[
    {
        "subject": "AIS",
        "catalog_number": "101",
        "title": "Introduction to American Indian Studies",
        "description": "Introduction to traditional and contemporary American Indian Cultures with an interdisciplinary approach to the history social institutions religion literature arts and inter-ethnic relations of First People Nations. (Available for General Education Comparative Cultural Studies)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AIS",
        "catalog_number": "210",
        "title": "THINKING/KNOWING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AIS",
        "catalog_number": "222",
        "title": "AMER IND GENDER",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AIS",
        "catalog_number": "301",
        "title": "First Peoples and Popular Culture",
        "description": "<p>The course introduces students to the misconceptions about First Peoples that have appeared in many avenues of popular culture including literature advertising Hollywood cinema New Age religions and political debates. As a cultural studies course it focuses on the representations of North American First Peoples in popular culture the response to those representations and the production of representations by First Peoples writers poets artists and filmmakers (among others). (Available for General Education Lifelong Learning.) \n\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AIS",
        "catalog_number": "304",
        "title": "American Indian Law and Policy",
        "description": "Preparatory: AIS 101.Examines the impact of the multi-jurisdictional indigenous social control mechanisms on U.S. state and federal law and policies. Major focus is on the unique legal relationship that exists between Indian governments and state and federal governments. Issues including criminal justice child welfare education gaming health care art land ownership and religious and treaty rights are examined. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AIS",
        "catalog_number": "401",
        "title": "Contemporary American Indian Social Issues",
        "description": "Focuses on First Peoples contemporary social issues and the relationship of those concerns to the surrounding society. While concerned with the histories and cultures of First Peoples the main focus is on contemporary scenarios. American Indian experiences will be compared and contrasted with those of the dominate society and other racial and ethnic groups. The student will be exposed to American Indian world views the unique sovereign status of American Indian nations and social institutional explanations for cultural and political conflict with the dominant society. To facilitate these goals during the semester each student will enter into a community partnership with an American Indian social group or formal organization in the larger Los Angeles area or on a reservation reserve or pueblo.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "AIS",
        "catalog_number": "301HON",
        "title": "POP CULTURE",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AIS",
        "catalog_number": "333",
        "title": "AMERI INDIAN PHIL",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    }
]