[
    {
        "subject": "COMP",
        "catalog_number": "100",
        "title": "Computers: Their Impact and Use",
        "description": "Not open to Computer Science majors. Introduction to the uses concepts techniques and terminology of computing. Places the possibilities and problems of computer use in historical economic and social contexts. Shows how computers can assist in a wide range of personal commercial and organizational activities. Typical computer applications including word processing spreadsheets and databases. (Available for General Education Lifelong Learning.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "105BAS",
        "title": "Computer Programming in BASIC",
        "description": "Prerequisite: COMP 101 110/L or 106/L. Instruction and practice in a particular computer programming language as listed below. 3 hours of lab per week. ; COMP\t105BAS\t\tComputer Programming in BASIC (1) ; COMP\t105C\t\tComputer Programming in C (1) ; COMP\t105COB\tComputer Programming in COBOL (1) ; COMP\t105FOR\t\tComputer Programming in FORTRAN (1) ; COMP\t105JAV\t\tComputer Programming in JAVA (1)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "COMP",
        "catalog_number": "108",
        "title": "Orientation to Computer Science",
        "description": "Prerequisite: Passing score on or exemption from the ELM or credit in MATH 093. Not a required course in the major. Recommended for incoming Computer Science majors with limited computing experience as well as those considering a major in Computer Science. Introduction to the Computer Science major and profession. Main focus on developing problem solving algorithm development and programming skills and acquiring critical thinking abilities especially when applied to Computer Science. Additional emphasis on orientation to the University campus resources study skills motivation and career awareness.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "110",
        "title": "Introduction to Algorithms and Programming",
        "description": "Prerequisites: Grade of C or better in MATH 102 103  104 105 150A or 255A or a passing score on the Math Placement Test (MPT) that satisfies prerequisites for MATH 150A or 255A . Corequisites: COMP 110L. Introduction to algorithms their representation design structuring analysis and optimization. Implementation of algorithms as structured programs in a high level language. Lab: three hours per week. (Available for General Education Lifelong Learning if required by students major.)\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "110L",
        "title": "Introduction to Algorithms and Programming Lab",
        "description": "Prerequisites: Grade of C or better in MATH 102 103  104 105 150A or 255A or a passing score on the Math Placement Test (MPT) that satisfies prerequisites for MATH 150A or 255A . Corequisites: COMP 110. Introduction to algorithms their representation design structuring analysis and optimization. Implementation of algorithms as structured programs in a high level language. Lab: three hours per week. (Available for General Education Lifelong Learning if required by students major.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "COMP",
        "catalog_number": "111A",
        "title": "ALGRTH PROG A",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "111AL",
        "title": "ALGRTH/PROG A LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "COMP",
        "catalog_number": "122",
        "title": "Computer Architecture and Assembly Language",
        "description": "Prerequisite: Grade of C or better in COMP 110/L; Grade of C or better in MATH 103 104 105 150A or 255A or a passing score on the Math Placement Test (MPT) that satisfies prerequisites for MATH 150A or 255A; Lower Division writing requirement. Corequisite: COMP 122L. Introduction to computer architecture assembly language programming system software and computer applications. Number systems and data representation. Internal organization of a computer. Primitive instructions and operations. Assembly language. Integrated lecture/lab environment. Lab: 3 hours per week.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "122L",
        "title": "Computer Architecture and Assembly Language Lab",
        "description": "Prerequisite: Grade of C or better in COMP 110/L; Grade of C or better in MATH 103 104 105 150A or 255A or a passing score on the Math Placement Test (MPT) that satisfies prerequisites for MATH 150A or 255A; Lower Division writing requirement. Corequisite: COMP 122. Introduction to computer architecture assembly language programming system software and computer applications. Number systems and data representation. Internal organization of a computer. Primitive instructions and operations. Assembly language. Integrated lecture/lab environment. Lab: 3 hours per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "COMP",
        "catalog_number": "182",
        "title": "Data Structures and Program Design",
        "description": "Prerequisites: Grade of C or better in COMP 110/L; Grade of C or better in MATH 103 104 105 150A or 255A or a passing score on the Math Placement Test (MPT) that satisfies prerequisites for MATH 150A or 255A; Lower Division writing requirement. Corequisite: COMP 182L. Introduction to data structures and the algorithms that use them. Review of composite data types such as arrays records strings and sets. Role of the abstract data type in program design. Definition implementation and application of data structures such as stacks queues linked lists trees and graphs. Recursion. Use of time complexity expressions in evaluating algorithms. Comparative study of sorting and searching algorithms. Lab: 3 hours per week.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "182L",
        "title": "Data Structures and Program Design Lab",
        "description": "Prerequisites: Grade of C or better in COMP 110/L; Grade of C or better in MATH 103 104 105 150A or 255A or a passing score on the Math Placement Test (MPT) that satisfies prerequisites for MATH 150A or 255A; Lower Division writing requirement. Corequisite: COMP 182. Introduction to data structures and the algorithms that use them. Review of composite data types such as arrays records strings and sets. Role of the abstract data type in program design. Definition implementation and application of data structures such as stacks queues linked lists trees and graphs. Recursion. Use of time complexity expressions in evaluating algorithms. Comparative study of sorting and searching algorithms. Lab: 3 hours per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "COMP",
        "catalog_number": "222",
        "title": "Computer Organization",
        "description": "Prerequisites: Grade of C or better in COMP 122/L and 182/L. Extension of basic addressing concepts to more advanced addressability such as base register and self-relative addressing. Comparative computer architecture focusing on such organizations as multiple register processors and stack machines. Basics of virtual memory input-output. Introduction to the concept of microprogrammable systems. Low-level language translation process associated with assemblers. System functions such as relocatable loading and memory management. Application of data structure and hashing techniques to the above. Other related topics.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "256",
        "title": "Discrete Structures for Computer Science",
        "description": "Prerequisites: COMP 182/L; MATH 150A; PHIL 230.  Study of discrete mathematical structures and proof techniques as used in computer science. Discrete structures such as functions relations sets graphs and trees. Proof techniques such as proof by induction proof by contradiction and proof by cases. Counting techniques. Lab: 3 hours per week.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "256L",
        "title": "Discrete Structures for Computer Science Lab",
        "description": "Prerequisites: COMP 182/L; MATH 150A; PHIL 230.  Study of discrete mathematical structures and proof techniques as used in computer science. Discrete structures such as functions relations sets graphs and trees. Proof techniques such as proof by induction proof by contradiction and proof by cases. Counting techniques. Lab: 3 hours per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "COMP",
        "catalog_number": "282",
        "title": "Advanced Data Structures",
        "description": "Prerequisites: Grade of C or better in COMP 182/L and MATH 150A. Introduction to advanced data structures (particularly persistent structures) using object-oriented design. Main memory structures hash tables and trees. Architectural foundations for files. Large-scale sorting. Hash-based persistent structures. Indexed files. Introduction to databases.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "300",
        "title": "Computer Fluency",
        "description": "Prerequisite: Completion of the Lower Division writing requirement.  Does not provide credit toward Computer Science major. Study of fundamental computing concepts related to: information technology data and its digital representation technological power computing limitations and social impact. Survey of essential and advanced applications designed to process different forms of information other than text. Promote such computing skills as basic algorithmic thinking debugging logical reasoning and critical use of information. Develop capabilities for applying the technology. (Available for General Education Lifelong Learning)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "310",
        "title": "Automata, Languages, and Computation",
        "description": "Prerequisites: COMP 256/L 333. Study of the relation of languages (e.g.. sets of strings) and machines for processing these languages with emphasis on classes of languages and corresponding classes of machines. Phrase structure languages and grammar. Types of grammar and classes of languages. Regular languages and finite state automata. Context-free languages and pushdown automata. Unrestricted languages and Turing Machines. Computability models of Turing Church Markov and McCarthy. Applications to programming languages compiler design and program design and testing.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "322",
        "title": "Introduction to Operating Systems and System Architecture",
        "description": "Prerequisite: COMP 222 or ECE 422 and ECE 425/L. Corerequisite: COMP 322L; Recommended Prerequisite: COMP 105C or knowledge ofC Language. Examination of the principal types of systems including batch multi-programminga nd time-sharing. Discusses networked system. Considers the salient problems associated with implementing systems including interrupt of event driven systems multitasking storage and database management and input-output. Emphasizes some of the simple algorithms used to solve common problems encountered such as deadlocks queue service and multiple access to data. Projects are implemented to reinforce the lectures. One 3-hour lab per week.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "322L",
        "title": "Introduction to Operating Systems and System Architecture Lab",
        "description": "Prerequisite: COMP 222 or ECE 422 and ECE 425/L. Corerequisite: COMP 322; Recommended Prerequisite: COMP 105C or knowledge ofC Language. Examination of the principal types of systems including batch multi-programminga nd time-sharing. Discusses networked system. Considers the salient problems associated with implementing systems including interrupt of event driven systems multitasking storage and database management and input-output. Emphasizes some of the simple algorithms used to solve common problems encountered such as deadlocks queue service and multiple access to data. Projects are implemented to reinforce the lectures. One 3-hour lab per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "COMP",
        "catalog_number": "333",
        "title": "Concepts of Programming Languages",
        "description": "Prerequisites: COMP 122/L 182/L. Discussion of issues in the design implementation and use of high-level programming languages through a historical framework including how languages reflect different design philosophies and use requirements and the technical issues in the design of main abstraction constructs of programming languages. Other approaches to imperative or object-oriented programming functional programming logical programming and parallel programming.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "380",
        "title": "Introduction to Software Engineering",
        "description": "Prerequisites: COMP 270/L or 282. Corerequisite: COMP 380L. Concepts and techniques for systems engineering requirements analysis design implementation and testing of large-scale computer systems. Principles of software engineering for production of reliable maintainable and portable software products. Emphasis on object-oriented analysis and design techniques. Topics include unit integration and systems testing configuration management software quality assurance practices and an introduction to Computer Aided Software Engineering (CASE). This is a lecture portion of a course in software engineering involving the design and partial implementation of a software system as a group project. Lab: 3 hours per week.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "380L",
        "title": "Introduction to Software Engineering Lab",
        "description": "Prerequisites: COMP 270/L or 282. Corerequisite: COMP 380. Concepts and techniques for systems engineering requirements analysis design implementation and testing of large-scale computer systems. Principles of software engineering for production of reliable maintainable and portable software products. Emphasis on object-oriented analysis and design techniques. Topics include unit integration and systems testing configuration management software quality assurance practices and an introduction to Computer Aided Software Engineering (CASE). This is a lecture portion of a course in software engineering involving the design and partial implementation of a software system as a group project. Lab: 3 hours per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "COMP",
        "catalog_number": "410",
        "title": "Logic Programming",
        "description": "Prerequisites: COMP 232 282 310; Attempted Upper Division Writing Proficiency Exam. Programming techniques in the logic programming language PROLOG. Prenex conjunctive normal form and grammatical algorithms. Tableaux sequenzen resolution and other semi-decision procedures. Closures of relations fixed point theory control mechanisms relationship to functional programming.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "424",
        "title": "Computer System Security",
        "description": "Prerequisites: COMP 322/L and 380/L or CIT 360 and IS 435; Attempted Upper Division Writing Proficiency Exam. Analysis of the need for computer system security and the security techniques in operating systems databases and computer networks. Supporting techniques such as auditing risk analysis and cost-benefit tradeoffs are discussed.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "429",
        "title": "Computer Network Software",
        "description": "Prerequisites: COMP 322/L; Attempted Upper Division Writing Proficiency Exam. Basic software design and analysis considerations in networking computers into coherent cooperating systems capable of processing computational tasks in a distributed manner. Network topology routing procedures message multiplexing and process scheduling techniques.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "440",
        "title": "Database Design",
        "description": "Prerequisites: COMP 380/L; Attempted Upper Division Writing Proficiency Exam. Database structure including: structure definition data models semantics of relations and operation on data models. Database schemas including element definition and use and manipulation of the schema. Elements of implementation. Algebra of relations on a database. Hierarchical databases. Discussion of information retrieval reliability protection and integrity of databases.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "442",
        "title": "MACHINE LEARNING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "465",
        "title": "Computer Graphic Systems and Design",
        "description": "Prerequisites: MATH 262; Attempted Upper Division Writing Proficiency Exam. Corequisite: COMP 465L. Fundamental concepts of computer graphics. Graphics devices; graphics languages; interactive systems. Applications to art science engineering and business. Trade-offs between hardware devices and software support. Lab: 3 hours per week.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "465L",
        "title": "Computer Graphic Systems and Design Lab",
        "description": "Prerequisites: MATH 262; Attempted Upper Division Writing Proficiency Exam. Corequisite: COMP 465. Fundamental concepts of computer graphics. Graphics devices; graphics languages; interactive systems. Applications to art science engineering and business. Trade-offs between hardware devices and software support. Lab: 3 hours per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "COMP",
        "catalog_number": "467",
        "title": "Multimedia Systems Design",
        "description": "Prerequisites: COMP 380/L; Attempted Upper Division Writing Proficiency Exam. Study of fundamentals of multimedia storage processing communication presentation and display by digital means with emphasis on audio still images and video media. Includes sampling theory compression techniques and synchronization. Discussion of hypermedia and methodology issues. Multimedia programming; software tools for authoring multimedia applications and interfaces.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "482",
        "title": "ALGORITHM DESIGN",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "484",
        "title": "Web Engineering I",
        "description": "Prerequisites: COMP 322/L or 380/L or CIT 360 and IS 451; Attempted Upper Division Writing Proficiency Exam. Corequisite: COMP 484L. Internet infrastructure and the underlying networking technologies. Study of system and software architectures for web applications e-business and e-commerce systems. Principles of website design. Advances in web-engineering technologies. Principles of web-based based transaction processing. XML and the associated technologies. Web service technology. Security and privacy issues. Study of the emerging Internet technologies. Lab: three hours per week.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "484L",
        "title": "Web Engineering I Lab",
        "description": "Prerequisites: COMP 322/L or 380/L or CIT 360 and IS 451; Attempted Upper Division Writing Proficiency Exam. Corequisite: COMP 484. Internet infrastructure and the underlying networking technologies. Study of system and software architectures for web applications e-business and e-commerce systems. Principles of website design. Advances in web-engineering technologies. Principles of web-based based transaction processing. XML and the associated technologies. Web service technology. Security and privacy issues. Study of the emerging Internet technologies. Lab: three hours per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "COMP",
        "catalog_number": "485",
        "title": "Human-Computer Interaction",
        "description": "Prerequisites: COMP 380/L or CIT 360 and IS 451; Attempted Upper Division Writing Proficiency Exam. Examines the information exchange between humans and computer systems. Discusses aspects of input/output devices software engineering and human factors with respect to human-computer interactions. Topics include text and graphic display; user modeling; program design debugging complexity and comprehension; and current research studies and methodologies.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "490",
        "title": "Senior Design Project",
        "description": "Prerequisites: COMP 380/L; Upper Division Writing Proficiency Exam. Corequisite: COMP 490L. Project-oriented course to allow students to apply their knowledge of software engineering to the design and implementation of a system to solve a real-world problem. Students select and specify a suitable problem investigate design alternatives and select an appropriate one implement a solution and verify and validate the result all as part of a team effort. The role of digital computers in modern society are investigated including the dangers of computer misuse as well as the proper and intelligent use of computers. Ethical concerns of software professionals are studied. Lab: 3 hours per week.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "490L",
        "title": "Senior Design Project Lab",
        "description": "Prerequisites: COMP 380/L; Upper Division Writing Proficiency Exam. Corequisite: COMP 490. Project-oriented course to allow students to apply their knowledge of software engineering to the design and implementation of a system to solve a real-world problem. Students select and specify a suitable problem investigate design alternatives and select an appropriate one implement a solution and verify and validate the result all as part of a team effort. The role of digital computers in modern society are investigated including the dangers of computer misuse as well as the proper and intelligent use of computers. Ethical concerns of software professionals are studied. Lab: 3 hours per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "COMP",
        "catalog_number": "528",
        "title": "MOBILE COMPUTING",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMP",
        "catalog_number": "528L",
        "title": "MOBILE COMP LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "COMP",
        "catalog_number": "529",
        "title": "Advanced Network Topics",
        "description": "Prerequisites: COMP 429; MATH 340 or 341. Advanced course on design and analysis of high-speed networks (Broadband ISDN and Asynchronous Transfer Mode [ATM] networks) and their protocols. Topics include multimedia services integrating techniques including synchronous and asynchronous transfer modes. ATM standards. ATM switch architecture ATM network traffic control ATM experimental networks high-speed LAN/MANs internetworking with high-speed networks and simulation techniques.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "COMP",
        "catalog_number": "529L",
        "title": "ADV NETWORK LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "COMP",
        "catalog_number": "539",
        "title": "NETWORK INFRAS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "541",
        "title": "Data Mining",
        "description": "Prerequisite: COMP 380/L. A study of the concepts principles techniques and applications of data mining. Topics include data preprocessing the ChiMerge algorithm data warehousing OLAP technology the Apriori algorithm for mining frequent patterns classification methods (such as decision tree induction Bayesian classification neural networks support vector machines and genetic algorithms) clustering methods (such as k-means algorithm hierarchical clustering methods and self-organizing feature map)and data mining applications (such as Web finance telecommunication biology medicine science and engineering). Privacy protection and information security in data mining are also discussed.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMP",
        "catalog_number": "542",
        "title": "MACHINE LEARNING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "582",
        "title": "Software Requirements Analysis and Specification",
        "description": "Prerequisite: COMP 380/L. An in-depth study of the early phases of the software development life cycle commonly called software requirements analysis and specification. Topics include the gathering of both functional and nonfunctional requirements customer communication requirements prototyping requirements modeling requirements validation the documentation of requirements in terms of a formal software requirements specification and the management of software requirements.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMP",
        "catalog_number": "584",
        "title": "Advanced Web Engineering",
        "description": "Prerequisite: COMP 380/L. A study of the concepts principles techniques and methods of Web engineering. Topics include requirements engineering modeling and architectures design and technologies testing operation and maintenance Web project management application development process usability and performance and security of Web applications. Technologies business models and strategiesand societal issues of Web 2.0 and Semantic Web also are discussed.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMP",
        "catalog_number": "585",
        "title": "Graphical User Interfaces",
        "description": "Prerequisites: COMP 322/L 380/L. The design development and analysis of programs requiring graphical direct manipulation and user interfaces (GUIs) will be examined. The majority of modern software includes a GUI. The development tools environments and style guides for common GUIs will be used in course assignments and discussed in lecture. The course involves the design and development of several GUI programs. The aesthetic and human computer interaction aspects and future trends in GUIs design and development also will be reviewed.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMP",
        "catalog_number": "586",
        "title": "Object-Oriented Software Development",
        "description": "Prerequisites: COMP 322/L 380/L. Review of object-oriented concepts. Comparison with functional methods. Benefits and pitfalls of object orientation. Fundamentals of object-oriented modeling -- associations links and states. Survey of object-oriented development methods. In-depth study of a current object-oriented method. Object-oriented software requirements analysis and modeling. Object-oriented preliminary design. Designing concurrent and multiprocessor systems. Object-oriented detailed design. Object-oriented and object-based implementations. Object-oriented testing.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMP",
        "catalog_number": "587",
        "title": "SOFTWARE V AND V",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMP",
        "catalog_number": "589",
        "title": "SOFTWARE METRICS",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMP",
        "catalog_number": "610",
        "title": "Data Structures and Algorithms",
        "description": "Prerequisites: COMP 310; MATH 482. Topics include design strategies for data structures and algorithms theoretical limits to space and time requirements time/space trade offs and open problems in the field.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMP",
        "catalog_number": "615",
        "title": "Advanced Topics in Computation Theory",
        "description": "Prerequisites: COMP 310; MATH 482. Languages and the theory of computation are studied in depth. Covers advanced material concerning regular and context free languages. Study of deterministic context-free languages context sensitive languages recursive and recursively enumerable sets. Investigation of current areas of interest.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMP",
        "catalog_number": "620",
        "title": "Computer System Architecture",
        "description": "Prerequisites: COMP 322/L 380/L. Analysis and evaluation of individual computers networks of computers and the programs that support their operation and use. Emphasis on comparison of architectures and the risks and benefits associated with various approaches and configurations.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMP",
        "catalog_number": "684",
        "title": "Software Architecture and Design",
        "description": "Prerequisites: COMP 380/L 682. Techniques methods and tools for designing building analyzing and evaluating the structural architectural and behavioral properties of software systems. It includes the study of the fundamental concepts and principles of software architectural design structured design object-oriented design component-level design and design for reuse.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMP",
        "catalog_number": "696C",
        "title": "Directed Graduate Research",
        "description": "Prerequisite: Permission of Project/Thesis Committee Cbair. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "COMP",
        "catalog_number": "698C",
        "title": "Thesis or Graduate Project",
        "description": "No Course Description.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "COMP",
        "catalog_number": "111B",
        "title": "ALGRTH PROG B",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "111BL",
        "title": "ALGRTH PROG B LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "COMP",
        "catalog_number": "392IP",
        "title": "DATABASE DESIGN",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "430",
        "title": "Language Design and Compilers",
        "description": "Prerequisites: COMP 310 380/L; Attempted Upper Division Writing Proficiency Exam. Examination of the issues involved in the design and subsequent implementation of programming languages. Considerations of implementation difficulties including various features in a programming language. Tools and techniques to facilitate both the processing of programming languages and the building of programming processors.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "469",
        "title": "Introduction to Artificial Intelligence",
        "description": "Prerequisites: COMP 310 380/L 410; Attempted Upper Division Writing Proficiency Exam. Exploration of the use of computers to perform computations normally associated with intelligence. These include game playing theorem proving problem solving question answering and visual perception. Topics include languages system architectures and heuristic strategies for advanced high-level computations. Covers computational models for knowledge representation natural language and vision.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "491L",
        "title": "Senior Project Lab",
        "description": "Prerequisite: COMP 490/L. Project-oriented lab to allow students to complete the design implementation and testing of the team-based software engineering project started in COMP 490/L. Lab: 3 hours per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "COMP",
        "catalog_number": "492IP",
        "title": "INTERNET SECURITY A",
        "description": null,
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "522",
        "title": "EMBEDDED APPS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "560",
        "title": "Expert Systems",
        "description": "Prerequisite: COMP 469. Extensive introduction to the concepts and techniques of expert systems. Rationale for such systems including evaluation of prospective domains. Explores existing systems those under development and likely future areas. Basic architecture is demonstrated using both example and rule-based systems. Commercial tools for building expert systems are surveyed and evaluated. Knowledge acquisition methods. Guidelines given for planning and managing development projects.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMP",
        "catalog_number": "565",
        "title": "Advanced Computer Graphics",
        "description": "Prerequisite: COMP 322/L. This course will cover the theory design implementation and application of advanced computer graphics environments. Accelerated 3D graphics APIs; the modeling and simulation of light sound physical objects motion and collisions; and user interaction in single- and multi-user virtual environments will be studied. The application domain for this class is interactive 3D computer games scientific visualization and virtual reality.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMP",
        "catalog_number": "581",
        "title": "Open Source Software Engineering",
        "description": "Prerequisite: COMP 380/L. Introduction to open source software engineering concepts principles and applications. Topics include history of open source software open source software engineering models open source products and software quality strategies and business models government policies toward open source software work organization of open source software development software and intellectual property rights organizations of the open source community and case studies. Different open source software products for various applications are also discussed and used for group projects.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMP",
        "catalog_number": "583",
        "title": "Software Engineering Management",
        "description": "Prerequisites: COMP 380/L; Upper Division Writing Proficiency Exam. Provides a framework for understanding software engineering management models technologies trends tools and planning processes. Emphasizes the development of an individualized approach to managing software teams projects and systems. The role of management as an increasingly critical factor in software engineering is examined.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMP",
        "catalog_number": "680",
        "title": "Advanced Topics in Software Engineering",
        "description": "Prerequisites: COMP 322/L 380/L. New and emerging software engineering technologies and practices covering: principles concepts methods notations formalisms techniques and tools. Study of these technologies and practices from a practical as well as from a theoretical perspective. Explore current problems underlying the development of large software systems and approaches for dealing with them.\n",
        "units": "3",
        "class_type": "SEM"
    }
]