[
    {
        "subject": "MATH",
        "catalog_number": "102",
        "title": "College Algebra",
        "description": "Prerequisites: Listed in Table 1. Students who are conditionally prepared must have credit for or concurrently enroll in MATH 102L. Functions linear equations quadratic equations theory of equations progressions inequalities absolute value logarithms permutations combinations probability and determinants. Not open to students who have credit in MATH 103 105 or 106. (Available for General Education Basic Skills Mathematics.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "102L",
        "title": "College Algebra Lab",
        "description": "Prerequisite: Required  for all Conditionally prepared students  enrolled in MATH 102. All students in MATH 102 are encouraged to enroll in this course. This is a Credit/No Credit hybrid enrichment laboratory for students in  MATH 102. This course  will include a self-paced modular online component. 2 hours lab per week. (Credit/No Credit only)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MATH",
        "catalog_number": "103",
        "title": "Mathematical Methods for Business",
        "description": "Prerequisites: Passing score on or exemption from the ELM Exam or credit in MATH 093; Passing score on the Mathematics Placement Test Part I or credit or concurrent enrollment in MATH 103L. Concepts and applications of algebra and calculus to business. Topics include functions systems of equations matrices the derivative and business-related topics in calculus. (Available for General Education Basic Skills Mathematics.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "103L",
        "title": "Mathematics for Business Laboratory",
        "description": "Prerequisite: Passing score on the ELM Exam. This self-paced module-based laboratory is designed to give students additional exposure to the applications of college algebra to business and economics beyond what can be done in lecture. The additional hands-on problem-solving skills learned in this class enhance the lecture experience and strengthen the skills necessary for success in MATH 103 and subsequent courses in business majors. The lab environment allows students to both work at their own pace and receive small-group instruction with the laboratory instructor on all modules. Students with an MPT Part I score below 24 may enroll in MATH 103 only if they enroll in this course. 2 hours lab per week. (Credit/No Credit only)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MATH",
        "catalog_number": "105",
        "title": "Pre-Calculus",
        "description": "Prerequisites: Listed in Table 1 above. Students who are Conditionally prepared must have credit for or concurrently enroll in MATH 105L. Number systems and their algebraic properties; systems of equations and inequalities; basic analytic geometry of lines and conic sections; elementary functions including polynomial rational exponential and logarithmic with emphasis on trigonometric functions; polar equations. Graphing calculators are used and the interplay between graphical and algebraic solutions is stressed. Not open for credit to students who have successfully completed MATH 150A.(Available for General Education Basic Skills Mathematics)\n",
        "units": "5",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "105L",
        "title": "PreCalculus Lab",
        "description": "Prerequisite: Required  for all conditionally prepared students  enrolled in MATH 105. All students in MATH 105 are encouraged to enroll in this course. This is a NC/CR hybrid enrichment laboratory for students  in MATH 105. This course  will include a self-paced modular online component. 3 hours lab per week. (Credit/No Credit only)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MATH",
        "catalog_number": "106",
        "title": "MATH NONCALC PHYS",
        "description": null,
        "units": "5",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "131",
        "title": "Mathematical Ideas",
        "description": "Prerequisites: Passing score on or exemption from the ELM Exam or credit in MATH 093. General Education course intended to acquaint the student with basic mathematical ideas. (Available for General Education Basic Skills Mathematics.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "131HON",
        "title": "MATH IDEAS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "140BUS",
        "title": "INTRO STAT BUS",
        "description": null,
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "140SCI",
        "title": "INTRO STAT STEM",
        "description": null,
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "141",
        "title": "ESSENTIAL STAT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "141L",
        "title": "ESSENTIAL STAT LAB",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "MATH",
        "catalog_number": "150A",
        "title": "Calculus I",
        "description": "Prerequisites: Listed in Table 1. Students who are Conditionally prepared or who transfer the equivalent of MATH 105 or both MATH 102 and 104 must have credit for or concurrently enroll in MATH 150AL. Limits derivatives applications of differentiation. Definite and indefinite integrals and the fundamental theorem of calculus. (Available for General Education Basic Skills Mathematics.)\n",
        "units": "5",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "150AL",
        "title": "Calculus I Laboratory",
        "description": "Prerequisite: Required for all Conditionally prepared students enrolled in MATH 150A or 255A. All students in MATH 150A and 255A are encouraged to enroll in this course. This is a Credit/No Credit hybrid enrichment laboratory for students in MATH 150A and 255A. This course will include a self-paced, modular online component. 3 hours lab per week. (Credit/No Credit only)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MATH",
        "catalog_number": "150B",
        "title": "Calculus II",
        "description": "Prerequisites: Listed in Table 1. Students  who are Conditionally prepared must have credit for or concurrently enroll in MATH 150BL.  Techniques of integration numerical integration improper integrals and applications of the integral. Taylor polynomials sequences and series and power series.\n",
        "units": "5",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "150BL",
        "title": "Calculus II Laboratory",
        "description": "Prerequisite: Required  for all Conditionally prepared students enrolled in MATH 150B or 255B. All students in MATH 150B and 255B are encouraged to enroll in this course. This is a Credit/No Credit hybrid enrichment laboratory for students in MATH 150B and 255B. This course will include a self-paced modular online component. 3 hours lab per week. (Credit/No Credit only)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MATH",
        "catalog_number": "210",
        "title": "Basic Number Concepts",
        "description": "Prerequisites: Passing score on or exemption from the ELM Exam or credit in MATH 093. Language of sets systems of numeration nature of numbers and fundamentals of operations relations and functions domain of integers and field of rational and real numbers. Designed primarily for students intending to teach in elementary or junior high school. Not available for credit toward the Major or Minor in Mathematics.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "211",
        "title": "STAT&PROB FOR TCH",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "250",
        "title": "Calculus III",
        "description": "Prerequisite: Completion of MATH 150B with a grade ofC or better. Continuation of MATH 150B. Solid analytic geometry partial differentiation and multiple integrals with applications.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "255A",
        "title": "Calculus for the Life Sciences I",
        "description": "Prerequisites: Listed in Table 1. Students who are Conditionally prepared must have credit for or concurrently enroll in MATH 150AL. Knowledge of trigonometry is assumed. First semester of a short course in calculus. Topics in calculus of functions of one variable including techniques of differentiation applications to graphing extreme problems and an introduction to integration. Not open for credit to students who have successfully completed MATH 150A. (Available for General Education Basic Skills Mathematics.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "255AL",
        "title": "CALC LIFE SCI I LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MATH",
        "catalog_number": "255B",
        "title": "Calculus for the Life Sciences II",
        "description": "Prerequisites: Listed in Table 1. Students who are Conditionally prepared must have credit for or concurrently enroll in MATH 150BL. Techniques of integration series applications functions of several variables and partial differentiation. Not open for credit to students who have successfully completed MATH 150AB.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "255BL",
        "title": "CALC LIFE SCI II LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MATH",
        "catalog_number": "262",
        "title": "Introduction to Linear Algebra",
        "description": "Prerequisite: MATH 150B. Systems of linear equations matrices determinants eigenvalues vector spaces and linear transformations as well as introduction to inner products on Rn and spectral theorem for symmetric matrices.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "280",
        "title": "Applied Differential Equations",
        "description": "Prerequisite: MATH 150B. Recommended Corequisite or Preparatory: MATH 250. Ordinary differential equations series solutions systems of equations and Laplace transforms with emphasis on applications and introduction to numerical techniques. Course is not open to students who have credit for MATH 351.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "310",
        "title": "Basic Concepts of Geometry",
        "description": "Probability and StatisticsPrerequisites: Passing score on or exemption from the ELM Exam or credit in MATH 093 and completion of MATH 210 with a grade ofC or better. Articulated course from another college equivalent to MATH 210 may only satisfy the course prerequisite for MATH 310. Students passing such a course with aC or better will still need to fulfill the ELM Exam requirement. Second course for students intending to teach in elementary or junior high school. Geometry as a system; congruence and similarity through construction with straightedge and compass; transformational geometry; the nature of measurement precision and accuracy; basic principles of probability and statistics. Not available for credit toward the Major or Minor in Mathematics.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "312",
        "title": "Basic Algebraic Concepts",
        "description": "Prerequisites: Passing score on the ELM Exam and completion of MATH 210 and 310 with a grade ofC or better or instructor consent. Topics selected from: abstract algebra and applied algebra using elementary mathematical models. Not available for credit toward the Math Major or Minor.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "320",
        "title": "Foundations of Higher Mathematics",
        "description": "Prerequisite: MATH 150B. The goal of this course is to help students transition from a primarily computational mode of doing mathematics to a more conceptual mode. The emphasis will be on proofs which are taught in the context of elementary number theory combinatorics and analysis; the language of sets relations order equivalence classes functions and cardinality is introduced. Students are expected to write large numbers of proofs and communicate mathematical ideas clearly.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "326",
        "title": "Discrete Mathematics",
        "description": "Prerequisites: ECE 320 or PHIL 230; MATH 150B. Propositional calculus predicate calculus set algebra relations functions mappings fields and number systems.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "331",
        "title": "Mathematical Explorations",
        "description": "Prerequisites: Passing Score on the ELM Exam; Completion of the Lower Division writing requirement; Upper Division standing. A course designed to give students an appreciation of the diversity of mathematics and the spirit in which it is employed in various applications. The character and origin of key topics from different branches of mathematics are explored. The contributions of various cultures to the field are studied along with the use of mathematical models for physical problems. The development is conceptual rather than axiomatic and includes several supervised reading and writing assignments. One significant writing assignment is required. Strongly recommended for prospective teachers in all fields. (Available for General Education Basic Skills Mathematics.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "340",
        "title": "Introductory Probability",
        "description": "Prerequisite: MATH 150B. Sample spaces probability rules independence conditional probability Bayes Theorem discrete and continuous random variables and distributions (e.g. binomial Poisson geometric normal exponential uniform) expectation moment generating functions joint distributions and central limit theorem.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "341",
        "title": "Applied Statistics I",
        "description": "Prerequisite: MATH 150B. Introduction to the practice of statistics emphasizing the role of probability. Includes basic probability discrete and continuous probability distributions expectation and variance sample surveys and experiments displaying and summarizing data sampling distributions central limit theorem inference for proportions chi-square test and least squares regression. Mathematics majors who are not in the Secondary Teaching Option may not receive credit for both MATH 340 and 341.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "351",
        "title": "Differential Equations",
        "description": "Prerequisites: MATH 250 262. Not open to students who have credit for MATH 280. Linear equations series solutions singular points existence and uniqueness of solutions and systems of equations.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "360",
        "title": "Abstract Algebra I",
        "description": "Prerequisites: MATH 262 320. Survey course in abstract algebra. Introduction to groups rings fields and vector spaces.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "370",
        "title": "Foundations of Geometry",
        "description": "Prerequisite or Corequisite: MATH 320. One of the goals of this course is to help students write rigorous proofs of results of plane Euclidean geometry. It is also expected that students visualize and develop geometric intuition through the use of dynamic geometry software. The content includes history axiomatic structure and theorems of plane Euclidean geometry geometric transformations of the plane rigid motions similarities and inversion coordinate geometry and an introduction to non-Euclidean geometries.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "382",
        "title": "Introduction to Scientific Computing",
        "description": "Corequisite: MATH 262. This course gives students an introduction to basic numerical techniques and to programming using some of the common software packages used in mathematics. Students apply these techniques in projects from different branches of mathematics.(This course does not replace a rigorous course in numerical analysis.) 2 hours lecture 2 hours lab.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "382L",
        "title": "Introduction to Scientific Computing Lab",
        "description": "Corequisite: MATH 262. This course gives students an introduction to basic numerical techniques and to programming using some of the common software packages used in mathematics. Students apply these techniques in projects from different branches of mathematics.(This course does not replace a rigorous course in numerical analysis.) 2 hours lecture 2 hours lab.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MATH",
        "catalog_number": "391",
        "title": "Field Experience in the Mathematics of the Public Schools",
        "description": "Prerequisites: Multiple Subject Candidates\n",
        "units": "2",
        "class_type": "SUP"
    },
    {
        "subject": "MATH",
        "catalog_number": "440A",
        "title": "Mathematical Statistics I",
        "description": "Prerequisites: MATH 262 340. Point estimation bias and mean squared error optimality theory for estimates maximum likelihood estimation confidence intervals test of hypotheses power and optimality theory for tests.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "445",
        "title": "STAT LEARNING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "450A",
        "title": "ADV CALCULUS I",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "455",
        "title": "Complex Variables",
        "description": "Prerequisite: MATH 350. Complex numbers analytic functions complex integration Cauchys Theorem power series calculus of residues and conformal mappings.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "460",
        "title": "Abstract Algebra II",
        "description": "Prerequisite: MATH 360. Second course in abstract algebra. Group theory rings and modules and field extensions.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "462",
        "title": "Advanced Linear Algebra",
        "description": "Prerequisites: MATH 262 320. Finite dimensional vector spaces linear transformations matrix polynomials canonical forms.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "480",
        "title": "Partial Differential Equations",
        "description": "Prerequisite: MATH 351 or 280. Orthogonal functions Laplaces equation Poissons equation Bessels equation self-adjoint operators Sturm-Liouville theory Fourier series separation of variables applied to the heat equation and wave equation nonhomogeneous problems Greens functions for time-independent problems and infinite domain problems.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "481A",
        "title": "Numerical Analysis",
        "description": "Prerequisites: COMP 106/L or 110/L; MATH 262. Techniques of applied mathematics solution of equations interpolation numerical integration and numerical solution of differential equations.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "482",
        "title": "Combinatorial Algorithms",
        "description": "Prerequisites: MATH 150B 262; Some computer programming experience. Computer-oriented study of seminumerical and non-numerical algorithms. Sorting tree searching generation of combinatorial structures algorithm proof techniques best algorithms and programming complexity.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "494",
        "title": "Practical Experience in Mathematics",
        "description": "Prerequisite: Junior standing in the major. Students will gain practical experience in the profession by either participating in an internship doing mathematical/statistical work at an outside organization or by doing directed research within the Department. All students are expected to work a minimum of 8 hours per week on this assignment and meet with the course instructor on a regular basis. All students are required to produce a written report on their work at the end of the semester. Students will give oral reports to the Department and their peers.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "MATH",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "See Independent Study under courses of study.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "MATH",
        "catalog_number": "501",
        "title": "Topology",
        "description": "Prerequisite: MATH 350. Metric spaces topological spaces compactness completeness and connectedness. Introduction to function spaces with emphasis on the uniform topology.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "543",
        "title": "MULTIVARIATE STATIST",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "547",
        "title": "CATEG DATA ANALYSIS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "550",
        "title": "Calculus On Manifolds",
        "description": "Prerequisite: MATH 450. Integration of functions of several variables. Differential forms and differential manifolds Line integrals integration on manifolds Stokes Theorem and Poincares Lemma.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "552",
        "title": "Real Analysis",
        "description": "Prerequisite: MATH 501. Introduction to measure theory and Lebesgue integration and their application to probability theory. Monotone and dominated convergence theorems Fubinis theorem Fourier analysis and Banach spaces.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "570",
        "title": "Differential Geometry",
        "description": "Prerequisite: MATH 450. The local theory of regular curves in R3 and Frenet formulas. Regular surfaces in R3 the first and second fundamental forms Gaussian and mean curvatures and the Egregium Gauss theorem. Geodesics and the Gauss-Bonnet theorem.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "581",
        "title": "Numerical Methods for Linear Systems",
        "description": "Prerequisite: MATH 462. Methods for solving large linear problems and eigenvalue problems are presented at an advanced level. Direct methods such as LU factorization Cholesky factorization and the Least Squares method and Iterative methods such as the Jacobi Gauss-Seidel SOR and conjugate Gradient methods are discussed in detail. Eigenvalue problems are solved via power iteration the QR method and the Jacobi method.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "582C",
        "title": "Topics in Numerical Analysis: Numerical Solution of Partial Differential Equations",
        "description": "Prerequisite: MATH 581 or consent of instructor. The course will cover topics in numerical analysis which are important in many applications and which are not covered elsewhere in the program. Part A usually covers numerical methods in optimization Part B covers numerical methods for ordinary differential equations and Part C covers numerical solution of partial differential equations. Part D covers a subject chosen by the instructor.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "589",
        "title": "Seminar in Mathematics",
        "description": "Prerequisite: Senior or graduate standing in the Mathematics Department. Students will read about advanced topics in the recent literature in mMathematics and report on them in a lecture. This course may be taken up to two times with the consent of the advisor. (Credit/No Credit only)\n",
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "592A",
        "title": "Topics in Applied Mathematics: Mathematical Theory of Partial Differential Equations",
        "description": "Prerequisites: MATH 552 or consent of instructor. This course is devoted to a variety of important topics in applied Mmathematics that are not covered elsewhere in the Program. In particular Part A will cover the mathematical theory of partial differential equations Part B covers mathematical optimization and operations research and Part C covers mathematical biology. The topic of Part D is left to the individual instructor.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "662",
        "title": "INTRO COMM ALGEBRA",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "697A",
        "title": "Directed Comprehensive Studies",
        "description": "No course description.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "MATH",
        "catalog_number": "698A",
        "title": "Thesis or Graduate Project",
        "description": "No course description.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "MATH",
        "catalog_number": "699A",
        "title": "Independent Study",
        "description": "See Independent Study under courses of study.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "MATH",
        "catalog_number": "91B",
        "title": "GE MATH SUPPORT",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "MATH",
        "catalog_number": "91S",
        "title": "SUPPORT STATS",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "MATH",
        "catalog_number": "310L",
        "title": "Geometry",
        "description": "Probability and Statistics LabRecommended Corequisite or Preparatory: MATH 310. Problem solving using models and simulation in mathematics appropriate for the elementary-school classroom. 2 hours of activities per week. (Credit/No Credit only)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "MATH",
        "catalog_number": "311",
        "title": "Basic Geometric Concepts",
        "description": "Prerequisites: Passing score on the ELM Exam and completion of MATH 210 and 310 with a grade ofC or better or instructor consent. Continuation of the investigation of elementary geometry begun in MATH 310. Topics selected from topology motion geometry metric geometry geometry as a mathematical system absolute geometry Euclidean geometry and non-Euclidean geometry. Not available for credit toward the Math Major or Minor.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "366",
        "title": "Combinatorics",
        "description": "Corequisite: MATH 320 or 326. This is a one-semester introduction to combinatorics. Topics include enumerative combinatorics (inclusion-exclusion generating functions Polyas Theorem etc.) and combinatorial structures (graphs designs etc.).\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "440B",
        "title": "Mathematical Statistics II",
        "description": "Prerequisite: MATH 440A. Chi-square goodness of fit tests simple and multiple linear regression 1- and 2-way analysis of variance and statistical analysis using the computer.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "444",
        "title": "STAT MODELING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "450B",
        "title": "ADV CALCULUS II",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "463",
        "title": "Number Theory",
        "description": "Prerequisite: MATH 320. Recommended Corequisite or Preparatory: MATH 360. Euclidean algorithm and the unique factorization theorem congruences primitive roots and indices quadratic residues and the law of quadratic reciprocity and distribution of primes.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "483",
        "title": "Mathematical Modeling",
        "description": "Prerequisites: MATH 340; 351. Applications of mathematical techniques to solve selected problems in ecology biology economics finance social sciences life sciences physical sciences and engineering. Models discussed include deterministic stochastic optimization static and dynamic ones. Emphasis is placed on the initial phase of building mathematical models and the final phase of interpreting the solutions in terms of real-life applications.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "490",
        "title": "Capstone Course",
        "description": "Prerequisite: Senior standing. A course where prospective teachers see high-school level mathematics from a more advanced perspective where there is considerably more emphasis on issues of pedagogy than in other content courses and where students will see connections between the mathematics they have learned and some of the activities that they will themselves be engaged in as teachers. MATH 490 is required for the Secondary Teaching Option but a student may choose in consultation with his or her advisor to take the course a second time as an elective.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "493",
        "title": "Undergraduate Seminar in Mathematics",
        "description": "Prerequisite: Junior standing in the major. Students will study current topics in mathematical and/or statistical literature and will prepare written summaries and give oral presentations to the class. Students will be active participants in all seminars by asking questions and providing written critiques and summaries of the presentations of other students.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "540",
        "title": "Regression Analysis",
        "description": "Prerequisite: MATH 440A. General linear model in matrix form simple and multiple regression analysis transformations variable selection multicollinearity analysis of variance robust regression logistic regression principal components and factor analysis. Statistical software utilized.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "541",
        "title": "THEOR STAT INFERENCE",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MATH",
        "catalog_number": "544",
        "title": "STOCHASTIC PROCESSES",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "560",
        "title": "Abstract Algebra III",
        "description": "Prerequisite: MATH 460. Graduate course in abstract algebra. Group theory Galois theory and other topics.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "582A",
        "title": "Topics in Numerical Analysis: Numerical Methods in Optimization",
        "description": "Prerequisite: MATH 581 or consent of instructor. The course will cover topics in numerical analysis which are important in many applications and which are not covered elsewhere in the program. Part A usually covers numerical methods in optimization Part B covers numerical methods for ordinary differential equations and Part C covers numerical solution of partial differential equations. Part D covers a subject chosen by the instructor.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "592C",
        "title": "Topics in Applied Mathematics: Mathematical Biology",
        "description": "Prerequisites: MATH 552 or consent of instructor. This course is devoted to a variety of important topics in applied Mmathematics that are not covered elsewhere in the Program. In particular Part A will cover the mathematical theory of partial differential equations Part B covers mathematical optimization and operations research and Part C covers mathematical biology. The topic of Part D is left to the individual instructor.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "651A",
        "title": "TOPICS AN GEO TOP",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "655",
        "title": "Complex Analysis",
        "description": "Prerequisites: MATH 501 455. Topics covered incluyde the general Cauchy theorem power series and analytic continuation series and product expansions conformal mapping and the Dirichlet problem.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "661B",
        "title": "TOP ALG DIS MATH",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MATH",
        "catalog_number": "661C",
        "title": "TOP ALG DISC MATH",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    }
]