[
    {
        "subject": "MSE",
        "catalog_number": "101",
        "title": "Introduction to Engineering",
        "description": "Corequisite: MSE 101L. Introduction to the engineering profession and academic programs. Orientation to the University the College and its Departments. Development of study communication problem-solving design analytical and computing skills. Introduction to internet word processing spread sheet computer-aided design and presentation software. Design project development and team experience. 1 hour lecture-discussion 3 hours lab per week. (Design units: 0.5) (Available to Civil Engineering majors for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "101L",
        "title": "Introduction to Engineering Lab",
        "description": "Corequisite: MSE 101. Introduction to the engineering profession and academic programs. Orientation to the University the College and its Departments. Development of study communication problem-solving design analytical and computing skills. Introduction to internet word processing spread sheet computer-aided design and presentation software. Design project development and team experience. 1 hour lecture-discussion 3 hours lab per week. (Design units: 0.5) (Available to Civil Engineering majors for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MSE",
        "catalog_number": "105",
        "title": "Introduction to Computer-Aided Graphics Tools",
        "description": "Introduction to the use of computer-aided (CA) graphics tools. Development of skills and techniques in graphical pictorial and rotational representation. Students will be able to work on an individual project tailored to meet the needs of their field of study and post their project on the Web. Not available for credit toward an Engineering Degree. (Available for General Education Lifelong Learning.) (IC)\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "220",
        "title": "Construction Materials",
        "description": "Prerequisite: PHYS 100A/L. Corequisite: MSE 220L. Introduction to basic construction materials and their properties including concrete masonry metals woods and thermal materials. Introduction to finishes equipment and specialty items. Not available for credit toward an Engineering Degree. 2 hours lecture-discussion 3 hours technical activity-lab per week.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "220L",
        "title": "Construction Materials Lab",
        "description": "Prerequisite: PHYS 100A/L. Corequisite: MSE 220. Introduction to basic construction materials and their properties including concrete masonry metals woods and thermal materials. Introduction to finishes equipment and specialty items. Not available for credit toward an Engineering Degree. 2 hours lecture-discussion 3 hours technical activity-lab per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MSE",
        "catalog_number": "227",
        "title": "Engineering Materials",
        "description": "Prerequisite: MATH 150A. Preparatory: CHEM 101/L; PHYS 220A/L. Introductory course in engineering materials including metals ceramics polymers and composites. Study of atomic and crystalline structures of materials. Application of basic principles to study of mechanical physical and chemical behavior of materials. Selection of materials in engineering applications based on above criteria. Design project on materials properties selection or application. 3 hours lecture per week. (Design units: 0.25)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "227L",
        "title": "Engineering Materials Lab",
        "description": "Prerequisite: MATH 150A. Preparatory: CHEM 101/L; MSE 227; PHYS 220A/L. Introductory lab course in engineering materials and their properties. Includes experiments in mechanical properties heat treatment metallography corrosion properties and X-ray diffraction. Course culminates in a special project in which students identify design and perform an experiment of their choosing. One 3-hour lab per week. (Design units: 0.25)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MSE",
        "catalog_number": "300",
        "title": "Construction Technology Economy",
        "description": "Prerequisites: ACCT 220; BLAW 280; ECON 160. Applications of engineering economy and capital investment analyses for construction management technology. Evaluation of project cash flows incorporating effective interest rates inflation price and wage rate changes and uncertainty and risk. Considerations of national fiscal and monetary policy impact on project planning and analysis. Not available for credit toward an Engineering Degree. 3 hours lecture-discussion per week. (Available for General Education Social Sciences if required by a students major.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "302",
        "title": "Women in Mathematics",
        "description": "Science and EngineeringPrerequisite: Completion of Lower Division writing requirement. Exploration of the activities contributions and struggles of women in mathematics science engineering and related areas and professions such as computer science. Research on individual women engaged in these fields. Investigation of different international ethnic and culture-based practices and perspectives. Consideration of policy-related issues and intervention strategies addressing the participation and achievement of women in pertinent areas of study. (Available for General Education Comparative Cultural Studies.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "303",
        "title": "Innovation",
        "description": "Invention and TechnologyPrerequisite: Completion of Lower Division writing requirement. Exploration of the history processes methods and creators of technological innovations and inventions. Global contributions creator diversity and technological failures are addressed. Critical assessments of technological innovation and invention. Not available for credit toward an Engineering Degree. (Available for General Education Lifelong Learning.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "304",
        "title": "Engineering Economic Analysis",
        "description": "Prerequisites: MATH 150B; Completion of the Lower Division writing requirement. Systematic evaluation of the economic benefits and costs of projects involving engineering design and analysis. Economic decision making in an environment of limited resources and uncertainty. Present economy the economy of multi-year projects selection among competing independent alternatives sensitivity of outcomes to input parameters before and after tax analyses replacement economy inflation and breakeven analysis in production environments are discussed.  (Design units: 0.5) (Available to Civil Engineering majors for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "401",
        "title": "Introduction to Engineering and Technology Management",
        "description": "Recommended Preparatory: MSE 304 362. An introduction to the roles of the engineer in managing engineering and technology activities. Responsibilities of engineering and technology managers and transitioning into these roles. Challenges and risks in engineering and technology management. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "403CS",
        "title": "Facilities Planning and Design",
        "description": "Prerequisite: MSE 248/L or equivalent or graduate status. Basic concepts in the planning and design of manufacturing facilities product analysis manufacturing processes and equipment selection and schedule design; flow space activity relationships and space planning; location and layout; material handling systems; and facilities planning models. Offers a community service opportunity with activities relating to concepts and theories presented. (Design units: 1.5)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "409",
        "title": "Fundamentals of Computer-Aided Manufacturing",
        "description": "Prerequisite: MSE 248/L or equivalent or graduate status. Corequisite: MSE 409L. Topics in computer-aided manufacturing (CAM). Fixed programmable and flexible automation; numerical control technology; manual NC programming; post-processing; graphical NC programming; and NC programming with CAD/CAM systems. Selection and design of tooling. 2 hours lecture-discussion 3 hours of lab per week. (Design units: 1.5)\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "409L",
        "title": "Fundamentals of Computer-Aided Manufacturing Lab",
        "description": "Prerequisite: MSE 248/L or equivalent or graduate status. Corequisite: MSE 409. Topics in computer-aided manufacturing (CAM). Fixed programmable and flexible automation; numerical control technology; manual NC programming; post-processing; graphical NC programming; and NC programming with CAD/CAM systems. Selection and design of tooling. 2 hours lecture-discussion 3 hours of lab per week. (Design units: 1.5)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MSE",
        "catalog_number": "420",
        "title": "INNOV & TECH ENTR",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "488A",
        "title": "MSEM Senior Design I",
        "description": "Prerequisites: Satisfactory completion of all major courses in years 1-3 of the 4-year program plan; Permission of the instructor; Passing score on the Upper Division Writing Proficiency Exam. Student teams engage in complex engineering design projects subject to multiple realistic constraints. Economic environmental social political ethical health and safety manufacturability sustainability and other relevant factors are addressed. Formal design reviews demonstrating written and oral communication skills are required. MSE 488A and MSE 488BCS must be completed during the same academic year. 6 hours of lab per week. Not available for Graduate Degree Program credit. Offered Fall semester. (Design units: 2.0)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MSE",
        "catalog_number": "494A",
        "title": "MSE INTERN A",
        "description": null,
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "MSE",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Prerequisites: Senior or graduate standing in Manufacturing Systems Engineering; Written approvals of the faculty sponsor and the Department Chair. Admission is based on evidence of ability to pursue independent study in depth and on approval of a proposal submitted prior to registration in the course. (Design units: Varies)\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "MSE",
        "catalog_number": "507",
        "title": "Lean Manufacturing Systems",
        "description": "Prerequisite: MSE 407 or instructor consent. Concepts and principles of lean manufacturing systems. Methods and tools for application to manufacturing systems improvement. Practices and projects for effective design and implementation of lean manufacturing operation production control and quality systems.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "508",
        "title": "CAD/CAM Systems",
        "description": "Prerequisite: Instructor Consent. Corequisite: MSE 508L. Concepts and applications of computer-aided design and manufacturing systems. 3-dimensional geometric modeling surface and solid modeling and finite element modeling and analysis. Data exchange standards. Survey and evaluation of commercial CAD/CAM systems. Computer integrated manufacturing and management systems and e-factory implementation. Emphasis on advanced modeling tools and applications. 2 hours lecture-discussion 3 hours lab per week. (Design units: 1.0)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "508L",
        "title": "CAD/CAM Systems and Lab",
        "description": "Prerequisite: Instructor Consent. Corequisite: MSE 508. Concepts and applications of computer-aided design and manufacturing systems. 3-dimensional geometric modeling surface and solid modeling and finite element modeling and analysis. Data exchange standards. Survey and evaluation of commercial CAD/CAM systems. Computer integrated manufacturing and management systems and e-factory implementation. Emphasis on advanced modeling tools and applications. 2 hours lecture-discussion 3 hours lab per week. (Design units: 1.0)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MSE",
        "catalog_number": "511",
        "title": "ROBOTICS W/APPS",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "511L",
        "title": "ROBOTICS APPS LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MSE",
        "catalog_number": "515",
        "title": "ENG SUP CHN SYS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "516",
        "title": "CAD/CAM ADV TOOLS",
        "description": null,
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "516L",
        "title": "CAD/CAM ADV T LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MSE",
        "catalog_number": "528",
        "title": "PRIN MTLS ENGR",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "528L",
        "title": "PRIN MTLS ENGR LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MSE",
        "catalog_number": "540",
        "title": "SUST FOR ENGRS",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "600",
        "title": "DEC TOOLS FOR EM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "602",
        "title": "Engineering Innovation Management",
        "description": "Prerequisites: MSE 504 and 608C or equivalent. Starting organizing and managing engineering and technology research design and production. Technology and innovation; technological strategy and forecasting; technical entrepreneurship; evolving organizations; capitalization; and intellectual property.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "603",
        "title": "Computer Integrated Manufacturing",
        "description": "Prerequisite: MSE 508/L or instructor consent. The integration of CAD/CAM information management and communication technologies in manufacturing environments. Provides advanced instruction in design and implementation of integrated CAD/CAM robotics and flexible manufacturing systems with particular attention toward bridging information gaps. Topics include analysis of product definition processes communication in manufacturing environments technological and organization requisites for CIM manufacturing requirements planning just-in-time manufacturing and future directions for factory automation.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "604",
        "title": "Engineering Economy and Financial Analysis",
        "description": "Prerequisite: Consent of instructor. Evaluation of economic feasibility from an engineering perspective. Application of various methods of comparing alternatives on an economic basis. Implications of depreciation inflation currency exchange rates and taxation on the profitability of engineering projects. Reviewing the basics of cost estimation and accounting. Development of income statement cash flow statement and balance sheet for engineering projects. Other applications in corporate financial decision making are briefly covered.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "606",
        "title": "PR & OPR MGT FOR ENG",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "608B",
        "title": "Management of Engineering Professionals",
        "description": "Prerequisite: MSE 504 or equivalent. Study of special considerations in the management of engineering professionals including selection performance termination and conflict situations. The course consists in part of the study of selected current publications.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "609",
        "title": "Advanced Topics in CAD/CAM",
        "description": "Recommended Preparatory: MSE 508/L or equivalent. Areas of current interest in computer-aided design and manufacturing. Topics include computer graphics software and hardware mathematical bases of geometric modeling simultaneous engineering manufacturability analysis feature-based processing and database management for manufacturing environments.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "617",
        "title": "Seminar in Quality Management",
        "description": "Recommended Preparatory: MSE 362 or equivalent. Discussion and analysis of current theory practices and state-of-the-art developments applicable to quality management in engineering and technology.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "630",
        "title": "Electronic Materials",
        "description": "Prerequisite: Instructor consent. Electrical behaviors of materials; conductors semiconductors and insulators; electronic structure of materials; preparation of semiconductor materials; crystal growth and doping; intrinsic and extrinsic semiconductors; semiconductor devices; superconductivity and superconducting materials; photoelectron effects with semiconductors; photovoltaic materials and solar cells; imperfections in semiconductors; and characterization of electronic materials.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "690",
        "title": "Materials Engineering Research Practicum",
        "description": "Prerequisite: Instructor consent. Applications of advanced materials and processes engineering laboratory research techniques and methodologies to studies of current interest such as nanotechnology MEMS sensors smart materials microelectronics optoelectronics bio-materials and environmentally-assisted cracking of advanced materials.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "MSE",
        "catalog_number": "697MFS",
        "title": "Manufacturing Systems Directed Comprehensive Studies",
        "description": "Preparatory: Classified status in M.S. Manufacturing Systems Engineering Program; Satisfactory completion of at least 24 semester units in formal program of study; Supervising faculty advisor and Graduate Coordinator permission. Preparation for and completion of written and oral comprehensive culminating experience requirement for the Master of Science in Manufacturing Systems Engineering degree. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "MSE",
        "catalog_number": "697MGT",
        "title": "Engineering Management Directed Comprehensive Studies",
        "description": "Preparatory: Classified status in M.S. Engineering Management; Satisfactory completion of at least 27 semester units in formal program of study; Supervising faculty advisor and Graduate Coordinator permission. Preparation for and completion of written comprehensive case studies culminating experience requirement for the Master of Science in Engineering Management Degree. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "MSE",
        "catalog_number": "697MTL",
        "title": "Directed Comprehensive Studies: Materials Engineering",
        "description": "(Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "MSE",
        "catalog_number": "248",
        "title": "Engineering Cad and Graphics",
        "description": "Prerequisite: MATH 250. Corequisite: MSE 248L. Development of concepts and skills in engineering graphics and computer-aided design (CAD). Reading interpretation and preparation of working drawings; dimensioning and tolerances; and interpretation of blueprints. Orthographic and isometric representations; auxiliary and sectional views. 3-dimensional solid modeling. Application of CAD graphics in the design and development of an assembly. 2 hours lecture-discussion 3 hours lab per week. (Design units: 1.0) (May be used in General Education Lifelong Learning if required by students major.)\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "248L",
        "title": "Engineering Cad and Graphics Lab",
        "description": "Prerequisite: MATH 250. Corequisite: MSE 248. Development of concepts and skills in engineering graphics and computer-aided design (CAD). Reading interpretation and preparation of working drawings; dimensioning and tolerances; and interpretation of blueprints. Orthographic and isometric representations; auxiliary and sectional views. 3-dimensional solid modeling. Application of CAD graphics in the design and development of an assembly. 2 hours lecture-discussion 3 hours lab per week. (Design units: 1.0) (May be used in General Education Lifelong Learning if required by students major.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MSE",
        "catalog_number": "362",
        "title": "Engineering Statistical Applications",
        "description": "Prerequisites: CE 240; MATH 250. Development and application of probabilistic and statistical methods for selected classes of engineering design and analysis problems. Applications to product and structural design engineering experiments and processes and the reliability of engineering systems.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "402",
        "title": "Engineering Project Management",
        "description": "Prerequisite: MSE 362 or equivalent. The engineering project management process from the feasibility stage through project close out. Topics include project initiation project screening and selection organizational and project structure time and cost estimation budgeting developing work plans scheduling resources managing risk tracking work managing teams partnership projects and close out. Students learn to use appropriate software to assist with the project-management process. (Design units: 0.5)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "406",
        "title": "Engineering Cost Analysis",
        "description": "Recommended Preparatory: MSE 304 362. Principles of cost analysis and estimating for the evaluation of engineering design and production with emphasis on evaluating innovations and inventions. Case studies and practical application experiences. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "407",
        "title": "Manufacturing Systems",
        "description": "Prerequisite: Instructor consent. Principles practices andmethodologies of manufacturing systems. Effective design and implementation of manufacturing operations production control quality and automated systems. (Design units: 1.0)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "410",
        "title": "Production Systems Modeling",
        "description": "Prerequisite: Instructor consent. Corequisite: MSE 410L. Design and analysis of production systems. Fixed flexible and programmable automation. Modeling and simulation of alternative production systems in conjunction with the systems-design process. 2 hours lecture-discussion 3 hours lab per week. Available for graduate credit. (Design units: 2.5)\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "410L",
        "title": "Production Systems Modeling Lab",
        "description": "Prerequisite: Instructor consent. Corequisite: MSE 410. Design and analysis of production systems. Fixed flexible and programmable automation. Modeling and simulation of alternative production systems in conjunction with the systems-design process. 2 hours lecture-discussion 3 hours lab per week. Available for graduate credit. (Design units: 2.5)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MSE",
        "catalog_number": "412",
        "title": "Manufacturing Process",
        "description": "Prerequisites: MSE 227/L 248/L; CE 240. Corequisite: MSE 412L. Manufacturing processes for cost-effective high-quality production. Consideration of technical capabilities and limitations of alternative methods. Includes forming removal casting joining heat treating molding finishing and coating. Course project required. Laboratory experiments include heat treating deep drawing powder metallurgy casting injection molding fabricating composites friction coefficients analysis and milled surface evaluation. 2 hours lecture-recitation 3 hours lab per week. Available for graduate credit. (Design units: 1.5)\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "412L",
        "title": "Manufacturing Process Lab",
        "description": "Prerequisites: MSE 227/L 248/L; CE 240. Corequisite: MSE 412. Manufacturing processes for cost-effective high-quality production. Consideration of technical capabilities and limitations of alternative methods. Includes forming removal casting joining heat treating molding finishing and coating. Course project required. Laboratory experiments include heat treating deep drawing powder metallurgy casting injection molding fabricating composites friction coefficients analysis and milled surface evaluation. 2 hours lecture-recitation 3 hours lab per week. Available for graduate credit. (Design units: 1.5)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "MSE",
        "catalog_number": "415",
        "title": "Product Design",
        "description": "Prerequisite: MSE 412/L or graduate status. Engineering principles and practices of product design. Applications of process design for manufacturing engineering. Approaches to design for manufacture (DFM) and design for assembly (DFA). (Design units: 2.0)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "488BCS",
        "title": "MSEM Senior Design II",
        "description": "Prerequisite: MSE 488A. Continuation of MSE 488A. Includes a community service opportunity with activities relating to concepts and theories presented. MSE 488A and 488BCS must be completed during the same academic year. 6 hours of lab per week. Not available for Graduate Degree Program credit. Offered Spring semester. (Design units: 2.0)\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "MSE",
        "catalog_number": "499C",
        "title": "Independent Study",
        "description": "Prerequisites: Senior or graduate standing in Manufacturing Systems Engineering; Written approvals of the faculty sponsor and the Department Chair. Admission is based on evidence of ability to pursue independent study in depth and on approval of a proposal submitted prior to registration in the course. (Design units: Varies)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "MSE",
        "catalog_number": "504",
        "title": "Engineering Management",
        "description": "Prerequisite: Instructor consent. Principles and applications for effective management of technology projects people budgets and schedules. Organizing and motivating people and controlling activities. Managing research development design marketing and production functions in engineering and technology. Ethical considerations in engineering and technology management. (Design units: 0.5)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "505",
        "title": "Engineering Decision Analysis",
        "description": "Preparatory: MSE 362 or equivalent. Introduction to decision- and risk-analysis methods in the context of engineering. Organizing frameworks for the synthesis analysis and evaluation of complex unstructured engineering problems and situations. (Design units: 1.0)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "MSE",
        "catalog_number": "509",
        "title": "Computer-Aided Manufacturing Systems",
        "description": "Prerequisite: MSE 409/L or equivalent. Introduction to the design of computer-aided manufacturing systems. Concepts and principles of computer-aided manufacturing programming language development. Methods tools practices and projects for design and implementation of computer-aided manufacturing systems.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "513",
        "title": "NDE Methods and Analyses",
        "description": "Prerequisite: Instructor Consent. Study of the methods of measuring quality in manufacturing products including metrology and non-destructive evaluation (NDE) methods; radiographic ultrasonic surface examination; and acoustic emission. The capability limitations and economics of the methods of gathering and interpreting data for measurement of quality. Reliability engineering topics introduced. (Design units: 1.5)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "601A",
        "title": "Engineering Statistics I",
        "description": "Prerequisite: Instructor consent. Comprehensive statistical estimation design and hypothesis testing methods and their application to selected problems in engineering.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "606A",
        "title": "Engineering Operations Management",
        "description": "Systems methodology and mathematical bases in industry and service organizations. Selected approaches in optimization methods such as linear programming and multi-criteria decision making tools; inventory modeling; logistics; decision analysis as well as PERT/CPM methods. Emphasis will be placed on applying the tools and the economic interpretation of results.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "608C",
        "title": "Engineering Financial and Cost Analysis",
        "description": "Recommended Preparatory: MSE 604 or equivalent. Fundamental concepts and methods of engineering financial cost analysis. Understanding the relevance of financial and managerial accounting to the effective management of engineering and technology projects.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "611",
        "title": "Robotics and Programmable Automation",
        "description": "Prerequisite: Instructor consent. Recommended Preparatory: MSE 511/L. Introduction to the design of programmable automation with robotic applications. Concepts principles and applications of programmable automation in manufacturing environments. Methods tools practices and projects for design and implementation of programmable automation systems.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "618",
        "title": "Six Sigma Quality Engineering",
        "description": "Prerequisite: MSE 601 or instructor consent. Overview and evolution of continuous improvement methodologies. Comparison of product-related and process-related Six Sigma methodologies. Integration of operating philosophies applied statistics and project management in continuous improvement deployment. Phases of Six Sigma methodology and application of computing technologies to quality engineering projects. Advanced topics in Six Sigma continuous improvement design.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "624",
        "title": "Failure Analysis",
        "description": "Prerequisite: Instructor consent. Modes mechanisms models and theories of materials failures. Environmental-assisted cracking and fatigue of materials. Analyses of engineering failures. Emphasis is placed on the development and formulation of approaches to materials selection based on probable failure modes.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "629",
        "title": "Phase Transformations",
        "description": "Prerequisite: Instructor consent. Thermodynamics of phase transformations kinetics of reactions diffusion crystal growth solidification recovery recrystallization and grain growth solid state phase transformation and diffusional and martensitic transformations.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "MSE",
        "catalog_number": "692",
        "title": "Engineering Management Research Practicum",
        "description": "Prerequisites: Completion of at least 18 units in formal program of study with GPA of at least 3.75; Classified status; Instructor consent. Application of advanced concepts of current interest in engineering management to research and implementation in technology-based environments such as analytical methods production systems technical personnel innovation and cost analyses.\n",
        "units": "3",
        "class_type": "SUP"
    }
]