[
    {
        "subject": "PSY",
        "catalog_number": "150",
        "title": "Principles of Human Behavior",
        "description": "Designed to give students an understanding and appreciation of the scientific approach to human behavior thought and action and to provide the basic conceptual framework for studying the cognitive emotional and social aspects of human activity. Students are required to spend approximately 2.5 hours during the term in research-related activities. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "150HON",
        "title": "INTRO PSYCH",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "250",
        "title": "Physiological Correlates Human Behavior",
        "description": "Prerequisites: PSY 150; Passing grade in AAS CHS PAS or ENGL 098 or eligibility for the Lower Division writing requirement. Designed for students majoring in Psychology. Development of a greater understanding of the relationship between human behavior and human physiology. Includes basic information about the anatomy and function of the nervous and endocrine systems. Students are required to spend approximately 1.25 hours during the term in research-related activities.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "301",
        "title": "PSY PREPROFESSION",
        "description": null,
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "310",
        "title": "Abnormal Psychology",
        "description": "Prerequisites: PSY 150 250; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. Survey of mental disorders including biological psychological and social/cultural determinants as well as psychosocial and pharmacological interventions. This course fulfills the 300-level Clinical/Personality Psychology Cluster requirement for Psychology Majors.\n",
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "312",
        "title": "Psychological Aspects of Parenthood",
        "description": "Prerequisites: PSY 150; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. Analysis of motivations and skills necessary for parenthood and the effect of various parental attitudes and practices on the development of the self. Historical presentation of changes in parenting styles cross-cultural views of parental practices and current information on the results of deviations in parental care. Examination of alternate family styles\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "313",
        "title": "Developmental Psychology",
        "description": "Prerequisites: PSY 150; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. In the context of examining the development of the whole child relevant aspects of physical social cognitive linguistic and emotional change are highlighted as part of development from birth to adolescence. Emphasis on the study of the underlying processes and influences on human development. Cultural contexts of development key changes continuity and individual differences are examined. Includes evaluation of selected theories contemporary issues and practical applications. This course fulfills the 300-level Developmental Psychology Cluster requirement for Psychology Majors.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "320",
        "title": "Statistical Methods in Psychological Research",
        "description": "Prerequisites: PSY 150 MATH 140 or equivalent. Corequisite: PSY 320L. Recommended Preparatory: PSY 301. Analysis of statistical decision-making procedures used in psychological research. Lab: Considers problem-solving techniques and computational methods needed to analyze data obtained in psychological experiments. 3 hours lecture-discussion 2 hours lab per week.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "320L",
        "title": "Statistical Methods in Psychological Research Lab",
        "description": "Prerequisites: PSY 150 MATH 140 or equivalent. Corequisite: PSY 320. Recommended Preparatory: PSY 301. Analysis of statistical decision-making procedures used in psychological research. Lab: Considers problem-solving techniques and computational methods needed to analyze data obtained in psychological experiments. 3 hours lecture-discussion 2 hours lab per week.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "PSY",
        "catalog_number": "321",
        "title": "Research Methods in Psychology",
        "description": "Prerequisites: PSY 320/L; Completion of Lower Division writing requirement. Corequisite: PSY 321L. Recommended Preparatory: PSY 301. Study of principles and techniques used to design and evaluate psychological research using simple and advanced research designs. Lab: Includes use of various research methods in psychology research projects. 2 hours lecture-discussion 3 hours lab per week.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "321L",
        "title": "Research Methods in Psychology Lab",
        "description": "Prerequisites: PSY 320/L; Completion of Lower Division writing requirement. Corequisite: PSY 321. Recommended Preparatory: PSY 301. Study of principles and techniques used to design and evaluate psychological research using simple and advanced research designs. Lab: Includes use of various research methods in psychology research projects. 2 hours lecture-discussion 3 hours lab per week.\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "PSY",
        "catalog_number": "321LH",
        "title": "PSY RES METH LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "PSY",
        "catalog_number": "345",
        "title": "Social Psychology",
        "description": "Prerequisites: PSY 150; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. Survey of phenomena that affect individual behavior. Topics include attitudes affiliation aggression altruism person perception liking social interaction social influence and group dynamics. This course fulfills the 300-level Social Psychology Cluster requirement for Psychology Majors.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "351",
        "title": "Behavioral Psychology and Therapy*",
        "description": "Prerequisites: PSY 150 PSY 250; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. The focus of this course is on how we learn certain behaviors why we behave as we do and how human behavior can be modified. Topics include basic concepts research methods used to study adaptive and maladaptive behaviors assessment procedures intervention strategies and outcomes self-management and ethical considerations in practice. This course fulfills the 300-level Clinical/Personality Psychology Cluster requirement for Psychology Majors.  \t*This course serves in a series of courses that prepares students to apply for the Board Certified Assistant Behavior Analyst (BCaBA) Exam.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "352",
        "title": "Motivation",
        "description": "Prerequisites: PSY 150; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. Explores basic and acquired motivations that provide the energy to arouse and direct the individuals interactions with society. Discusses research methods in the social sciences. (Available for General Education Social Sciences.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "356",
        "title": "Industrial and Organizational Psychology",
        "description": "Prerequisite: PSY 150. Recommended Preparatory: PSY 301. An introduction to the major applications of psychology in various organizational and job settings. Representative topics include job selection and training job enrichment motivation team collaboration leadership knowledge sharing environmental design consumer psychology psychometrics social networking and human factors. Consideration is given to individual student work interests and to the application of psychological principles to help advance student career objectives.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "361",
        "title": "Adolescence",
        "description": "Prerequisites: PSY 150; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. Analysis of the physical cognitive social and emotional changes from puberty to adulthood. Examines contemporary youth culture from a historical and cross-cultural perspective. Discusses evaluation of age norms and deviant development. Project involving some aspect of adolescent development is required. This course fulfills the 300-level Developmental Psychology Cluster requirement for Psychology Majors. (Cross listed with CADV 361.)\n",
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "365",
        "title": "Introduction to Gerontology",
        "description": "Prerequisites: PSY 150; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. Study of the changes occurring with age as a result of alterations in physical conditions economic status role changes etc. and the accompanying psychological effects. Students may engage in volunteer activities or advocacy work in community agencies for persons over 55 or in research in memory quality of life issues physical health exercise etc. This course fulfills the 300-level Developmental Psychology Cluster requirement for Psychology Majors. (Available for General Education Social Sciences.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "367",
        "title": "Cognitive Psychology",
        "description": "Prerequisites: PSY 150; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. Analysis of the mechanisms by which people gather and process information from the environment. Basic phenomena of perception and cognition are discussed with an emphasis on experimental studies on such topics as pattern recognition attention memory language reasoning and problem solving. This course fulfills the 300-level Cognitive Psychology Cluster requirement for Psychology Majors.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "369",
        "title": "Applied Cognition",
        "description": "Prerequisites: PSY 150; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. Cognitive psychology is the study of mental processes such as learning memory attention problem solving and language. Applied cognitive psychology describes contemporary cognitive theory from the perspective of its application in support of human performance in real-world domains such as medicine legal practice aviation and business among many others. This course fulfills the 300-level Cognitive Psychology Cluster requirement for Psychology Majors.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "370",
        "title": "Psychology of Personality",
        "description": "Prerequisites: PSY 150 PSY 250; Completion of Lower Division writing requirement. Recommended Preparatory: PSY 301. Human behavior and personality as a function of social dynamic and biological determinants. Emphasis on social learning conditions that relate to normal and deviant behavior and other relevant contemporary issues. This course fulfills the 300-level Clinical/Personality Psychology Cluster requirement for Psychology Majors.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "382",
        "title": "Principles of Human Factors",
        "description": "Prerequisites: PSY 150; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. Overview of the interdisciplinary field of human factors a professional specialization that considers how best to accommodate human needs in real world systems. Focuses on cognitive perceptual behavioral and physiological principles as they relate to the design of devices products and systems in order to enhance human performance and satisfaction. Representative topics include principles of information processing human characteristics and limitations environmental stressors user safety and applied research techniques. This course fulfills the 300-level Cognitive Psychology Cluster requirement for Psychology Majors.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "383",
        "title": "Interpersonal Competence and Group Dynamics",
        "description": "Prerequisite: PSY 150. Recommended Preparatory: PSY 301. Lecture-discussion and experiential activities designed to increase knowledge and skill in the areas of interpersonal relations group dynamics and leadership.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "406",
        "title": "Developmental Psychopathology*",
        "description": "Prerequisites: PSY 313; Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory:  PSY 301. Study of disorders diagnosed in infancy childhood or adolescence (e.g. autism mental retardation communication disorders) and the empirically validated interventions appropriate for each population. Available for graduate credit with consent of students graduate advisor. 2 hours lecture-discussion per week. *This course serves in a series of courses that prepares students to apply for the Board Certified Assistant Behavior Analyst (BCaBA) Exam.\n\n",
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "420",
        "title": "ADV STAT METHODS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "420L",
        "title": "LAB ADV STAT",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "PSY",
        "catalog_number": "421J",
        "title": "Workshop in Psychology: Development of Sexuality",
        "description": "Prerequisites: PSY 150; Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory: PSY 301. Psychology workshops deal with specific psychological topics related to living and adjusting in contemporary society. Encourages relevance and practical application through the use of group discussions simulations role-playing case studies and real-life examples. Maximum of 4 units may be counted toward the Major.\n",
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "421M",
        "title": "Workshop in Psychology: Communication and Conflict",
        "description": "Prerequisites: PSY 150; Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory: PSY 301. Psychology workshops deal with specific psychological topics related to living and adjusting in contemporary society. Encourages relevance and practical application through the use of group discussions simulations role-playing case studies and real-life examples. Maximum of 4 units may be counted toward the Major.\n",
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "421N",
        "title": "Workshop in Psychology: Human Sexuality",
        "description": "Prerequisites: PSY 150; Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory: PSY 301. Psychology workshops deal with specific psychological topics related to living and adjusting in contemporary society. Encourages relevance and practical application through the use of group discussions simulations role-playing case studies and real-life examples. Maximum of 4 units may be counted toward the Major.\n",
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "426",
        "title": "Contemporary Trends in Psychology",
        "description": "Prerequisites: PSY 150; Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory: PSY 301. Trends and issues in current psychological theories and systems.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "427",
        "title": "Introduction to Psychological Testing",
        "description": "Prerequisites: PSY 320/L; Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory: PSY 301. Basic concepts of psychological measurement as applied to the construction evaluation and use of group and individual tests of intelligence aptitude interest and personality are studied. Demonstrations of the administration scoring and interpretations of standardized tests are provided.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "453",
        "title": "Psychological Aspects of Human Sexuality",
        "description": "Prerequisites: PSY 150; Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory: PSY 301. Offers a comprehensive and integrated approach to human sexuality. Examines sexual behaviors and attitudes in contemporary society and includes the physiological basis of sexual function and dysfunction.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "457",
        "title": "BEH APP AUTISM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "460",
        "title": "Counseling and Interviewing",
        "description": "Prerequisites: PSY 310; Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory: PSY 301. Intensive study of current approaches to individual counseling and psychotherapy particularly for students seeking preparation for graduate programs. Format allows students to present research findings discuss current theories and experience therapy situations through role play and supervised counseling.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "464",
        "title": "Cognitive and Behavioral Intervention Techniques",
        "description": "Prerequisites: Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory: PSY 301 350. Consideration of some of the major issues and theories of human behavior change including a critical review of some of the important relevant experiments and areas of application. Includes techniques of modifying cognitive processes and behavior in the medical and clinical settings.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "471C",
        "title": "Advanced Inquiry in Clinical/Personality Psychology: Clinical",
        "description": "Prerequisites: PSY 301 320/L 321/L; Any course from required Clinical Cluster (PSY 310 351 353 370 or 380); Score of 8 or better on the Upper Division Writing Proficiency Exam. Corequisite: Corresponding PSY 471AA-ZZ Seminar. This Capstone course provides advanced study of areas of current interest in sub-areas of Clinical/Personality Psychology. Topics within sub-areas listed below may change each semester. Seminar: Includes student presentation of written and oral reports based on relevant topics from current literature and intensive student-led discussions of selected research and application of theories. Students will demonstrate knowledge of statistics and research methods obtained in prerequisite courses. Letters indicate sub-areas within Clinical/Personality Psychology. Each may be taken 1 time for credit: (AB) Applied Behavior Analysis (C) Clinical (CN) Clinical Neuropsychology and (P) Personality. Satisfies the Capstone requirement for Psychology Majors. Available for graduate credit with consent of students graduate advisor. 3 hours lecture 2 hours seminar.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "471CB",
        "title": "ADV INQ COGBEHTX",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "471CBS",
        "title": "ADV INQ CLIN SEM",
        "description": null,
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "471CN",
        "title": "Advanced Inquiry in Clinical/Personality Psychology: Clinical Neuropsychology",
        "description": "Prerequisites: PSY 301 320/L 321/L; Any course from required Clinical Cluster (PSY 310 351 353 370 or 380); Score of 8 or better on the Upper Division Writing Proficiency Exam. Corequisite: Corresponding PSY 471AA-ZZ Seminar. This Capstone course provides advanced study of areas of current interest in sub-areas of Clinical/Personality Psychology. Topics within sub-areas listed below may change each semester. Seminar: Includes student presentation of written and oral reports based on relevant topics from current literature and intensive student-led discussions of selected research and application of theories. Students will demonstrate knowledge of statistics and research methods obtained in prerequisite courses. Letters indicate sub-areas within Clinical/Personality Psychology. Each may be taken 1 time for credit: (AB) Applied Behavior Analysis (C) Clinical (CN) Clinical Neuropsychology and (P) Personality. Satisfies the Capstone requirement for Psychology Majors. Available for graduate credit with consent of students graduate advisor. 3 hours lecture 2 hours seminar.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "473CN",
        "title": "Advanced Inquiry in Neuroscience: Cognitive Neuroscience",
        "description": "Prerequisites: PSY 301 320/L 321/L; Score of 8 or better on the Upper Division Writing Proficiency Exam. Corequisite: Corresponding PSY 473AA-ZZ Seminar. This Capstone course provides advanced study of areas of current interest in sub-areas of Neuroscience. Topics within sub-areas listed below may change each semester. Seminar: Includes student presentation of written and oral reports based on relevant topics from current literature and intensive student-led discussions of selected research and application of theories. Students will demonstrate knowledge of statistics and research methods obtained in prerequisite courses. Letters indicate sub-areas within Neuroscience. Each may be taken 1 time for credit: (BN) Behavioral Neuroscience (CN) Cognitive Neuroscience (NP) Neuropsychology and (P) Psychopharmacology. Satisfies the Capstone Requirement for Psychology Majors. Available for graduate credit with consent of students graduate advisor. 3 hours lecture 2 hours seminar.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "473CNS",
        "title": "Advanced Inquiry in Neuroscience: Cognitive Neuroscience Seminar",
        "description": "Prerequisites: PSY 301 320/L 321/L; Score of 8 or better on the Upper Division Writing Proficiency Exam. Corequisite: Corresponding PSY 473AA-ZZ. This Capstone course provides advanced study of areas of current interest in sub-areas of Neuroscience. Topics within sub-areas listed below may change each semester. Seminar: Includes student presentation of written and oral reports based on relevant topics from current literature and intensive student-led discussions of selected research and application of theories. Students will demonstrate knowledge of statistics and research methods obtained in prerequisite courses. Letters indicate sub-areas within Neuroscience. Each may be taken 1 time for credit: (BN) Behavioral Neuroscience (CN) Cognitive Neuroscience (NP) Neuropsychology and (P) Psychopharmacology. Satisfies the Capstone Requirement for Psychology Majors. Available for graduate credit with consent of students graduate advisor. 3 hours lecture 2 hours seminar.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "475CC",
        "title": "ADV INQ DEV CULT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "475CCS",
        "title": "ADV INQ DEV SEM",
        "description": null,
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "475EA",
        "title": "ADV INQ DEV ED AP",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "479AS",
        "title": "Advanced Inquiry in Social Psychology: Applied Social Psychology",
        "description": "Prerequisites: PSY 301 320/L 321/L 345; Score of 8 or better on the Upper Division Writing Proficiency Exam. Corequisite: Corresponding PSY 479AA-ZZ Seminar. This Capstone course provides advanced study of topics of current interest in sub-areas of Social Psychology. Topics within sub-areas listed below may change each semester. Seminar: Includes student presentation of written and oral reports based on relevant topics from current literature and intensive student-led discussions of selected research and application of theories. Students will demonstrate knowledge of statistics and research methods obtained in prerequisite courses. Letters indicate sub-areas within social psychology. Each may be taken 1 time for credit: (A) Attitudes; (AG) Aggression; (AH) Altruism and Helping; (AI) Attraction and Intimacy; (AS) Applied Social Psychology; (AT) Attribution; (C) Culture; (CO) Conformity and Obedience; (G) Gender; (GS) General Social Psychology; (IR) Intergroup Relations; (P) Persuasion; (PD) Prejudice and Discrimination; (S) Self; and (SC) Social Cognition. Satisfies Capstone Requirement for Psychology Majors. Available for graduate credit with consent of students graduate advisor. 3 hours lecture 2 hours seminar.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "479ASS",
        "title": "Advanced Inquiry in Social Psychology: Applied Social Psychology Seminar",
        "description": "Prerequisites: PSY 301 320/L 321/L 345; Score of 8 or better on the Upper Division Writing Proficiency Exam. Corequisite: Corresponding PSY 479AA-ZZ. This Capstone course provides advanced study of topics of current interest in sub-areas of Social Psychology. Topics within sub-areas listed below may change each semester. Seminar: Includes student presentation of written and oral reports based on relevant topics from current literature and intensive student-led discussions of selected research and application of theories. Students will demonstrate knowledge of statistics and research methods obtained in prerequisite courses. Letters indicate sub-areas within social psychology. Each may be taken 1 time for credit: (A) Attitudes; (AG) Aggression; (AH) Altruism and Helping; (AI) Attraction and Intimacy; (AS) Applied Social Psychology; (AT) Attribution; (C) Culture; (CO) Conformity and Obedience; (G) Gender; (GS) General Social Psychology; (IR) Intergroup Relations; (P) Persuasion; (PD) Prejudice and Discrimination; (S) Self; and (SC) Social Cognition. Satisfies Capstone Requirement for Psychology Majors. Available for graduate credit with consent of students graduate advisor. 3 hours lecture 2 hours seminar.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "479CS",
        "title": "ADV SOC CULTURE",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "479CSS",
        "title": "ADV INQ SOC SEM",
        "description": null,
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "479PD",
        "title": "ADV INQ PREJUDICE",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "479SE",
        "title": "ADV INQ SPORT PSY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "485AD",
        "title": "ADV INQ RES METH",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "485ADS",
        "title": "ADV INQ METH SEM",
        "description": null,
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "485US",
        "title": "ADV INQ UNIV STAT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "485USS",
        "title": "ADV INQ METH SEM",
        "description": null,
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "487H",
        "title": "HONORS PROSEMINAR",
        "description": null,
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "488C",
        "title": "Advanced Inquiry in Cognitive Psychology: General Cognition",
        "description": "Prerequisites: PSY 301 320/L 321/L; Any course from required Cognitive Cluster (PSY 304 367 369 or 382); Score of 8 or higher on the Upper Division Writing Proficiency Exam. Corequisite: Corresponding PSY 488AA-ZZ Seminar. This Capstone course provides advanced study of topics of current interest in sub-areas of Cognitive Psychology. Topics within sub-areas listed below may change each semester. Seminar: Includes student presentation of written and oral reports based on relevant topics from current literature and intensive student-led discussions of selected research and application of theories. Students will demonstrate knowledge of statistics and research methods obtained in prerequisite courses. Letters indicate sub-areas within Cognitive Psychology. Each may be taken 1 time for credit: (AC) Attention and Consciousness (C) General Cognition (CA) Cognition and Action (CF) Cognition and Food (CI) Creativity and Innovation (DM) Decision Making (E) Expertise (HF) Human Factors (I) Intelligence (L) Language (M) Memory (MI) Mental Imagery (OP) Origins and Perspectives (P) Perception (PM) Pattern Matching (PS) Problem Solving and (R) Reasoning. Satisfies the Capstone requirement for Psychology Majors. Available for graduate credit with consent of students graduate advisor. 3 hours lecture 2 hours seminar.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "488CF",
        "title": "Advanced Inquiry in Cognitive Psychology: Cognition and Food",
        "description": "Prerequisites: PSY 301 320/L 321/L; Any course from required Cognitive Cluster (PSY 304 367 369 or 382); Score of 8 or higher on the Upper Division Writing Proficiency Exam. Corequisite: Corresponding PSY 488AA-ZZ Seminar. This Capstone course provides advanced study of topics of current interest in sub-areas of Cognitive Psychology. Topics within sub-areas listed below may change each semester. Seminar: Includes student presentation of written and oral reports based on relevant topics from current literature and intensive student-led discussions of selected research and application of theories. Students will demonstrate knowledge of statistics and research methods obtained in prerequisite courses. Letters indicate sub-areas within Cognitive Psychology. Each may be taken 1 time for credit: (AC) Attention and Consciousness (C) General Cognition (CA) Cognition and Action (CF) Cognition and Food (CI) Creativity and Innovation (DM) Decision Making (E) Expertise (HF) Human Factors (I) Intelligence (L) Language (M) Memory (MI) Mental Imagery (OP) Origins and Perspectives (P) Perception (PM) Pattern Matching (PS) Problem Solving and (R) Reasoning. Satisfies the Capstone requirement for Psychology Majors. Available for graduate credit with consent of students graduate advisor. 3 hours lecture 2 hours seminar.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "488CFH",
        "title": "ADV INQ COG&FOOD",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "488CFS",
        "title": "Advanced Inquiry in Cognitive Psychology: Cognition and Food Seminar",
        "description": "Prerequisites: PSY 301 320/L 321/L; Any course from required Cognitive Cluster (PSY 304 367 369 or 382); Score of 8 or higher on the Upper Division Writing Proficiency Exam. Corequisite: Corresponding PSY 488AA-ZZ. This Capstone course provides advanced study of topics of current interest in sub-areas of Cognitive Psychology. Topics within sub-areas listed below may change each semester. Seminar: Includes student presentation of written and oral reports based on relevant topics from current literature and intensive student-led discussions of selected research and application of theories. Students will demonstrate knowledge of statistics and research methods obtained in prerequisite courses. Letters indicate sub-areas within Cognitive Psychology. Each may be taken 1 time for credit: (AC) Attention and Consciousness (C) General Cognition (CA) Cognition and Action (CF) Cognition and Food (CI) Creativity and Innovation (DM) Decision Making (E) Expertise (HF) Human Factors (I) Intelligence (L) Language (M) Memory (MI) Mental Imagery (OP) Origins and Perspectives (P) Perception (PM) Pattern Matching (PS) Problem Solving and (R) Reasoning. Satisfies the Capstone requirement for Psychology Majors. Available for graduate credit with consent of students graduate advisor. 3 hours lecture 2 hours seminar.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "488CI",
        "title": "ADV INQ COG CREATI",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "488CIS",
        "title": "ADV INQ COG SEM",
        "description": null,
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "488CS",
        "title": "Advanced Inquiry in Cognitive Psychology: General Cognition Seminar",
        "description": "Prerequisites: PSY 301 320/L 321/L; Any course from required Cognitive Cluster (PSY 304 367 369 or 382); Score of 8 or higher on the Upper Division Writing Proficiency Exam. Corequisite: Corresponding PSY 488AA-ZZ. This Capstone course provides advanced study of topics of current interest in sub-areas of Cognitive Psychology. Topics within sub-areas listed below may change each semester. Seminar: Includes student presentation of written and oral reports based on relevant topics from current literature and intensive student-led discussions of selected research and application of theories. Students will demonstrate knowledge of statistics and research methods obtained in prerequisite courses. Letters indicate sub-areas within Cognitive Psychology. Each may be taken 1 time for credit: (AC) Attention and Consciousness (C) General Cognition (CA) Cognition and Action (CF) Cognition and Food (CI) Creativity and Innovation (DM) Decision Making (E) Expertise (HF) Human Factors (I) Intelligence (L) Language (M) Memory (MI) Mental Imagery (OP) Origins and Perspectives (P) Perception (PM) Pattern Matching (PS) Problem Solving and (R) Reasoning. Satisfies the Capstone requirement for Psychology Majors. Available for graduate credit with consent of students graduate advisor. 3 hours lecture 2 hours seminar.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "488DM",
        "title": "Advanced Inquiry in Cognitive Psychology: Decision Making",
        "description": "Prerequisites: PSY 301 320/L 321/L; Any course from required Cognitive Cluster (PSY 304 367 369 or 382); Score of 8 or higher on the Upper Division Writing Proficiency Exam. Corequisite: Corresponding PSY 488AA-ZZ Seminar. This Capstone course provides advanced study of topics of current interest in sub-areas of Cognitive Psychology. Topics within sub-areas listed below may change each semester. Seminar: Includes student presentation of written and oral reports based on relevant topics from current literature and intensive student-led discussions of selected research and application of theories. Students will demonstrate knowledge of statistics and research methods obtained in prerequisite courses. Letters indicate sub-areas within Cognitive Psychology. Each may be taken 1 time for credit: (AC) Attention and Consciousness (C) General Cognition (CA) Cognition and Action (CF) Cognition and Food (CI) Creativity and Innovation (DM) Decision Making (E) Expertise (HF) Human Factors (I) Intelligence (L) Language (M) Memory (MI) Mental Imagery (OP) Origins and Perspectives (P) Perception (PM) Pattern Matching (PS) Problem Solving and (R) Reasoning. Satisfies the Capstone requirement for Psychology Majors. Available for graduate credit with consent of students graduate advisor. 3 hours lecture 2 hours seminar.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "488DMS",
        "title": "Advanced Inquiry in Cognitive Psychology: Decision Making Seminar",
        "description": "Prerequisites: PSY 301 320/L 321/L; Any course from required Cognitive Cluster (PSY 304 367 369 or 382); Score of 8 or higher on the Upper Division Writing Proficiency Exam. Corequisite: Corresponding PSY 488AA-ZZ. This Capstone course provides advanced study of topics of current interest in sub-areas of Cognitive Psychology. Topics within sub-areas listed below may change each semester. Seminar: Includes student presentation of written and oral reports based on relevant topics from current literature and intensive student-led discussions of selected research and application of theories. Students will demonstrate knowledge of statistics and research methods obtained in prerequisite courses. Letters indicate sub-areas within Cognitive Psychology. Each may be taken 1 time for credit: (AC) Attention and Consciousness (C) General Cognition (CA) Cognition and Action (CF) Cognition and Food (CI) Creativity and Innovation (DM) Decision Making (E) Expertise (HF) Human Factors (I) Intelligence (L) Language (M) Memory (MI) Mental Imagery (OP) Origins and Perspectives (P) Perception (PM) Pattern Matching (PS) Problem Solving and (R) Reasoning. Satisfies the Capstone requirement for Psychology Majors. Available for graduate credit with consent of students graduate advisor. 3 hours lecture 2 hours seminar.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "492H",
        "title": "Honors Professional Development",
        "description": "Restricted. Instructor permission required. Prerequisites: completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher.  Recommended Preparation: PSY 301. Addresses issues associated with becoming a professional in Psychology. Discussion of time management study skills decisions about one’s prospective career discussion of activities that can strengthen competitiveness for a variety of career goals presenting at professional conferences writing a statement of purpose preparing a curriculum vita among other topics. Available for graduate credit. (Credit/No Credit Only)\n",
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "497C",
        "title": "Proseminar in Psychological Research",
        "description": "Prerequisites: PSY 150; Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory: PSY 301. Introduction to psychological research and writing through supervised individual projects and field work. 6 units maximum may be taken for credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Prerequisites: PSY 150; Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory: PSY 301. 6 units maximum may be taken for credit.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "PSY",
        "catalog_number": "500",
        "title": "Seminar in Professional Development",
        "description": "Prerequisites:  Graduate standing in Psychology.  Advanced undergraduate students may enroll by permission of the instructor and will be graded using the same standards as for graduate students. Addresses issues associated with being in Masters Programs in Psychology and being a professional in the social sciences. Students receive direct research experience and learn the skills needed to advance to a Doctoral Program. Topics include current research in psychology writing applications for an Institutional Review Board (IRB) writing for publication writing a statement of purpose presenting research at conferences applying to Doctoral Programs scholarships internships fellowships and teaching opportunities. Students attend scheduled seminars on course topics and serve outside the course as a research intern to a professor in the Department of Psychology. 1 hour seminar 2 hours by arrangement each week. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "512",
        "title": "Seminar in Developmental Psychology",
        "description": "Prerequisite: Graduate standing in Psychology. Advanced undergraduate students may enroll by permission of the instructor. Undergraduate students will be graded using the same standards as for graduate students.  Offers an examination of critical issues and theories in the study of human development. Discussion of selected topics in child and/or adolescent development including empirical findings and broader applications.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "534",
        "title": "LATENT VAR ANALYS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "534S",
        "title": "LATENT VAR SEM",
        "description": null,
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "540",
        "title": "Seminar in Social Psychology",
        "description": "Prerequisite: Graduate standing in psychology. Advanced undergraduate students may enroll by permission of the instructor. Undergraduate students will be graded using the same standards as for graduate students. Examines current research and theory in social psychology. Representative topics include attitudes aggression altruism and helping attraction and intimacy applied social psychology attribution culture conformity and obedience gender intergroup relations persuasion prejudice and discrimination self social cognition and stereotypes.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "558",
        "title": "Topics in Behavior Analysis*",
        "description": "In this course students will learn applications of behavior analytic theories procedures and methods as it pertains to special populations (e.g. children with autism geriatrics learners with developmental disabilities). Specific behavioral challenges and research in the selected topics will be discussed. Emphasis will be placed on evidence-based practices and procedures to eliminate or minimize challenges teach and increase appropriate behaviors. Given the focus on application students will be required to conduct and complete a comprehensive written project utilizing behavior analytic principles. \t\t*This course serves in a series of courses that prepares students to apply for the Board Certified Behavior Analyst Exam.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "581",
        "title": "Teaching of Psychology",
        "description": "Prerequisite: Instructor consent. This course focuses on the theories skills preparation and practices required for serving as an instructional aide in Psychology courses. Topics include course preparation skills for fostering student learning theories of assessment effective strategies for improving student writing using technology in the classroom diversity sensitivity and treatment of special populations as well as ethical and legal issues faced in the classroom. An emphasis will be made on both traditional and recent educational research findings and their implementation for effective teaching. Students attend scheduled seminars on course topics and serve outside the course as a teaching aide to a professor in the Department of Psychology. Available for graduate credit with consent of students graduate advisor. May be taken for a maximum of 6 units. 1 hour seminar 2 hours by arrangement each week. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "593A",
        "title": "COMM RES I",
        "description": null,
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "PSY",
        "catalog_number": "593AS",
        "title": "COMM RES SEM I",
        "description": null,
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "594HA",
        "title": "TUTORIAL IN PSY",
        "description": null,
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "PSY",
        "catalog_number": "594HC",
        "title": "Tutorial in Psychology",
        "description": "Prerequisite: Admission into the Graduate Program or instructor consent. Tutorial content varies by instructor and related areas of faculty specialty. Sections meet in small groups for reading and discussion to cover topics such as cognition social psychology traumatic stress mental disorders and substance dependence clinical neuropsychology and human factors design. May be repeated for credit.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "PSY",
        "catalog_number": "594RC",
        "title": "TUT RES METHODS",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "PSY",
        "catalog_number": "624",
        "title": "ADV PSY TESTING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "624L",
        "title": "ADV PSY TEST LAB",
        "description": null,
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "628",
        "title": "Fundamentals of Psychotherapy",
        "description": "Prerequisite: PSY 460; instructor consent. Comprehensive review of representative theories of psychotherapy and behavioral readjustment with an evaluation of the assumptions underlying these theories. Emphasis on group work in a community mental health setting. (Some sections are reserved exclusively for M.A. students in the classified graduate programs)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "629",
        "title": "Concepts and Clinical Application of Behavior Analysis",
        "description": "Prerequisites: Graduate standing in Psychology; Instructor consent. This course focuses on ethical functional behavior assessment and behavior change procedures as they pertain to clinical populations. Students will demonstrate advanced understanding of the philosophy theories science and concepts of applied behavior analysis.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "640",
        "title": "Advanced Social Psychology I",
        "description": "Extensive coverage of major research and theories advanced in contemporary social psychology with emphasis on individual behavior as a function of social variables. Topics include interpersonal attraction person perception and attributional processes attitude formation and change social motivation aggression and altruism.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "655AC",
        "title": "Fieldwork in Psychological Services",
        "description": "Prerequisite: Instructor consent. Taught as an academic University-based experience designed to accompany students supervised practica field work and/or internship. Course content varies as a function of the practicum setting (e.g. hospital community agency) and client age level (e.g. children adolescents adults). May be repeated (up to 4 semesters) and taken for varying number of units (1-5).\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "690A",
        "title": "Advanced Sensation and Perception",
        "description": "Prerequisites: Classified graduate status; Instructor consent. Critical review of current literature theories methods and problems concerning sensory and perceptual processes.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "696",
        "title": "Directed Graduate Research",
        "description": "No course description.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "697C",
        "title": "Directed Comprehensive Studies",
        "description": "No course description.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "PSY",
        "catalog_number": "698C",
        "title": "Thesis or Graduate Project",
        "description": "Prerequisites: Classified graduate status; Instructor consent. Course may be repeated once.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "PSY",
        "catalog_number": "699A",
        "title": "Independent Study",
        "description": "Prerequisites: Written proposals for independent study in areas of special interest to the advanced student must be submitted for Departmental approval prior to registration.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "PSY",
        "catalog_number": "200",
        "title": "Introduction to Lifespan Psychology",
        "description": "Prerequisite: PSY 150. Introduction to the patterns of growth change and stability in behavior that occurs through the entire lifespan. In addition to physical development this course examines growth and change in intellectual abilities as well as how interactions with others and social relationships develop from infancy to late adulthood. (Available for General Education Social Sciences.) PSY 230. Introduction to Human Sexual Behavior (3)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "327",
        "title": "Infancy and Early Childhood",
        "description": "Prerequisites: PSY 150; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. Relevant aspects of physical social cognitive and emotional change are highlighted as part of human development from conception to early childhood (8 years). Emphasis on study of the underlying processes and influences on human development. Cultural contexts of development key changes continuity and individual differences are examined. Includes evaluation of selected theories contemporary issues and practical applications. This course fulfills the 300-level Developmental Psychology Cluster requirement for Psychology Majors. (Cross listed with CADV 327.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "380",
        "title": "Psychology of Stress",
        "description": "Prerequisites: PSY 150 250; Completion of Lower Division writing requirement. Recommended Preparatory: PSY 301. Cognitive emotional and physiological effects of psychosocial stressors. Emphasis placed on differentiating stress from other motivational constructs and examining contemporary research approaches and techniques of personal stress management. This course fulfills the 300-level Clinical/Personality Psychology Cluster requirement for Psychology Majors.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "454",
        "title": "Clinical Psychology",
        "description": "Prerequisites: PSY 310; Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory: PSY 301. Survey of varied approaches to psychotherapy and examination of assessment methods used in research and decision making in clinical settings. Historical development of the field of clinical psychology and related disciplines and such current professional issues as graduate programs ethics and delivery of mental health services to the community are explored. Students are expected to complete 20 hours of field work in an agency related to their career objective.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "455",
        "title": "Ethical",
        "description": "Professional and Legal Standards in PsychologyPrerequisites: PSY 150; Upper Division or Graduate Status in Psychology; Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory: PSY 301. Ethical issues relevant to teaching research and application of psychology are reviewed with an emphasis on the principles of the American Psychological Associations ethics code and related professional standards and guidelines.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "471ABS",
        "title": "Advanced Inquiry in Clinical/Personality Psychology: Applied Behavior Analysis Seminar",
        "description": "Prerequisites: PSY 301 320/L 321/L; Any course from required Clinical Cluster (PSY 310 351 353 370 or 380); Score of 8 or better on the Upper Division Writing Proficiency Exam. Corequisite: Corresponding PSY 471AA-ZZ. This Capstone course provides advanced study of areas of current interest in sub-areas of Clinical/Personality Psychology. Topics within sub-areas listed below may change each semester. Seminar: Includes student presentation of written and oral reports based on relevant topics from current literature and intensive student-led discussions of selected research and application of theories. Students will demonstrate knowledge of statistics and research methods obtained in prerequisite courses. Letters indicate sub-areas within Clinical/Personality Psychology. Each may be taken 1 time for credit: (AB) Applied Behavior Analysis (C) Clinical (CN) Clinical Neuropsychology and (P) Personality. Satisfies the Capstone requirement for Psychology Majors. Available for graduate credit with consent of students graduate advisor. 3 hours lecture 2 hours seminar.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "471CP",
        "title": "ADV INQ CUL-CLIN PSY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "471PH",
        "title": "Advanced Inquiry in Clinical/Personality Psychology: Personality",
        "description": "Prerequisites: PSY 301 320/L 321/L; Any course from required Clinical Cluster (PSY 310 351 353 370 or 380); Score of 8 or better on the Upper Division Writing Proficiency Exam. Corequisite: Corresponding PSY 471AA-ZZ Seminar. This Capstone course provides advanced study of areas of current interest in sub-areas of Clinical/Personality Psychology. Topics within sub-areas listed below may change each semester. Seminar: Includes student presentation of written and oral reports based on relevant topics from current literature and intensive student-led discussions of selected research and application of theories. Students will demonstrate knowledge of statistics and research methods obtained in prerequisite courses. Letters indicate sub-areas within Clinical/Personality Psychology. Each may be taken 1 time for credit: (AB) Applied Behavior Analysis (C) Clinical (CN) Clinical Neuropsychology and (P) Personality. Satisfies the Capstone requirement for Psychology Majors. Available for graduate credit with consent of students graduate advisor. 3 hours lecture 2 hours seminar.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "471PHS",
        "title": "Advanced Inquiry in Clinical/Personality Psychology: Personality Seminar",
        "description": "Prerequisites: PSY 301 320/L 321/L; Any course from required Clinical Cluster (PSY 310 351 353 370 or 380); Score of 8 or better on the Upper Division Writing Proficiency Exam. Corequisite: Corresponding PSY 471AA-ZZ. This Capstone course provides advanced study of areas of current interest in sub-areas of Clinical/Personality Psychology. Topics within sub-areas listed below may change each semester. Seminar: Includes student presentation of written and oral reports based on relevant topics from current literature and intensive student-led discussions of selected research and application of theories. Students will demonstrate knowledge of statistics and research methods obtained in prerequisite courses. Letters indicate sub-areas within Clinical/Personality Psychology. Each may be taken 1 time for credit: (AB) Applied Behavior Analysis (C) Clinical (CN) Clinical Neuropsychology and (P) Personality. Satisfies the Capstone requirement for Psychology Majors. Available for graduate credit with consent of students graduate advisor. 3 hours lecture 2 hours seminar.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "475EAS",
        "title": "ADV INQ DEV SEM",
        "description": null,
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "479GG",
        "title": "ADV INQ SCPSY GAM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "479GGS",
        "title": "ADV SCPSY GAM SEM",
        "description": null,
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "479PDS",
        "title": "ADV SOC PSY SEM",
        "description": null,
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "485GT",
        "title": "Advanced Inquiry in Research and Analysis Methods: Grounded Theory",
        "description": "Prerequisites: PSY 301 320/L 321/L; Score of 8 or better on the Upper Division Writing Proficiency Exam. Corequisite: Corresponding PSY 485AA-ZZ Seminar. This Capstone course provides advanced study of areas of current interest in sub-areas of Research Methods in psychology. Topics within sub-areas listed below may change each semester. Seminar: Includes student presentation of written and oral reports based on relevant topics from current literature and intensive student-led discussions of selected research and application of theories. Students will demonstrate knowledge of statistics and research methods obtained in prerequisite courses. Letters indicate sub-areas within Research Methods. Each may be taken one time for credit: (AD) Archival Data (CS) Case Study (DA) Discourse Analysis (ET) Ethnography (GT) Grounded Theory (NA) Narrative Analysis (PA) Participatory Action Research (QL) Qualitative Methods; (QT) Quantitative Methods; and (SD) Survey Data. Satisfies the Capstone Requirement for Psychology Majors. Available for graduate credit with consent of students graduate advisor. 3 hours lecture 2 hours seminar.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "485GTS",
        "title": "Advanced Inquiry in Research and Analysis Methods: Grounded Theory Seminar",
        "description": "Prerequisites: PSY 301 320/L 321/L; Score of 8 or better on the Upper Division Writing Proficiency Exam. Corequisite: Corresponding PSY 485AA-ZZ. This Capstone course provides advanced study of areas of current interest in sub-areas of Research Methods in psychology. Topics within sub-areas listed below may change each semester. Seminar: Includes student presentation of written and oral reports based on relevant topics from current literature and intensive student-led discussions of selected research and application of theories. Students will demonstrate knowledge of statistics and research methods obtained in prerequisite courses. Letters indicate sub-areas within Research Methods. Each may be taken one time for credit: (AD) Archival Data (CS) Case Study (DA) Discourse Analysis (ET) Ethnography (GT) Grounded Theory (NA) Narrative Analysis (PA) Participatory Action Research (QL) Qualitative Methods; (QT) Quantitative Methods; and (SD) Survey Data. Satisfies the Capstone Requirement for Psychology Majors. Available for graduate credit with consent of students graduate advisor. 3 hours lecture 2 hours seminar.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "493SOC",
        "title": "Professional Development in the Social Sciences II",
        "description": "Prerequisites: PSY 250 492SOC; Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory: PSY 301. Students learn in detail what it is like to be in a graduate program. Prepares students to be successful while in their graduate program by preparing them to write applications for Institutional Review Board (IRB) approvals for work with human and animal subjects writing for publication and applying for financial aid scholarships fellowships and other sources of funding. (Credit/No Credit only)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "PSY",
        "catalog_number": "524",
        "title": "Multivariate Analysis Computer",
        "description": "Prerequisite: PSY 420/L. Corequisite: PSY 524L. Analysis of multivariate research data in psychology using packaged computer programs. Covers standard techniques with applications in psychology. Choice of analytic technique is discussed as are methods of screening data to assure appropriateness of techniques. Lab: Provides direct experience with computing facilities for conducting multivariate analysis and computational methods extending statistical analysis provided by computer output. 3 hours lecture-discussion 2 hours lab per week.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "524L",
        "title": "Multivariate Analysis Computer Lab",
        "description": "Prerequisite: PSY 420/L. Corequisite: PSY 524. Analysis of multivariate research data in psychology using packaged computer programs. Covers standard techniques with applications in psychology. Choice of analytic technique is discussed as are methods of screening data to assure appropriateness of techniques. Lab: Provides direct experience with computing facilities for conducting multivariate analysis and computational methods extending statistical analysis provided by computer output. 3 hours lecture-discussion 2 hours lab per week.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "PSY",
        "catalog_number": "591A",
        "title": "Seminar in Cognitive Psychology",
        "description": "Prerequisite: Graduate standing in psychology. Advanced undergraduate students may enroll by permission of the instructor and will be graded using the same standards as for graduate students. Offers an in-depth examination of current research and theory in cognition. Representative topics include attention perception learning memory language problem solving creativity reasoning decision making and intelligence.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "594AA",
        "title": "TUT BEH DISORDERS",
        "description": null,
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "PSY",
        "catalog_number": "594RD",
        "title": "Tutorial in Psychology: Research Methods",
        "description": "Prerequisite: Admission into the Graduate Program or instructor consent. Tutorial content varies by instructor and related areas of faculty specialty. Sections meet in small groups for reading and discussion to cover topics such as cognition social psychology traumatic stress mental disorders and substance dependence clinical neuropsychology and human factors design. May be repeated for credit.\n",
        "units": "4",
        "class_type": "SUP"
    },
    {
        "subject": "PSY",
        "catalog_number": "600",
        "title": "Ethical Practice with Individuals",
        "description": "Families and Multidisciplinary Teams*Prerequisites: Graduate standing in Psychology; Instructor consent. This course focuses on ethical and professional research and practice of behavior analysts and professionals in the field of psychology. Emphasis is placed on ethical guidelines established by Behavior Analyst Certification Board (BACB) and American Psychological Association (APA) through analyzing cases that address working with individuals families and multidisciplinary teams.  *This course serves in a series of courses that prepares students to apply for the Board Certified Behavior Analyst Exam.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "620",
        "title": "ADV PSYCHOPATH",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PSY",
        "catalog_number": "655BC",
        "title": "Fieldwork in Psychological Services",
        "description": "Prerequisite: Instructor consent. Taught as an academic University-based experience designed to accompany students supervised practica field work and/or internship. Course content varies as a function of the practicum setting (e.g. hospital community agency) and client age level (e.g. children adolescents adults). May be repeated (up to 4 semesters) and taken for varying number of units (1-5).\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "691A",
        "title": "Advanced Cognitive Psychology",
        "description": "Prerequisites: Classified graduate status; Instructor consent. Critical review of current literature theories methods and problems concerning thinking processes and communication.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PSY",
        "catalog_number": "692A",
        "title": "Seminar in Research Methodology",
        "description": "Prerequisites: Graduate standing in Psychology; Instructor consent. This course focuses on advanced research methods in psychology including review of the scientific approach research designs and measurement and threats to validity. Emphasis is on critical analysis of research in terms of the research objective the adequacy of research design and the justifications for the conclusions.\n",
        "units": "3",
        "class_type": "SEM"
    }
]