[
    {
        "subject": "RS",
        "catalog_number": "100",
        "title": "Introduction to Religious Studies",
        "description": "Study of the elements of religion and selected contemporary religious issues. Examines such subjects as myth and ritual the sacred and profane dreams and theophanies priests and prophets science and religion history and religion and the expansion of religion today. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "100HON",
        "title": "INTRO TO REL STDY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "101",
        "title": "The Bible",
        "description": "Survey of the basic content and major themes of the Hebrew Bible (Old Testament) New Testament and Apocryphal writings. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "150",
        "title": "World Religions",
        "description": "Study of selected major world religions with emphasis on tribal religions and the historic international faiths of Asia and the Near East. Investigates rituals ethics institutional structures and the cultural ethos of religions as well as their myths doctrines and sacred texts. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "150HON",
        "title": "WORLD RELIGIONS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "204",
        "title": "Religion",
        "description": "Logic and the MediaThis course introduces and guides students in the practical use of the basic concepts of deductive logic as a dimension of critical reasoning. Using these concepts students will discuss analyze and critique statements that appear in the media (in the U.S. and elsewhere) that have been expressed by religious people and by the media itself. (Available for General Education Basic Skills Critical Thinking.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "255",
        "title": "American Political Institutions and Religion",
        "description": "Examination of the development of U.S. and California political ideals institutions and processes. The course focuses on the religious elements within political ideals religious freedom the relation between religion and state and the role of religion in the public forum including both politics and public education. (Meets GE Title 5 U.S. Constitution and State and Local Governments.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "256",
        "title": "AM REL HIST IDEAL",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "304",
        "title": "Women and Religion",
        "description": "Examination of religious views of women in oral and literary cultures focusing on the roles symbols and concepts of women within an international and historical framework. Also addresses womens own perspectives on religion as reflected in historical sources and in contemporary theology and religious life. (An Information Competence course. Available for General Education Arts and Humanities.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "306",
        "title": "American Religious Diversity",
        "description": "Survey of the religion of groups in America who are marginal to or outside of the historically dominant mainstream Protestant and civil religion ethos. An Information Competence course. Available for General Education Comparative Cultural Studies.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "307",
        "title": "Religion in America",
        "description": "The study of the influence of religious traditions on the formation of American culture and the modification of religious traditions by the American context. Also addresses major American religious thinkers and movements and religions role in shaping American thought literature and ethos. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "308",
        "title": "Native American Religions",
        "description": "Seeks to understand the religions of Native Americans in their respective tribal contexts. Inquires to what extent a common religious outlook existed among the cultures occupying what is presently the U.S.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "310",
        "title": "Religion and Literature",
        "description": "Study of literature to discover to what extent a religious tradition or the lack of one influences an authors understanding of human existence. Writers who reflect religious traditions as well as those who are informed by humanism or atheism are read and interpreted. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "311",
        "title": "Religion and Film",
        "description": "Examines how film artists address the major religious issues of our time including the nature of reality sources of transcendence the nature of good and evil in the self and society and the possibilities of renewal and hope.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "325",
        "title": "New Testament",
        "description": "Study of the New Testament and its religious thought in context.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "327",
        "title": "Teachings of Jesus",
        "description": "Literary and social analysis of the teachings of Jesus.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "345",
        "title": "Christianity",
        "description": "Eastern Orthodox Roman Catholic Protestant and non-traditional forms of Christianity compared and contrasted with one another in their historical and social contexts.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "346",
        "title": "Sufism",
        "description": "A historical and critical study of emergence and development of the mystical tradition of Islam Sufism with particular attention to literary and artistic works that are informed by Sufism as well as the relevance of Sufism to the modern world.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "355",
        "title": "Mysticism",
        "description": "Study of mysticism as a distinct religious phenomenon and a major category of religious experience. To understand its character it may be studied either within the great Western religious traditions (Judaism Islam Christianity) or cross-culturally.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "356",
        "title": "Contemporary Religious Thought",
        "description": "Study of selected major writings in religious thought with the aim of analyzing representative modern approaches to such questions as God and the world faith and self-understanding and belief and social consciousness. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "361",
        "title": "Contemporary Ethical Issues",
        "description": "Emphasizes the development of skills in critical thinking through analysis of such contemporary ethical issues as abortion euthanasia genetic engineering sexual behavior racism gender bias punishment animal rights the environment and the relationships between religion and morality. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "365",
        "title": "Islam",
        "description": "Study of the varieties of Islamic civilization in their social contexts. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "367",
        "title": "PSYCHOLOGY RELIGION",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "370",
        "title": "Religion and Ecology",
        "description": "This course examines how religious beliefs and practices contribute to humans protection utilization and/or damage of the natural world. Students explore the resources for environmental sustainability within at least 2 world religious and in newgreen theologies nature mysticism and radical environmentalism.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "378",
        "title": "American Jewish Experience",
        "description": "Seeks to describe the experience of the Jewish religion-ethnic community in America with reference to its own historic background and development and the relationship of the community to the general American culture and to other particular subcultures or ethnic groups. Emphasizes distinctive Jewish values and customs and evaluates their contribution to American culture. Studies contrasts between religious and secular understandings of Jewishness between different strands of Jewish immigration and between Jewish experience in different regions of the U.S. An Information Competence course. Available for General Education Comparative Cultural Studies.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "380",
        "title": "Asian Religions: Communal Traditions and Transitions",
        "description": "Explores Asian religions by comparing human and divine religious figures cross-culturally. Comparison of the figures from the various cultures provides a method to understand the nature of humanity and divinity in Asia. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "390",
        "title": "Buddhism",
        "description": "Study of the fundamental concepts in Theravada and Mahayana Buddhism (e.g. nirvana enlightenment karma dharma). Examines the historic development of these concepts in their various Asian cultural and geographic settings. An Information Competence course. Available for General Education Comparative Cultural Studies.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "395",
        "title": "Theory and Method in Religious Studies",
        "description": "Examines modern attempts to study religion objectively from the Western Enlightenment to the present exploring and criticizing theories and methods from anthropology sociology feminist hermeneutics evolutionary psychology and the history of religions.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "437",
        "title": "PAULINE LETTERS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "240",
        "title": "Approaches to the History of Religions",
        "description": "An investigation of major and selected religions around the world using social-scientific methods from history sociology political science and anthropology. Students learn why various religions change over time and how they interact with their particular social and cultural environments. Examples are taken from ancient and modern religions and from major and tribal religions including new religious cults. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "366",
        "title": "SCIENCE & RELIGION",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "385",
        "title": "Hinduism",
        "description": "Study of the religious life of India from the Indus Valley civilizations to the modern period. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RS",
        "catalog_number": "497B",
        "title": "Proseminar in Religious Studies",
        "description": "Reading and discussion in a specific field or on a specific topic in a small group. May be repeated for credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "RS",
        "catalog_number": "497J",
        "title": "JAINISM",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    }
]