[
    {
        "subject": "SWRK",
        "catalog_number": "501",
        "title": "Human Behavior and Social Environment I",
        "description": "Prerequisite: Graduate admission; Acceptance to the MSW Program.This is the first of 2 human behavior and social environment courses thatprovide understanding of human behavior and social environmental relationships from an ecological perspective. This course focuses on child development from pre-birth to maturity.  Child development is a complex interplay between the emerging child and his/her primary caregiver; the caregivers intimate relationships; the extended family; and the familys relationships to larger social systems.  This class examines the transactions between family members and their transactions in 3 primary arenas--the intimate relationships within the family daycare/school and the neighborhood. Students will understand the impact of risks and protective factors in human development as identified in groundbreaking longitudinal studies. Additionally the familys systems of interdependence with political social cultural economic and natural environments are explored.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "510",
        "title": "Generalist Social Work Theory and Practice I",
        "description": "Prerequisites: Graduate standing; Acceptance to the MSW Program.This is an introductory course in generalist social work knowledge values and skills. Attention is given to the historic development of social work practice; the nature and application of social work values and ethical principles; the theoretical framework of helping methods; and the helping process of engagement assessment planning intervention and evaluation. Emphasis is on a generalist approach to helping within the person-in-environment and eco-systems perspectives of services with individuals couples families and small groups.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "520",
        "title": "Social Work Practice in Multicultural Contexts",
        "description": "Prerequisites: Graduate standing; Acceptance to the MSW Program. This course is designed to assist graduate social work students in understanding and interacting in a culturally competent manner with the multitude of groups that are identified by race culture ethnicity class religion gender age sexual orientation mental or physical disability and regional and national origins that compose the diverse cultural mosaic of the U.S. The course also will cover issues relating to international social work practice and the increasingly interconnected global economy.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "521",
        "title": "Generalist Social Work Theory and Practice II",
        "description": "Prerequisites: Graduate standing; Acceptance to the MSW Program. This course is designed to help students understand organizations institutions and communities and the knowledge bases of social work generalist practice for interventions at this level. It provides an opportunity to explore selected macro models of practice and learn about human service organizations that often serve as an immediate context for community practice.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "522",
        "title": "GENERALST FLD EDU I",
        "description": null,
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "522P",
        "title": "GENERALST FLD I PLC",
        "description": null,
        "units": "1",
        "class_type": "FLD"
    },
    {
        "subject": "SWRK",
        "catalog_number": "523",
        "title": "Foundations of Field Education I",
        "description": "Prerequisite: SWRK 522. Field education in the professional foundation year is designed to permit the student to apply the knowledge skills and values learned in courses in the liberal arts social work practice social welfare policy and services human behavior in the social environment and social research in an educationally supervised experience. Students are required to complete approximately 250-300 hours of supervised practice during the course in an assigned social service agency. Agency assignments are made by the field coordinator after consultation with the student. (Letter grade only)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "525",
        "title": "Social Welfare Policy and Services",
        "description": "Prerequisites: Graduate standing; Acceptance to the MSW Program. This course examines economic historical political intellectual socio-cultural leadership values ideologies and other such factors shaping social welfare economic policy programs and services. It addresses various frameworks for studying social welfare policy programs and services and examines the roles of policy-makers the processes of social change and the roles of social workers as facilitators of positive social change. Emphasis is placed on effects of social and economic policy decisions on impoverished and oppressed people.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "535",
        "title": "Social Work Research Methods I",
        "description": "Prerequisites: Graduate standing; Acceptance to the MSW Program. This foundation course is designed to provide an introduction to research methods and to produce an appreciation of the research process. The course provides an overview of social science research methods useful for social work practice. The class provides the foundation of knowledge and skills that enable students to be intelligent consumers of science-based information to conduct social research and to critically evaluate social work practice.  Students will be prepared to participate in a range of social work research activities including: (a) conceptualization of research problems; (b) review of the literature; (c) research designs; (e) measurement; (f) data collection; and (g) evaluation of data. The student will gain an understanding of how research can facilitate and inform practice decisions and on-going evaluation of ones practice.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "601",
        "title": "Advanced Social Work Practice with Urban Families I",
        "description": "Prerequisite: Second year standing. This course advances students theoretical knowledge and practice skills in working with urban families and small groups. The course utilizes a family-systems perspective and integrates such concepts as family stress and resilience prevention and recovery in understanding and treating families through the phases of treatment from engagement and assessment to termination and evaluation. Emphasis is placed on the development and enhancement of knowledge skill theories and values specific to family practice. Various family therapy models will be introduced with an emphasis on those substantiated by evidence-based research. Theories of the family family development and diverse family structures are examined. Several specific issues commonly faced by families in urban environments also are examined including specific models in prevention and recovery.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "621",
        "title": "Advanced Social Work Practice in Urban Communities",
        "description": "<span style=line-height: 1.5em;>Prerequisite: SWRK 521. Recommended preparatory: First Year (Generalist) Courses. This course is designed around social justice and critical multicultural theoretical frameworks to help students understand and apply mezzo-macro social work interventions in urban settings with families/groups communities organizations and institutions.  Building upon the material in SWRK 521 the course will provide an opportunity to explore and apply selected advanced social work mezzo-macro practice skills such as planning organizing program development and implementation organizational assessment and evaluation.  In addition students will learn about leadership integration and  human service organizations that often serve as an immediate context for community practice. </span>\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "622",
        "title": "SPECIALIST FLD EDU I",
        "description": null,
        "units": "4",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "622P",
        "title": "SPECIALIST FLD I PLC",
        "description": null,
        "units": "1",
        "class_type": "FLD"
    },
    {
        "subject": "SWRK",
        "catalog_number": "630",
        "title": "Family Crisis",
        "description": "Trauma and GriefPrerequisite: Second year standing. This course examines the complex issues of family crisis trauma and grief for social workers working with urban families and individuals who have experienced these conditions. Several theoretical approaches are examined with an emphasis on crisis intervention in traumatic and stressful situations as well as issues of death and dying and the grief and loss associated with them. In the modern urban environments many people experience traumatic events in their daily lives. The purpose of the course is to acquaint social work students with the nature and impact as well as some of the concepts theories and principles for dealing with client systems of all sizes when they face crisis trauma and grief. The significance of crisis trauma and grief for fields of such practice as mental health hospital social work child welfare gerontology and other social services and in community violence and terrorism are explored.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "635",
        "title": "Social Work Research Methods II",
        "description": "Prerequisites: Second year standing; SWRK 535. This course provides a more in-depth view of social science research methods useful for social work practice with urban families.  It provides the knowledge and skills that enable students to be intelligent consumers of information to conduct social research and to critically evaluate social work practice.  Students also will learn how to use research to scientifically evaluate their own practice. This advanced-year course builds on knowledge of research concepts and methods developed during foundation year research courses particularly SWRK 535 as well as on the expansion of knowledge students acquire about human behavior social work practice and social welfare policies and programs. It extends students understanding of research methods and their ability to evaluate social work practice using a variety of research designs. Students will learn the skills of problem formulation operationalization and examination and utilization of the peer-reviewed literature by focusing on a research topic they are passionate about. This work will serve as the foundation on which students Capstone projects will be based.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "645",
        "title": "Urban Social Policy and Advocacy",
        "description": "Prerequisite: Second Year standing. This course is designed to help students gain knowledge and skills of policy practice (including both analysis and advocacy) to effectively participate in the development and advancement of policies that support and effect change at multiple levels of diverse client systems in urban environments. This course helps build skills in both formal and informal policy analysis identifying underlying values and communicating and organizing to effect policy formation and change.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "650U",
        "title": "INTL SOCIAL WORK",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SWRK",
        "catalog_number": "502",
        "title": "Human Behavior and Social Environment II",
        "description": "Prerequisites: SWRK 501; Graduate admission; Acceptance to the MSW Program. This is the second of 2 human behavior and social environment courses that provide understanding of human behavior and social environmental relationships from an ecological perspective. It will focus on the developmental dynamics of larger social systems specifically groups organizations and communities and their influence on individuals and families. The systems interdependence with political social cultural economic and natural environments is explored. Content emphasizes multiculturalism diversity and social justice in relation to social systems. This course will examine adult development in the context of social relationships and societal systems (both as shaped by and as shapers of) across early middle and late adulthood. The class will focus on individuals and families living in an urban setting from a strengths-based perspective.  Special attention will be given to diverse and vulnerable individuals and families living in urban settings--LGBTQIA emancipating foster youths community-released prisoners immigrant families and returning veterans.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "503",
        "title": "Psychosocial Assessment and Diagnostic Formulation",
        "description": "Prerequisite: Acceptance to the MSW Program. Social workers are often required to practice within multidisciplinary teams of professionals. The role of the social worker within the larger mental health arena is the conceptualization of an individual or family system within a social/cultural/political/economic context and from a strengths-based perspective. This course will teach students to conduct a comprehensive psychosocial assessment of individuals and families living in an urban setting. Students will critique assessment and diagnostic tools including the Diagnostic and Statistical Manual of Mental Disorders. Students completing the course will demonstrate competency in writing and orally presenting a psychosocial assessment including a multiaxial diagnostic formulation.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "602",
        "title": "Advanced Social Work Practice with Urban Families II",
        "description": "Prerequisites: SWRK 601; Second year standing. This course advances students knowledge and practice skills in working with individuals and couples. Utilizing a strengths-based person-in-environment perspective students are taught engagement assessment intervention evaluation and termination skills. Evidence-based practice models will be introduced teaching students to evaluate and critique their effectiveness with diverse clients. The major focus is on developing skill and competence with individuals within the context of their urban family and system.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "623",
        "title": "SPECIALST FLD EDU II",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SWRK",
        "catalog_number": "623P",
        "title": "Advanced Field Practicum with Urban Families II Placement",
        "description": "Prerequisite: Second Year standing SWRK 622/P.  Corequisite: SWRK 623. Advanced Practice with Urban Families Field Practicum II is the second semester of the advanced concentration field practicum courses.  The course provides field education about the advanced concentration curriculum which focuses on social work with urban families.  This second practicum is designed to provide experience in larger system work with and on behalf of families coordinating with the content classroom learning.  During the second semester of field practicum students continue at their first semester assigned placement site while continuing to enhance their social work practice skills. Students are required to complete approximately 300-360 hours of supervised practice in their assigned social service agency. (Offered Spring semester) (Letter grade only)\n",
        "units": "1",
        "class_type": "FLD"
    },
    {
        "subject": "SWRK",
        "catalog_number": "650A",
        "title": "CHILD WELFARE",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SWRK",
        "catalog_number": "650B",
        "title": "ADDICTIONS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SWRK",
        "catalog_number": "650C",
        "title": "RECOVERY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SWRK",
        "catalog_number": "650F",
        "title": "SUICIDEPREVENTION",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SWRK",
        "catalog_number": "650M",
        "title": "GROUP THERAPY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SWRK",
        "catalog_number": "650P",
        "title": "FAMILY THERAPY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SWRK",
        "catalog_number": "650V",
        "title": "INTEGRAT HLTHCARE",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SWRK",
        "catalog_number": "698",
        "title": "Capstone Project",
        "description": "Prerequisites: Second year standing. Offered as the culminating experience of the Graduate Program students complete an individual or group research project reflecting the students interests and needs in working with urban families. Outcomes of this seminar will require students to collect analyze and report direct observations; write a research paper that includes a title page abstract background methods and discussion sections conforming to APA Publication Manual guidelines; and present a poster in an open community-invited forum. This project meets the culminating experience requirements.\n",
        "units": "3",
        "class_type": "SEM"
    }
]