{
    "course-sets": {
        "required": [
            "&",
            "AFRS 100",
            "AFRS 168",
            "AFRS 201",
            [
                "|1",
                "AFRS 220",
                "AFRS 221"
            ],
            [
                "|1",
                "AFRS 245",
                "AFRS 252"
            ],
            "AFRS 271",
            "AFRS 272",
            "AFRS 301",
            [
                "|1",
                "AFRS 320",
                "AFRS 322"
            ],
            "AFRS 350",
            "AFRS 361",
            [
                "|1",
                "AFRS 392A-Z",
                "AFRS 486SOC"
            ],
            "AFRS 398",
            "AFRS 498",
            [
                "|1",
                "AFRS 161",
                "AFRS 165",
                "AFRS 311",
                "AFRS 367",
                "AFRS 466A",
                "AFRS 466B",
                "AFRS 488",
                "AFRS 490"
            ]
        ]
    },
    "link-to-major": "https://catalog.csun.edu/academics/afrs/programs/ba-africana-studies-i/african-and-african-american-social-sciences/",
    "name": "B.A., Africana Studies: African and African-American Social Sciences",
    "prog-reqq-blob": [
        "Program Requirements",
        "The Africana Studies major consists of two components: the completion of the core requirements (21 units) and the completion of one of three specific options (24 units). For each of the options, there are specific lower and upper division core courses and electives that are relevant to that concentration. All students who major in Africana Studies must select one of the three options, each of which is designed to prepare students for graduate study or for a career of their choice.",
        "1. Core Requirements for All Options (21 units)",
        "AFRS 100 Introduction to Black Studies and Culture (3)",
        "AFRS 168 Introduction to the African Diaspora (3)",
        "AFRS 201 Economics of the African-American Community I (3)",
        "AFRS 220 Psychological Environment of the African-American (3)",
        "or AFRS 221 Social Environment of the African-American (3)",
        "AFRS 245 African-American Literature Since 1930 (3)",
        "or AFRS 252 Popular Culture and the Black World (3)",
        "AFRS 271 African-American History to 1865 (3)",
        "AFRS 272 African-American History Since 1865 (3)",
        "2. Required Courses for African and African-American Social Sciences (21 units)",
        "AFRS 301 Economics of the African-American Community II (3)",
        "AFRS 320 African-American Personality Development (3)",
        "or AFRS 322 African-American Family (3)",
        "AFRS 350 Advanced Writing (3)",
        "AFRS 361 African-American Politics (3)",
        "AFRS 392A-Z Fieldwork in the African-American Community (3)",
        "or AFRS 486SOC Social Science Career Internship (3)",
        "AFRS 398 Research Methods and Paradigms in Pan African Studies (3)",
        "AFRS 498 Proseminar in Pan African Studies (3)",
        "3. Elective (3 units)",
        "Select one course from the following:",
        "AFRS 161 American Political Institutions: A Black Perspective (3)",
        "AFRS 165 Introduction to Pan Africanism (3)",
        "AFRS 311 Black Psychology (3)",
        "AFRS 367 African-American Social Movements (3)",
        "AFRS 466A The United Nations, the Organization of African Unity, and Africa (3)",
        "AFRS 466B Model Organization of African Unity Practicum (3)",
        "AFRS 488 Sustainability and Environmental Justice in African and African Diaspora Communities (3)",
        "AFRS 490 Statistical Research and Methods in Pan African Studies (3)",
        "4. Languages (Optional)",
        "All students majoring in Africana Studies are encouraged to take foreign languages (French, Portuguese, Spanish or Swahili recommended).",
        "5. General Education (48 units)",
        "Undergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.",
        "15 units are satisfied by the following courses in the major: AFRS 271 satisfies C3 American History, Institutions and Ideals; AFRS 201 and AFRS 361 satisfy D1 Social Sciences; AFRS 100 and AFRS 320 or AFRS 322 satisfy F Comparative Cultural Studies.",
        "If taken, AFRS 245 satisfies C2 Humanities; and AFRS 161 satisfies D3/D4 Constitution of the United States/State and Local Government.",
        "Total Units in the Major/Option: 45",
        "General Education Units: 33",
        "Additional Units: 42",
        "Total Units Required for the B.A. Degree: 120"
    ]
}