[
    {
        "subject": "ANTH",
        "catalog_number": "108",
        "title": "Latin American Cultures",
        "description": "Study of major social institutions and lifestyles in Central and South America focusing on contemporary peoples their traditional cultural base and current cultural changes. (Available for General Education Comparative Cultural Studies)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "150",
        "title": "The Human Adventure: Introduction to Anthropology",
        "description": "Overview of human physical and cultural origins and the development and distribution of diverse populations languages social institutions and beliefs; introduction to the methods and insights of cultural anthropology archaeology linguistics and physical anthropology. (Available for General Education Social Sciences)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "151",
        "title": "Physical Anthropology",
        "description": "Anthropological perspective on biological variation in human and non-human primates in the past and the present; examines the interaction between biology and culture in the evolution of human society. Evolution and behavior of non-human primates are examined for what they reveal about the human condition. (Available for General Education Social Sciences)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "151HON",
        "title": "INTRO BIO ANTHRO",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "152",
        "title": "Culture and Human Behavior",
        "description": "Study of the variety of cultural patterns that human societies use to adapt to the environment guide social interaction and understand the human condition. Emphasizes the ideas and methods anthropologists use to develop a scientific and humanistic understanding of the worlds cultures. (Available for General Education Social Sciences)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "153",
        "title": "Temples",
        "description": "Tombs and Treasures? An Introduction to ArchaeologyAlthough we are often captivated by the ancient past many of the reconstructions of this past found in popular culture are not based on the premises of scientific archaeological practice. This course introduces students to the methods theories and results of scientific archaeological study. Students learn how archaeologists collect and analyze data in order to reconstruct the lifeways and culture histories of our prehistoric ancestors from the Pleistocene to the first civilizations. (Available for General Education Social Sciences)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "212",
        "title": "Anthropology of Sex",
        "description": "This course will examine human sexuality from a holistic anthropological perspective. Subjects such as sexual anatomy and physiology sexual intercourse prostitution sexual coercion homosexuality and masturbation will be examined from a biological perspective looking to the non-human primates for comparison and a cultural perspective using ethnographic and archeological data. Additionally the course will examine the role of sex in language and folklore. (Available for General Education Social Sciences)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "222",
        "title": "Visions of the Sacred",
        "description": "Study of the varieties of religious beliefs rituals and experiences showing the relationship between people and their society culture environment and universe. (Available for General Education Arts and Humanities)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "232",
        "title": "EXPRESSIVE CULT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "262",
        "title": "FORENSIC ANTH",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "292IP",
        "title": "CULTURE AND SOCIETY",
        "description": null,
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "302",
        "title": "Introduction to Applied Anthropology",
        "description": "Prerequisites: completion of lower-division GE credit in cultural anthropology sociology political science or cultural geography and completion of lower division writing requirement. This practical hands-on course introduces students to the ways in which anthropologists apply our fields skills knowledge and perspectives towards the resolution of social problems in todays world.  Students are introduced to a variety of applications anthropology has for other disciplines and professions including education health environmental issues and business.  (Available for General Education  Social Science Subject Matter Explorations).\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "303",
        "title": "Anthropological Thought",
        "description": "Prerequisite: ANTH 150 or 152.Study of the conceptual foundations of contemporary anthropological thought. Topics include evolutionary theory functionalism historicalism structuralism and interpretative anthropology. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "305",
        "title": "Individual and Culture",
        "description": "Prerequisites: ANTH 150 or 152; PSY 150 or SOC 150 ; Completion of the Lower Division writing requirement. Not to be taken for credit in addition to SOC 305. Comparative study of the relationship between the individuals and their culture. Child-rearing in nonwestern cultures. Exploration of individual identity and group character. Regular written assignments required. (Available for General Education Social Sciences)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "308",
        "title": "Women, Sex Roles and Culture",
        "description": "Prerequisite: Completion of the Lower Division writing requirement.Discussion of women and sex roles in tribal modernizing and industrial societies; traditional sex roles and the impact of cultural change. (Available for General Education Comparative Cultural Studies)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "310",
        "title": "Language in Culture: Anthropological Linguistics",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Study of basic linguistic concepts in cultural contexts; an examination of language diversity and sociocultural factors of language use. (Available for General Education Comparative Cultural Studies and for Section C of the Multicultural Requirement for Credential Candidates)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "311",
        "title": "Human Variation",
        "description": "Prerequisite: ANTH 151. Morphological genetic and physiological aspects of human biological variability; the concept and description of race; the interaction of cultural and environmental factors in human biological adaptation. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "315",
        "title": "Third World Cultures",
        "description": "Prerequisite: Completion of the Lower Division writing requirement.Compares and contrasts nonwestern kin-organized societies with class-oriented Western societies. Examines the historic relationship between Western societies and those of indigenous peoples in the Third World. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "319",
        "title": "World Prehistory",
        "description": "Prerequisite: Completion of the Lower Division writing requirement.Encompasses the origin and development of prehistoric human culture from hunting and gathering to the origin of urban societies. Surveys the archaeological evidence from both the New and Old World. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "326",
        "title": "Introduction to Folklore",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Introduction to the study of folklore from a cross-cultural perspective including major forms such as folktale legend ballad joke riddle proverb and festival and the theories used to interpret them. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "326HON",
        "title": "INTRO TO FOLKLORE",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "341",
        "title": "Bones: An Introduction to the Study of Human Remains",
        "description": "Prerequisites: ANTH 150 or 151 or BIOL 100 or 101 or 106; Completion of Lower Division writing requirement. Forensic Anthropology has been popularized in recent years by a range of popular media. But what can human remains really tell us? In this class we will review the methods used by physical anthropologists to study the human skeleton and critically examine the array of information that can actually be scientifically extracted from human skeletal remains. Based on this knowledge we will analyze the biological and cultural information bones may yield about past human populations. (Available for General Education Social Sciences)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "345",
        "title": "Diversity in the United States",
        "description": "Prerequisites: ANTH 150 or 152; Completion of the Lower Division writing requirement. Examination of individual and group ethnic identity. Interaction of mainstream culture ethnic groups and social classes in U.S. society. Illustrations drawn from particular groups. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "346",
        "title": "Urban Anthropology",
        "description": "Prerequisite: Completion of the Lower Division writing requirement.Cross-cultural urbanism urbanization and migration both with macro and micro focus. Regular written assignments required. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "353",
        "title": "The Maya: Ancient and Modern",
        "description": "Prerequisite: ANTH 319. The Maya form one of the largest indigenous linguistic groups in the Americas. This course is an introductory survey of their culture and society from prehistoric times to the present. The course addresses the cultural history social organization and political history of the Maya as well as their artistic and intellectual achievements. Discussions include examination of ancient Maya sites architecture art and writing as well as examining the state of the Maya in the modern world. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "356",
        "title": "Peoples and Cultures of the Mediterranean",
        "description": "Prerequisite: ANTH 150 or 152. Examines people and cultures of the Mediterranean region including Spain southern France Italy Greece the Middle East and North Africa through contemporary ethnography and film. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "360",
        "title": "Immigration and Ethnicity",
        "description": "Prerequisite: Completion of the Lower Division writing requirement.Counts as credit toward the Anthropology minor but not toward the Anthropology major. Examines the basic concepts that inform our understanding of immigration and ethnicity: race class gender; the politics of multiculturalism and cultural diversity; and the conflicts and problems inherent in the immigrant experience. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "423",
        "title": "Human Behavior: Evolutionary Perspectives",
        "description": "Prerequisites: ANTH 151; Completion of the Lower Division writing requirement. Introduction to the various methods and approaches anthropologists use to understand human behavior from a biocultural perspective. Examines the determinants of human behavior past and present. Regular written assignments required. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "424",
        "title": "The Supernatural in the Modern World",
        "description": "Prerequisite: ANTH 152. Ethnographic approach to supernatural belief in the post-Enlightenment Western world through religions narratives folk healing folk drama ritual and media accounts. Analyzes scholarly approaches to these topics. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "426",
        "title": "Old World Archaeology",
        "description": "Prerequisite: ANTH 153. Survey of the culture history of the Old World from Paleolithic times to the rise of the major Old World civilizations with an emphasis on the prehistory of the Southwestern Asian Mediterranean and European regions. Regular written assignments are required. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "427",
        "title": "Archaeology of North America",
        "description": "Prerequisites: ANTH 153; Completion of the Lower Division writing requirement.Examination of the origins and adaptations of Native American Cultures. Regular written assignments are required. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "430",
        "title": "Ecological Anthropology",
        "description": "Prerequisites: ANTH 150 or 152; Completion of the Lower Division writing requirement. Ecological anthropology attempts to understand the structure distribution and evolution of human societies on the basis of ecological principles. Regular written assignments are required. Available for graduate credit. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "432",
        "title": "Environmental Justice and Health",
        "description": "Prerequisites: ANTH 150 or 152 completion of lower division writing requirement. Students in this course will explore issues of global development and social justice particularly looking at the issues of environmental degradation and human health in the context of global and local inequality. Students will explore such topics as agricultural and natural resource development the effects of war and conflict health and environmental pollution and food security all in a global-to-local ethnographic context.  Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented.  Check the schedule of classes for a CS designation.  Available for Graduate Credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "445",
        "title": "HUMAN OSTEOLOGY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "445L",
        "title": "OSTEOLOGY LAB",
        "description": null,
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "449",
        "title": "HISTARCH",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "460",
        "title": "The Archaeological Study of Women in the Ancient World",
        "description": "Prerequisites: ANTH 152 or 153; Upper Division standing; completion of the Lower Division writing requirement.Examines the data which deal with the status and roles of women in prehistoric societies. Discussion of fundamental issues such as the origins of the gendered division of labor the origins of gender hierarchy the universality of female subordination and variability in womens activities status and power in human societies. Taught from a cross-cultural perspective and combines insights provided by cultural anthropology archaeology art history physical anthropology and history.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "462",
        "title": "Anthropology of the Arts",
        "description": "Prerequisites: ANTH 150 152 or 153; Completion of the Lower Division writing requirement.Anthropological approaches to the study of artistic expression in diverse sociocultural settings from the prehistoric to the present. Regular written assignments are required. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "473",
        "title": "Theory and Method in Archaeology",
        "description": "Prerequisites: ANTH 153; Upper Division Writing Proficiency Exam. Recommended preparatory: ANTH 303. This course provides students with the basic theoretical and methodological skills and background needed to become practicing archaeologists. By the end of this course students will be able to analyze and evaluate archaeological arguments on a range of key topics in terms of their theoretical approach research design and logic. Students will master the key concepts that provide the underpinnings to successful research design and allow them to intelligently engage with other scholars at the national and international level. Available for graduate credit. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "475",
        "title": "Ethnographic Research Methods",
        "description": "Prerequisites: ANTH 150 or 152; Upper Division standing; Completion of Lower Division writing requirement. Introduction to the integration of anthropological perspectives with other social scientific research including quantitative and advanced qualitative methods. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "476A",
        "title": "Topics in Anthropological Methods",
        "description": "Fieldwork in any branch of anthropology taken either in conjunction with or subsequent to an Upper Division course in that particular branch. Available for Graduate Credit. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ANTH",
        "catalog_number": "486",
        "title": "Interrogating Globalization: the Ethnography of Global Problems",
        "description": "Prerequisites: ANTH 152 or equivalent; Upper Division Writing Proficiency Exam. Preparatory: ANTH 300 or ANTH 315 or completion of regional distribution requirement. This course studies globalization using ethnography. It examines both the debates related to characterizing globalization and ethnographies that analyze some of its aspects such as the rise of high-tech societies the decentralization and feminization of labor the dynamics and consequences of international migration and the causes and impacts of international commodity trade. Available for graduate credit. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "490A",
        "title": "Seminar in Anthropology: Archaeology",
        "description": "Prerequisites: ANTH 303; Past or concurrent enrollment in ANTH 473 or 475 (after Fall 2006); One Upper Division course in appropriate subdiscipline.Faculty-directed research on primary data in the major subdisciplines of anthropology. Selected subjects in the same subdiscipline may be repeated up to 3 times. (A) Archaeology; (B) Biological Anthropology; (C) Cultural Anthropology; (D) Linguistics; (E) Applied Anthropology.  Available for Graduate Credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ANTH",
        "catalog_number": "490C",
        "title": "Seminar in Anthropology: Cultural Anthropology",
        "description": "Prerequisites: ANTH 303; Past or concurrent enrollment in ANTH 473 or 475 (after Fall 2006); One Upper Division course in appropriate subdiscipline.Faculty-directed research on primary data in the major subdisciplines of anthropology. Selected subjects in the same subdiscipline may be repeated up to 3 times. (A) Archaeology; (B) Biological Anthropology; (C) Cultural Anthropology; (D) Linguistics; (E) Applied Anthropology.  Available for Graduate Credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ANTH",
        "catalog_number": "490E",
        "title": "Seminar in Anthropology: Applied Anthropology",
        "description": "Prerequisites: ANTH 303; Past or concurrent enrollment in ANTH 473 or 475 (after Fall 2006); One Upper Division course in appropriate subdiscipline.Faculty-directed research on primary data in the major subdisciplines of anthropology. Selected subjects in the same subdiscipline may be repeated up to 3 times. (A) Archaeology; (B) Biological Anthropology; (C) Cultural Anthropology; (D) Linguistics; (E) Applied Anthropology.  Available for Graduate Credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ANTH",
        "catalog_number": "499A",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "ANTH",
        "catalog_number": "500",
        "title": "FNDANTHTM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "574",
        "title": "ADV QNT METH ANTH",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ANTH",
        "catalog_number": "603",
        "title": "Problems in Physical Anthropology",
        "description": "Prerequisite: Classified status or instructor consent. Advanced study of theories methods problems and data pertinent to contemporary physical anthropology.  \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ANTH",
        "catalog_number": "606",
        "title": "Problems in Archaeology",
        "description": "Prerequisite: Classified status or instructor consent. Intensive review of current issues and concepts critical to general understanding of archaeology.  \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ANTH",
        "catalog_number": "607",
        "title": "Seminar in Management of Archaeological Resources",
        "description": "Prerequisite: Classified status or instructor consent. Covers the practical scientific and ethical aspects of conducting archaeological research for public and private agencies. \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ANTH",
        "catalog_number": "694",
        "title": "Practicum in Cultural Resource Management",
        "description": "Prerequisite: ANTH 607 or instructor consent. Internship involving the student directly in a work experience in cultural resource management. \n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "ANTH",
        "catalog_number": "696A",
        "title": "ANTH RES DESIGN",
        "description": null,
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "ANTH",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisite: Completion of all courses required in the program. Intended for students taking the comprehensive exam.  Grading is CR/NC only.\n",
        "units": "2",
        "class_type": "SUP"
    },
    {
        "subject": "ANTH",
        "catalog_number": "698A",
        "title": "Thesis or Graduate Project",
        "description": "Thesis or Graduate Project\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "ANTH",
        "catalog_number": "699B",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "2",
        "class_type": "SUP"
    },
    {
        "subject": "ANTH",
        "catalog_number": "307",
        "title": "Native Peoples of California and the Southwest",
        "description": "Prerequisite: ANTH 150 or 152.Origins modes of subsistence social organization and geographic and historical relationships. European conquest and the present condition of several tribes. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "338",
        "title": "Peoples of Africa",
        "description": "This course introduces students to the diversity of African cultures in North Africa the Sahel the Horn of Africa Central Africa West Africa East Africa and Southern Africa. Students will learn about the history and ethnography of colonial and postcolonial African societies and develop a more balanced understanding of Africas diversity complexity and relationship to contemporary globalization.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "351",
        "title": "Peoples of Middle America",
        "description": "Prerequisite: ANTH 150 or 152 or CAS 100. Survey of the cultures from Mexico to Panama tracing their characteristics and changes from the 16th century to the present. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "421",
        "title": "Primatology: Morphology",
        "description": "Behavior and Social OrganizationPrerequisites: ANTH 151 and 150 or 152. Detailed examination of that part of physical anthropology which seeks to add to understanding of human behavior and evolution by elucidating the social organizations and behavioral adaptation of the primates. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "425",
        "title": "Culture",
        "description": "Health and HealingPrerequisites: ANTH 151 or ANTH 152. Introduction to medical anthropology the study of the interaction of biological psychological and sociocultural factors in human promotion of health and adaptation to disease. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "428",
        "title": "Archaeology of Mesoamerica",
        "description": "Prerequisites: ANTH 153; Completion of the Lower Division writing requirement.Overview of the cultural achievements and developments in Mesoamerica prior to the Spanish Conquest. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "429",
        "title": "Archaeology of South America",
        "description": "Prerequisites: ANTH 153; Completion of the Lower Division writing requirement. Overview of the cultural achievements and developments in South America prior to the colonialization by the European countries. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "450",
        "title": "Historical Anthropology",
        "description": "Prerequisites: ANTH 150 or 152; Completion of the Lower Division writing requirement.Introduction to the anthropological study of cultures within a historical context. Examines the importance of a diachronic approach to the study of contemporary societies and introduces anthropological methods for a study of the past. Teaches critical analysis of documentary materials relevant for anthropological research. Regular written assignments required. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "453",
        "title": "Human Paleontology",
        "description": "Prerequisites: ANTH 151 153. Origin of humanity and the history of physical evolution beginning in Miocene times and continuing through to the present. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "465",
        "title": "Museum Anthropology: Principles and Practices",
        "description": "Prerequisites: ANTH 152 or equivalent; Upper Division Writing Proficiency Exam. This course introduces students to the theoretical and technical aspects of museum work as it relates to ethnographic and archaeological materials as well as to the political and ethical ramifications of these practices. The course explores museum practices skills and resources as they relate to the collection curation exhibition and administration of ethnographic and archaeological materials. Practices principles and resources are considered not only for the United States but also as they pertain to museums and collections worldwide. Available for graduate credit.  \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "468",
        "title": "Cultural Heritage",
        "description": "Prerequisite: ANTH 152 and 153; Completion of Lower-Division writing requirement. Introduction to cultural heritage studies that focuses on the politics of the representation and conservation of tangible and intangible remains of the past. An examination of the issues at stake in the interpretation management and portrayal of the past that contribute to the complexity of contemporary identity politics. The course also explores the uses (and abuses) of the past in the present for social political and economic purposes. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "474",
        "title": "QUANT METH ANTH",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "476E",
        "title": "TOPIC ANTH METHOD",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ANTH",
        "catalog_number": "476L",
        "title": "LITHIC ANALYSIS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "490B",
        "title": "Seminar in Anthropology: Biological Anthropology",
        "description": "Prerequisites: ANTH 303; Past or concurrent enrollment in ANTH 473 or 475 (after Fall 2006); One Upper Division course in appropriate subdiscipline.Faculty-directed research on primary data in the major subdisciplines of anthropology. Selected subjects in the same subdiscipline may be repeated up to 3 times. (A) Archaeology; (B) Biological Anthropology; (C) Cultural Anthropology; (D) Linguistics; (E) Applied Anthropology.  Available for Graduate Credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ANTH",
        "catalog_number": "518",
        "title": "LAB MTHDS IN ARCH",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "518L",
        "title": "LAB MTHD ARCH LAB",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "ANTH",
        "catalog_number": "521",
        "title": "California Archaeology",
        "description": "Prerequisite: ANTH 473. Study of the archaeology of California from the earliest times through the Mission Period with particular attention to the ecology of foraging and the causes of the cultural changes exhibited in the sequence. \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ANTH",
        "catalog_number": "549",
        "title": "ADV HIST ARCH",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ANTH",
        "catalog_number": "575",
        "title": "ADV ETHNG METHDS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "602",
        "title": "Problems in Cultural Anthropology",
        "description": "Prerequisite: Classified status or instructor consent. Survey of current issues and debates in cultural anthropology.  \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ANTH",
        "catalog_number": "608",
        "title": "PROB APPLIED ANTH",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ANTH",
        "catalog_number": "696B",
        "title": "PROP & GRANT WRIT",
        "description": null,
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "ANTH",
        "catalog_number": "697B",
        "title": "DIR COMP STUDIES",
        "description": null,
        "units": "2",
        "class_type": "SUP"
    },
    {
        "subject": "ANTH",
        "catalog_number": "698B",
        "title": "Thesis or Graduate Project",
        "description": "Thesis or Graduate Project\n",
        "units": "2",
        "class_type": "SUP"
    },
    {
        "subject": "ANTH",
        "catalog_number": "699A",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "1",
        "class_type": "SUP"
    }
]