[
    {
        "subject": "CAS",
        "catalog_number": "100",
        "title": "Introduction to Central American Studies",
        "description": "Comparative historical introduction to political cultural and socioeconomic aspects of the Central American experience both in Central America and in the United States. Considers the question of whether there can be a single Central American identity in light of the great variety of experiences of race gender ethnicity and social class in the Central American community. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "102",
        "title": "The Salvadoran Experience",
        "description": "Introduction to the political economic social and cultural realities of Salvadoran life in El Salvador and in the U.S.. Emphasis is on various aspects of the institutional and private life of Salvadoran communities. The course is framed by historical and contemporary comparisons with other Central American national groups with respect to their experiences of race ethnicity class gender and national identity. (Available for General Education Comparative Cultural Studies)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "113A",
        "title": "Approaches to University Writing A",
        "description": "Prerequisite: EPT score of 139 and below. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction syntax and grammar as well as the elements of prose style. Students receive credit for only one course chosen from AAS CAS CHS ENGL PAS or QS 113A. Students are required to also enroll in UNIV 060 (1 credit) or equivalent. Individual tutoring is available through the Learning Resource Center.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "113AOP",
        "title": "APPR UNIV WRTNG A",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "115",
        "title": "APPR UNIV WRITING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "151",
        "title": "Fundamentals of Public Speaking",
        "description": "Prerequisites: EPT score of 151 or better or EPT and successful completion of 113A and 114A or equivalent. This course will introduce students to the fundamentals of public speaking and verbal communication with particular emphasis on issues related to the Central American experience. This course will include intensive practice in public speaking logical reasoning and critical reasoning. Over the course of the semester students will learn how to research design prepare and deliver effective and engaging oral presentations. Students will be required to deliver four speeches that address topics and themes relevant to Central America and the Central American diaspora. Relevant themes include Central American histories societies and cultures; diverse ethnic race class gender and sexual identities; histories of colonial and imperial intervention in Central America; diaspora immigration labor national identity social exclusion and political activism (Available for General Education Oral Communication.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "201",
        "title": "Survey of Central American Literature",
        "description": "Analysis of literary traditions throughout the history of Central America from pre-Hispanic times to the present. The course will focus on 20th and 21st century literary movements with the main emphasis placed on the historical and political elements and the ideological proposals of these works. It includes a discussion of the relationship between literary creation and the construction of Central American identity (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "303",
        "title": "Central American Film",
        "description": "Preparatory: Completion of Lower Division writing requirement; either CAS 100 102 or permission of the instructor. History of the development of Central American cinema and analysis of film and video production by Central Americans. The course will focus on 20th and 21st century film and video production with the main emphasis placed on the historical and political context in which Central American cinema is produced the ideological proposals that these works make and the ways in which this production contributes to the construction of a contemporary version of Central American identity. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "309",
        "title": "Ancient to Pre-Modern History of the Central American People",
        "description": "Preparatory: Completion of Lower Division writing requirement. Survey of the history of Central Americans from pre-Hispanic times to the pre-Independence days. Major topics include: Indigenous cultures (complex and single societies); Indigenous and European (Spanish and Anglo) relations; religion family and land tenure; language and education; disease labor and population; local and global trading; Indigenous revolts and pre-independence movements. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "310",
        "title": "MODRN HIST CENT AM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "311",
        "title": "The Central American Diaspora",
        "description": "Preparatory: Completion of the Lower Division writing requirement. Comparative survey of the socioeconomic conditions and cultural life of Central American peoples in the U.S. today particularly in California. Issues of immigration employment income education gender family language national identity acculturation and political participation will be examined. Discussion of Central American diaspora communities in other parts of the world also may be included. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "355",
        "title": "Environment",
        "description": "Development and Social Exclusion in Central AmericaPreparatory: Completion of Lower Division writing requirement; either CAS 100 102 or permission of the instructor. The focus of this course will be the origins and ramifications of environmental degradation that stems from developmental policies that have historically impoverished Central American peoples. It examines the socio-cultural demographic economic political and environmental problems experienced by Central America. It also addresses the effects of mono-crop cultivation and the devastation produced by the use of pesticides. Additionally this course shows the linkages of land degradation and poverty strategies of survival and resistance and the communal response to the dynamics of global capitalism. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "356",
        "title": "AFRO-CARIB CEN AM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "364",
        "title": "Culture and Violence in Central America",
        "description": "Preparatory: Completion of Lower Division writing requirement; either CAS 100 102 or permission of the instructor. This course will provide students with a basic theoretical and practical understanding of the relationship between culture and violence in Central America and the historical and socio-economic conditions that have generated a culture of violence in the region. The course will include an analysis of the concept of violence as it takes ideological and physical forms both in public and private spaces. Major topics of discussion include the historical legacy of exclusion authoritarianism and the militarization of Central America; the colonial legacy of ethnic exclusion; the destruction and exploitation of the environment; the role that violence plays in the experience of displacement that Central American immigrant communities undergo; and the relationship between violence culture and the construction of Central American identity. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "365",
        "title": "Changing Roles of Central American Women",
        "description": "Preparatory: Completion of the Lower Division writing requirement; either CAS 100 or 102. Comparative examination of the shifting cultural political economic and sex/gender roles that have shaped the lives of Central American women including womens roles prior to and after the revolutionary movements. Also includes discussions of women activists and womens movements in various Central American communities both in the U.S. and in Central America; the search of Central American women for identity in the U.S.; and womens contributions to art music poetry literature politics and culture. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "366",
        "title": "Contemporary Indigenous Peoples of Central America",
        "description": "Preparatory: Completion of Lower Division writing requirement; either CAS 100 102 or permission of the instructor. This interdisciplinary course examines the new socio-economic political and religious conditions that contemporary Indigenous people of Central America are facing in their daily quest for self-determination. In the last two decades the study of Indigenous practices has challenged the traditional notion that portrays native peoples as passive subjects of the modern forces of assimilation. This course explores the transnational spaces occupied by Indigenous associations and the challenges that this Indigenous movement represents to the Central American nation/states the participation of women in defining the future of Indigenous communities and resistance to the imposing socio-cultural and political paradigms. Emphasis will be placed on contemporary Indigenous culture identity movements rights media gender and migratory issues. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "367",
        "title": "Contemporary Religious Movements in Central America",
        "description": "Preparatory: Completion of Lower Division writing requirement; either CAS 100 102 or permission of the instructor. Designed to provide students with a basic theoretical and practical understanding of the contemporary religious movements that shape Central American life in both Central America and the U.S. Emphasizes the transnational nature of Central American religious movements as well as the ways in which these movements are responding to the legacy of war and violence that has impacted Central American life both in the region and in diaspora communities. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "368",
        "title": "Central American Revolutionary Movements",
        "description": "Preparatory: Completion of the Lower Division writing requirement; either CAS 100 or 102. Examines the historical and socio-economic conditions that have shaped the Central American revolutionary movements. Major topics of discussion include the history of Central America leading up to these movements the role of U.S. policy in the region before and during the movements the ideological sources of the revolutionary movements and their organizing strategies the impact of the U.S. anti-intervention and solidarity movements the peace processes in the region and the influence of these movements on the post-revolutionary diaspora communities in the U.S. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "369",
        "title": "Contemporary Social Movements in Central America",
        "description": "Preparatory: Completion of Lower Division writing requirement; either CAS 100 102 or permission of the instructor. Designed to provide students with a basic theoretical and practical understanding of the contemporary social movements that shape Central American life in both Central America and the U.S. Emphasizes the transnational nature of Central American social movements as well as the ways in which these movements are responding to the legacy of war and violence that has impacted Central American life both in the region and in diaspora communities. (Available for General Education Social Sciences)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "392IP",
        "title": "PROFESSIONAL EXP INT I",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "410",
        "title": "The Central American Child",
        "description": "Preparatory: Completion of the Lower Division writing requirement. This course examines the educational experience of the Central American child within the context of immigration in the U.S.. At the same time it compares the educational experience of the Central American child with that of children from other ethnic groups. This perspective provides insight into the Central American educational experience in the U.S.. It analyzes family educational strategies Central American cultural and ethnic diversity as well as the legacy of war and violence that has impacted Central American life in the U.S. and their influence on the Central American childs learning process. In addition it will assess the educational system within a context of diversity its outcomes and cultural relevance to Central American learning styles. Moreover it will identify the national structures of culture racism economics and social policy and their impacts on the local dynamics within the Central American community as well as other ethnic groups particularly with regard to second language learning bilingualism and non-Western cultural identities.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "421",
        "title": "Central American Literature Seminar",
        "description": "Examines Central American literary traditions with emphasis on the 20th and 21st centuries. Focuses on the aesthetic proposals the historical and political context in which Central American literature is produced the Central American transnational experience and the ways in which literary production contributes to the construction of a contemporary version of Central American identity. Emphasizes application of recent trends in literary theories and critical methodologies. Variable topics. Conducted in Spanish. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "440",
        "title": "Research Seminar on Central American Culture",
        "description": "Preparatory: Upper Division standing; 6 units in Central American Studies including CAS 201. Techniques and practice of the critical analysis of culture. Develop and implement a comparative research project that explores in-depth some aspect of Central American cultures. Variable content. Possible topics include the role of literature in the construction of national identity the creation of texts through oral history cultural transformation and continuity in the Central American diaspora art and social protest medicine religion and sorcery in the Central American diaspora. May be repeated for credit with instructor consent.  \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CAS",
        "catalog_number": "460",
        "title": "Research Seminar on Central American Political Issues",
        "description": "Preparatory: Upper Division standing; 6 units in Central American Studies including CAS 201. The purpose of this seminar is to acquaint students with the techniques and practices of theoretical research. Students will develop and implement comparative research projects that explore in-depth some aspect of the Central American political experience. Variable content. Possible topics include Sandinismo in theory and practice the role of the Catholic Church and the influence of Evangelical Protestantism in Central American communities postwar democracy in Central America and political activism in Central American diaspora communities in California. \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CAS",
        "catalog_number": "492IP",
        "title": "LITERATURE AND POWER IN LA",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "113B",
        "title": "Approaches to University Writing B",
        "description": "Prerequisite: Successful completion of CAS 113A. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction syntax and grammar as well as the elements of prose style. Students receive credit for only one course chosen from AAS CAS CHS ENGL PAS or QS 113B. Students are required to also enroll in UNIV 060 (1 credit) or equivalent. Individual tutoring is available through the Learning Resource Center. (Available for General Education Analytical Reading/Expository Writing.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "113BOP",
        "title": "APPR UNIV WRTNG B",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "201EOP",
        "title": "SURV CENT AM LIT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "270",
        "title": "Fieldwork in Central American Communities",
        "description": "Preparatory CAS 100 or 102. Field study in a selected Central American community. By reflecting on their work experience students learn how the needs of the community can best be met and how the well- being of the community is impacted by its relationships to state and local governments community organizations and private institutions. Faculty supervisor assists students in obtaining appropriate work placements. Field study to be conducted under supervision and after preparatory instruction to acquaint students with field learning techniques. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "CAS",
        "catalog_number": "350",
        "title": "Urbanization in Central America",
        "description": "Preparatory: Completion of Lower Division writing requirement; either CAS 100 102 or permission of the instructor. During the second half of the 20th century the Central American societies were transformed from an agrarian to an urban-based service economy. As a result of this process and the political instability in Central America the Central American population was massively displaced toward urban areas inside and outside the region. This interdisciplinary course will provide students with an understanding of the cultural social economic demographic and political implications of the planning and development of the urban landscape in Central America and of the Central American population movement to urban spaces inside and outside the region. \n",
        "units": "3",
        "class_type": "LEC"
    }
]