[
    {
        "subject": "CD",
        "catalog_number": "133",
        "title": "SURVEY COMM DIS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "361",
        "title": "Language Development in Children",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Study of oral language development in children and the bases for speech and language problems. Provides layperson awareness of the various dimensions of speech and language development; the milestones observable within the normal developmental sequence; and the identification consequences and management of speech and language disorders. (Not open to Communication Disorders and Sciences majors) (Available for General Education Lifelong Learning.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "405",
        "title": "Phonetics",
        "description": "Study of general phonetics principles; articulatory acoustic and linguistic aspects of the sound systems of standard and non-standard dialects of American English; introduction to the application of phonetics to disordered sound systems.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "410",
        "title": "Hearing Science",
        "description": "Study of physics of sound anatomy and physiology of the earand measurement of perception of sound. Brief survey of causes of hearing impairment and habilitation procedures.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "415",
        "title": "Speech and Language Development",
        "description": "Study of speech and language development in relation to normal learning and growth processes; brief introduction to second language acqusition.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "442",
        "title": "Speech Science",
        "description": "Structure and function of neuro-muscular systems used in respiration phonation resonation and articulation; fundamentals of sound production and transmission applied to speech.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "445",
        "title": "Audiometry and Hearing Conservation",
        "description": "Prerequisite: CD 410. Study of basic battery of audiologic tests including equipment calibration procedures pure tone and speech audiometry clinical masking and the study of school and industrial identification audiometry and hearing conservation. Familiarization with basic audiologic equipment and calibrationand test procedures.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "446",
        "title": "Auditory Habilitation",
        "description": "Prerequisite: CD 410. Theory and methods of habilitation of hearing-impaired adults and children including assessment of hearing handicap habilitation management speech-reading and amplification with individual and group hearing aids.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "450",
        "title": "Fluency and Disorders of Fluency",
        "description": "Prerequisites: CD 415 442. Study of the etiology characteristics and clinic assessment of typical/atypical stuttering in adults and children. The efficacy and efficiency of therapeutic management of fluency disorders are discussed. In addition multicultural implications for assessment and treatment will be presented. Regular written assignments are required\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "451",
        "title": "Phonologic and Articulatory Disorders",
        "description": "Prerequisites: CD 405 415 442. Examination of theories of normal and disordered acquisition of phonology and articulatory production as well as basic phonologic assessment methods and treatment planning. Both functional and structural disorders are emphasized including cleft lip and palate and related craniofacial syndromes. Regular written assignments are required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "462",
        "title": "Language Disorders I",
        "description": "Prerequisite: CD 415. Ways of conceptualizing language of parts of language; introduction to data collection transcription and language analysis; introduction to the concept of differential diagnosis; introduction to diagnostic populations with associated developmental language disorders.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "465",
        "title": "Clinical Practicum in Speech Pathology I",
        "description": "Prerequisites: CD 405 (or equivalent) 410 (or equivalent) 415 (or equivalent) 442 (or equivalent) 451 (or equivalent) 462 (or equivalent)469A (or equivalent) 469O (or equivalent). Corequisites: Maintenance of clinical privileges; Consent of instructor. Supervised clinical experience in the diagnosis of and therapy for speech- and hearing-handicapped children academic study of specific speech problems. 6 hours of clinical skills lab per week. May be repeated one time.\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "CD",
        "catalog_number": "469A",
        "title": "Diagnostic Methods in Communication Disorders",
        "description": "Prerequisite: Admission to Clinical Privileges (Clinical Phase). Basic concepts of standardized and non-standardized evaluation procedures for children and adults with mild to moderate communicative disorders. Theory and application of clinical writing including the case history and the assessment report.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "469O",
        "title": "Observation in Communication Disorders",
        "description": "Prerequisite: Admission to Clinical Privileges(Clinical Phase). Corequisites: Maintenance of clinical privileges; Consent of instructor. Observation of the evaluation and management of speech language and hearing disorders. 25 hours of pre-therapy observation. Instruction in case-management fundamentals. To be taken concurrently with 469A. 3 hours of clinical skills lab per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CD",
        "catalog_number": "475",
        "title": "Clinical Practicum in Audiology I",
        "description": "Prerequisites: CD 445 446 496A 469O. Application of audiometric theory in the audiological lab giving the student experience in the clinic routine of assessing auditory function and preparing and implementing a program of rehabilitation. Six hours of lab per week.\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "CD",
        "catalog_number": "480",
        "title": "Early Speech-Language Intervention",
        "description": "Prerequisites: CD 405 415 462. Advanced study of speech and language disorders assessment procedures and intervention management of developmentally-delayed children from birth to age 5.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "485",
        "title": "Augmentative and Alternative Communication",
        "description": "Prerequisites: CD 405 (or equivalent) 410 (or equivalent) 415 (or equivalent) 442 (or equivalent). The study of unaided and aided communication systems and modalities to provide augmentative and/or alternative communication habilitation and rehabilitation to communicatively handicapped individuals.  Contemporary microcomputer hardware and software program development devices and applications in the fields of Speech-Language Pathology and Audiology are introduced. Library research using computers and specialized software and diagnostic and rehabilitative procedures are discussed along with requirements and methods of clinical documentation. Regular written assignments are required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "500",
        "title": "BACKGROUND LEV CD",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "502",
        "title": "Research in Communication Disorders",
        "description": "Prerequisite: Graduate standing. Study of applied research methods and instrumentation in the field of communication disorders including literature search techniques research design statistical tests lab instrumentation and calibration and report preparation. Regular written assignments are required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "552",
        "title": "Language Disorders II",
        "description": "Prerequisites: CDS 462 or equivalent; Graduate standing. Survey of current definitions and causes of language disorder; disorders of parts of language and trade-off effects. Identification of relevant features of disordered language for assessment and intervention. Analysis of relevant features of disordered language through advanced data collection transcription and language analysis of intonation morphosyntactic form communicative function repair phenomena and discourse-level sequences.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CD",
        "catalog_number": "558",
        "title": "Neuroanatomy and Neurophysiology of Speech",
        "description": "Language and HearingPrerequisite: Graduate standing. Concerned with the structural components and organization of the central and peripheral nervous systems and their conduction pathways and functions with specific emphasis on those structures that subserve normal speech language and hearing processes. Regular writing assignments are required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "565",
        "title": "CL PRC SP PTH IGR",
        "description": null,
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "CD",
        "catalog_number": "566",
        "title": "Clinical Practicum in Speech Pathology II",
        "description": "Prerequisites: CD 405 (or equivalent) 410 (or equivalent) 415 (or equivalent) 442 (or equivalent) 451 (or equivalent) 462 (or equivalent) 465 (or equivalent) 469A (or equivalent) 469O (or equivalent); Graduate status. Corequisites: Maintenance of clinical privileges; Consent of instructor. 6 hours of clinical skills lab per week. May be repeated one time.\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "CD",
        "catalog_number": "567",
        "title": "Clinical Practicum in Speech Pathology III",
        "description": "Prerequisites: CD 566 (or equivalent); Graduate status. Corequisites: Maintenance of clinical privileges; Consent of instructor. 6 hours of clinical skills lab per week. May be repeated one time.\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "CD",
        "catalog_number": "576",
        "title": "Clinical Practicum in Audiology II",
        "description": "Prerequisite: CD 475. Six hours of lab per week.\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "CD",
        "catalog_number": "577",
        "title": "Clinical Practicum in Audiology III",
        "description": "Prerequisite: Graduate status. Six hours of lab per week.\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "CD",
        "catalog_number": "599A",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "CD",
        "catalog_number": "651",
        "title": "Advanced Study of Articulation and Phonological Disorders in Children",
        "description": "Prerequisites: CD 451 462 469A 558 or the equivalents; Graduate standing. Advanced study of speech acquisition differential diagnosis of pediatric speech disorders and principles of intervention.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "661",
        "title": "Voice and Disorders of Voice",
        "description": "Prerequisite: Admission to the Departments graduate program. Corequisite: Consent of instructor. Study of theoretical diagnostic and treatment issues in functional/organic/neurogenic/and psychgenic voice disorders. In addition diagnostic and treatment options for laryngeal head and neck cancer are presented. Multicultural implications for assessment and treatment are discussed. Regular written assignments are required as well as proficiency with instrumentation for options within assessment and treatment.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CD",
        "catalog_number": "662",
        "title": "Seminar in Developmental Language Disorders",
        "description": "Prerequisites: CD 552; Graduate standing. Advanced study of current research relating to the differential diagnosis of populations with associated developmental language disorders including specific language impairment language/learning disabilities central auditory processing disorders pervasive developmental disorders psychiatric disorders mental retardation and other populations with associated developmental disorder.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CD",
        "catalog_number": "663",
        "title": "Adult and Pediatric Swallowing/Feeding Disorders",
        "description": "Prerequisites: CD 558; Admission to the Departments graduate program. Corequisite: Consert of instructor. This course focuses on the theoretical and clinical aspects of the disorders of swallowing or dysphagia. The physiology of normal swallow is studied as it develops across the life span. The etiologies of dysphagia in both the pediatric and adult populations are examined as well as clinical and instrumental assessment of normal swallowing and dysphagia. Finally the diagnosis and management of disorders of swallowing in the pediatric and adult populations are investigated.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CD",
        "catalog_number": "668",
        "title": "Advanced Diagnostics in Speech- Language Pathology",
        "description": "Prerequisites: CD 465 566 567 552 558 651 659 661; Maintenance of clinical privileges; Consent of isntructor. Advanced diagnosis and evaluation of children and adults with complex disorders of speech and/or language and/or cognition. Clinical experience in taking a history constructing a test battery administering norm-referenced tests performing informal assessment procedures interpreting formal and informal results making a differential diagnosis writing reports and conducting feedback sessions with clients parents and/or caregivers.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CD",
        "catalog_number": "672A",
        "title": "Advanced Clinical Practice in Speech Pathology and Audiology I",
        "description": "Prerequisites: CD 465 566 567. Supervised clinical experience in diagnostic and therapeutic procedures with speech- and hearing-handicapped children and adults in hospitals and community health service centers. Staff conferences with medical and allied health personnel in relation to speech and language pathologies. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "CD",
        "catalog_number": "672B",
        "title": "Advanced Clinical Practice in Speech Pathology and Audiology II",
        "description": "Prerequisites: CD 465 566 567. Supervised clinical experience in diagnostic and therapeutic procedures with speech- and hearing-handicapped children and adults in hospitals and community health service centers. Staff conferences with medical and allied health personnel in relation to speech and language pathologies. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CD",
        "catalog_number": "672C",
        "title": "AV CL PR SP-A IIC",
        "description": null,
        "units": "6",
        "class_type": "ACT"
    },
    {
        "subject": "CD",
        "catalog_number": "674",
        "title": "Pediatric Audiology",
        "description": "Prerequisites: CD 445 446. Advanced study of the causation assessment and management of auditory disorders in infants and children.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CD",
        "catalog_number": "697",
        "title": "DIR COMP STUDIES",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "CD",
        "catalog_number": "708",
        "title": "ANA PHYA AUD SYST",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "724",
        "title": "ADV AUDIOM EVAL",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "730",
        "title": "CLIN METH INSTR",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "742B",
        "title": "AUDITORY AMP II",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "744",
        "title": "INTER COUN AUDIOL",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "745",
        "title": "PATHOLOGIES AUD SYST",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "753A",
        "title": "ELECT PHY AUD I",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "760",
        "title": "RESEARCH AUDIO",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "764",
        "title": "IND OCC FOREN AUD",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "770",
        "title": "CLIN PRAC AUD I",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CD",
        "catalog_number": "773",
        "title": "CLIN PRAC AUD IV",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CD",
        "catalog_number": "775B",
        "title": "ADV PRAC AUD II",
        "description": null,
        "units": "6",
        "class_type": "ACT"
    },
    {
        "subject": "CD",
        "catalog_number": "776B",
        "title": "REQ PROF AUD II",
        "description": null,
        "units": "6",
        "class_type": "ACT"
    },
    {
        "subject": "CD",
        "catalog_number": "796",
        "title": "DIR GRAD RES AUD",
        "description": null,
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "CD",
        "catalog_number": "499B",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "2",
        "class_type": "SUP"
    },
    {
        "subject": "CD",
        "catalog_number": "501",
        "title": "Interviewing and Counseling in Communicative Disorders",
        "description": "Prerequisite: Graduate standing or permission of instructor. Advanced study of interviewing and counseling strategies and techniques associated with diagnostic and therapeutic practice in Speech-Language Pathology and Audiology. Professional responsibilities for ethical practices. Regular written assignments are required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "659",
        "title": "Neurogenic Disorders of Cognition and Language",
        "description": "Prerequisites: Admission to the Departments graduate program; CD 558. Corequisite: Consent of instructor. This course includes advanced study of the neurological bases for language and cognitive deficits as well as theoretical views of the organization of these components. Primary focus is given to the diagnosis and treatment of common communication problems in adults with aphasia traumatic brain injury and other acquired language and cognitive disorders. In addition these language and cognitive impairments will be contrasted with communication changes associated with normal aging.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "660",
        "title": "Structural and Neurogenic Speech Disorders",
        "description": "Prerequisites: CD 558; Admission to the Departments graduate program. Corequisite: Consent of Instructor. This course focuses on the advanced study of structural and neurogenic speech disorders including models of motor control of speech production neurological representation of speech and the effects of structural or neurological damage on speech production. Students will identify specific speech deficits characterizing dysarthria apraxia of speech craniofacial anomalies and surgical or traumatic alterations in normal speech structure and function. Physical and clinical assessment and management of these cases will be emphasized.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "720",
        "title": "PSYCH ACOU SP PER",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "742A",
        "title": "AUDITORY AMP I",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "748",
        "title": "EDUCATIONAL AUDIOL",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "752",
        "title": "IMPLANT AUD PROST",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "753B",
        "title": "ELECT PHY AUD II",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "755",
        "title": "ADV PED AUD INT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "762",
        "title": "BUSI ASPE AUDIOL",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "767",
        "title": "INT DISPL AUD",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CD",
        "catalog_number": "771",
        "title": "CLIN PRAC AUD II",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CD",
        "catalog_number": "774",
        "title": "CLIN PRAC AUD V",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CD",
        "catalog_number": "775C",
        "title": "ADV PRAC AUD III",
        "description": null,
        "units": "6",
        "class_type": "ACT"
    }
]