[
    {
        "subject": "CE",
        "catalog_number": "101",
        "title": "Introduction to Civil Engineering",
        "description": "Freshman orientation course for the Civil Engineering program the professiona nd an introduction to the University. Introduction to the tools for civil engineering studies: internet word processing and spreadsheets. Development of communication skills and the ability to work in teams. Development of learning skills in civil engineering studies. 1 hour lecture/discussion 3 hours lab per week.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "CE",
        "catalog_number": "101L",
        "title": "Introduction to Civil Engineering Lab",
        "description": "Freshman orientation course for the Civil Engineering program the professiona nd an introduction to the University. Introduction to the tools for civil engineering studies: internet word processing and spreadsheets. Development of communication skills and the ability to work in teams. Development of learning skills in civil engineering studies. 1 hour lecture/discussion 3 hours lab per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CE",
        "catalog_number": "240",
        "title": "Engineering Statics",
        "description": "Prerequisite: PHYS 220A/L. Corequisite: MATH 150B. Analysis of the distribution of forces on and within bodies in static equilibrium. Free body diagrams equilibrium equations and the method of sections. Includes a limited introduction to the subject of strength of materials. (Design units: 0.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CE",
        "catalog_number": "280",
        "title": "Computer Applications in Civil Engineering",
        "description": "Prerequisite: CE 240. Development of computer skills related to the field of civil engineering. Introduction of Windows email and internet usage. Introduction to Office suite word processing spreadsheets with VBA applications presentation and publishing software. Development of programming skills. Application of CAD to the development of structural and architectural drawings dimensioning grading plans contour lines and sections. Analysis and design of structural systems using structural engineering packages. Development of algorithms and computer codes for the solution of civil engineering problems. 1hour of lecture 3 hours of lab per week.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "CE",
        "catalog_number": "280L",
        "title": "Computer Applications in Civil Engineering Lab",
        "description": "Prerequisite: CE 240. Development of computer skills related to the field of civil engineering. Introduction of Windows email and internet usage. Introduction to Office suite word processing spreadsheets with VBA applications presentation and publishing software. Development of programming skills. Application of CAD to the development of structural and architectural drawings dimensioning grading plans contour lines and sections. Analysis and design of structural systems using structural engineering packages. Development of algorithms and computer codes for the solution of civil engineering problems. 1hour of lecture 3 hours of lab per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CE",
        "catalog_number": "308",
        "title": "Surveying",
        "description": "Corequisite: 308L. Fundamentals of plane and geodetic surveying. Concepts of linear and angular measurements precision errors and corrections. Field problems in chaining differential and profile leveling triangulation and highway curves. 2 hours lecture 3 hours lab. (Design units: 0.)\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "CE",
        "catalog_number": "308L",
        "title": "Surveying Lab",
        "description": "Corequisite: 308. Fundamentals of plane and geodetic surveying. Concepts of linear and angular measurements precision errors and corrections. Field problems in chaining differential and profile leveling triangulation and highway curves. 2 hours lecture 3 hours lab. (Design units: 0.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CE",
        "catalog_number": "315",
        "title": "CONST ENGR",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "CE",
        "catalog_number": "315L",
        "title": "CONST ENGR LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CE",
        "catalog_number": "335",
        "title": "Structures I",
        "description": "Prerequisite: CE 340. Corequisite: CE 335L. Determination of the force distribution and deflections in statically determinant and indeterminant structures using the classical non-matrix methods of structural analysis. 3 hours of lecture per week. Lab: Structural analysis problem solving session. Computer applications of structural analysis and design. 3 hours of lab per week. (Design units: 0)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CE",
        "catalog_number": "335L",
        "title": "Structures I Computational Lab",
        "description": "Prerequisite: CE 340. Corequisite: CE 335. Determination of the force distribution and deflections in statically determinant and indeterminant structures using the classical non-matrix methods of structural analysis. 3 hours of lecture per week. Lab: Structural analysis problem solving session. Computer applications of structural analysis and design. 3 hours of lab per week. (Design units: 0)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CE",
        "catalog_number": "340",
        "title": "Strength of Materials",
        "description": "Prerequisites: CE 240; MATH 280. Analysis of the stresses and deflections in members and basic structural systems. Axial torsional bending and shear stresses and deflections. Introduction to structural stability. Design of structural components. (Design units: 0.5)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CE",
        "catalog_number": "408",
        "title": "Surveying with GPS Applications",
        "description": "Prerequisite: CE 308/L. Corequisite: 408L. Surveying with Global Positioning Systems (GPS): point positioning differential positioning differencing techniques survey planning real-time kinematic (RTK) surveys vertical positioning random errors and survey specifications horizontal curves vertical curves horizontal control and vertical control. 1 hour lecture 3 hours lab per week. (Design units: 0.)\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "CE",
        "catalog_number": "408L",
        "title": "Surveying with GPS Applications Lab",
        "description": "Prerequisite: CE 308/L. Corequisite: 408. Surveying with Global Positioning Systems (GPS): point positioning differential positioning differencing techniques survey planning real-time kinematic (RTK) surveys vertical positioning random errors and survey specifications horizontal curves vertical curves horizontal control and vertical control. 1 hour lecture 3 hours lab per week. (Design units: 0.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CE",
        "catalog_number": "426",
        "title": "Soil Mechanics",
        "description": "Corequisite: 426L. Soil as a foundation for structures and as a material of construction. Lab experiments to be performed to obtain data to determine soil physical properties. 3 hours lecture 3 hours lab per week. (Design units: 1.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CE",
        "catalog_number": "426L",
        "title": "Soil Mechanics Lab",
        "description": "Corequisite: 426. Soil as a foundation for structures and as a material of construction. Lab experiments to be performed to obtain data to determine soil physical properties. 3 hours lecture 3 hours lab per week. (Design units: 1.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CE",
        "catalog_number": "438",
        "title": "Reinforced Concrete Design",
        "description": "Prerequisite: CE 335. Basic concepts in the design of reinforced concrete structures. Applications to beams columns slabs shear walls footing and composite construction. (Design units: 3)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CE",
        "catalog_number": "439",
        "title": "Structural Steel Design",
        "description": "Prerequisite: CE 335. Basic concepts in the design of steel structures. Design in steel of tension and compression members beams columns welded and bolted connections; eccentrically loaded and moment resistant joints; plate girders. Introduction to computer aided design (CAD). (Design units: 3.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CE",
        "catalog_number": "460",
        "title": "Engineering Hydrology",
        "description": "Prerequisite: ME 390. Corequisite 460L. Surface Hydrology for the design of drainage flood control water storage and distribution systems. Topics include hydrologic cycle meteorology surface and ground water movement interrelation between precipitation and runoff hydrograph analysis flood routing and risk assessment. Hydrologic model development and analysis using computers emphasized for design of storm drainage systems flood protection water storage and reservoir operations. 2 hours lecture 3 hours lab. (Design units: 1.)\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "CE",
        "catalog_number": "460L",
        "title": "Engineering Hydrology Lab",
        "description": "Prerequisite: ME 390. Corequisite 460. Surface Hydrology for the design of drainage flood control water storage and distribution systems. Topics include hydrologic cycle meteorology surface and ground water movement interrelation between precipitation and runoff hydrograph analysis flood routing and risk assessment. Hydrologic model development and analysis using computers emphasized for design of storm drainage systems flood protection water storage and reservoir operations. 2 hours lecture 3 hours lab. (Design units: 1.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CE",
        "catalog_number": "488A",
        "title": "CIVIL SR DSN I",
        "description": null,
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "CE",
        "catalog_number": "488AL",
        "title": "CIVIL SR DSN I LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CE",
        "catalog_number": "488B",
        "title": "Civil Engineering Senior Design II",
        "description": "Prerequisite: CE 488A/L. Corequisites: Second major civil design course either CE 438 439 or 526. Continuation of CE 488A. (CE 488A and CE 488B must be completed within the same academic year.) Final design stage of the project initiated in CE 488A is undertaken with emphasis on working in project teams. 6 hours of lab per week. (Offered Spring semester.) (Design units: 2.)\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "CE",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Prerequisite:s Senior or graduate standing in Civil Engineering with senior or graduate program on file; Written approvals of faculty sponsor and Department Chair. Admission based on evidence of ability to pursue Independent Study in-depth and approval of a proposal submitted prior to registration in the course. (Design units vary.)\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "CE",
        "catalog_number": "526",
        "title": "Geotechnical Foundation Design",
        "description": "Prerequisite: CE 426. Soil mechanics aspects of foundation design. Shear strength and compressibility of soil. Lateral pressures and retaining structures. Strength and deformation laws for spread footings piers piles and caissons. Analysis of mat foundations. Eccentric and inclined foundation loads. (Design units: 1.0.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CE",
        "catalog_number": "536",
        "title": "Structures II",
        "description": "Prerequisite: CE 335. Corequisite CE 536L. Study of structural analysis and design problems using matrix methods. Complete development of the flexibility and stiffness methods of analysis. Computer applications to structural analysis and design. 3 hours lecture 3 hours lab per week. (Design units: 1.5.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CE",
        "catalog_number": "536L",
        "title": "Structures II Lab",
        "description": "Prerequisite: CE 335. Corequisite CE 536. Study of structural analysis and design problems using matrix methods. Complete development of the flexibility and stiffness methods of analysis. Computer applications to structural analysis and design. 3 hours lecture 3 hours lab per week. (Design units: 1.5.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CE",
        "catalog_number": "537",
        "title": "Timber and Masonry Design",
        "description": "Prerequisite: CE 335. Study of vertical and lateral loading on structures. Elements of timber design. Timber beams tension members compression members tension and bending and compression and bending members. Design of horizontal diaphragms and shearwalls. Design of connections. Elements of masonry design. Design of masonry in bending shear and axial members. 4 hours of lecture. (Design units: 4.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CE",
        "catalog_number": "636",
        "title": "Structural Dynamics",
        "description": "Prerequisite: AM 610. Vibration of structural systems with emphasis on approximate solutions to continuous systems; assumed modes Rayleigh-Ritz Finite Element Applications and nonlinear vibrations. Numerical techniques for computer application. Response spectra for multi-degree-of-freedom systems. Advanced topics.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CE",
        "catalog_number": "638",
        "title": "Advanced Reinforced Concrete Design",
        "description": "Prerequisite: CE 438. Advanced topics in concrete design including frames and slabs.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CE",
        "catalog_number": "639",
        "title": "Advanced Structural Steel Design",
        "description": "Prerequisite: CE 439. Advanced topics in structural steel design such as frames bridges and buildings.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CE",
        "catalog_number": "640",
        "title": "ADV ANALYSIS METH",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CE",
        "catalog_number": "641",
        "title": "Earthquake Engineering",
        "description": "Prerequisites: AM 410; CE 335. Study of the earthquake problem. Topics covered include plate tectonics seismology dynamic response of structures dynamics of sites and design for earthquakes.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CE",
        "catalog_number": "642",
        "title": "FINITE ELEMENT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CE",
        "catalog_number": "642L",
        "title": "FINITE ANAL LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CE",
        "catalog_number": "648",
        "title": "Prestressed Concrete Design",
        "description": "Prerequisite: CE 638. Prestressed concrete design and analysis for gravity and lateral loading. Design of reinforced and prestressed structural elements. Safety and economy. Connection design for earthquake and wind loadings. Design projects using professional practice standards including latest codes. 3 hours of lecture. (Design units: 3.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CE",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "(Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "CE",
        "catalog_number": "698C",
        "title": "Thesis",
        "description": "Prerequisites: Advancement to candidacy for the M.S. Degree; Written approvals of faculty advisor and Department Graduate Coordinator or Department Chair.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "CE",
        "catalog_number": "699C",
        "title": "Independent Study",
        "description": "Prerequisites: Classified status in the M.S. program; Written approvals from faculty sponsor and Department Graduate Coordinator or Department Chair. Admission is based in part on evidence of the ability to pursue Independent Study or research in-depth and approval of a proposal submitted prior to the time of registration.\n",
        "units": "3",
        "class_type": "SUP"
    }
]