[
    {
        "subject": "CHEM",
        "catalog_number": "100",
        "title": "Principles Of Chemistry",
        "description": "Prerequisite: Multiple Measures Placement in GE-level Mathematics, or exemption. One semester course based on a systematic, semi-empirical approach to the submicroscopic world of chemistry. Development of modern ideas concerning atomic and molecular structure, principles of compound formation, and chemical reactivity are emphasized. Selected topics in applied chemistry and the application of chemical principles to life and environmental sciences are explored. Engineering and Science majors should consult with their advisors before enrolling in this course. 3 hours lecture per week. (Available for General Education, B1 Physical Science. Students may satisfy the B3 Science Laboratory Activity requirement by completing CHEM 100L.)",
        "units": "3",
        "prerequisites": "Prerequisite: Multiple Measures Placement in GE-level Mathematics, or exemption"
    },
    {
        "subject": "CHEM",
        "catalog_number": "100L",
        "title": "Principles Of Chemistry Laboratory",
        "description": "Prerequisite: Multiple Measures Placement in GE-level Mathematics, or exemption. Corequisite: CHEM 100. Optional laboratory course to accompany CHEM 100 in which the fundamentals of scientific inquiry and basic laboratory techniques are presented. One 3-hour lab per week. (Available for General Education, B3 Science Laboratory Activity provided CHEM 100 is also completed.)",
        "units": "1",
        "prerequisites": "Prerequisite: Multiple Measures Placement in GE-level Mathematics, or exemption"
    },
    {
        "subject": "CHEM",
        "catalog_number": "101",
        "title": "General Chemistry I",
        "description": "Prerequisite: Satisfactory score on the Chemistry Placement Test (CPT) or a grade of “C” or higher (“C-” does not satisfy the prerequisite) in CHEM 100 taken at CSUN only. Corequisites: CHEM 101D and CHEM 101L. Basic course in the fundamental principles and theories of Chemistry with special emphasis on chemical calculations. Includes a discussion of the kinetic molecular theory, atomic structures, the periodic table, solutions and oxidation-reduction. (Available for General Education, B1 Physical Science. Students may satisfy the B3 Science Laboratory Activity requirement by completing CHEM 101L). All three components of this course (CHEM 101, CHEM 101D, and CHEM 101L) must be completed before enrollment in CHEM 102/CHEM 102D/CHEM 102L. 3 hour lecture per week.",
        "units": "5",
        "prerequisites": "Prerequisite: Satisfactory score on the Chemistry Placement Test (CPT) or a grade of “C” or higher (“C-” does not satisfy the prerequisite) in CHEM 100 taken at CSUN only"
    },
    {
        "subject": "CHEM",
        "catalog_number": "101D",
        "title": "Gen Chem I Disc",
        "description": "Prerequisite: Satisfactory score on the Chemistry Placement Test (CPT) or a grade of “C” or higher (“C-” does not satisfy the prerequisite) in CHEM 100 taken at CSUN only. Corequisites: CHEM 101 and CHEM 101L. Critical analysis of topics introduced in CHEM 101. Structured group work is used to develop essential analysis and problem-solving skills. 1 hour discussion per week.",
        "units": "1",
        "prerequisites": "Prerequisite: Satisfactory score on the Chemistry Placement Test (CPT) or a grade of “C” or higher (“C-” does not satisfy the prerequisite) in CHEM 100 taken at CSUN only"
    },
    {
        "subject": "CHEM",
        "catalog_number": "101L",
        "title": "General Chemistry I Lab",
        "description": "Prerequisite: Satisfactory score on the Chemistry Placement Test (CPT) or a grade of “C” or higher (“C-” does not satisfy the prerequisite) in CHEM 100 taken at CSUN only. Corequisites: CHEM 101 and CHEM 101D. Lab section emphasizes basic lab skills, quantitative relationships in chemistry and inorganic preparative procedures. 3 hour lab per week. (Available for General Education, B3 Science Laboratory Activity requirement provided CHEM 101 is also completed.)",
        "units": "0",
        "prerequisites": "Prerequisite: Satisfactory score on the Chemistry Placement Test (CPT) or a grade of “C” or higher (“C-” does not satisfy the prerequisite) in CHEM 100 taken at CSUN only"
    },
    {
        "subject": "CHEM",
        "catalog_number": "102",
        "title": "General Chemistry Ii",
        "description": "Prerequisites: CHEM 101, CHEM 101D, and CHEM 101L with a minimum grade of “C-” in CHEM 101. Corequisites: CHEM 102D and CHEM 102L. Continuation of CHEM 101. Introduction to kinetics, gas phase and solution equilibria, electrochemistry, chemical thermodynamics and radio/nuclear chemistry. (Available for General Education, B1 Physical Science. Students may satisfy the B3 Science Laboratory Activity requirement by completing CHEM 102L). All three components of this course (CHEM 102, CHEM 102D, and CHEM 102L) must be completed before enrollment in CHEM 333/CHEM 333D/CHEM 333L and/or CHEM 321/L. 3 hour lecture per week.",
        "units": "3",
        "prerequisites": "Prerequisites: CHEM 101, CHEM 101D, and CHEM 101L with a minimum grade of “C-” in CHEM 101"
    },
    {
        "subject": "CHEM",
        "catalog_number": "102D",
        "title": "Gen Chem Ii Disc",
        "description": "Prerequisites: CHEM 101 and CHEM 101L with a grade of “C-” or better in CHEM 101. Corequisites: CHEM 102 and CHEM 102L. Structured group work, individual problems, and worked examples are used to develop essential problem-solving skills necessary in CHEM 102. 1 hour discussion per week.",
        "units": "1",
        "prerequisites": "Prerequisites: CHEM 101 and CHEM 101L with a grade of “C-” or better in CHEM 101"
    },
    {
        "subject": "CHEM",
        "catalog_number": "102L",
        "title": "General Chemistry Ii Lab",
        "description": "Prerequisites: CHEM 101, CHEM 101D, and CHEM 101L with a minimum grade of “C-” in CHEM 101. Corequisites: CHEM 102 and CHEM 102D. Lab section consists of experiments dealing with kinetics, acid-base and solubility equilibria, selected reactions of metals and nonmetals, and qualitative elemental analysis. 3 hour lab per week. (Available for General Education, B3 Science Laboratory Activity requirement provided CHEM 102 is also completed.)",
        "units": "1",
        "prerequisites": "Prerequisites: CHEM 101, CHEM 101D, and CHEM 101L with a minimum grade of “C-” in CHEM 101"
    },
    {
        "subject": "CHEM",
        "catalog_number": "103",
        "title": "Introductory Chemistry I",
        "description": "Prerequisite: Multiple Measures Placement in GE-level Mathematics, or exemption. Not open to engineering, biology or physical science majors. Designed to stress fundamental principles of inorganic chemistry, the structure of atoms and molecules, the periodic table, states of matter, chemical calculations involving stoichiometry and simple algebraic operations. 3 hours lecture per week. (Available for General Education, B1 Physical Science. Students may satisfy the B3 Science Laboratory Activity requirement by completing CHEM 103L).",
        "units": "4",
        "prerequisites": "Prerequisite: Multiple Measures Placement in GE-level Mathematics, or exemption"
    },
    {
        "subject": "CHEM",
        "catalog_number": "103L",
        "title": "Introductory Chemistry I Lab",
        "description": "Prerequisite: Multiple Measures Placement in GE-level Mathematics, or exemption. Corequisite: CHEM 103. Not open to engineering, biology or physical science majors. Designed to stress fundamental principles of inorganic chemistry, the structure of atoms and molecules, the periodic table, states of matter, chemical calculations involving stoichiometry and simple algebraic operations. One 3-hour lab per week. (Available for General Education, B3 Science Laboratory Activity requirement provided CHEM 103 is also completed.)",
        "units": "1",
        "prerequisites": "Prerequisite: Multiple Measures Placement in GE-level Mathematics, or exemption"
    },
    {
        "subject": "CHEM",
        "catalog_number": "104",
        "title": "Introductory Chemistry Ii",
        "description": "Prerequisites: CHEM 103 and CHEM 103L. Not open to engineering, biology or physical science majors. Continuation of CHEM 103/L. Properties of solutions, chemical equilibrium, acids and bases. Chemistry of simple organic compounds and common elements. 3 hours lecture per week. (Available for General Education, B1 Physical Science. Students may satisfy the B3 Science Laboratory Activity requirement by completing CHEM 104L.)",
        "units": "4",
        "prerequisites": "Prerequisites: CHEM 103 and CHEM 103L"
    },
    {
        "subject": "CHEM",
        "catalog_number": "104L",
        "title": "Introductory Chemistry Ii Lab",
        "description": "Prerequisites: CHEM 103 and CHEM 103L. Corequisite: CHEM 104. Not open to engineering, biology or physical science majors. Continuation of CHEM 103/L. Properties of solutions, chemical equilibrium, acids and bases. Chemistry of simple organic compounds and common elements. One 3-hour lab per week. (Available for General Education, B3 Science Laboratory Activity requirement provided CHEM 104 is also completed.)",
        "units": "1",
        "prerequisites": "Prerequisites: CHEM 103 and CHEM 103L"
    },
    {
        "subject": "CHEM",
        "catalog_number": "235",
        "title": "Introductory Organic Chemistry",
        "description": "Prerequisites: CHEM 102 and CHEM 102L, or CHEM 104 and CHEM 104L. Corequisite: CHEM 235L. A course describing simple aliphatic and aromatic compounds with an emphasis on the chemistry of functional groups. 3 hours of lecture and one 3-hour lab per week. No credit for Science and Engineering majors, except for certain options in Biology and Geology; consult your major department. This course does not substitute for CHEM 333.",
        "units": "4",
        "prerequisites": "Prerequisites: CHEM 102 and CHEM 102L, or CHEM 104 and CHEM 104L"
    },
    {
        "subject": "CHEM",
        "catalog_number": "235L",
        "title": "Introductory Organic Chemistry And Lab",
        "description": "Prerequisites: CHEM 102 and CHEM 102L, or CHEM 104 and CHEM 104L. Corequisite: CHEM 235L. A course describing simple aliphatic and aromatic compounds with an emphasis on the chemistry of functional groups. 3 hours of lecture and one 3-hour lab per week. No credit for Science and Engineering majors, except for certain options in Biology and Geology; consult your major department. This course does not substitute for CHEM 333.",
        "units": "1",
        "prerequisites": "Prerequisites: CHEM 102 and CHEM 102L, or CHEM 104 and CHEM 104L"
    },
    {
        "subject": "CHEM",
        "catalog_number": "321",
        "title": "Chemical Analysis I",
        "description": "Prerequisites: CHEM 102 and CHEM 102L. Corequisite: CHEM 321L. Emphasizes the principles of analytical reactions and the theory and applications of instruments to problems of chemical analysis. Principal topics include volumetric methods and instrumental techniques such as spectrophotometry, electro chemistry and chromatography. Lab: Introduction to the experimental methods of analytical chemistry based on the theory covered in CHEM 321. Emphasis on the development of careful and accurate lab technique. 2 hours lecture per week; two 3-hour lab periods per week.",
        "units": "2",
        "prerequisites": "Prerequisites: CHEM 102 and CHEM 102L"
    },
    {
        "subject": "CHEM",
        "catalog_number": "321L",
        "title": "Chemical Analysis I Lab",
        "description": "Prerequisites: CHEM 102 and CHEM 102L. Corequisite: CHEM 321L. Emphasizes the principles of analytical reactions and the theory and applications of instruments to problems of chemical analysis. Principal topics include volumetric methods and instrumental techniques such as spectrophotometry, electro chemistry and chromatography. Lab: Introduction to the experimental methods of analytical chemistry based on the theory covered in CHEM 321. Emphasis on the development of careful and accurate lab technique. 2 hours lecture per week; two 3-hour lab periods per week.",
        "units": "2",
        "prerequisites": "Prerequisites: CHEM 102 and CHEM 102L"
    },
    {
        "subject": "CHEM",
        "catalog_number": "333",
        "title": "Organic Chemistry I",
        "description": "Prerequisite: CHEM 102 with a grade of “C-” or better. Corequisites: CHEM 333/L. Critical analysis of topics introduced in CHEM 333. Structured group work is used to develop essential analysis and problem-solving skills. 1 hour discussion per week.",
        "units": "3",
        "prerequisites": "Prerequisite: CHEM 102 with a grade of “C-” or better"
    },
    {
        "subject": "CHEM",
        "catalog_number": "333D",
        "title": "Organic Chem I Disc",
        "description": "Prerequisite: CHEM 102 with a grade of “C-” or better. Corequisites: CHEM 333/L. Critical analysis of topics introduced in CHEM 333. Structured group work is used to develop essential analysis and problem-solving skills. 1 hour discussion per week.",
        "units": "1",
        "prerequisites": "Prerequisite: CHEM 102 with a grade of “C-” or better"
    },
    {
        "subject": "CHEM",
        "catalog_number": "333L",
        "title": "Organic Chemistry I Lab",
        "description": "Prerequisites: CHEM 102, CHEM 102D, and CHEM 102L with a minimum grade of “C-” in CHEM 102. Corequisites: CHEM 333D and CHEM 333L. The study of the structure and properties of organic molecules, with special emphasis on functional groups and their reactions. Attention given to the mechanisms of organic reactions and the spectroscopic techniques used to determine the structure of organic molecules. Lab: An introduction to the techniques of synthesis, purification, and characterization of organic compounds. 3 hour lecture and 3 hour lab per week.",
        "units": "1",
        "prerequisites": "Prerequisites: CHEM 102, CHEM 102D, and CHEM 102L with a minimum grade of “C-” in CHEM 102"
    },
    {
        "subject": "CHEM",
        "catalog_number": "334",
        "title": "Organic Chemistry Ii",
        "description": "Prerequisites: CHEM 333/L with a minimum grade of “C-” in CHEM 333. Corequisite: CHEM 334L (all majors), CHEM 334R for Chemistry and Biochemistry majors. Recommended Corequisite: CHEM 334R for all other majors. Continuation of CHEM 333, with an emphasis on mechanisms of organic reactions and synthesis. Attention given to representative compounds of interest in biology and medicine. Lab: Exposure to reactions common in chemical synthesis, including arene substitution, transformations of carbonyl compounds, the Diels-Alder reaction and polymer synthesis. 3 hours lecture per week; one 3-hour lab per week.",
        "units": "3",
        "prerequisites": "Prerequisites: CHEM 333/L with a minimum grade of “C-” in CHEM 333"
    },
    {
        "subject": "CHEM",
        "catalog_number": "334L",
        "title": "Organic Chemistry Ii Lab",
        "description": "Prerequisites: CHEM 333/L with a minimum grade of “C-” in CHEM 333. Corequisite: CHEM 334L (all majors), CHEM 334R for Chemistry and Biochemistry majors. Recommended Corequisite: CHEM 334R for all other majors. Continuation of CHEM 333, with an emphasis on mechanisms of organic reactions and synthesis. Attention given to representative compounds of interest in biology and medicine. Lab: Exposure to reactions common in chemical synthesis, including arene substitution, transformations of carbonyl compounds, the Diels-Alder reaction and polymer synthesis. 3 hours lecture per week; one 3-hour lab per week.",
        "units": "1",
        "prerequisites": "Prerequisites: CHEM 333/L with a minimum grade of “C-” in CHEM 333"
    },
    {
        "subject": "CHEM",
        "catalog_number": "334R",
        "title": "Problem Solving In Organic Chemistry Ii",
        "description": "Prerequisites: CHEM 333/L. Corequisite: CHEM 334. Critical analysis of topics introduced in CHEM 334. Structured group work is used to develop essential analysis and problem-solving skills. 1 hour per week.",
        "units": "1",
        "prerequisites": "Prerequisites: CHEM 333/L"
    },
    {
        "subject": "CHEM",
        "catalog_number": "351",
        "title": "Physical Chemistry I",
        "description": "Prerequisites: CHEM 102 and CHEM 102L; PHYS 220A or PHYS 225; MATH 150B or MATH 255B. Corequisite for Chemistry B.A. and B.S. majors: CHEM 351L. Recommended Corequisite or Preparatory: CHEM 351L and MATH 250. Basic laws of thermodynamics, states and changes of state, solutions, equilibria, phase rule, kinetic molecular theory, chemical kinetics and electrochemistry. 4 hours lecture per week. (Offered Fall semester.)",
        "units": "4",
        "prerequisites": "Prerequisites: CHEM 102 and CHEM 102L; PHYS 220A or PHYS 225; MATH 150B or MATH 255B"
    },
    {
        "subject": "CHEM",
        "catalog_number": "351L",
        "title": "Physical Chemistry I Lab",
        "description": "Corequisite: CHEM 351. Laboratory course for CHEM 351. Introduction to the experimental methods of physical chemistry based on the concepts covered in CHEM 351. One 3-hour lab per week. (Offered Fall semester.)",
        "units": "1",
        "prerequisites": "Corequisite: CHEM 351"
    },
    {
        "subject": "CHEM",
        "catalog_number": "352",
        "title": "Physical Chemistry Ii",
        "description": "Prerequisites: CHEM 321/L, CHEM 351; PHYS 220B or PHYS 226. Corequisite for Chemistry B.S. majors: CHEM 352L. Recommended Corequisite for Biochemistry B.S.: CHEM 352L; Recommended preparatory: MATH 250 and MATH 280. Continuation of CHEM 351. Quantum mechanics, atomic and molecular structure, spectroscopy, and new developments and trends in physical chemistry. (Offered Spring semester)",
        "units": "3",
        "prerequisites": "Prerequisites: CHEM 321/L, CHEM 351; PHYS 220B or PHYS 226"
    },
    {
        "subject": "CHEM",
        "catalog_number": "352L",
        "title": "Physical Chemistry Ii Lab",
        "description": "Corequisite: CHEM 352. Laboratory course for CHEM 352. Selected experiments illustrating some of the important concepts covered in CHEM 352. One 3-hour lab per week. (Offered Spring semester.)",
        "units": "2",
        "prerequisites": "Corequisite: CHEM 352"
    },
    {
        "subject": "CHEM",
        "catalog_number": "365",
        "title": "Intro Biochem",
        "description": "Prerequisites: CHEM 235/L. A course designed for non-science majors, describing chemistry and metabolism of proteins, carbohydrates, lipids, vitamins, hormones, etc. 3 hours of lecture per week. No credit for Science or Engineering majors, except for certain options in Biology; consult your major department.",
        "units": "3",
        "prerequisites": "Prerequisites: CHEM 235/L"
    },
    {
        "subject": "CHEM",
        "catalog_number": "365L",
        "title": "Intro Biochem Lab",
        "description": "Prerequisites: CHEM 235/L. Corequisite: CHEM 365. A course designed for non-science majors, describing chemistry and metabolism of proteins, carbohydrates, lipids, vitamins, hormones, etc. One 3-hour laboratory per week. No credit for Science or Engineering majors except for certain options in Biology; consult your major department.",
        "units": "0",
        "prerequisites": "Prerequisites: CHEM 235/L"
    },
    {
        "subject": "CHEM",
        "catalog_number": "401",
        "title": "Inorganic Chemistry",
        "description": "Prerequisite: CHEM 351. Principles of chemical bonding and molecular structure; survey of the chemistry of the elements of the periodic system. Available for graduate credit. 3 hours lecture per week.",
        "units": "3",
        "prerequisites": "Prerequisite: CHEM 351"
    },
    {
        "subject": "CHEM",
        "catalog_number": "401L",
        "title": "Inorganic Chemistry Lab",
        "description": "Corequisite: CHEM 401. Synthesis and characterization of inorganic and organometallic compounds. Synthetic techniques important to inorganic chemistry, such as electrochemical synthesis, autoclave reactions and inert atmosphere techniques, as well as inorganic spectroscopic techniques. Available for graduate credit. One 3-hour lab per week.",
        "units": "1",
        "prerequisites": "Corequisite: CHEM 401"
    },
    {
        "subject": "CHEM",
        "catalog_number": "411",
        "title": "Synthesis",
        "description": "Prerequisite: CHEM 334. Preparation of inorganic and organic compounds and their identification, using advanced methods. Available for graduate credit. 1 hour lecture; two 3-hour lab periods per week.",
        "units": "3",
        "prerequisites": "Prerequisite: CHEM 334"
    },
    {
        "subject": "CHEM",
        "catalog_number": "422",
        "title": "Chemical Analysis Ii",
        "description": "Prerequisite: CHEM 321. Corequisite: CHEM 422L. Continuation of CHEM 321, with special emphasis on polarography and voltammetry, chromatography, spectrophotometric methods, mass spectrometry and radiochemical methods. Available for graduate credit. 2 hours lecture per week; two 3-hour lab periods per week.",
        "units": "4",
        "prerequisites": "Prerequisite: CHEM 321"
    },
    {
        "subject": "CHEM",
        "catalog_number": "422L",
        "title": "Chemical Analysis Ii Lab",
        "description": "Prerequisite: CHEM 321. Corequisite: CHEM 422L. Continuation of CHEM 321, with special emphasis on polarography and voltammetry, chromatography, spectrophotometric methods, mass spectrometry and radiochemical methods. Available for graduate credit. 2 hours lecture per week; two 3-hour lab periods per week.",
        "units": "2",
        "prerequisites": "Prerequisite: CHEM 321"
    },
    {
        "subject": "CHEM",
        "catalog_number": "433",
        "title": "Organic Analysis",
        "description": "Prerequisite: CHEM 334. Identification of organic compounds using advanced spectrometric techniques that include modern NMR methods. Available for graduate credit. 1 hour lecture; two 3-hour lab periods per week.",
        "units": "3",
        "prerequisites": "Prerequisite: CHEM 334"
    },
    {
        "subject": "CHEM",
        "catalog_number": "461",
        "title": "Biochem I",
        "description": "Prerequisites: CHEM 321/L, CHEM 334. Corequisites: CHEM 461L. The first part of a two-semester biochemistry lecture series designed for biochemistry majors that includes study of protein structure and function, enzyme mechanisms, biological membranes, carbohydrate metabolism, ATP generation and lipid metabolism. Lab includes experiments involving acid/base chemistry, peptide analysis, spectrophotometric analysis, protein isolation and characterization, and enzyme kinetics. Available for graduate credit. 3 hours lecture per week; one 3-hour lab per week.",
        "units": "3",
        "prerequisites": "Prerequisites: CHEM 321/L, CHEM 334"
    },
    {
        "subject": "CHEM",
        "catalog_number": "461L",
        "title": "Biochem I Lab",
        "description": "Prerequisites: CHEM 321/L, CHEM 334. Corequisites: CHEM 461L. The first part of a two-semester biochemistry lecture series designed for biochemistry majors that includes study of protein structure and function, enzyme mechanisms, biological membranes, carbohydrate metabolism, ATP generation and lipid metabolism. Lab includes experiments involving acid/base chemistry, peptide analysis, spectrophotometric analysis, protein isolation and characterization, and enzyme kinetics. Available for graduate credit. 3 hours lecture per week; one 3-hour lab per week.",
        "units": "1",
        "prerequisites": "Prerequisites: CHEM 321/L, CHEM 334"
    },
    {
        "subject": "CHEM",
        "catalog_number": "462",
        "title": "Biochemistry Ii",
        "description": "Prerequisite: CHEM 461 or instructor consent. Corequisites: CHEM 462L. Continuation of CHEM 461, the second part of a two-semester biochemistry lecture series designed for biochemistry majors, including discussion of photosynthesis, amino acid metabolism, lipoproteins, metabolic interrelationships and regulation, information transfer and signal transduction. Lab includes experiments involving gel filtration, ATP biosynthesis, isolation and characterization of phospholipids, reactions of lipolytic enzymes, mitochondrial dehydrogenases, isolation of DNA, study of restriction enzymes and polymerase chain reaction. Available for graduate credit. 3 hours lecture per week; one 3-hour lab per week.",
        "units": "3",
        "prerequisites": "Prerequisite: CHEM 461 or instructor consent"
    },
    {
        "subject": "CHEM",
        "catalog_number": "462L",
        "title": "Biochemistry Ii Lab",
        "description": "Prerequisite: CHEM 461 or instructor consent. Corequisites: CHEM 462L. Continuation of CHEM 461, the second part of a two-semester biochemistry lecture series designed for biochemistry majors, including discussion of photosynthesis, amino acid metabolism, lipoproteins, metabolic interrelationships and regulation, information transfer and signal transduction. Lab includes experiments involving gel filtration, ATP biosynthesis, isolation and characterization of phospholipids, reactions of lipolytic enzymes, mitochondrial dehydrogenases, isolation of DNA, study of restriction enzymes and polymerase chain reaction. Available for graduate credit. 3 hours lecture per week; one 3-hour lab per week.",
        "units": "1",
        "prerequisites": "Prerequisite: CHEM 461 or instructor consent"
    },
    {
        "subject": "CHEM",
        "catalog_number": "464",
        "title": "Principles Of Biochemistry",
        "description": "Prerequisite: CHEM 334. Corequisite (for Chemistry majors and minors): CHEM 464L. Properties and metabolism of the constituents of biological systems. Mechanism of enzyme action, energy relations in biological systems. 3 hours lecture per week. Available for graduate credit.",
        "units": "4",
        "prerequisites": "Prerequisite: CHEM 334"
    },
    {
        "subject": "CHEM",
        "catalog_number": "464L",
        "title": "Principles Of Biochemistry Laboratory",
        "description": "Prerequisite: CHEM 334. Corequisite: CHEM 464. Recommended Preparatory: CHEM 321/L. Experiments involving acid/base chemistry, peptide structure, spectrophotometric analysis, biomolecule purification and enzymology designed to develop the ability to collect, analyze and report experimental biochemical information. One 3-hour lab per week. Available for graduate credit.",
        "units": "0",
        "prerequisites": "Prerequisite: CHEM 334"
    },
    {
        "subject": "CHEM",
        "catalog_number": "465",
        "title": "Topics In Biochemistry",
        "description": "Prerequisite: CHEM 462 or instructor consent. Seminar in major recent developments in biochemistry. Available for graduate credit. 3 hours lecture per week.",
        "units": "3",
        "prerequisites": "Prerequisite: CHEM 462 or instructor consent"
    },
    {
        "subject": "CHEM",
        "catalog_number": "495A",
        "title": "Directed Undergraduate Research",
        "description": "Prerequisite: One course beyond CHEM 102 in the area related to the research. Interested students should make arrangements with the department as soon as possible, preferably during the previous semester. For students of advanced rank and proven competence in chemistry. Program of original independent research, culminating in a written report, carried out under the direction of one of the Chemistry faculty. Upon prior approval by the department of a detailed research proposal, the research may be performed in industrial or medical labs. In such a case, the research report must be submitted to and evaluated by a designated member of the Chemistry faculty. May be repeated for credit. No credit toward M.S. degree.",
        "units": "1",
        "prerequisites": "Prerequisite: One course beyond CHEM 102 in the area related to the research"
    },
    {
        "subject": "CHEM",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "See Independent Study under courses of study.",
        "units": "1",
        "prerequisites": "See Independent Study under courses of study"
    },
    {
        "subject": "CHEM",
        "catalog_number": "500",
        "title": "Chemistry Teaching Assistant Workshop",
        "description": "Prerequisite: Required core course for all Chemistry and Biochemistry graduate students, to be taken in first or second semester in the program. A workshop to help prepare all Chemistry graduate students with appropriate skills for future pedagogical opportunities while simultaneously improving their public speaking and scientific communication. Participants learn by presenting short videotaped lessons or presentations to the class and by receiving feedback on the basic skills demonstrated in the lesson or presentation. Participants are presented with a basic model for clear chemistry lab teaching and are taught effective feedback techniques. 2 hours per week. (Credit/No Credit only)",
        "units": "1",
        "prerequisites": "Prerequisite: Required core course for all Chemistry and Biochemistry graduate students, to be taken in first or second semester in the program"
    },
    {
        "subject": "CHEM",
        "catalog_number": "522",
        "title": "Advanced Analytical Chemistry",
        "description": "Prerequisites: CHEM 422/L or approval of the instructor. An advanced-level discussion of topics in analytical chemistry with particular emphasis on separation sciences and optical spectroscopy. Topics that will be discussed in detail are fluorescence, phosphorescence, phase and distribution equilibria, extraction techniques, electrophoresis and micro-fluid separation. 3 hours lecture per week.",
        "units": "3",
        "prerequisites": "Prerequisites: CHEM 422/L or approval of the instructor"
    },
    {
        "subject": "CHEM",
        "catalog_number": "552",
        "title": "Quantum Chemistry",
        "description": "Prerequisite: CHEM 352. Elements of wave mechanics and the application to chemical problems. 3 hours lecture per week.",
        "units": "3",
        "prerequisites": "Prerequisite: CHEM 352"
    },
    {
        "subject": "CHEM",
        "catalog_number": "554",
        "title": "Macromolecules",
        "description": "Prerequisite: CHEM 352. Physical chemistry of high molecular weight compounds, ultracentrifuge, electro-phoresis, light scattering. 3 hours lecture per week.",
        "units": "3",
        "prerequisites": "Prerequisite: CHEM 352"
    },
    {
        "subject": "CHEM",
        "catalog_number": "566",
        "title": "Dna-protein Interactions",
        "description": "Prerequisites: CHEM 464, or CHEM 461 and CHEM 462. An advanced biochemistry course with an in-depth study of the biochemistry of DNA-protein interactions. The course focuses on subfields of biochemistry that involve direct physical interaction between DNA and proteins, including DNA repair, mutagenesis, replication, transcription, translation, RNA interference, DNA packaging and chromosomal maintenance. 3 hours of lecture per week.",
        "units": "3",
        "prerequisites": "Prerequisites: CHEM 464, or CHEM 461 and CHEM 462"
    },
    {
        "subject": "CHEM",
        "catalog_number": "595D",
        "title": "Experimental Topics Courses: Bioinorganic",
        "description": "Prerequisites: Advisor and instructor consent. Specialized topics from a concentrated field of current interest presented at an advanced level. Since the topic chosen is different each semester students may repeat this course with approval. \n",
        "units": "3",
        "prerequisites": "Prerequisites: Advisor and instructor consent"
    },
    {
        "subject": "CHEM",
        "catalog_number": "595R",
        "title": "Bioanal Mass Spec",
        "description": null,
        "units": "3"
    },
    {
        "subject": "CHEM",
        "catalog_number": "599A",
        "title": "Independent Study",
        "description": "Independent Study",
        "units": "1",
        "prerequisites": "N/A"
    },
    {
        "subject": "CHEM",
        "catalog_number": "691",
        "title": "Literature Seminar",
        "description": "Prerequisites: Graduate standing; Instructor consent. Oral reports by graduate students on important topics from the current literature in chemistry.",
        "units": "1",
        "prerequisites": "Prerequisites: Graduate standing; Instructor consent"
    },
    {
        "subject": "CHEM",
        "catalog_number": "692",
        "title": "Thesis Seminar",
        "description": "Prerequisites: Graduate standing; Instructor consent. Oral reports by graduate students on the results of their thesis research. Before presenting the report, students must submit a rough draft of their M.S. thesis to their graduate thesis committee and to the Department of Chemistry and Biochemistry as a whole.",
        "units": "1",
        "prerequisites": "Prerequisites: Graduate standing; Instructor consent"
    },
    {
        "subject": "CHEM",
        "catalog_number": "696A",
        "title": "Directed Graduate Research",
        "description": "Prerequisites: Classified status; Consent of a faculty member who will serve as thesis advisor. Program of research conducted under the direction of the thesis advisor in an area of interest to the student. May be repeated, but no more than 7 units are allowed toward the M.S. degree.",
        "units": "1",
        "prerequisites": "Prerequisites: Classified status; Consent of a faculty member who will serve as thesis advisor"
    },
    {
        "subject": "CHEM",
        "catalog_number": "698A",
        "title": "Thesis",
        "description": "Prerequisites: Classified standing; Advisor’s consent. For the M.S. degree: Thesis includes the preparation and writing of the master thesis. May be repeated once, but not more than 3 units are allowed towards the M.S. degree.",
        "units": "1",
        "prerequisites": "Prerequisites: Classified standing; Advisor’s consent"
    },
    {
        "subject": "CHEM",
        "catalog_number": "698B",
        "title": "Thesis",
        "description": "Prerequisites: Classified standing; Advisors consent. For the M.S. Degree: Thesis includes the preparation and writing of the master thesis. May be repeated once but not more than 3 units are allowed towards the M.S. degree.\n",
        "units": "2",
        "prerequisites": "Prerequisites: Classified standing; Advisors consent"
    }
]