[
    {
        "subject": "CJS",
        "catalog_number": "102",
        "title": "Introduction to Criminology and Justice Studies",
        "description": "Introduction to Criminology and Justice Studies provides an overview of the fields of criminology and criminal justice, the relationship between the two fields, and how both influence each other. Both traditional and contemporary approaches to justice will be explored, including alternatives and system reform. Furthermore, students will critically examine the purpose, components, and processes of the criminal justice system and the impact of crime on individuals, communities, and societies. Students will be introduced to various approaches for measuring and studying crime and basic theoretical paradigms related to criminal behavior. Additionally, this course incorporates a focus on the experiences of individuals impacted by the criminal justice system based on identities such as race, indigeneity, ethnicity, gender/gender identity, sexuality/sexual orientation, class, and their intersections.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "280",
        "title": "Statistics in Criminology and Justice Studies",
        "description": "Prerequisite: Criminology and Justice Studies major. This course is designed to introduce students to descriptive and inferential statistics used in criminology and justice studies. Specifically, students will learn the essentials of probability, estimation, and confidence intervals using data, examples, and situations relevant to the fields of criminology and criminal justice. Students will also learn methods for displaying, describing, and presenting data, including becoming proficient with basic data analysis techniques using commonly used statistical software in criminology and criminal justice.",
        "units": "3",
        "prerequisites": "{Criminology and Justice Studies major}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "302",
        "title": "Crime, Criminal Justice and Society",
        "description": "This course provides an introduction to key perspectives, principles, institutions, actors, and issues in the field of criminology and criminal justice. This course takes a critical perspective on current issues and controversies surrounding the attempts to understand the causes of crime as well as the criminal justice response to it. The impact of crime and criminal justice policy on society is also a focus in this course. Special emphasis is given to the application of key material to current policies, controversies, and practical problems in crime and criminal justice.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "310",
        "title": "Juvenile Justice",
        "description": "Prerequisite: SOC 250 or CJS 102 or CJS 302 or permission of instructor. This course provides an analysis of the historical and philosophical foundations of the juvenile justice process and system. Special attention is given to legal and administrative issues, reforms, and controversies. Additionally, the course will include the study of the emergence of youth subcultures over the course of the twentieth century and its relationship to issues of juvenile delinquency and juvenile justice. Special attention will be given to the impact of the social and cultural context of youth, including the family, neighborhood, media, drugs, gangs, guns, race, class and gender roles within the juvenile justice context.",
        "units": "3",
        "prerequisites": "{{SOC 250} || {CJS 102} || {CJS 302} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "320",
        "title": "Introduction to Criminal Law and Legal Analysis",
        "description": "Prerequisite: SOC 250 or CJS 102 or CJS 302 or permission of instructor. This course creates a foundation in criminal law and legal procedure as applied to the criminal justice field. Rationales for punishing criminals, elements of crimes and defense of the accused are covered. In addition, this course examines tensions between various state statutes, the common law and the Model Penal Code. This course also emphasizes the ability to apply criminal law doctrine in order to make strong legal arguments as well as to engage in analysis of policy which embraces or criticizes current laws.",
        "units": "3",
        "prerequisites": "{{SOC 250} || {CJS 102} || {CJS 302} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "326",
        "title": "Victimology",
        "description": "Preparatory: CJS 102 or CJS 302. This course introduces the field of victimology including the extent, types, theories, and effects of crime victimization and trauma at multiple levels of the social ecology. This course explores the influence of identities such as race, ethnicity, indigeneity, class, religious affiliation, disability, sexuality/sexual orientation, immigration status, gender/gender identity, and their intersections on crime victimization and access to justice. The meaning of victimization will be critically explored including who is considered a victim and the language used to describe victim’s experiences in various contexts. The interactions between victims and social systems will also be examined, with consideration of how various systems disproportionately reproduce harm to victims and communities. Students will learn about effective approaches for working with crime victims. Organizations and policies intended to support victims of crime will also be explored and critiqued.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "328",
        "title": "Diversity and Crime",
        "description": "Preparatory: CJS 102 or CJS 302. This course explores human diversity, including but not limited to race, indigeneity, class, gender/gender identity, dis/ability, mental illness, sexuality/sexual orientation, immigration status, and their intersections in connection to crime perpetration, victimization, and the criminal justice system. Students enrolled in this course will explore disproportionate contacts with the criminal justice system and inequalities in justice processes based on identity. The historical development and practical impacts of such inequalities and inequities will be explored, including how these issues can be addressed through programming, policy, criminal justice practice, and system reform.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "334",
        "title": "Law Enforcement and Security",
        "description": "This course provides a foundation for the understanding of U.S. law enforcement and security including its historical origins as a colonial institution of social control. Students will explore police culture, the organization and operations of law enforcement, contemporary issues in law enforcement, and major and emerging theoretical traditions in the field of law enforcement and security. Course content critically examines the role and experiences of law enforcement and security through several lenses, including but not limited to race, ethnicity, indigeneity, gender/gender identity, sexuality/sexual orientation, immigrations status, class, and their intersections. Finally, students will examine the role of accountability in law enforcement and how it shapes civil society.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "340",
        "title": "Ethics in Criminal Justice",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course provides a foundation for the study and application of ethics in criminal justice decision making and policy analysis.  Students will demonstrate the ability to apply ethical practice in research and applied situations through writing. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "344",
        "title": "Corrections",
        "description": "Prerequisite: SOC 250 or CJS 102 or CJS 302 or permission of instructor. Offers social-scientific examination of the field of corrections, both substantively and critically. Includes patterns and trends in incarceration rates; police and judicial processes resulting in incarceration; climate and culture of correctional facilities; and gender/diversity issues in corrections. Discussion of correctional facilities and supervision including an introduction to community corrections. Critical examination of current issues in corrections is covered.",
        "units": "2",
        "prerequisites": "{{SOC 250} || {CJS 102} || {CJS 302} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "350",
        "title": "Criminological Theory",
        "description": "Prerequisite: SOC 250 or CJS 102 or CJS 302 or permission of instructor. This course provides a foundational understanding of criminological theory, including its historical development and application to contemporary issues in crime and justice. Students will explore the diverse theoretical traditions underpinning the field, including established and emerging biosocial, control, learning, strain, conflict, life course, labeling, and critical theories. Contributions from historically underrepresented theorists and new theoretical directions will also be examined. Special attention will be placed on examining how different theories explain the roles of social structure, identity (gender, race, ethnicity, indigeneity, class, sexuality/sexual orientation, and others) and context (time, place) in shaping our understanding of crime.",
        "units": "3",
        "prerequisites": "{{SOC 250} || {CJS 102} || {CJS 302} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "360",
        "title": "Career Planning in Criminal Justice",
        "description": "The course provides the groundwork for professional socialization into the roles, norms, expectations and requirements for careers in the criminal justice system. Special attention will be given to the ways in which local agencies interview, hire and train new criminal justice employees and how internships feed into those professional expectations by these agencies. Students are also exposed to issues of ethics and decision making as well as learning how to write for the criminal justice field.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "370",
        "title": "Criminal Justice Systems",
        "description": "This course provides a foundational understanding of the development, organization, and process of the police, law and the courts, and corrections from a systemic perspective and their interactions with other social institutions. Course content addresses the historical origins, development, purpose, and goals of the U.S. criminal justice system from colonial institutions of social control to contemporary conflicting methods of crime control and due process orientations. Additionally, issues of diversity, ethics, and (in)justice throughout the system are extensively discussed, including the roles of gender/gender identity, race, ethnicity, indigeneity, class, sexuality/sexual orientation, and other areas of diversity and their intersections, on individuals’ experiences interacting with and working within the systems. Practical application of insights from course material towards crime prevention, policy, and system reform as well as discussions of alternative justice systems are emphasized and required.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "380",
        "title": "Criminology and Justice Methods",
        "description": "Prerequisite: CJS 102 or CJS 302. Preparatory: CJS 280. Note: CJS 380 and 380L are corequisite classes. CJS 380/L is designed to give students a working knowledge of basic research methods and data used in the study of criminology and criminal justice. The seminar portion of the course is designed to highlight the research process, ethical issues, different types of quantitative and qualitative research designs, data analysis, and the reporting of research results in the context of criminal justice research and practice. The laboratory portion of the course will provide hands-on instruction for students to become proficient with basic data analysis techniques and technologies. The process of conducting research and writing research results will be directly experienced first-hand through a combination of seminar and discussion activities and assignments. 2 hours lecture, 2 hours lab.",
        "units": "2",
        "prerequisites": "{{CJS 102} || {CJS 302}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "380L",
        "title": "Criminology and Justice Methods Lab",
        "description": "Prerequisite: CJS 102 or CJS 302. Preparatory: CJS 280. Note: CJS 380 and 380L are corequisite classes. CJS 380/L is designed to give students a working knowledge of basic research methods and data used in the study of criminology and criminal justice. The seminar portion of the course is designed to highlight the research process, ethical issues, different types of quantitative and qualitative research designs, data analysis, and the reporting of research results in the context of criminal justice research and practice. The laboratory portion of the course will provide hands-on instruction for students to become proficient with basic data analysis techniques and technologies. The process of conducting research and writing research results will be directly experienced first-hand through a combination of seminar and discussion activities and assignments. 2 hours lecture, 2 hours lab.",
        "units": "1",
        "prerequisites": "{{CJS 102} || {CJS 302}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "402",
        "title": "Gangs",
        "description": "Prerequisite: SOC 250 or CJS 102 or CJS 302 or permission of instructor. This course provides a core foundation for the study of gangs and gang control in a historical and contemporary perspective. Gang definitions, types, social organization, and control are included in this class as well as an examination of the social, political, and economic conditions that favor the emergence of gangs and gang behavior. The focus of this class is on gangs in both a U.S. and a global context. Critical perspectives are used to analyze issues in the understanding and control of gangs, and application of these perspectives to the criminal justice field is emphasized. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{SOC 250} || {CJS 102} || {CJS 302} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "418",
        "title": "Gender and Crime",
        "description": "Prerequisite: SOC 250 or CJS 102 or CJS 302 or permission of instructor. The course examines the historical and contemporary views of gender/gender identity and criminality, victimization, crime perpetration, and societal responses to crime and public policy. In addition, this course examines the scientific study of gender/gender identity and crime by examining intersectional social factors such  as race, ethnicity, indigeneity, immigration status, class, sexuality/sexual orientation, and dis/ability. Further, the course includes discussions on how gender impacts people’s experiences as victims and perpetrators of crime. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{SOC 250} || {CJS 102} || {CJS 302} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "422",
        "title": "White Collar Crime",
        "description": "Prerequisite: SOC 250 or CJS 102 or CJS 302 or permission of instructor. This course will explore various types of white collar crime committed in the United States and abroad, including fraud, perjury, obstruction, computer crime, identity theft, bribery and corruption, embezzlement, tax evasion, conspiracy, RICO, and organizational (entity) crime. It will examine criminal procedure, including search and seizure, due process, self-incrimination, right to counsel, sentencing, fines, restitution, and probation and parole connected to this type of crime. Additionally, we will explore theoretical perspectives and the impact that this form of crime has on individuals, businesses, and society. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{SOC 250} || {CJS 102} || {CJS 302} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "432",
        "title": "Alcohol, Drugs, and Crime",
        "description": "Prerequisite: SOC 250 or CJS 102 or CJS 302 or permission of instructor. This course will provide a foundation for understanding the interactions between alcohol, drugs, and crime. Included in this foundation are the nature, effects, theories, interventions, and prevention of substance abuse both for individuals and society. Students will engage in a critical examination of the criminal justice response and impacts of such policies as the War on Drugs on the criminal justice system. Throughout the course, there will be an emphasis on practical applications and policy implications. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{SOC 250} || {CJS 102} || {CJS 302} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "438",
        "title": "Gender and Criminal Justice",
        "description": "Prerequisite: SOC 250 or CJS 102 or CJS 302 or permission of instructor. This course will explore the values, ethics, and ideologies underlying the current justice system and social justice responses, with special application given to the role of sex, gender, gender expression, and gender identity. The course will explore gender and justice beyond the man/woman and male/female dichotomy. In addition, the course examines the scientific study of gender, intersectional social factors such as race, indigeneity, ethnicity, immigration status, class, sexuality/sexual orientation, gender identity/expression, and ability; and interactions with the justice system (police, courts, and corrections). The justice system will be examined with the following components in mind: stereotypes, marginalization, stigmatization, power, privilege, bias, oppression, resistance, compassion, inclusivity, and community. Further, gender identities among professionals in the justice system (police officers, attorneys, judges, correctional officers) will be discussed. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{SOC 250} || {CJS 102} || {CJS 302} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "444",
        "title": "Community Corrections",
        "description": "Prerequisite: SOC 250 or CJS 102 or CJS 302 or permission of instructor. This course studies the role of community corrections within the U.S. correctional system. Specifically, this course includes topics including pretrial diversion, community-based sentences and treatment, and parole supervision. Critical issues in the field including offender reentry, managing offenders in a community setting, and instituting alternatives to traditional incarceration will be addressed. Practical application of course material to work in the community corrections field will also be emphasized. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{SOC 250} || {CJS 102} || {CJS 302} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "446",
        "title": "Domestic Violence",
        "description": "Prerequisite: SOC 250 or CJS 102 or CJS 302 or permission of instructor. This course explores the various forms of domestic violence including the prevalence across different social dimensions, including but not limited to gender/gender identity, race, indigeneity, ethnicity, class, immigration status, sexuality/sexual orientation, and their intersections. Domestic violence will be discussed from various theoretical perspectives to understand the causes and the effects of abuse. Students will learn about the criminal justice process and responses, including how these experiences differ based on identity, culture, and the type of abuse. The course also covers basic prevention and intervention strategies, including laws and policies within and outside of the criminal justice system. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{SOC 250} || {CJS 102} || {CJS 302} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "448",
        "title": "Global Perspectives in Crime and Justice",
        "description": "Prerequisite: SOC 250 or CJS 102 or CJS 302 or permission of instructor. The purpose of this course is to give students an introduction to criminology and criminal justice from a global perspective. Students in this course adopt comparative and cross-national approaches to crime in order to examine a number of subject matters in international criminal law, international criminal justice, war crimes, and transnational crimes. Critical thinking and practical application of key material is strongly emphasized. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{SOC 250} || {CJS 102} || {CJS 302} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "480",
        "title": "Applied Research in Criminology and Justice Studies",
        "description": "Prerequisites: SOC 250 or CJS 102 or CJS 302; CJS 430/L or GEOG 306/L; or permission of instructor. This course will provide students applied research experience either in a criminal justice-related agency or with crime data. The course will focus on the practice of research in the field of criminology and justice studies, the development and writing of empirical research papers, and content related to the specific agency or data project to which students are assigned. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{{{SOC 250} || {CJS 102} || {CJS 302}} && {{CJS 430/L} || {GEOG 306/L}}} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CJS",
        "catalog_number": "494A",
        "title": "Criminal Justice Internships Seminar and Field Experience",
        "description": "Prerequisites: CJS 102 or CJS 302; CJS 430/L; senior standing; permission of instructor. CJS 494A-E and CJS 494AA-EE are corequisite classes for an internship experience relating to one of these five areas: law enforcement (494A and 494AA), law and courts (494B and 494BB), corrections (494C and 494CC), victim services (494D and 494DD), and community based programs (494E and 494EE). This course is designed to bring academic concepts, theories, and other learning to bear on applied experiences in the criminal justice and related fields. Students will gain hands-on experience and develop skills connected to work in the criminal justice system and related sites during a minimum of 120 hours of work in an internship site. An academic research paper synthesizing literature and applying it to data gathered from the site is required. (Credit/No Credit only)",
        "units": "1",
        "prerequisites": "{{{CJS 102} || {CJS 302}} && {CJS 430/L} && {senior standing} && {permission of instructor}}",
        "corequisites": "{None}"
    }
]