[
    {
        "subject": "ELPS",
        "catalog_number": "203",
        "title": "Urban Education in American Society",
        "description": "Introductory foundation course. Designed to provide students with the fundamental knowledge of the understanding of the American educational enterprise, especially problems in urban multicultural schools. Concepts and methods from the fields of sociology, philosophy and the politics of education are used to gain knowledge of, understand and analyze the current conditions of American schools, and to evaluate selected proposals/ models for reform. The California Standards for the Teaching Profession, the Teaching Performance Expectations and the K-12 subject matter content standards are introduced. A minimum of 20 hours of observation and participation in a multicultural school and community setting is required.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "417",
        "title": "Equity and Diversity in Schools",
        "description": "Prepares teacher candidates to examine principles of educational equity, diversity and the implementation of curriculum content and school practices for elementary/secondary students. Focuses on the history and culture of a specific ethnic experience, and a comparative analysis is made with other ethnic groups in California. Engages students to examine, critique and reflect on their personal biases regarding children of color. Not available for credit in addition to AAS 417, AFRS 417, ARMN 417 or CHS 417. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "541A",
        "title": "Getting Started–Introduction to Teaching in Urban Schools",
        "description": "Prerequisites: Restricted to candidates admitted to the Accelerated Collaborative Teacher (ACT) Residency Program. Corequisites: Multiple Subject Credential Candidates: SPED 541B, EED 500 or EPC 500, EED 515, EED 520, EED 565M, EED 577, EED 567ACT, EED 559C. Single Subject Credential Candidates: SPED 541B, EPC 420, SED 511, SED 514, SED 525XX, SED 554/S. Preliminary Special Education Credential Candidates in Mild/Moderate and Extensive Support Needs (MME): SPED 541B, SPED 402, SPED 406, SPED 407, SPED 511, EED 565M or SED 525XX, SPED 579ACT. The first of two core courses in the ACT Program for elementary, secondary, and special education teacher candidates is taught collaboratively by a team of university and school faculty. The course is an introduction to teaching and learning in the context of P-12 urban schools with an emphasis on educational equity, diversity, and special populations. Topics include an introduction to the roles and responsibilities of a professional educator; teachers’ and students’ backgrounds and how they impact teaching and learning in urban schools; knowledge of relevant federal and state legislation for students with disabilities; classroom practices that include planning, assessment and management in urban schools; and collaboration with school professionals and parents. Teacher candidates are provided activities and discussion that emphasize the link between theory and practice. (Offered Fall semester only).",
        "units": "1",
        "prerequisites": "{Restricted to candidates admitted to the Accelerated Collaborative Teacher (ACT) Residency Program}",
        "corequisites": "{{SPED 541B} || {EED 500} || {EPC 500} || {EED 515} || {EED 520} || {EED 565M} || {EED 577} || {EED 567ACT} || {EED 559C}}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "542A",
        "title": "Meeting the Needs of All Students in Urban Schools",
        "description": "Prerequisites: Restricted to candidates admitted to the Accelerated Collaborative Teacher (ACT) Residency Program. Successful completion of all Fall semester coursework. Corequisites: Multiple Subject Credential Candidates: SPED 542B, EED 565S, EED 568ACT, EED 575; HSCI 465ELM; KIN 595PE; EED 559F. Single Subject Credential Candidates: SPED 542B; SED 529; HSCI 466ADO; SED 521; SED 555; SED 555S. Special Education Preliminary Credential Candidates in Mild/Moderate and Extensive Support Needs (MME): SPED 542B, SPED 416, SPED 502MME, SPED 503MME, SPED 545, SPED 580ACT. This course is the second of two core courses in the ACT Program for elementary, secondary, and special education teacher candidates and taught collaboratively by a team of university and school faculty. Building on the content introduced in the first core course related to educational equity, restorative justice practices, diversity, and special populations, topics include developing as a reflective educator who considers the learning needs of all students; creating and managing effective and healthy classroom environments in urban schools; problem solving strategies to facilitate teaching and learning; instructional modifications and accommodations for students with disabilities in general education settings; issues related to diversity and multicultural education; and models of collaboration/consultation. Teacher candidates are provided activities and discussion that emphasize the link between theory and practice. (Offered in Spring semester only).",
        "units": "2",
        "prerequisites": "{Restricted to candidates admitted to the Accelerated Collaborative Teacher (ACT) Residency Program}",
        "corequisites": "{{SPED 542B} || {EED 565S} || {EED 568ACT} || {EED 575} || {HSCI 465ELM} || {KIN 595PE} || {EED 559F}}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "600",
        "title": "Research in Educational Leadership",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program. This course introduces students to education research concepts, methods and contributions to K12 and higher education practice, with an emphasis on how administrators can use research to inform decision making. It is designed to provide students with the foundations of educational research so that they will be able to understand basic research reports, evaluate practice in light of research and develop action research projects.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "600HE",
        "title": "Research Design in Higher Education",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program. This course introduces students to education research concepts, methods and contributions to higher education practice, with an emphasis on how higher education leaders can use research to systematically investigate problems in college and university settings and inform decision making in institutional contexts. The course is designed to provide students with the foundations of educational research to support the development of knowledge and skills to understand research reports and evaluate practice in light of research.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "601HE",
        "title": "American Higher Education",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program. This course is designed for students to understand the nature, scope and function of higher education in the U.S., with an emphasis given to contemporary issues and problems. This seminar-designed class is structured to engage students in meaningful exploration of the continued evolution of American higher education and the major controversies that will shape the future of these institutions.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "650",
        "title": "Contemporary Administrative Leadership",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program. Designed to assist in the development of administrative leadership skills. Focus on the knowledge and application of leadership skills necessary in effective organizations, with special emphasis on schools. Topics of study include situational leadership, organizational climate and culture, individual and group motivation and transforming leadership as applied through school-based management, shared decision making, strategic planning, team building and total quality management. Includes discussion of current educational reform efforts and trends.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "650HE",
        "title": "Contemporary Administrative Leadership in Higher Education",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program. This course is designed to assist in the development of administrative leadership skills. Focus is on the knowledge and application of leadership skills necessary in effective organizations with special emphasis on higher education. Topics of study include situational leadership, organizational climate and culture, individual and group motivation, and transformational leadership as applied through shared decision making, strategic planning, team building, and total quality management. This course will also include discussion of current educational reform efforts and trends. This course requires students to complete 2-4 hours of field-based experience.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "656HE",
        "title": "Diversity and Student Success in Higher Education",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program. This course deals with current issues and challenges of diversity and student success in higher education. Emphasis is placed on understanding the overall educational experiences of diverse college student populations across various institutional settings. This course will require students to complete 2-4 hours of field-base experience.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "663",
        "title": "Legal Aspects of Educational Administration",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program. General principles of American school law, with particular emphasis on California statutes. Consideration of the legal basis of federal, state and local administrative levels. Review of the salient legal provisions of the Education Code respecting administration of schools, the rights of patrons and employees, torts, contracts, certification, tenure, school plant planning, and the rights and obligations of pupils. Analysis and significance of major court decisions having implications for public education.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "663HE",
        "title": "Policy and Law in Higher Education",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program. This course explores key topics in higher education public policy and law at the federal and state levels in their historical and contemporary contexts. It emphasizes topics that are relevant to California, including governance, access, equity, higher education and state economic development, K-16 planning and articulation, and accountability.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "667HE",
        "title": "Organization and Administration of Community College Education",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program. This course is designed for students to study the organization and administration of community colleges. The course focuses on the application of organizational theory to institutional practice in community colleges, the application of administrative policies and procedures in community college settings, and the study of historical patterns and emerging trends in the areas of faculty and staff, curriculum and instruction, facilities management, and community and government relationships.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "672",
        "title": "Management of Human Resources",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program. Seminar in the philosophy, scope, function and evaluation of public school personnel administration. Emphasis on the development of a practical program.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "673HE",
        "title": "Leadership for Managing Reform in Higher Education",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program. This course is designed to support the development of knowledge and skills to plan for and manage institutional change in colleges and universities. The class includes focuses of historical and contemporary problems in postsecondary educational environments, strategies for managing change efforts in institutional settings in higher education, and emerging approaches to support and finance new programs intended to resolve pressing issues and persistent challenges in higher education. The class emphasizes the development of project proposals designed to address solutions to meet the needs of diverse constituent groups in higher educational settings.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "674HE",
        "title": "Higher Education Operations: Finance and Human Resources in Higher Education",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program. This course is designed to help students understand the philosophy, scope, function and evaluation of postsecondary operations related to financial and human resources. The course covers general principles of American higher education finance and human resource administration with particular emphasis upon California law and practice. The course focuses on problems and principles of higher education finance and human resource administration with an emphasis on California. Further, the course examines public funding of community college and public universities in California. This course requires students to complete 2-4 hours of field-based experience.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "675",
        "title": "Decision Making Simulation",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program. Designed to provide experienced school administrators and graduate students in administration and supervision the opportunity to simulate the position of a school administrator and assume the leadership of a typical public school. Content is developed around the use of simulated materials and focuses on the individual students and their approach to realistic problems and situations faced by a school administrator. These responses are the basis for the students’ self-examination of their administrative behavior and enables them to capitalize upon strengths and ameliorate weaknesses.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "676",
        "title": "School Community Relations",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program. The seminar is devoted to a study of the knowledge, dispositions and skills needed by educational administrators in order to understand and respond to diverse community interests and needs, collaborate effectively with families and community members, mobilize community resources to benefit students and families, and interpret the school to the public through a variety of media and modes.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "681",
        "title": "Organization and Administration of Elementary, Secondary and Special Education",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program. Organizational structure of elementary and secondary education in the schools, with a focus on-site leadership. Particular emphasis given to the organization, administration and supervision of various types of special education programs as well as the internal organization, structure, cultural context and the administration of the school, and the role of the school principal. Emphasizing and encouraging personal responsibility for developing, articulating and refining the values, beliefs and assumptions that guide professional practice to maximize student learning.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "682",
        "title": "Supervision of Curriculum and Instruction",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program. Foundations and philosophies of curriculum and instructional supervision. Curriculum formation, organization and assessment. Principles of professional development for staff members. The role of various school personnel in improving teaching and learning. Elementary and secondary school levels included.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "688",
        "title": "Fieldwork in Educational Administration",
        "description": "Prerequisites: This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program; completion of ELPS 600; teaching experience; 6 hours or less of coursework remaining in the program; and approval of the administrator of the school where the fieldwork is to be performed. Admission is by fieldwork application only, which may be obtained in the department office or online at www.csun.edu/education/elps. Application must be received by June 15 for consideration for the Fall semester and by December 15 for consideration for the Spring semester. The experience in this program is at the building site level and reflects, as much as possible, those functions, assignments and responsibilities characteristic of the principal’s office. Students assume a leadership role in implementing the Action Research Project designed in ELPS 600.",
        "units": "3",
        "prerequisites": "{{This course is restricted to candidates who have been admitted to the Master of Arts in Educational Administration and/or the CA Preliminary Administrative Services Credential program} && {ELPS 600} && {teaching experience} && {6 hours or less of coursework remaining in the program} && {approval of the administrator of the school where the fieldwork is to be performed}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "688HE",
        "title": "Fieldwork in Higher Education",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program. This course is designed to facilitate fieldwork in higher education administration with a focus on leadership through field research and professional experiences. Following ELPS 600HE where students develop skills to design and execute an action research project, the course focuses on both administrative and research fieldwork, with the use of data collection procedures typically utilized in both quantitative and qualitative research. The research fieldwork supports the development of knowledge and skills to gather information to support a systematic approach to problem solving in postsecondary educational environments. In addition, the administrative field experiences are in higher education settings, with a focus on leadership shadowing and participant observations in administrative settings. The course emphasizes applications of research design and procedures in institutional contexts in colleges and universities and focuses on systematic approaches to gathering information in the field and the development of leadership skills in real-life educational settings.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "690HE",
        "title": "Research Analysis in Higher Education",
        "description": "Prerequisite: This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program. This course prepares students to understand the nature, assumptions, and logic of quantitative and qualitative research design and analysis. The course will build on concepts learned in ELPS 600HE and ELPS 688HE by extending on issues of design, conceptualization, analysis, and interpretation of quantitative and qualitative research procedures. The aim of this course is to help students acquire skills and gain experience in using a variety of research techniques for the purposes of understanding and making sense of educational issues.",
        "units": "3",
        "prerequisites": "{This course is restricted to candidates who have been admitted to the Master of Arts in Higher Education Leadership program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Preparatory: Restricted to and required of M.A. degree candidates in the semester in which they take the comprehensive examination for the degree.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "697HE",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisites: Admission to the Master of Arts degree program in Higher Education Leadership; All coursework must be completed prior to or during the semester in which the candidate will take Directed Comprehensive Studies. This course is the culminating experience for candidates in the Master of Arts degree program in Higher Education Leadership. Directed Comprehensive Studies is an assessment of the candidate’s understanding and mastery of the organization, governance structures, funding resources, change and reform, student access, and research issues in higher education administration. Directed Comprehensive Studies is comprised of two parts: (1) Response to a case scenario, (2) Analysis of a research study. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{Admission to the Master of Arts degree program in Higher Education Leadership} && {All coursework must be completed prior to or during the semester in which the candidate will take Directed Comprehensive Studies}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "700",
        "title": "The Art of Collaborative Leadership",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. This course provides educational leaders with the tools to establish and enhance their own leadership skills in P12 school/district- or community-college settings. Students study and apply the literature of collaborative leadership, including team building, visioning, inspiring, and empowering constituents and stakeholders connected to the learning organization.",
        "units": "3",
        "prerequisites": "{Admission to the Doctoral Program in Educational Leadership}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "705",
        "title": "Organizational Complexity and Change",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. This course focuses on school/district or community colleges as complex and dynamic organizations. It emphasizes the ways in which educational leaders use knowledge of organizational theory to improve management decisions, facilitate organizational change and achieve positive outcomes for students.",
        "units": "3",
        "prerequisites": "{Admission to the Doctoral Program in Educational Leadership}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "715",
        "title": "Leading Change Through Cultural Competence",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. This course assists in the development of culturally competent leaders in diverse educational settings. Students develop knowledge, skills and dispositions necessary to promote policies and practices that value difference and ensure equity in effective organizations. Special emphasis is given to culturally and linguistically diverse populations in P12 schools or community colleges.",
        "units": "3",
        "prerequisites": "{Admission to the Doctoral Program in Educational Leadership}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "725",
        "title": "Instructional Assessment and Program Evaluation",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. This course includes study of instructional assessment and program evaluation for effective educational leadership. Emphasis is given to an examination of measures of student achievement and accountability systems.",
        "units": "3",
        "prerequisites": "{Admission to the Doctoral Program in Educational Leadership}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "730",
        "title": "Public Policy in Education",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. (P12 cohort only.) This course examines the context for policy making and the process of policy development and implementation. It includes the study of organizational structures for educational decision making at the federal, state, county and local levels, with emphasis on how and where influence can be exerted.",
        "units": "3",
        "prerequisites": "{Admission to the Doctoral Program in Educational Leadership}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "740",
        "title": "Entrepreneurship in Public Education",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. This course examines developments and promising practices in educational entrepreneurship and community partnerships. Students learn professional skills, such as grant writing, collaborative planning, presentation delivery and marketing. An emphasis is placed on working effectively with a variety of stakeholders across the public and private sectors to improve public P14 schools.",
        "units": "3",
        "prerequisites": "{Admission to the Doctoral Program in Educational Leadership}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "755",
        "title": "Human Relations in Educational Organizations",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. This course enhances the effective management of human relations in collaborative organizational contexts. As the capstone course in the Doctoral Program, it addresses both self-awareness and increased understanding of others.",
        "units": "3",
        "prerequisites": "{Admission to the Doctoral Program in Educational Leadership}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "760",
        "title": "Field Based Inquiry I",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. Doctoral students are guided in designing and conducting an intensive, field-based inquiry related to organizational change efforts to improve student achievement in P12 schools or community colleges. Students develop or enhance hands-on administrative skills in action research, collaborative problem solving, program planning and professional presentation.",
        "units": "3",
        "prerequisites": "{Admission to the Doctoral Program in Educational Leadership}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "770",
        "title": "Applied Quantitative Inquiry I",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. This course provides an introduction to concepts, principles and methods of quantitative research in education. Problem identification, research design, data collection techniques and interpretation of research findings are addressed. Critical analysis of relevant research literature is emphasized.",
        "units": "3",
        "prerequisites": "{Admission to the Doctoral Program in Educational Leadership}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "780",
        "title": "Applied Qualitative Inquiry I",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. This course is an overview of qualitative approaches to educational research that can be applied to educational leadership for school improvement. Students learn to be critical consumers of the qualitative research literature and to use basic qualitative research methods. Action research and qualitative approaches to the dissertation process are also discussed.",
        "units": "3",
        "prerequisites": "{Admission to the Doctoral Program in Educational Leadership}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "785",
        "title": "Applied Qualitative Inquiry II",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership; Successful completion of Applied Qualitative Inquiry I. This course is an advanced seminar for students who plan to use mainly qualitative research methods for their dissertation. It guides them through the process of designing a meaningful, manageable qualitative study, as well as advanced techniques in qualitative data collection, analysis and reporting.",
        "units": "3",
        "prerequisites": "{{Admission to the Doctoral Program in Educational Leadership} && {Successful completion of Applied Qualitative Inquiry I}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "789",
        "title": "Dissertation Seminar",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership; Advancement to Candidacy. Students work under the guidance of their advisor to complete requirements for the dissertation. Includes independent work as well as dissertation seminars. Minimum of 12 dissertation seminar units are required in the program. May be repeated for credit. Students must be enrolled every semester after admission to Candidacy until they successfully defend their dissertation.",
        "units": "2",
        "prerequisites": "{{Admission to the Doctoral Program in Educational Leadership} && {Advancement to Candidacy}}",
        "corequisites": "{None}"
    }
]