[
    {
        "subject": "FCS",
        "catalog_number": "111",
        "title": "INTERIOR DS MTRS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "113",
        "title": "Drafting for Interior Design",
        "description": "Recommended Co-requisites: ART 124A and ART 141. Introduction to concepts and conventions of drafting for interior design. Emphasis on developing skills in architectural hand drafting of plans elevations sections using conventional symbols of the building design professions; recognizing the importance of working drawings; improving drafting and hand lettering proficiency through practice discussion direct observation and critiques. Media includes mechanical pencil and technical pen on vellum and drafting equipment necessary to the completion of each assignment. Emphasis is on a set of working drawings. 6 hours per week. Credit not allowed for both FCS 113 and ART 113.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "FCS",
        "catalog_number": "150",
        "title": "Apparel Construction I",
        "description": "Corequisite: FCS 150L. Fundamental principles and terminology of clothing construction with emphasis on the interrelationship of fiber fabric construction techniques fit and care. 2o hours lecture one 3-hour lab.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "150L",
        "title": "Apparel Construction I Lab",
        "description": "Corequisite: FCS 150. Fundamental principles and terminology of clothing construction with emphasis on the interrelationship of fiber fabric construction techniques fit and care. 2o hours lecture one 3-hour lab.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "160",
        "title": "Introductory Textiles",
        "description": "Lecture-discussion course presenting an introductory analysis of textile fibers yarns fabrics dyestuffs and finishes as they relate to the selection of end-use products. Emphasis given to textiles in apparel and interiors.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "170",
        "title": "Creative Expression in Family and Consumer Sciences",
        "description": "Develops awareness of the relationships between creative expression and the quality of life in the family unit.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "201",
        "title": "Introductory Food Science",
        "description": "Corequisite: FCS 201L. Introduction to the chemical physical and nutritional properties of foods and changes that occur during processing and storage. Methods currently used in food preparation are emphasized. 2 hours lecture one 3-hour lab.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "201L",
        "title": "Introductory Food Science Lab",
        "description": "Corequisite: FCS 201. Introduction to the chemical physical and nutritional properties of foods and changes that occur during processing and storage. Methods currently used in food preparation are emphasized. 2 hours lecture one 3-hour lab.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "207",
        "title": "Nutrition for Life",
        "description": "Basics of sensible and safe food choices related to the science of nutrition. Achievement and maintenance of nutritional well-being throughout life as influenced by social cultural economic and environmental conditions. Credit not allowed for both FCS 207 and HSCI 337. (Available for General Education Lifelong Learning.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "210",
        "title": "History of Interiors and Architecture I",
        "description": "Prerequisite: FCS 113 FCS 114/L. Study of architecture and interiors from antiquity to the Victorian period.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "211",
        "title": "Interior Design I",
        "description": "Prerequisites: FCS 113 and FCS 114/L. Introduction to space planning. 6 hours of studio.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "FCS",
        "catalog_number": "213",
        "title": "Computer Applications for Interior Design",
        "description": "Prerequisites: FCS 113 or ART 113. Corequisite 213L. Emphasis on the use of the AutoCAD program to prepare drawings in interior design. Through computer applications students develop communication skills in 2-Dimensional and 3-Dimensional interior design drawings using drafting and lettering techniques with computer-aided tools. 1 hour lecture two 3-hour labs.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "213L",
        "title": "Computer Applications for Interior Design Lab",
        "description": "Prerequisites: FCS 113 or ART 113. Corequisite 213. Emphasis on the use of the AutoCAD program to prepare drawings in interior design. Through computer applications students develop communication skills in 2-Dimensional and 3-Dimensional interior design drawings using drafting and lettering techniques with computer-aided tools. 1 hour lecture two 3-hour labs.\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "214",
        "title": "Interior Design Materials",
        "description": "Standards and Specifications and LabPrerequisites: FCS 113 FCS 114/L; Corequisites: FCS 160 and FCS 214L. Study of materials standards and specifications used in the design and construction of interior environments. 2 hours lecture 3 hours lab per week.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "214L",
        "title": "Interior Design Materials Lab",
        "description": "Standards and Specifications and LabPrerequisites: FCS 113 FCS 114/L; Corequisites: FCS 160 and FCS 214. Study of materials standards and specifications used in the design and construction of interior environments. 2 hours lecture 3 hours lab per week.\n",
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "FCS",
        "catalog_number": "232",
        "title": "Individual and Family Development",
        "description": "Relationships and adjustments during the normal stages of family living.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "234",
        "title": "The Child in the Family and Community",
        "description": "Dynamics of childrens relationships with their families and others throughout their development and with various contexts. Lecture-discussion.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "250",
        "title": "Apparel Construction II",
        "description": "Prerequisite: FCS 150/L. Corequisite: FCS 250L. Theory and application of pattern alteration fitting advanced construction techniques; analysis of fabrics used in fashion apparel. 2 hours lecture one 3-hour lab.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "250L",
        "title": "Apparel Construction II Lab",
        "description": "Prerequisite: FCS 150/L. Corequisite: FCS 250. Theory and application of pattern alteration fitting advanced construction techniques; analysis of fabrics used in fashion apparel. 2 hours lecture one 3-hour lab.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "255",
        "title": "The Fashion Industry",
        "description": "Overview of the structure and functioning of the fashion industry as it relates to apparel. Field trips required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "271",
        "title": "Apparel Analysis and Selection",
        "description": "Prerequisite: FCS 170. Corequisite: FCS 271L. Study of individual differences in relation to apparel selection and design. 2 hours lecture one 2-hour studio.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "271L",
        "title": "Apparel Analysis and Selection Lab",
        "description": "Prerequisite: FCS 170. Corequisite: FCS 271. Study of individual differences in relation to apparel selection and design. 2 hours lecture one 2-hour studio.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "FCS",
        "catalog_number": "296A",
        "title": "INTRO FASHION CAD",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "300",
        "title": "Family and Community Services",
        "description": "In-depth study of various types of family service agencies (local/state/federal non-profit/for-profit) and the services they provide to families in the community.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "301",
        "title": "Food Science and Technology",
        "description": "Prerequisites: BIOL 215/L; CHEM 235/L; FCS 201 201L. Study of the physical and chemical changes occurring in food during commercial operations and the principles and technical process involved in the production processing preservation storage and distribution of foods. Control and utilization of microorganisms in food food laws and regulations and the influence of processing on nutritional quality of foods are discussed.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "302",
        "title": "Food Product Development and Quality Assurance",
        "description": "Prerequisite: FCS 301. Principles and practice of quality assurance and product development programs in food industry. Lab and field study of commercial food processing and preservation operations. 6 hours lab per week.\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "304",
        "title": "Food Service Production",
        "description": "Prerequisite: FCS 301. Overview of the principles and methods of commercial/institutional food production including use of food service equipment. Includes application of principles of safety and sanitation.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "307",
        "title": "Advanced Nutrition: Macronutrients",
        "description": "Prerequsities: Grade of C or better in BIOL 281/L CHEM 235/L and FCS 207. Role of carbohydrates fats proteins minerals and vitamins in human nutrition. Nutritional requirements during the various stages of life cycle.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "308",
        "title": "Advanced Nutrition Micronutrients",
        "description": "Prerequisites: FCS 307 and Chem 365/L: passing grade of C or better in each. The role of micronutrients vitamins and minerals in human nutrition including digestion absorption metabolism and major biological physiological and metabolic roles. Emphasis is placed on interactions and interrelationships of the nutrients at the organism and cellular levels.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "311",
        "title": "Interior Design II",
        "description": "Prerequisites: FCS 211 FCS 213/L FCS 214/L ART 124A ART 141 ART 230; Corequisite: FCS 314/L. Application of theories to residential hospitality and other institutional design. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the Schedule of Classes for the CS Designation. 6 hours of studio per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "FCS",
        "catalog_number": "312",
        "title": "Lighting and Mechanical Systems",
        "description": "Prerequisites: FCS 211 FCS 213/L and FCS 214/L; Corequisite: FCS 312L. Principles of lighting and electrical systems thermal control systems and ancillary services applied to residential and commercial design. Lab involves design of lighting systems and an understanding of mechanical systems for residential and commercial applications. 2 hours lecture one 3-hour studio.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "312L",
        "title": "Lighting and Mechanical Systems Lab",
        "description": "Prerequisites: FCS 211 FCS 213/L and FCS 214/L; Corequisite: FCS 312. Principles of lighting and electrical systems thermal control systems and ancillary services applied to residential and commercial design. Lab involves design of lighting systems and an understanding of mechanical systems for residential and commercial applications. 2 hours lecture one 3-hour studio.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "FCS",
        "catalog_number": "314",
        "title": "Building Codes",
        "description": "Systems and Detailing for Interior Design and LabPrerequisites: FCS 211 213/L 214/L. Corequisite: FCS 314L. Students are introduced to basic elements of construction and building systems including power distribution systems mechanical systems energy management ceiling systems flooring systems and the impact of local building codes on the interior design process. Emphasis is placed on the interaction between interior design ideas and the construction methods. 2 hours lecture one 3-hour lab per week.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "314L",
        "title": "Building Codes Lab",
        "description": "Systems and Detailing for Interior Design and LabPrerequisites: FCS 211 213/L 214/L. Corequisite: FCS 314. Students are introduced to basic elements of construction and building systems including power distribution systems mechanical systems energy management ceiling systems flooring systems and the impact of local building codes on the interior design process. Emphasis is placed on the interaction between interior design ideas and the construction methods. 2 hours lecture one 3-hour lab per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "315",
        "title": "Issues in Housing",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Examines current issues and problems in housing and their impact on individuals and families. Concepts from Family and Consumer Sciences law economics design government and the natural and social sciences are applied to the housing situation in an effort to explore problems and develop strategies for coping in difficult times. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "316",
        "title": "Presentation Techniques for Interior Design",
        "description": "Prerequisites: FCS 113 FCS 114/L ART 124A ART 141 and ART 230. Emphasis on graphic visual presentation techniques in interior design. Students will learn base methods and various techniques for presentation in manual and digital formats that are specific to the interior design field. 6 hours per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "FCS",
        "catalog_number": "318",
        "title": "ENV PSYCH ID",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "320",
        "title": "Family Resource Management",
        "description": "Management theory applied to the family. Emphasis on clarifying values setting goals decision making and allocating resources as they relate to individual and family choice across the lifespan. Such skills as communication time management team building and stress management are ceveloped.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "321",
        "title": "Contemporary Issues in Foods and Nutrition",
        "description": "and LabPrerequisite: FCS 207 or HSCI 337. Corequisite: FCS 321L. Examination of contemporary nutrition and food education issues. Analysis discussion and evaluation of physiological economic environmental and cultural factors as they apply to food management plans and healthy nutrition choices for individuals groups and families. Computers are used to evaluate the nutritional value and economics of various meal plans. 2 hours lecture one 3-hour lab per week.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "321L",
        "title": "Contemporary Issues in Foods and Nutrition Lab",
        "description": "and LabPrerequisite: FCS 207 or HSCI 337. Corequisite: FCS 321. Examination of contemporary nutrition and food education issues. Analysis discussion and evaluation of physiological economic environmental and cultural factors as they apply to food management plans and healthy nutrition choices for individuals groups and families. Computers are used to evaluate the nutritional value and economics of various meal plans. 2 hours lecture one 3-hour lab per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "322",
        "title": "Equipment I",
        "description": "Corequisite: FCS 322L. Principles of electricity and gas; materials physical structures safety and economic factors of household appliances; use and care of appliances; and kitchen planning. Two hours lecture; 1 three-hour lab per week.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "322L",
        "title": "Equipment I Lab",
        "description": "Corequisite: FCS 322. Principles of electricity and gas; materials physical structures safety and economic factors of household appliances; use and care of appliances; and kitchen planning. Two hours lecture; 1 three-hour lab per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "323",
        "title": "Family and Individual Money Management",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Management decisions related to the allocation of family income during various stages in the family cycle. (Available for General Education Lifelong Learning.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "324",
        "title": "Consumer Rights",
        "description": "Issues and ProblemsPrerequisite: Completion of the Lower Division writing requirement. Designed to enhance consumer interaction in the marketplace. Emphasis on consumer rights protection and decision making. Basic consumer and financial strategies are explored. Roles of public and private consumer protection agencies are evaluated. (Available for General Education Lifelong Learning.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "330",
        "title": "Child Growth and Development I",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Principles of child growth and development. Observation of group activities involving children. Additional hours as assigned or arranged. (Available for General Education Lifelong Learning.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "335",
        "title": "Prenatal and Infant Development",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Study of development in the physical motor intellectual social and emotional areas and constitutional and environmental factors that influence the direction and scope of development.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "340",
        "title": "Marriage and Family Relations",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Interpersonal and intrapersonal relationships of courtship marriage and family living and the importance of these relationships in solving current issues concerning the quality of family life. (Available for General Education Lifelong Learning.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "352",
        "title": "History of Textiles and Apparel",
        "description": "Prerequisite: Upper Division standing. Study of the historical development of modern dress.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "356",
        "title": "Analysis and Evaluation of Apparel Quality",
        "description": "Prerequisites: FCS 150/L 160. Corequisite: FCS 356L. Analysis of the quality of design materials and construction techniques used in commercially produced apparel and accessories. Comparison of manufacturing processes concepts of sizing and principles of fit and pricing in relation to the target consumer in various markets. 2 hours lecture one 2-hour activity per week.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "356L",
        "title": "Analysis and Evaluation of Apparel Quality Lab",
        "description": "Prerequisites: FCS 150/L 160. Corequisite: FCS 356. Analysis of the quality of design materials and construction techniques used in commercially produced apparel and accessories. Comparison of manufacturing processes concepts of sizing and principles of fit and pricing in relation to the target consumer in various markets. 2 hours lecture one 2-hour activity per week.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "FCS",
        "catalog_number": "357",
        "title": "APPARL HUMAN BEHAVR",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "360",
        "title": "Textiles",
        "description": "Prerequisites: FCS 160 and CHEM 100/L or CHEM 103 or 105/L or 110/L. Corequisite: FCS 360L. Sources and properties of textile fibers fabric characteristics as related to selection use and care. 2 lectures one 3-hour lab per week.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "360L",
        "title": "Textiles Lab",
        "description": "Prerequisites: FCS 160 and CHEM 100/L or CHEM 103 or 105/L or 110/L. Corequisite: FCS 360. Sources and properties of textile fibers fabric characteristics as related to selection use and care. 2 lectures one 3-hour lab per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "380",
        "title": "Family and Consumer Sciences Foundations and Research",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Historical and philosophical background current issues and analysis of research in the field of Family and Consumer Sciences.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "394A",
        "title": "Undergraduate Internship",
        "description": "Directed field experience in selected area of Family and Consumer Sciences related to business industry and public service agencies. Written reports required. Academic Internship course.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "401",
        "title": "Food Chemistry and Analysis",
        "description": "Prerequisite: FCS 301. Corequisite: FCS 401L. Structure and properties of basic food constituents and their chemical and biochemical changes that influence the texture color flavor odor stability and nutritional quality of foods. Evaluation and interpretation of recent findings in food research. 2 hours lecture one 3-hour lab per week.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "401L",
        "title": "Food Chemistry and Analysis Lab",
        "description": "Prerequisite: FCS 301. Corequisite: FCS 401. Structure and properties of basic food constituents and their chemical and biochemical changes that influence the texture color flavor odor stability and nutritional quality of foods. Evaluation and interpretation of recent findings in food research. 2 hours lecture one 3-hour lab per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "402",
        "title": "Medical Nutrition Therapy I",
        "description": "Prerequisites: CHEM 365L; FCS 308. This is the first in a 2-course sequence in medical nutrition therapy that includes assessment of nutritional status nutrition care process pathophysiology and medical and nutritional management through the lifespan for endocrine cardiovascular and gastrointestinal diseases eating disorders and obesity treatment. Alternative feeding modalities (parenteral and enteral nutrition) and medical terminology will be addressed.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "403",
        "title": "Medical Nutrition Therapy II",
        "description": "Prerequisite: FCS 402. This course is a continuation of FCS 402 -- Medical Nutrition Therapy I and includes pathophysiology medical and nutritional management through the lifespan for neurological renal hepatic pulmonary neoplastic and rheumatic diseases in addition to sepsis and trauma HIV cancer and food allergies and intolerance.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "404",
        "title": "Food Service System Management",
        "description": "Prerequisites: 304 321/L. Corequisite: 404L. Systems approach to managing a food service facility including organization management marketing procurement distribution and financial and human resource management.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "404L",
        "title": "Food Service System Management Lab",
        "description": "Prerequisites: 304 321/L. Corequisite: 404. Systems approach to managing a food service facility including organization management marketing procurement distribution and financial and human resource management.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "408",
        "title": "Community Nutrition",
        "description": "Prerequisites: FCS 307; SED 525HE. Community nutrition studies the nutrition programs that relate the science of nutrition to the improvement maintenance and promotion of the health status of individuals and groups including those from different ethnic and socioeconomic backgrounds. Community organization program planning funding and evaluation of nutrition methods and current issues are studied. Some sections may offer a community service opportunity with activities relating to concepts and theories presented. Check SOLAR for the CS Designation.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "410",
        "title": "History of Interiors and Architecture II",
        "description": "Prerequisites: FCS 210 FCS 311 ART 315. The study of architecture and interiors from post-Victorian to the present.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "411",
        "title": "Interior Design III",
        "description": "Prerequisites: FCS 310 311 312/L 314/L 316. Application of theories to commercial design. Some sections of this course are taught with a community service learning opportunity (CS) with activities related to concepts and theories presented. Check the Schedule for Classes for the CS Designation. 6 hours of studio per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "FCS",
        "catalog_number": "412",
        "title": "Organization of Interior Design Practice",
        "description": "Prerequisites: FCS 210 FCS 311 ART 315. Focus on current concepts and activities of professional practice including professional roles managerial practices service delivery systems and ethics. Review and synthesis of research and professional literature pertinent to the practice of interior design. Some portions of this course are taught online (OL). Check the Schedule of Classes for the OL Designation.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "413",
        "title": "3D Computer Applications for Interior Design",
        "description": "Prerequisites: FCS 213/L or Instructor Permission. This course will introduce students to 3-D Computer Aided-Design (CAD). The course will use 3-D modeling software to focus on Building Information Modeling (BIM). By the end of the course students are expected to use 3-D modeling software to develop Interior Design (ID) projects and communicate their spatial qualities. Available for graduate credit.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "413L",
        "title": "3D Computer Applications for Interior Design Lab",
        "description": "Prerequisites: FCS 213/L or Instructor Permission. This course will introduce students to 3-D Computer Aided-Design (CAD). The course will use 3-D modeling software to focus on Building Information Modeling (BIM). By the end of the course students are expected to use 3-D modeling software to develop Interior Design (ID) projects and communicate their spatial qualities. Available for graduate credit.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "414",
        "title": "Senior Comprehensive Interior Design Studio",
        "description": "Prerequisites: FCS 310 311 312/L 314/L 316 411. Advanced study in interior design with emphasis on application of theoretical concepts to specialized interior settings. Students are required to conceptualize and generate the interior design for a particular setting including the graphic presentation of the design solution. 8 hours of studio per week.\n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "420",
        "title": "Critical Issues in Family Resource Management",
        "description": "Prerequisite: Senior or graduate standing. Application of management theory and concepts to managing families with emphasis on case study analyses personal examination and problem solving. Issues include conflict resolution balancing work and family and working with at-risk families.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "422",
        "title": "FAM FIN COUNSEL",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "423",
        "title": "Analysis of Family Economic Issues",
        "description": "Prerequisite: FCS 323. A study of family financial management as affected by the economic political and social environments. Analysis of public policy as it relates to retirement health care housing and poverty.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "424",
        "title": "Resource Management for the Elderly",
        "description": "Concentrates on allocation of resources during the late phases of the family life cycle. Attention is given to retirement planning and alternative lifestyles for the aging and elderly. Government community and private resources are analyzed relative to benefits useful to this age group. Non-majors taking this course for the Certificate Program for Service to the Aging must demonstrate that they have had sufficient experience in gerontology to benefit from the course.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "426",
        "title": "Issues of Contemporary and Future Families",
        "description": "Prerequisite: FCS 232 or 330 or 340 or senior or graduate standing. Focuses on current trends in home and family life and the impact that these issues have on future generations.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "428",
        "title": "Corporate Consumer Affairs",
        "description": "Prerequisites: BLAW 280; ENGL 205; FCS 324. A capstone course in Customer Relations Management (CRM). The course specializes in customer care and customer relations management. Emphasis is placed on CRM technology communication systems and regulations. Product recalls and safety issues are covered in-depth. Available for graduate credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "429",
        "title": "Family and Consumer Public Policy",
        "description": "Prerequisites: Passing score on the Upper-Division Writing Proficiency Exam (WPE). Exploration of the reciprocal influences between families and consumer functioning and public policies at the local state and federal levels. Emphasis is placed on the process of policy formation implementation evaluation and advocacy from a family and consumer perspective. The course is available for graduate credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "431",
        "title": "Child and Family Assessment",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Preparatory: FCS 330 or 335 or PSY 313. Application of human developmental theories to the assessment of children and families. Students also participate in a lab experience at the Child and Family Studies Laboratory.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "431L",
        "title": "Child and Family Assessment Lab",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Preparatory: FCS 330 or 335 or PSY 313. Application of child and family assessments in the Child and Family Studies Laboratory. 3 hours per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "432",
        "title": "Family Theories",
        "description": "Prerequisite: Senior or graduate standing. Preparatory: FCS 340. Review of theoretical and philosophical perspectives used in the study of families including assumptions values propositions and applications.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "433",
        "title": "Administration of Children&#8217;s Programs",
        "description": "Prerequisite: FCS 330 or 335 or PSY 313. Administrative philosophy and functions of childrens programs. Staff organization program management and facilities planning appropriate to the developmental needs of the child and family.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "434",
        "title": "SPRVS CH DEV PERS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "436",
        "title": "Parental Development",
        "description": "Prerequisites: Senior or graduate standing. Preparatory: FCS 330 or 335 or PSY 313. Study of the parents role as a facilitator emphasizing different parenting styles and their effects as well as appropriate parent and child interactions.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "438",
        "title": "Adolescents in the Family Context",
        "description": "Prerequisite: Senior or graduate standing. Preparatory: FCS 330 or 335 or PSY 313. Developmental changes and challenges of adolescents and their families as they deal with current societal issues (e.g. autonomy sexuality parent-adolescent communication values) in particular pregnancy and adolescents as parents.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "441",
        "title": "Human Sexuality",
        "description": "Provides biological sociological and psychological aspects of human sexuality. Principles of sexual therapy.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "453",
        "title": "FASHION VMD",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "453L",
        "title": "FASHION VMD LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "455",
        "title": "Fashion Merchandising",
        "description": "Prerequisites: FCS 255; MKT 443; Senior or graduate status. Corequisite: FCS 455L. In-depth study and application of the concepts and activities involved in the merchandising of fashion goods from producer to consumer. 2 hour lecture one 3-hour lab per week.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "455L",
        "title": "Fashion Merchandising Lab",
        "description": "Prerequisites: FCS 255; MKT 443; Senior or graduate status. Corequisite: FCS 455. In-depth study and application of the concepts and activities involved in the merchandising of fashion goods from producer to consumer. 2 hour lecture one 3-hour lab per week.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "FCS",
        "catalog_number": "460",
        "title": "Textile Product Analysis",
        "description": "Prerequisites: FCS 255; Senior or graduate status. Corequisite: FCS 460L. Analysis of principles and procedures used in the production and evaluation of textile products. Impact of U.S. and international trade policies and regulations. 2 hours lecture one 3-hour lab per week.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "460L",
        "title": "Textile Product Analysis Lab",
        "description": "Prerequisites: FCS 255; Senior or graduate status. Corequisite: FCS 460. Analysis of principles and procedures used in the production and evaluation of textile products. Impact of U.S. and international trade policies and regulations. 2 hours lecture one 3-hour lab per week.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "FCS",
        "catalog_number": "471",
        "title": "APP DES DRAPING",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "471L",
        "title": "APP DES DRAP LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "472",
        "title": "APPAREL DSGN: CAD",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "472L",
        "title": "APPRL DSN:CAD LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "480",
        "title": "The Helping Professional",
        "description": "Designed to facilitate the self-exploration skills building and knowledge of future helping professionals. Students are challenged to enhance their knowledge of the helping professions while understanding the various career paths that are available.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "485",
        "title": "Family Resiliency",
        "description": "Prerequisite: PSY 150 or FCS 232 or 234 or 330 or 340 or senior or graduate status. Application of family resiliency theory to societal issues with an emphasis on family protective factors and family adaptation.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "491A",
        "title": "Family and Consumer Sciences Projects",
        "description": "Prerequisites: Instructor consent. Individual supervised projects involving utilization of the facilities and personnel of the Child and Family Studies Laboratory.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "494",
        "title": "Academic Internship",
        "description": "Prerequisite: Instructor consent and senior standing. Corequisite: FCS 494I. This academic internship course provides supervised practical learning experiences focused on the application of concepts learned throughout the academic program/option. Specific guidelines for field experience and assignments vary by option.\n\n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "494I",
        "title": "Academic Internship Evaluation",
        "description": "Prerequisite: Instructor consent and senior standing. Corequisite: FCS 494. This field-based course allows for application in a professional setting and student reflection.  Individualized learning outcomes are evaluated via observation participation reflection journal/portfolio contents self-evaluation and supervisor evaluations.  Specific guidelines for field experience and assignments vary by option.\n\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "FCS",
        "catalog_number": "505",
        "title": "Nutrient and Drug Interactions",
        "description": "Prerequisite: FCS 402 or possession of verification statement for Didactic Program in Dietetics. Study of metabolic interaction between nutrients and drugs. Emphasis on drug-induced physiological and chemical alterations affecting appetite regulation absorption metabolism distribution and excretion of nutrients.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "506",
        "title": "READINGS NUTR",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "535",
        "title": "THEORY APPL ADM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "542",
        "title": "Theories of Family Development",
        "description": "Prerequisites: Senior or graduate standing. In-depth study of family development theories and research presented evaluated and applied to specific family situations. Students research family theories and present and lead discussions about their findings to the class.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "555",
        "title": "Textiles and Apparel in the Global Economy",
        "description": "Prerequisites: Senior or graduate standing. Analysis of the U.S. textile and apparel complex and of the U.S. market within an international context.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "570",
        "title": "Practicum in Nutrition Therapy",
        "description": "Prerequisites: Admission to the Dietetic Internship; Instructor consent. Recommended corequisite: FCS 573. Units do not apply for either Bachelor or Masters Degree Programs. The supervised practice hours are a minimum of 512 hours for students in the Nutrition Therapy Concentration and a minimum of 416 hours for students in the Community Nutrition Concentration. Supervised practices are at selected clinical settings such as hospitals stressing application of pathophysiology and related medical sciences to treatment and nutrition care. (Credit/No Credit only)\n",
        "units": "6",
        "class_type": "SUP"
    },
    {
        "subject": "FCS",
        "catalog_number": "571",
        "title": "Practicum in Food Service Systems Management",
        "description": "Prerequisites: Admission to the Dietetic Internship; Instructor consent. Recommended corequisite: FCS 573. No credit for either Bachelor or Masters Degree Programs. A minimum of 288 hours of supervised practice are served at selected hospitals and school foodservice settings. Interns practice foodservice production management and administration. (Credit/No Credit only)\n",
        "units": "6",
        "class_type": "SUP"
    },
    {
        "subject": "FCS",
        "catalog_number": "572",
        "title": "Practicum in Community Nutrition",
        "description": "Prerequisites: Admission to the Dietetic Internship; Instructor consent. Recommended corequisite: FCS 573. No credit for either Bachelor or Masters Degree Programs. The supervised practice hours are a minimum of 512 hours for students in the Community Nutrition Concentration and a minimum of 416 hours for students in the Nutrition Therapy Concentration. Supervised practices are at selected community settings mainly outpatient clinics stressing the planning delivery and evaluation of preventive health services as well as the delivery of services to persons with complex nutritional needs. (Credit/No Credit only)\n",
        "units": "6",
        "class_type": "SUP"
    },
    {
        "subject": "FCS",
        "catalog_number": "573",
        "title": "Seminar for Dietetic Interns",
        "description": "Prerequisites: Admission to the Dietetic Internship and instructor consent. Recommended corequisites: FCS 570 571 and/or 572 each semester. Must be repeated twice for a total of 6 units but only 3 units maximum may be applied toward a Masters Degree. Lectures group discussions and presentations dealing with the process of providing food and nutrition services in clinical food-service and community settings. Interns are considered part of the Greater Los Angeles Dietetics Internship Consortium and attend seminars with interns from other programs held at off-campus locations.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "580",
        "title": "The Family and Conusmer Sciences Profession",
        "description": "A study of Famiy Consumer Sciences (FCS) as a profession including its vision and mission history theoretical framework and professional and ethical standards. Applications of the Human Ecological Theory to ones Area of study is examined. Course is required for graduate students who do not have a FCS undergraduate degree. Credit does not count toward the graduate program and completion of the course must occur before Classification which must occur within the first 12 units.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "601",
        "title": "NUTRITION POLICY",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "606",
        "title": "Vitamin and Mineral Metabolism",
        "description": "Prerequisite: FCS 308 or possession of verification statement for Didactic Program in Dietetics. Recent advances in the roles of vitamins and minerals in human nutrition.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "609",
        "title": "NTR GENES",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "623",
        "title": "FAMILY FINANCIAL ISSUES",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "681",
        "title": "Research Methods",
        "description": "Prerequisite: Graduate standing. Review and critique of published research examination of research methodology in Family and Consumer Sciences and selection and utilization of research tools and techniques.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "682",
        "title": "Research Applications",
        "description": "Prerequisite: FCS 681. Development of research proposals completion of mini-research project and practice in the application of selected research strategies and methodologies.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "690A",
        "title": "Seminar: Advances in Family and Consumer Sciences: Nutrition",
        "description": "Prerequisite: Graduate standing. Advanced study in Family and Consumer Sciences subject matter areas: (A) Nutrition; (B) Food Science; (C) Family Economics; (D) Family Management; (E) Textile Science; (F) Apparel and Human Behavior; (G) Environmental Design for Selected Populations; (H) Interior Design of Selected Settings; (I)Child Development; (J) Family Relations; (K) Consumer Economics; (L) Teacher Supervision; (M) Special Issues in Family and Consumer Sciences; (N) Innovative Teaching Techniques in Family and Consumer Sciences; (O) Family Financial Issues; and (P) Open.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "690B",
        "title": "Seminar: Advances in Family and Consumer Sciences: Food Science",
        "description": "Prerequisite: Graduate standing. Advanced study in Family and Consumer Sciences subject matter areas: (A) Nutrition; (B) Food Science; (C) Family Economics; (D) Family Management; (E) Textile Science; (F) Apparel and Human Behavior; (G) Environmental Design for Selected Populations; (H) Interior Design of Selected Settings; (I)Child Development; (J) Family Relations; (K) Consumer Economics; (L) Teacher Supervision; (M) Special Issues in Family and Consumer Sciences; (N) Innovative Teaching Techniques in Family and Consumer Sciences; (O) Family Financial Issues; and (P) Open.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "690C",
        "title": "Seminar: Advances in Family and Consumer Sciences: Family Economics",
        "description": "Prerequisite: Graduate standing. Advanced study in Family and Consumer Sciences subject matter areas: (A) Nutrition; (B) Food Science; (C) Family Economics; (D) Family Management; (E) Textile Science; (F) Apparel and Human Behavior; (G) Environmental Design for Selected Populations; (H) Interior Design of Selected Settings; (I)Child Development; (J) Family Relations; (K) Consumer Economics; (L) Teacher Supervision; (M) Special Issues in Family and Consumer Sciences; (N) Innovative Teaching Techniques in Family and Consumer Sciences; (O) Family Financial Issues; and (P) Open.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "690I",
        "title": "Seminar: Advances in Family and Consumer Sciences: Child Development",
        "description": "Prerequisite: Graduate standing. Advanced study in Family and Consumer Sciences subject matter areas: (A) Nutrition; (B) Food Science; (C) Family Economics; (D) Family Management; (E) Textile Science; (F) Apparel and Human Behavior; (G) Environmental Design for Selected Populations; (H) Interior Design of Selected Settings; (I)Child Development; (J) Family Relations; (K) Consumer Economics; (L) Teacher Supervision; (M) Special Issues in Family and Consumer Sciences; (N) Innovative Teaching Techniques in Family and Consumer Sciences; (O) Family Financial Issues; and (P) Open.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "690J",
        "title": "Seminar: Advances in Family and Consumer Sciences: Family Relations",
        "description": "Prerequisite: Graduate standing. Advanced study in Family and Consumer Sciences subject matter areas: (A) Nutrition; (B) Food Science; (C) Family Economics; (D) Family Management; (E) Textile Science; (F) Apparel and Human Behavior; (G) Environmental Design for Selected Populations; (H) Interior Design of Selected Settings; (I)Child Development; (J) Family Relations; (K) Consumer Economics; (L) Teacher Supervision; (M) Special Issues in Family and Consumer Sciences; (N) Innovative Teaching Techniques in Family and Consumer Sciences; (O) Family Financial Issues; and (P) Open.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "690K",
        "title": "Seminar: Advances in Family and Consumer Sciences: Consumer Economics",
        "description": "Prerequisite: Graduate standing. Advanced study in Family and Consumer Sciences subject matter areas: (A) Nutrition; (B) Food Science; (C) Family Economics; (D) Family Management; (E) Textile Science; (F) Apparel and Human Behavior; (G) Environmental Design for Selected Populations; (H) Interior Design of Selected Settings; (I)Child Development; (J) Family Relations; (K) Consumer Economics; (L) Teacher Supervision; (M) Special Issues in Family and Consumer Sciences; (N) Innovative Teaching Techniques in Family and Consumer Sciences; (O) Family Financial Issues; and (P) Open.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "694A",
        "title": "Supervised Field Study",
        "description": "Prerequisites: Graduate standing; Approval of advisor. Direct field experience in selected area of Family and Consumer Sciences related to business industry nutrition and dietetic areas and public service agencies. Written reports required include submission of a journal of activities performed during the semester a scholarly research paper and presentation based on current theory and concepts in business management or technology. Academic Internship includes 45-120 work hours in addition to regular seminar meetings. (Graded)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "696A",
        "title": "Directed Graduate Research",
        "description": "Prerequisites: Classified graduate standing; Approval of advisor. Investigation of a significant individual research problem.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "FCS",
        "catalog_number": "697C",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisites: Graduate standing; Classified status. For students who have completed all course requirements (30 units) for the Masters Degree and for those graduate students electing to take comprehensive examinations.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "FCS",
        "catalog_number": "698C",
        "title": "THESIS",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "FCS",
        "catalog_number": "114",
        "title": "INTRO INTERIOR DS",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "114L",
        "title": "Introduction to Interior Design Lab",
        "description": "Corequisite: FCS 114. Introductory survey of interior design. 1 hour lecture one 3-hour lab\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "217",
        "title": "INT DSGN STUDIO II",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "FCS",
        "catalog_number": "317",
        "title": "INT DSGN STUDIO IV",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "FCS",
        "catalog_number": "354",
        "title": "Apparel for Special Groups",
        "description": "Prerequisite: Upper Division standing. Study of clothing needs and desires of children the physically limited of all ages the aged and other special groups.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "371",
        "title": "Apparel Design: Flat Pattern",
        "description": "Prerequisite: FCS 150. Corequisite: FCS 371L. Principles of flat pattern design and their application in patternmaking. 2 hours lecture one 3-hour lab per week.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "371L",
        "title": "Apparel Design: Flat Pattern Lab",
        "description": "Prerequisite: FCS 150. Corequisite: FCS 371. Principles of flat pattern design and their application in patternmaking. 2 hours lecture one 3-hour lab per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "409",
        "title": "Geriatric Nutrition",
        "description": "Special problems of the aging population with regard to nutrient requirements food use and selection as well as government intervention programs related to nutrition. Non-majors taking this course must demonstrate that they have had sufficient experience in gerontology to benefit from the content.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "427",
        "title": "Consumer Advocacy and Education",
        "description": "Prerequisite: FCS 324. Concepts of consumer advocacy and protection with emphasis on educating consumer and analysis of strategies for resolving consumer conflicts.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "435",
        "title": "ADV ADM CHILD PRO",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "475",
        "title": "Fashion Development",
        "description": "Prerequisites: FCS 170 255 271/L; Senior or graduate standing. Corequisite: FCS 475L. Fashion products from conception through wholesale distribution. Existing and potential markets sources of inspiration procurement of materials manufacturing technology costing production scheduling pricing merchandising promotion and distribution at the wholesale level. 2 hours lecture one 3-hour lab per week.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "475L",
        "title": "Fashion Development Lab",
        "description": "Prerequisites: FCS 170 255 271/L; Senior or graduate standing. Corequisite: FCS 475. Fashion products from conception through wholesale distribution. Existing and potential markets sources of inspiration procurement of materials manufacturing technology costing production scheduling pricing merchandising promotion and distribution at the wholesale level. 2 hours lecture one 3-hour lab per week.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "FCS",
        "catalog_number": "476",
        "title": "Studio Problems in Apparel Design",
        "description": "Prerequisites: FCS 371/L 471/L; Senior or graduate status. Advanced study in apparel design and production with emphasis on application of theoretical concepts to specialized apparel. Students are required to design produce and present a design portfolio and a line of apparel. 8 hours of studio per week. May be repeated once for credit.\n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "496S",
        "title": "Experimental Topics Courses in Family and Consumer Sciences: Sustainability in FCS",
        "description": "Prerequisites: Senior status; Instructor consent. Experimental courses in areas of Family and Consumer Sciences.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "497",
        "title": "Fashion Show Production",
        "description": "Prerequisite: FCS 255 and instructor permission. This course is a study of the directing and coordinating of fashion promotions the functions of the fashion coordinators and the techniques and procedures for presenting fashion shows. The techniques will be developed through research and various components used by merchandisers and designers culminating with a successful annual fashion show.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "501",
        "title": "Advanced Food Chemistry and Analysis I",
        "description": "Prerequisites: CHEM 365L; FCS 401. Methods of modern analytical techniques and instruments used in food and nutrient analysis.\n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "FCS",
        "catalog_number": "543",
        "title": "Intergenerational Caregiving",
        "description": "Prerequisites: Senior or graduate standing. Comprehensive study and analysis of the history multicultural issues research academic and professional competencies required to establish direct teach and/or evaluate a quality intergenerational program for children and the elderly of varying abilities cultural and socioeconomic backgrounds.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "575",
        "title": "TEX TECH FOR ADM",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "595J",
        "title": "THRS FAM DEVLMT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "605",
        "title": "ETH SOC JUS NUTR",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "607",
        "title": "Carbohydrate",
        "description": "Lipid and Protein MetabolismPrerequisite: FCS 307 or possession of verification statement for Didactic Program in Dietetics. Recent advances in roles of carbohydrates lipids and proteins in human nutrition.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "635",
        "title": "Theories of Infant Development",
        "description": "Prerequisite: Graduate standing. Preparatory: FCS 330 or 335 or EPC 430. In-depth study of theory and research on infant development and care.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "640",
        "title": "Family Strengths",
        "description": "Prerequisite: Graduate standing. Preparatory: FCS 542. Study of the family system focusing on the resiliency coping strategies support systems and other factors that contribute to the strength and durability of the family unit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "685",
        "title": "DEC MAKG FCS",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "FCS",
        "catalog_number": "686",
        "title": "CUR ISSUES IN FCS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "FCS",
        "catalog_number": "690M",
        "title": "Seminar: Advances in Family and Consumer Sciences: Special Issues in FCS",
        "description": "Prerequisite: Graduate standing. Advanced study in Family and Consumer Sciences subject matter areas: (A) Nutrition; (B) Food Science; (C) Family Economics; (D) Family Management; (E) Textile Science; (F) Apparel and Human Behavior; (G) Environmental Design for Selected Populations; (H) Interior Design of Selected Settings; (I)Child Development; (J) Family Relations; (K) Consumer Economics; (L) Teacher Supervision; (M) Special Issues in Family and Consumer Sciences; (N) Innovative Teaching Techniques in Family and Consumer Sciences; (O) Family Financial Issues; and (P) Open.\n",
        "units": "3",
        "class_type": "SEM"
    }
]