[
    {
        "subject": "GEOG",
        "catalog_number": "101",
        "title": "The Physical Environment",
        "description": "Study of the natural environment–nature, distribution and relationships of climate, landforms, vegetation, hydrology and soils. (Available for General Education, B1 Physical Science.)\nNote: Students should only enroll in GEOG 101 if meeting the B3 Science Laboratory Activity in Life Science.",
        "units": "3",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "101A",
        "title": "Physical Environ",
        "description": "Corequisite: GEOG 101AL. Examines the natural environment including the distribution of and relationships between weather, climate, landforms, vegetation, hydrology, and soils. Students will learn critical skills to understand the processes shaping the physical world and gain an understanding of environmental and landscape change over time. Students may not receive credit for both GEOG 101A and GEOG 101. (Available for General Education, B1 Physical Science. Students satisfy the B3 Science Laboratory Activity requirement by completing GEOG 101AL.)",
        "units": "2",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "101AL",
        "title": "Physical Environ Lab",
        "description": "Corequisite: GEOG 101A. Examines the natural environment including the distribution of and relationships between weather, climate, landforms, vegetation, hydrology, and soils. Students will learn critical skills to understand the processes shaping the physical world and gain an understanding of environmental and landscape change over time. 2 hours lab. Students may not receive credit for both GEOG 101AL and GEOG 102. (Available for General Education, B3 Science Laboratory Activity. Students satisfy the B1 Physical Science requirement by completing GEOG 101A.)",
        "units": "1",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "102",
        "title": "Physical Geography Lab",
        "description": "Corequisite: GEOG 101. Observations, experiments and demonstrations designed to familiarize students with techniques utilized by physical geographers. 2 hours lab.\nNote: Students should enroll in GEOG 101A/AL instead of GEOG 101/102.",
        "units": "1"
    },
    {
        "subject": "GEOG",
        "catalog_number": "103",
        "title": "Weather",
        "description": "Study of atmospheric processes. (Available for General Education, B1 Physical Science.)\nNote: Students should only enroll in GEOG 103 if meeting the B3 Science Laboratory Activity in Life Science.",
        "units": "3",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "103A",
        "title": "Weather",
        "description": "Corequisite: GEOG 103AL. Explores the fundamental concepts of the dynamics of Earth’s atmosphere, its composition, and the processes and patterns of weather. The topics covered in this course include an examination of how Earth’s atmosphere is warmed and cooled, daily and seasonal temperature variations, the development and type of clouds, moisture (rain, snow, humidity, dew, fog), wind systems, air masses and fronts, and special topics such as thunderstorms, tornadoes, and hurricanes, as well as weather forecasting. Students may not receive credit for both GEOG 103A and GEOG 103. (Available for General Education, B1 Physical Science. Students satisfy the B3 Science Laboratory Activity requirement by completing GEOG 103AL.)",
        "units": "2",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "103AL",
        "title": "Weather Lab",
        "description": "Corequisite: GEOG 103A. Explores the fundamental concepts of the dynamics of Earth’s atmosphere, its composition, and the processes and patterns of weather. The topics covered in this course include an examination of how Earth’s atmosphere is warmed and cooled, daily and seasonal temperature variations, the development and type of clouds, moisture (rain, snow, humidity, dew, fog), wind systems, air masses and fronts, and special topics such as thunderstorms, tornadoes, and hurricanes, as well as weather forecasting. 2 hours lab. Students may not receive credit for both GEOG 103AL and GEOG 105. (Available for General Education, B3 Science Laboratory Activity. Students satisfy the B1 Physical Science requirement by completing GEOG 103A.)",
        "units": "1",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "105",
        "title": "Weather Lab",
        "description": "Corequisite: GEOG 103. Observations, experiments and demonstrations designed to familiarize students with the nature of California’s weather and climate. 2 hours lab per week.",
        "units": "1",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "107",
        "title": "Introduction To Human Geography",
        "description": "Examines the patterns and processes of human occupance of the Earth, with a focus on the U.S. Topics such as population, agriculture, language, religion, ethnicity, politics and economics are covered using the tools, methods and perspective of the geographer. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "111",
        "title": "Climate Change",
        "description": "Severe global climate change will have disastrous consequences for Earth’s population. This course will develop the basic science behind the predictions for Earth’s climate, and explain why human activities, primarily the emission of greenhouse gases, is the main driver of global warming. Course topics include the causes of climate change, its impacts, projections for the future, possible mitigation, and economic barriers imposed by the global capitalist system. 3 hours lecture per week. Students receive credit for only one course chosen from either GEOG 111, SUST 111, or SCI 111. (Available for General Education, B1 Physical Science. Students may satisfy the B3 Science Laboratory Activity requirement by completing GEOG 111L.)",
        "units": "3",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "111HON",
        "title": "Climate Change",
        "description": null,
        "units": "3"
    },
    {
        "subject": "GEOG",
        "catalog_number": "111L",
        "title": "Climate Change Lb",
        "description": "Corequisite: GEOG 111. Laboratory exercises include climate prediction modeling, the use of proxy data, and examination of the impacts of climate change. 3 hours lab per week. Students receive credit for only one course chosen from either GEOG 111L, SUST 111L, or SCI 111L. (Available for General Education, B3 Science Laboratory Activity requirement provided GEOG 111 is also completed.)",
        "units": "1",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "150",
        "title": "World Geography",
        "description": "Geographical survey of the world’s major regions, with emphasis on those features important to an understanding of current global concerns and problems. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "170",
        "title": "Water Resource Ca",
        "description": "This course examines the nature and challenges of California’s water resources. Topics include the physical attributes of water (sources, quantity, and quality), the underlying climatic and hydrologic processes that determine the surface and subsurface distribution of water, and the physical, social, economic and management issues that occur as California’s water resources face increasing pressure from agriculture, industry, and human populations and climate change. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "206",
        "title": "Introduction To Geographical Information Science",
        "description": "Corequisite: GEOG 206L. Introduction to fundamental concepts of geographical information science. Course will cover technical and context knowledge for basic spatial analysis, including data gathering, analysis and display through digital methods. Geographic Information Systems (GIS) will be used to explore spatial questions about environmental and social issues. Lab demonstrates these principles through hands-on experience with the dominant GIS software, ArcGIS. Students also will be exposed to other online GIS software applications. 2 hours lecture, 2 hours lab. (Available for General Education, E Lifelong Learning.) (IC)",
        "units": "2",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "206L",
        "title": "Introduction To Geographical Information Science Lab",
        "description": "Corequisite: GEOG 206L. Introduction to fundamental concepts of geographical information science. Course will cover technical and context knowledge for basic spatial analysis, including data gathering, analysis and display through digital methods. Geographic Information Systems (GIS) will be used to explore spatial questions about environmental and social issues. Lab demonstrates these principles through hands-on experience with the dominant GIS software, ArcGIS. Students also will be exposed to other online GIS software applications. 2 hours lecture, 2 hours lab. (Available for General Education, E Lifelong Learning.) (IC)",
        "units": "1",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "300",
        "title": "The Geographer&#8217;s Craft",
        "description": "Introduction to geography as a discipline, emphasizing its approach to analysis and problem solving, resources for conducting geographic research, methods for answering geographic questions, and techniques for communicating insights.",
        "units": "1",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "301",
        "title": "Cultural Geography",
        "description": "Prerequisites: Lower division course in the social sciences; Completion of the lower division writing requirement. Study of the literature, traditions and theories dealing with the human-environment relationship and an analysis of the approaches used by cultural geographers to elucidate the nature of this relationship. Major themes are the cultural landscape, cultural ecology and environmental perception. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "Lower division course in the social sciences; Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "304",
        "title": "Map And Image Int",
        "description": "Prerequisite: GEOG 101 or GEOG 101A or GEOG 150. Corequisite: GEOG 304L. Introduction to reading maps and interpreting aerial imagery. Emphasis on making simple measurements from maps and imagery, techniques of interpreting the physical and cultural landscape and elementary map-making. 2 hours lecture, 2 hours lab.",
        "units": "2",
        "prerequisites": "GEOG 101 or GEOG 101A or GEOG 150",
        "corequisites": "GEOG 304L"
    },
    {
        "subject": "GEOG",
        "catalog_number": "304L",
        "title": "Map Rd & Int Lab",
        "description": "Prerequisite: GEOG 101 or GEOG 101A or GEOG 150. Corequisite: GEOG 304L. Introduction to reading maps and interpreting aerial imagery. Emphasis on making simple measurements from maps and imagery, techniques of interpreting the physical and cultural landscape and elementary map-making. 2 hours lecture, 2 hours lab.",
        "units": "2",
        "prerequisites": "GEOG 101 or GEOG 101A or GEOG 150",
        "corequisites": "GEOG 304"
    },
    {
        "subject": "GEOG",
        "catalog_number": "305",
        "title": "Maps And Graphics",
        "description": "Corequisite: GEOG 305L. Preparatory: Lower division course in Geography or other relevant field. Design, use and preparation of maps and graphs. 2 hours lecture, 2 hours lab.",
        "units": "2",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "305L",
        "title": "Maps And Graphics Lab",
        "description": "Corequisite: GEOG 305L. Preparatory: Lower division course in Geography or other relevant field. Design, use and preparation of maps and graphs. 2 hours lecture, 2 hours lab.",
        "units": "2",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "306",
        "title": "Intermediate Geographical Information Science",
        "description": "Prerequisites: GEOG 206/L or instructor consent. Corequisite: GEOG 306L. Intermediate course on theories and application of geographical information science. Course will cover fundamental concepts of database management, spatial analysis and data creation. Geographic Information Systems (GIS) will be used to discover spatial relationships among environmental and social phenomena. Labs will provide an introduction to spatial data structures and raster-based applications of GIS. Labs offer hands-on experience with the dominant GIS software, ArcGIS. 2 hours lecture, 3 hours lab.",
        "units": "1",
        "prerequisites": "GEOG 206/L or instructor consent",
        "corequisites": "GEOG 306L"
    },
    {
        "subject": "GEOG",
        "catalog_number": "306L",
        "title": "Intermediate Geographical Information Science Lab",
        "description": "Prerequisites: GEOG 206/L or instructor consent. Corequisite: GEOG 306L. Intermediate course on theories and application of geographical information science. Course will cover fundamental concepts of database management, spatial analysis and data creation. Geographic Information Systems (GIS) will be used to discover spatial relationships among environmental and social phenomena. Labs will provide an introduction to spatial data structures and raster-based applications of GIS. Labs offer hands-on experience with the dominant GIS software, ArcGIS. 2 hours lecture, 3 hours lab.",
        "units": "2",
        "prerequisites": "GEOG 206/L or instructor consent",
        "corequisites": "GEOG 306"
    },
    {
        "subject": "GEOG",
        "catalog_number": "311",
        "title": "The Atmosphere",
        "description": "Prerequisites: GEOG 101 or GEOG 101A or GEOG 103 or GEOG 103A or ASTR 152 or GEOL 100 or GEOL 110 or GEOL 122; Completion of the lower division writing requirement. Explanations of rain, wind, smog, etc. Basic principles of energy transfer. 3 hours lecture. (Available for General Education, B5 Scientific Inquiry and Quantitative Reasoning.)",
        "units": "3",
        "prerequisites": "GEOG 101 or GEOG 101A or GEOG 103 or GEOG 103A or ASTR 152 or GEOL 100 or GEOL 110 or GEOL 122; Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "311L",
        "title": "The Atmosphere Lab",
        "description": "Prerequisites: GEOG 101 or GEOG 101A or GEOG 103 or GEOG 103A or ASTR 152 or GEOL 100 or GEOL 110 or GEOL 122; Completion of the lower division writing requirement. Explanations of rain, wind, smog, etc. Basic principles of energy transfer. 2 hours lab.",
        "units": "1",
        "prerequisites": "GEOG 101 or GEOG 101A or GEOG 103 or GEOG 103A or ASTR 152 or GEOL 100 or GEOL 110 or GEOL 122; Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "316",
        "title": "Environmental Geography",
        "description": "Prerequisite: Completion of the lower division writing requirement. Recommended Corequisite or Preparatory: GEOG 316L. Introduction to the principles of environmental geography with special emphasis on the connections between human activities and the physical (natural) environment. Emphasis will be placed on identifying the historical and contemporary impact of humans on the natural environment. 3 hours lecture. (Available for General Education, B5 Scientific Inquiry and Quantitative Reasoning.)",
        "units": "3",
        "prerequisites": "Completion of the lower division writing requirement",
        "corequisites": "GEOG 316L"
    },
    {
        "subject": "GEOG",
        "catalog_number": "318",
        "title": "Europe",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examination of the physical, historical, cultural, economic and political factors that have shaped the contemporary European landscapes. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "321",
        "title": "United States",
        "description": "Prerequisites: Lower division course in the social sciences; Completion of the lower division writing requirement. Regional and cultural geography of the U.S. emphasizing human-environment interaction and the evolution of contemporary geographical patterns of population distribution, resource exploitation, transportation, and agricultural and industrial production. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "Lower division course in the social sciences; Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "322",
        "title": "Latin America",
        "description": "Prerequisite: Completion of the lower division writing requirement. Spatial and ecological survey of the environment, cultures, economies and societies of the Latin American nations. Emphasizes the changing settlement geography and pays special attention to Brazil and the Andean countries. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "324",
        "title": "China",
        "description": "Prerequisite: Completion of the lower division writing requirement. Geographical analysis of the peoples and culture of China, emphasizing features important to an understanding of China’s cultural and regional diversity and contemporary problems. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "326",
        "title": "Africa",
        "description": "Prerequisite: Completion of the lower division writing requirement. Geographical analysis of the peoples and cultures of Africa, emphasizing features important to an understanding of Africa’s cultural and regional diversity and contemporary problems. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "330",
        "title": "California",
        "description": "Prerequisites: Lower division course in the social sciences; Completion of the lower division writing requirement. An exploration of the diverse physical and human landscapes of California. The course examines the state’s environmental context (climate, landforms, water, vegetation, wildlife, minerals); human imprints on the natural landscape (population, agriculture, industry, urbanization); and the physical and human challenges facing California today. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "Lower division course in the social sciences; Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "334",
        "title": "Geography Of Oceania",
        "description": "Prerequisite: Completion of the lower division writing requirement. Cultural and regional geography of Oceania, including Australia, New Zealand and the Pacific nations, territories and protectorates. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "340",
        "title": "Economic Geography",
        "description": "Prerequisite: Lower division course in Geography or ECON 160 or ECON 300. Principles governing spatial organization of society. Theoretical and empirical approaches to location of urban and rural settlement and economic activities. Spatial structures, their interrelationships and changes in organization.",
        "units": "3",
        "prerequisites": "Lower division course in Geography or ECON 160 or ECON 300",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "351",
        "title": "Urban Geography",
        "description": "Prerequisites: Lower division course in the social sciences; Completion of the lower division writing requirement. Geographical analysis of past and current patterns of world urbanization. Emphasis on city origins, growth, development and current problems. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "Lower division course in the social sciences; Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "364",
        "title": "Geog Ecosystems",
        "description": "Prerequisite: GEOG 101 or GEOG 101A. Corequisite: GEOG 364L. Major vegetative formations of the world, their soil (edaphic) and atmospheric environments, and the role of human activity in modification, destruction and replacement of vegetative structures and environments through purposeful and inadvertent activities. Examines local vegetative types on field trips. 2 hours lecture, 2 hours field activity.",
        "units": "3",
        "prerequisites": "GEOG 101 or GEOG 101A",
        "corequisites": "GEOG 364L"
    },
    {
        "subject": "GEOG",
        "catalog_number": "365",
        "title": "Geomorphology",
        "description": "Prerequisites: GEOG 101 or GEOG 101A or GEOL 101; Completion of the lower division writing requirement. Analytical and descriptive study of physical processes responsible for development and evolution of Earth’s surface features. Aspects of local geomorphology will be observed on field trips. 3 hours lecture. (Available for General Education, B5 Scientific Inquiry and Quantitative Reasoning.) (IC)",
        "units": "2",
        "prerequisites": "GEOG 101 or GEOG 101A or GEOL 101; Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "365L",
        "title": "Geomorphology Lab",
        "description": "Prerequisites: GEOG 101 or GEOG 101A or GEOL 101; Completion of the lower division writing requirement. Corequisite: GEOG 365. Analytical and descriptive study of physical processes responsible for development and evolution of Earth’s surface features. Aspects of local geomorphology will be observed on field trips. 2 hours field activity.",
        "units": "1",
        "prerequisites": "GEOG 101 or GEOG 101A or GEOL 101; Completion of the lower division writing requirement",
        "corequisites": "GEOG 365"
    },
    {
        "subject": "GEOG",
        "catalog_number": "366",
        "title": "Environ Hazards",
        "description": "Prerequisites: A lower division science course from Physical Geography, Geological Sciences, Physics, Chemistry, or Biology; completion of the lower division writing requirement. From a geographical perspective, comprehension of environmental hazards, their spatial distribution, their magnitude and frequency of occurrence and human perception of environmental hazards. Course emphasizes impact of environmental hazards on land utilization, settlement patterns, economic development and transportation systems. 3 hours lecture. (Available for General Education, B5 Scientific Inquiry and Quantitative Reasoning.)",
        "units": "3",
        "prerequisites": "A lower division science course from Physical Geography, Geological Sciences, Physics, Chemistry, or Biology; completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "366L",
        "title": "Envin Hazards Lab",
        "description": "Prerequisites: A lower division science course from Physical Geography, Geological Sciences, Physics, Chemistry, or Biology; completion of the lower division writing requirement. Corequisite: GEOG 366. Observations, experiments and demonstrations designed to familiarize students with the scientific investigation of environmental hazards. 2 hours lab.",
        "units": "1",
        "prerequisites": "A lower division science course from Physical Geography, Geological Sciences, Physics, Chemistry, or Biology; completion of the lower division writing requirement",
        "corequisites": "GEOG 366"
    },
    {
        "subject": "GEOG",
        "catalog_number": "370",
        "title": "Water Soc Env",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course critically examines the complex relationships between human societies and water. A broad understanding of the coupled natural and human systems and their dependence on water will be examined. Topics include the global distribution of water, hydrological cycle, water supply and demand, water policy and law, water and public health, and the economics of water. This course will conclude with an examination of the growing water/energy nexus and provide insight into the future of water on our planet. Relevant examples will be drawn from California, the United States and from around the world. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "404BC",
        "title": "Fld Std Foreign",
        "description": null,
        "units": "3"
    },
    {
        "subject": "GEOG",
        "catalog_number": "406",
        "title": "Advanced Geographical Information Science",
        "description": "Prerequisite: GEOG 306 or permission of instructor. Corequisite: GEOG 406L. This course will cover advanced topics in geographical information science. Students will investigate geographic data structures, advanced concepts in database design, algorithms for spatial data analysis, web-based mapping applications, customized applications, and implementation and management issues associated with Geographic Information Systems (GIS). Lab will demonstrate these issues through the use of GIS software packages. Available for graduate credit. 2 hours lecture, 3 hours lab.",
        "units": "1"
    },
    {
        "subject": "GEOG",
        "catalog_number": "406L",
        "title": "Advanced Geographical Information Science Lab",
        "description": "Prerequisite: GEOG 306 or permission of instructor. Corequisite: GEOG 406L. This course will cover advanced topics in geographical information science. Students will investigate geographic data structures, advanced concepts in database design, algorithms for spatial data analysis, web-based mapping applications, customized applications, and implementation and management issues associated with Geographic Information Systems (GIS). Lab will demonstrate these issues through the use of GIS software packages. Available for graduate credit. 2 hours lecture, 3 hours lab.",
        "units": "2",
        "prerequisites": "GEOG 306 or permission of instructor",
        "corequisites": "GEOG 406"
    },
    {
        "subject": "GEOG",
        "catalog_number": "407",
        "title": "Remote Sensing",
        "description": "Prerequisites: GEOG 304/L or GEOG 305/ L or GEOG 306/L or permission of the instructor. Corequisite: GEOG 407L. Theory and practice of remote sensing by satellites and aircraft in visible, infrared and microwave portions of the spectrum. Problem-oriented course emphasizing the application of image processing software and techniques to digital satellite imagery. Available for graduate credit. 2 hours lecture, 2 hours lab.",
        "units": "3",
        "prerequisites": "GEOG 304/L or GEOG 305/ L or GEOG 306/L or permission of the instructor",
        "corequisites": "GEOG 407L"
    },
    {
        "subject": "GEOG",
        "catalog_number": "407L",
        "title": "Remote Sensng Lab",
        "description": "Prerequisites: GEOG 304/L or GEOG 305/ L or GEOG 306/L or permission of the instructor. Corequisite: GEOG 407L. Theory and practice of remote sensing by satellites and aircraft in visible, infrared and microwave portions of the spectrum. Problem-oriented course emphasizing the application of image processing software and techniques to digital satellite imagery. Available for graduate credit. 2 hours lecture, 2 hours lab.",
        "units": "1",
        "prerequisites": "GEOG 304/L or GEOG 305/ L or GEOG 306/L or permission of the instructor",
        "corequisites": "GEOG 407"
    },
    {
        "subject": "GEOG",
        "catalog_number": "408B",
        "title": "Env Appl In Gis",
        "description": "Prerequisites: GEOG 306/L or permission of instructor. Corequisite: GEOG 408BL. Advanced applications of geographical information systems. Includes analysis of environmental hazards, animal and plant species distributions, distributions of archaeological sites, mineral exploration, forest inventory and management, navigation, hydrology, climatology, geomorphology. Project may result in the development of customized applications of software. Available for graduate credit. 2 hours lecture, 3 hours lab.",
        "units": "2",
        "prerequisites": "GEOG 306/L or permission of instructor",
        "corequisites": "GEOG 408BL"
    },
    {
        "subject": "GEOG",
        "catalog_number": "408D",
        "title": "Spatial Database Management",
        "description": "Prerequisites: GEOG 206/L or permission of instructor. Corequisite: GEOG 408DL. Advanced concepts in spatial database management. This course explores the management and design of spatial datasets and their association with Geographical Information Systems. Students will be introduced to concepts such as the principles of spatial database planning, design, implementation, and administration. Final projects will result in the development of a customized geospatial database. Available for graduate credit. 2 hours lecture, 3 hours lab.",
        "units": "2",
        "prerequisites": "GEOG 206/L or permission of instructor",
        "corequisites": "GEOG 408DL"
    },
    {
        "subject": "GEOG",
        "catalog_number": "408DL",
        "title": "Spatial Database Management Lab",
        "description": "Prerequisites: GEOG 206/L or permission of instructor. Corequisite: GEOG 408DL. Advanced concepts in spatial database management. This course explores the management and design of spatial datasets and their association with Geographical Information Systems. Students will be introduced to concepts such as the principles of spatial database planning, design, implementation, and administration. Final projects will result in the development of a customized geospatial database. Available for graduate credit. 2 hours lecture, 3 hours lab.",
        "units": "1",
        "prerequisites": "GEOG 206/L or permission of instructor",
        "corequisites": "GEOG 408D"
    },
    {
        "subject": "GEOG",
        "catalog_number": "408E",
        "title": "Gis Automation And Customization",
        "description": "Prerequisites: GEOG 306/L or permission of instructor. Corequisite: GEOG 408EL. This course exposes students to GIS automation using industry standard programming systems. Basic programming concepts and methodologies for customizing and/or extending the available functions in ArcGIS are introduced. Available for graduate credit. 1 hour lecture, 6 hours lab.",
        "units": "1",
        "prerequisites": "GEOG 306/L or permission of instructor",
        "corequisites": "GEOG 408EL"
    },
    {
        "subject": "GEOG",
        "catalog_number": "408EL",
        "title": "Gis Automation And Customization Lab",
        "description": "Prerequisites: GEOG 306/L or permission of instructor. Corequisite: GEOG 408EL. This course exposes students to GIS automation using industry standard programming systems. Basic programming concepts and methodologies for customizing and/or extending the available functions in ArcGIS are introduced. Available for graduate credit. 1 hour lecture, 6 hours lab.",
        "units": "2",
        "prerequisites": "GEOG 306/L or permission of instructor",
        "corequisites": "GEOG 408E"
    },
    {
        "subject": "GEOG",
        "catalog_number": "408F",
        "title": "Webgis",
        "description": "Prerequisites: GEOG 206/L or permission of instructor. Corequisite: GEOG 408FL. Introduction to the design, development, and implementation of interactive and accessible customized web-based GIS applications. The course provides an overview of conceptual and theoretical backgrounds of WebGIS system architecture and offers programming concepts and skill sets underlying development and implementation of distributed geographical information on the Internet. Available for graduate credit. 2 hours lecture, 3 hours lab.",
        "units": "2",
        "prerequisites": "GEOG 206/L or permission of instructor",
        "corequisites": "GEOG 408FL"
    },
    {
        "subject": "GEOG",
        "catalog_number": "408FL",
        "title": "Webgis Lab",
        "description": "Prerequisites: GEOG 206/L or permission of instructor. Corequisite: GEOG 408FL. Introduction to the design, development, and implementation of interactive and accessible customized web-based GIS applications. The course provides an overview of conceptual and theoretical backgrounds of WebGIS system architecture and offers programming concepts and skill sets underlying development and implementation of distributed geographical information on the Internet. Available for graduate credit. 2 hours lecture, 3 hours lab.",
        "units": "1",
        "prerequisites": "GEOG 206/L or permission of instructor",
        "corequisites": "GEOG 408F"
    },
    {
        "subject": "GEOG",
        "catalog_number": "409",
        "title": "Digital Cartography",
        "description": "Prerequisites: GEOG 305/L. Corequisite: GEOG 409L. Advanced design, use and presentation of maps and information graphics. Course will explore computer-assisted cartography in theory and practice. Topics will include cartographic communications, data acquisition and design for computer generated mapping. 2 hours lecture, 2 hours lab. Available for graduate credit.",
        "units": "2",
        "prerequisites": "GEOG 305/L",
        "corequisites": "GEOG 409L"
    },
    {
        "subject": "GEOG",
        "catalog_number": "409L",
        "title": "Digital Cartography Lab",
        "description": "Prerequisites: GEOG 305/L. Corequisite: GEOG 409L. Advanced design, use and presentation of maps and information graphics. Course will explore computer-assisted cartography in theory and practice. Topics will include cartographic communications, data acquisition and design for computer generated mapping. 2 hours lecture, 2 hours lab. Available for graduate credit.",
        "units": "1",
        "prerequisites": "GEOG 305/L",
        "corequisites": "GEOG 409"
    },
    {
        "subject": "GEOG",
        "catalog_number": "449",
        "title": "Mixed Methods Geog",
        "description": "Prerequisites: Lower division course in geography; Completion of the lower division writing requirement. Preparatory: GEOG 300. This course provides training in a selection of qualitative and quantitative methods and their applications in human and environmental geography. This is useful for research into human dimensions of space, place, and landscape; the human-environment interface; and socio-ecological processes. Through seminar-based discussions and assignments, students will examine methods such as: questionnaires; participant observation; interviews; archival maps; discourse analysis; and participatory, feminist, and community-based approaches to geographic information systems (GIS). There is emphasis on integrating these methods into the research design process and on writing analytical research papers. Available for graduate credit.",
        "units": "3",
        "prerequisites": "Lower division course in geography; Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "460",
        "title": "Spatial Analysis And Comparison",
        "description": "Prerequisite: GEOG 360 or equivalent. Corequisite: GEOG 460L. Statistical analysis of quantitative data by areas. Measurement of aggregation and concentration, description of a real distribution and gradients, and significance of similarities and differences. Available for graduate credit. 2 hours lecture, 2 hours lab.",
        "units": "2",
        "prerequisites": "GEOG 360 or equivalent",
        "corequisites": "GEOG 460L"
    },
    {
        "subject": "GEOG",
        "catalog_number": "460L",
        "title": "Spatial Analysis And Comparison Lab",
        "description": "Prerequisite: GEOG 360 or equivalent. Corequisite: GEOG 460L. Statistical analysis of quantitative data by areas. Measurement of aggregation and concentration, description of a real distribution and gradients, and significance of similarities and differences. Available for graduate credit. 2 hours lecture, 2 hours lab.",
        "units": "1",
        "prerequisites": "GEOG 360 or equivalent",
        "corequisites": "GEOG 460"
    },
    {
        "subject": "GEOG",
        "catalog_number": "490",
        "title": "Senior Project",
        "description": "Prerequisite: GEOG 300 or consent of instructor. Preparation of a research proposal and writing of a senior paper under close faculty supervision. Available for graduate credit.",
        "units": "3",
        "prerequisites": "GEOG 300 or consent of instructor",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "494",
        "title": "Internship",
        "description": "Prerequisite: GEOG major with senior standing. Upon prior approval of the Internship Coordinator, a student may earn 3 units of credit in the major for professional service as a geographer in a public agency or private organization. No more than 3 units may be applied to the major. Academic Internship course.",
        "units": "3",
        "prerequisites": "GEOG major with senior standing",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Independent Study",
        "units": "1",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "550F",
        "title": "Forensic Geography",
        "description": "Prerequisite: GEOG 306 or an additional statistics course; or permission of the instructor. This course is designed to help students learn how to use the tools and techniques of the forensic geographer so they may prepare to do research in criminology or prepare for careers in the criminal justice field. Class activities will be split between discussion of concepts and theories that apply to a spatial understanding of crime, and applications of statistical techniques/spatial analysis to crime data.",
        "units": "3",
        "prerequisites": "GEOG 306 or an additional statistics course; or permission of the instructor",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "600",
        "title": "Geographic Thought",
        "description": "Introductory seminar designed for first-year graduate students. Analysis of the trends in the theories, methods and problems pertinent to contemporary geography, including a review of the skills required for geographical research, analysis and writing.",
        "units": "3",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "630A",
        "title": "Environmental Studies: Environmental Geography",
        "description": "(A) Environmental Geography, (B) Biogeography, (C) Special Topics in Environmental Geography, (E) Human Impact on the Environment.",
        "units": "3",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "630C",
        "title": "Environmental Studies: Special Topics In Environmental Geography",
        "description": "(A) Environmental Geography (B) Biogeography (C) Special Topics in Environmental Geography (D) Ecosystem Studies (E) Human Impact on the Environment (F) Natural Resources.\n",
        "units": "3",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "630E",
        "title": "Environmental Studies: Human Impact On The Environment",
        "description": "(A) Environmental Geography (B) Biogeography (C) Special Topics in Environmental Geography (D) Ecosystem Studies (E) Human Impact on the Environment (F) Natural Resources.\n",
        "units": "3",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "650A",
        "title": "Urban Geography: Special Topics In Urban Geography",
        "description": "(A) Special Topics in Urban Geography, (C) Urban Social Geography, (D) Metropolitan Los Angeles.",
        "units": "3",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "650C",
        "title": "Urban Geography: Urban Social Geography",
        "description": "(A) Special Topics in Urban Geography (B) Housing and Community Development (C) Urban Social Geography (D) Metropolitan Los Angeles\n",
        "units": "3",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "690A",
        "title": "Geographic Information Science: Special Topics In Gis",
        "description": "Selected topics in digital mapping with course content to be determined. Can be taken twice for 6 units.\nCourse Title\nGEOG 690A Special Topics in GIS\nGEOG 690B Spatial Statistics\nGEOG 690D Remote Sensing\nGEOG 690E WebGIS\nGEOG 690G Applications in GIS\nGEOG 690J Foundations in Geographic Information Science",
        "units": "3",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "690B",
        "title": "Geographic Information Science: Spatial Statistics",
        "description": "(A) Special Topics in GIS : selected topics in digital mapping with course content to be determined.  Can be taken twice for six units. (B) Spatial Statistics. (C) Digital Cartography: Selected topics in digital cartography with course content to be determined. Can be taken twice for six units. (D) Remote Sensing. (E) Image Interpretation. (F) Methods in GIS. (G) Applications in GIS: selected topics in GIS applications with course content to be determined. Can be taken twice for six units. (H) Environmental Applications of GIS.\n",
        "units": "3",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "690E",
        "title": "Geographic Information Science: Image Interpretation",
        "description": "(A) Special Topics in GIS : selected topics in digital mapping with course content to be determined.  Can be taken twice for six units. (B) Spatial Statistics. (C) Digital Cartography: Selected topics in digital cartography with course content to be determined. Can be taken twice for six units. (D) Remote Sensing. (E) Image Interpretation. (F) Methods in GIS. (G) Applications in GIS: selected topics in GIS applications with course content to be determined. Can be taken twice for six units. (H) Environmental Applications of GIS.\n",
        "units": "3",
        "prerequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "696",
        "title": "Directed Graduate Research",
        "description": "To be taken near the end of the student’s graduate program and prior to GEOG 698. Supervised research leading to the development of a thesis topic, preparation of a preliminary bibliography and a formal thesis proposal, and selection of a faculty thesis committee.",
        "units": "3"
    },
    {
        "subject": "GEOG",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisite: GEOG 696. Focused readings followed by Comprehensive Exams under the direction of the students Committee. Only one enrollment permitted.\n",
        "units": "3",
        "prerequisites": "GEOG 696",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "698",
        "title": "Thesis",
        "description": "Prerequisite: GEOG 696. Researching and writing the master’s thesis, under the supervision of the student’s faculty thesis committee. Only one enrollment permitted.",
        "units": "3",
        "prerequisites": "GEOG 696",
        "corequisites": "None"
    },
    {
        "subject": "GEOG",
        "catalog_number": "699A",
        "title": "Independent Study",
        "description": "Prerequisite: Consent of instructor, graduate coordinator and department chair. Maximum of 3 units may be applied to the student’s program and only to the elective requirement in the Option 1 Program.",
        "units": "1",
        "prerequisites": "Consent of instructor, graduate coordinator and department chair",
        "corequisites": "None"
    }
]