[
    {
        "subject": "GEOL",
        "catalog_number": "101",
        "title": "Geology Of Planet Earth",
        "description": "Studies of the geologic materials and processes that shape our Earth and environment are explored as they relate to our everyday lives. Topics include global tectonics; earthquakes and other geologic hazards; glacial, river and coastal processes that form our landscapes; water, mineral and energy resources; and waste disposal and pollution.Students may not receive credit for both GEOL 100 and GEOL 101. 3 hours lecture, field trip. (Available for General Education, B1 Physical Science. Students may satisfy the B3 Science Laboratory Activity requirement by completing GEOL 102.)",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "102",
        "title": "Geology Of Planet Earth Lab",
        "description": "Recommended Corequisite or Preparatory: GEOL 100 or GEOL 101. Identification of rocks and minerals. Introduction to topographic maps and how they are used to interpret geologic processes and geologic history. Interpretation of geologic maps and data relating to earthquakes and plate tectonics. 3 hours lab, field trips. (Available for General Education, B3 Science Laboratory Activity requirement provided either GEOG 100 or GEOL 101 is completed.)",
        "units": "1",
        "prerequisites": "None",
        "corequisites": "GEOL 100 or GEOL 101"
    },
    {
        "subject": "GEOL",
        "catalog_number": "104",
        "title": "Living With Earthquakes In California",
        "description": "Not for credit in Geology major. Examines the revolution in earthquake hazard awareness that has occurred in California since the mid-1980’s when the scale of the earthquake hazard began to emerge from scientific discovery. Students will investigate the reciprocal ways in which science has informed the public, political and economic debate over the implications of earthquake hazard as well as exploring the manner by which public and political priorities have shaped the direction of scientific and engineering response to the hazard. Lecture 3 hours. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "106LRS",
        "title": "Earth And Space Science For Liberal Studies Majors",
        "description": "Prerequisite: Completion of the lower division writing requirement. Analysis of Earth systems (atmosphere, hydrosphere, lithosphere and biosphere), the solar system and the universe. Selected topics include structure and composition of the Earth; minerals and rocks; plate tectonics; landforms and surface processes; natural hazards, such as floods, earthquakes and volcanic eruptions; physical oceanography, the water cycle, weather and climate; formation of the universe and solar system; and evolution of stars and galaxies. 3 hours lecture per week. Available for Earth Science credit for Liberal Studies majors. (Cross-listed with GEOG 106LRS.)",
        "units": "3",
        "prerequisites": "Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "107",
        "title": "Geology Goes Hollywood",
        "description": "Corequisite: GEOL 107L. This online lecture explores how Earth science issues that impact society are depicted in film and television and how these depictions influence the viewers’ perceptions of Earth science. Students will learn fundamental concepts of Earth science, and how to evaluate the appropriateness and accuracy of Earth science portrayed in fictional and documentary film and television. (Available for General Education, B1 Physical Science. Students satisfy the B3 Science Laboratory Activity requirement by completing GEOL 107L.)",
        "units": "2",
        "prerequisites": "None",
        "corequisites": "GEOL 107L"
    },
    {
        "subject": "GEOL",
        "catalog_number": "107L",
        "title": "Geology Goes Hollywood Lab",
        "description": "Corequisite: GEOL 107. This online laboratory explores how Earth science issues that impact society are depicted in film and television and how these depictions influence the viewers’ perceptions of Earth science. Students will learn fundamental concepts of Earth science, and how to evaluate the appropriateness and accuracy of Earth science portrayed in fictional and documentary film and television. (Available for General Education, B3 Science Laboratory Activity. Students satisfy the B1 Physical Science requirement by completing GEOL 107.)",
        "units": "1",
        "prerequisites": "None",
        "corequisites": "GEOL 107"
    },
    {
        "subject": "GEOL",
        "catalog_number": "110",
        "title": "Earth And Life Through Time",
        "description": "Introduction to the dynamic study of the Earth’s evolution, including changes in the geosphere, biosphere, hydrosphere, and atmosphere. This course focusses on how these changes, woven into the fabric of geologic time, affected major groups of plants and animals, including dinosaurs and humans. Students may not receive credit for both GEOL 110 and GEOL 113. (Available for General Education, B1 Physical Science or B2 Life Science.)\nNote: Students should only enroll in GEOL 110 if they are taking a course other than GEOL 112 to meet the B3 Science Laboratory Activity requirement.",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "112",
        "title": "Earth And Life Through Time Lab",
        "description": "Corequisite: GEOL 113. Course content includes introduction to fossil, relative-age relationships and construction and interpretation of maps and cross-sections that emphasize paleogeography and sedimentary rocks. 3 hours lab, 1-day field trip. (Available for General Education, B3 Science Laboratory Activity requirement provided GEOL 113 is also completed.)",
        "units": "1",
        "prerequisites": "None",
        "corequisites": "GEOL 113"
    },
    {
        "subject": "GEOL",
        "catalog_number": "117",
        "title": "Geol Disasters",
        "description": "Corequisite: GEOL 117L. This lecture and lab combination explores the hazards associated with geological processes, including earthquakes, volcanoes, landslides, and flooding. Students will learn fundamental scientific concepts, evaluate risks posed by natural hazards, and assess potential mitigation strategies. (Available for General Education, B1 Physical Science. Students satisfy the B3 Science Laboratory Activity requirement by completing GEOL 117L.)",
        "units": "2",
        "prerequisites": "None",
        "corequisites": "GEOL 117L"
    },
    {
        "subject": "GEOL",
        "catalog_number": "117L",
        "title": "Geol Disasters Lab",
        "description": "Corequisite: GEOL 117. This lecture and lab combination explores the hazards associated with geological processes, including earthquakes, volcanoes, landslides, and flooding. Students will learn fundamental scientific concepts, evaluate risks posed by natural hazards, and assess potential mitigation strategies. (Available for General Education, B3 Science Laboratory Activity. Students satisfy the B1 Physical Science requirement by completing GEOL 117.)",
        "units": "1",
        "prerequisites": "None",
        "corequisites": "GEOL 117"
    },
    {
        "subject": "GEOL",
        "catalog_number": "122",
        "title": "The World Ocean",
        "description": "Introduction to the oceans. Evolution of the ocean basins, their environment and resources. Aspects of biological, chemical, geological and physical oceanography. (Available for General Education, B1 Physical Science. Students may satisfy the B3 Science Laboratory Activity requirement by completing GEOL 123.)",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "123",
        "title": "World Ocean Lab",
        "description": "Recommended Corequisite or Preparatory: GEOL 122. Introduction to oceanographic data, its collection and interpretation. 3 hours lab, field trips. (Available for General Education, B3 Science Laboratory Activity requirement provided GEOL 122 is also completed.)",
        "units": "1",
        "prerequisites": "None",
        "corequisites": "GEOL 122"
    },
    {
        "subject": "GEOL",
        "catalog_number": "300",
        "title": "Environmental Geology",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of the relationship between humans and the Earth and the application of geology to environmental problems. Topics include geological hazards, pollution, mineral and energy resources, land use planning and environmental impact. 3 hours lecture, field trips. (Available for General Education, B5 Scientific Inquiry and Quantitative Reasoning.)",
        "units": "3",
        "prerequisites": "Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "301",
        "title": "Environmental Geology Lab",
        "description": "Prerequisite: Completion of the lower division writing requirement. Recommended Corequisite or Preparatory: GEOL 300. An introduction to geologic materials and processes as they are applicable to the human environment. Included are practical exercises on rocks, minerals, geologic maps and water, mineral and energy resources. Earthquake, volcanic, landslide and flood hazard evaluations are also performed. 3 hours lab, field trips.",
        "units": "1",
        "prerequisites": "Completion of the lower division writing requirement",
        "corequisites": "GEOL 300"
    },
    {
        "subject": "GEOL",
        "catalog_number": "303",
        "title": "Communicating Geo",
        "description": "Prerequisite: Any 3-unit 100-level GEOL course. Scientific discoveries are only useful to the community if they are shared clearly, concisely, and convincingly. Scientists use different communications strategies based on the audience they are addressing, the purpose of their communication, and the mediums available to them. This course introduces students to a range of written, visual, and oral communications products that are common in geoscience. Students practice elements of effective communication by critiquing samples, creating their own products, and learning to revise them. 3 hours in class and 3 hours online assignments.",
        "units": "2",
        "prerequisites": "Any 3-unit 100-level GEOL course",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "306",
        "title": "Earth Mat",
        "description": "Prerequisite: Any 3-unit 100-level GEOL course. Corequisite: GEOL 306L. Recommended Preparatory: Any 100-level CHEM course. Study of the origin and distribution of the solid materials that comprise the Earth. Students will learn the physical and optical properties of minerals and use those properties to perform mineral and rock identifications. The course will emphasize placing earth materials in the context of the rock cycle and plate tectonic theory. Homework assignments organized around real data sets will simulate research experience and provide important problem solving opportunities. 3 hours lecture, 3 hours lab, field trip, fee required.",
        "units": "3",
        "prerequisites": "Any 3-unit 100-level GEOL course",
        "corequisites": "GEOL 306L"
    },
    {
        "subject": "GEOL",
        "catalog_number": "306L",
        "title": "Earth Mat Lab",
        "description": "Prerequisite: Any 3-unit 100-level GEOL course. Corequisite: GEOL 306L. Recommended Preparatory: Any 100-level CHEM course. Study of the origin and distribution of the solid materials that comprise the Earth. Students will learn the physical and optical properties of minerals and use those properties to perform mineral and rock identifications. The course will emphasize placing earth materials in the context of the rock cycle and plate tectonic theory. Homework assignments organized around real data sets will simulate research experience and provide important problem solving opportunities. 3 hours lecture, 3 hours lab, field trip, fee required.",
        "units": "1",
        "prerequisites": "Any 3-unit 100-level GEOL course",
        "corequisites": "GEO 306"
    },
    {
        "subject": "GEOL",
        "catalog_number": "307",
        "title": "Petrology",
        "description": "Prerequisites: GEOL 306/L, CHEM 101 and CHEM 101L. Corequisite: GEOL 307L. Introduction to the classification and origin of igneous and metamorphic rocks, including the optical properties of minerals. Lab study of these rocks utilizing hand-specimen characteristics and the petrographic microscope. 3 hours lecture, 3 hours lab, field trips, fee required.",
        "units": "2",
        "prerequisites": "GEOL 306/L, CHEM 101 and CHEM 101L",
        "corequisites": "GEOL 307L"
    },
    {
        "subject": "GEOL",
        "catalog_number": "307L",
        "title": "Petrology Lab",
        "description": "Prerequisites: GEOL 306/L, CHEM 101 and CHEM 101L. Corequisite: GEOL 307L. Introduction to the classification and origin of igneous and metamorphic rocks, including the optical properties of minerals. Lab study of these rocks utilizing hand-specimen characteristics and the petrographic microscope. 3 hours lecture, 3 hours lab, field trips, fee required.",
        "units": "1",
        "prerequisites": "GEOL 306/L, CHEM 101 and CHEM 101L",
        "corequisites": "GEO 307"
    },
    {
        "subject": "GEOL",
        "catalog_number": "309",
        "title": "Tectonics",
        "description": "Prerequisite: Any 3-unit 100-level GEOL course. Corequisite: GEOL 309L. Study of the basic principles of plate tectonics and structural geology that provide ways to interpret Earth’s interior. Topics will include the basics of plate tectonic theory, stress and strain, classification of structures, and structural-tectonic evolution of modern and ancient plate boundaries. 3 hours lecture, 3 hours lab, field trip, fee required.",
        "units": "3",
        "prerequisites": "Any 3-unit 100-level GEOL course",
        "corequisites": "GEOL 309L"
    },
    {
        "subject": "GEOL",
        "catalog_number": "309L",
        "title": "Tectonics Lab",
        "description": "Prerequisite: Any 3-unit 100-level GEOL course. Corequisite: GEOL 309L. Study of the basic principles of plate tectonics and structural geology that provide ways to interpret Earth’s interior. Topics will include the basics of plate tectonic theory, stress and strain, classification of structures, and structural-tectonic evolution of modern and ancient plate boundaries. 3 hours lecture, 3 hours lab, field trip, fee required.",
        "units": "1",
        "prerequisites": "Any 3-unit 100-level GEOL course",
        "corequisites": "GEO 309"
    },
    {
        "subject": "GEOL",
        "catalog_number": "310",
        "title": "Structural Geology",
        "description": "Prerequisites: GEOL 309/L. Corequisite: GEOL 310L. Study of rock deformational processes and resulting structures in the Earth’s crust. Lab work emphasizes the use of graphic methods to assist in the geometric and kinematic interpretation of rock structures. 3 hours lecture, 3 hours lab, field trip, fee required.",
        "units": "2",
        "prerequisites": "GEOL 309/L",
        "corequisites": "GEOL 310L"
    },
    {
        "subject": "GEOL",
        "catalog_number": "310L",
        "title": "Structural Geology Lab",
        "description": "Prerequisites: GEOL 309/L. Corequisite: GEOL 310L. Study of rock deformational processes and resulting structures in the Earth’s crust. Lab work emphasizes the use of graphic methods to assist in the geometric and kinematic interpretation of rock structures. 3 hours lecture, 3 hours lab, field trip, fee required.",
        "units": "1",
        "prerequisites": "GEOL 309/L",
        "corequisites": "GEO 310"
    },
    {
        "subject": "GEOL",
        "catalog_number": "313",
        "title": "Field Methods",
        "description": "Corequisite: GEOL 306/L. Study of and practice in techniques and methods of geologic field studies, including note taking, mapping, analysis of geologic history and structures, geologic illustration, and report writing. 3 hours per week and approximately 6 days of fieldwork (including overnight weekend trips). Fee required.",
        "units": "2",
        "prerequisites": "None",
        "corequisites": "GEOL 306/L"
    },
    {
        "subject": "GEOL",
        "catalog_number": "314",
        "title": "Earth Systems",
        "description": "Prerequisite: Any 3-unit 100-level GEOL course. Corequisite: GEOL 314L. This course focuses on the four Earth systems (geosphere, hydrosphere, atmosphere, and biosphere) and interactions between these systems and humankind. Major course topics include water and energy resources, global climate change, sedimentary processes at the Earth’s surface, and how the fossil record is used to understand Earth history and the geologic timescale. Special focus will be placed on feedbacks between each system and the role of humans in these interactions. The laboratory will reinforce and expand concepts introduced in the lecture. 3 hours lecture, 3 hours lab, field trips, fee required.",
        "units": "3",
        "prerequisites": "Any 3-unit 100-level GEOL course",
        "corequisites": "GEOL 314L"
    },
    {
        "subject": "GEOL",
        "catalog_number": "314L",
        "title": "Earth Systems Lab",
        "description": "Prerequisite: Any 3-unit 100-level GEOL course. Corequisite: GEOL 314L. This course focuses on the four Earth systems (geosphere, hydrosphere, atmosphere, and biosphere) and interactions between these systems and humankind. Major course topics include water and energy resources, global climate change, sedimentary processes at the Earth’s surface, and how the fossil record is used to understand Earth history and the geologic timescale. Special focus will be placed on feedbacks between each system and the role of humans in these interactions. The laboratory will reinforce and expand concepts introduced in the lecture. 3 hours lecture, 3 hours lab, field trips, fee required.",
        "units": "1",
        "prerequisites": "Any 3-unit 100-level GEOL course",
        "corequisites": "GEO 314"
    },
    {
        "subject": "GEOL",
        "catalog_number": "324",
        "title": "Dinosaurs",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course is a study of dinosaurs and the world in which they lived from the time of their first appearance to their extinction. The evolutionary patterns exhibited by dinosaurs are explored via an examination of their spatial and temporal distribution through time, considering connections to the evolving Mesozoic world’s paleogeography, paleoclimate, and paleo-environment as interpreted from the rock record. Topics include dinosaur origins, anatomy, reproduction, diets, diversity, and classification, as well as a survey of other vertebrate animals that lived at the same time. Hypotheses for dinosaur extinction are compared and contrasted. (Cross-listed with BIOL 324.) (Available for General Education B5, Scientific Inquiry and Quantitative Reasoning.)",
        "units": "3",
        "prerequisites": "Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "341",
        "title": "Sed/strat Lect",
        "description": "Prerequisites: GEOL 314/L. Corequisite: 341L. Introduction to the processes of sedimentation; the texture, composition and classification of sedimentary rocks; depositional environments; and stratigraphic sequences and correlation techniques. 3 hours lecture, 3 hours lab, field trips, fee required.",
        "units": "2",
        "prerequisites": "GEOL 314/L",
        "corequisites": "341L"
    },
    {
        "subject": "GEOL",
        "catalog_number": "341L",
        "title": "Sed/strat Lab",
        "description": "Prerequisites: GEOL 314/L. Corequisite: 341L. Introduction to the processes of sedimentation; the texture, composition and classification of sedimentary rocks; depositional environments; and stratigraphic sequences and correlation techniques. 3 hours lecture, 3 hours lab, field trips, fee required.",
        "units": "1",
        "prerequisites": "GEOL 314/L",
        "corequisites": "341L"
    },
    {
        "subject": "GEOL",
        "catalog_number": "344",
        "title": "California Geol",
        "description": "Prerequisite: Completion of the lower division writing requirement. Investigations of aspects of California geology. California-related topics may include: plate tectonic history, earthquakes, geologic hazards, geology of national parks, climate record and hydrogeology. (Available for General Education, B5 Scientific Inquiry and Quantitative Reasoning.) (IC)",
        "units": "3",
        "prerequisites": "Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "406LRS",
        "title": "Liberal Studies Science Experience Capstone",
        "description": "Prerequisites: BIOL 100, BIOL 101 or BIOL 102; PHSC 170; GEOL 106LRS or GEOG 106LRS. This laboratory course serves as a culminating science experience for Liberal Studies majors in the Pre-Credential and ITEP options. An interdisciplinary blend of biology, physics, chemistry, and Earth and space sciences from lower division courses will be integrated into the course as various topics are explored through the broad lens of Earth science. Hands-on investigations will include topics linked to California K-6 State Science Standards, such as the nature of science, astronomy and the solar system, solar energy and meteorology, the water cycle, fossils and the evolution of life, rocks and minerals, natural resources, plate tectonics and Earth’s structure, earthquakes and volcanic eruptions, and geomorphology. 3 hours lab.",
        "units": "1",
        "prerequisites": "BIOL 100, BIOL 101 or BIOL 102; PHSC 170; GEOL 106LRS or GEOG 106LRS",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "490",
        "title": "Senior Capstone",
        "description": "Prerequisites: GEOL 303, GEOL 306, GEOL 309, GEOL 313, GEOL 314; B.S. Geology majors only. Students engage in a semester-long case study problem where a community must make a decision about how to effectively use a geologically complex site such as an eroding coastline, a contaminated industrial site, or a landfill facing landslides (topics change yearly). Students work in collaborative teams to investigate the geologic, economic, social, and political factors that affect that decision.",
        "units": "3",
        "prerequisites": "GEOL 303, GEOL 306, GEOL 309, GEOL 313, GEOL 314; B",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "497",
        "title": "Research Methods And Design",
        "description": "Preparatory: Junior or senior standing; Instructor consent. Students are advised and guided in research methods and design. Students use critical reasoning and the scientific method to develop and write their own research proposal to execute the project for their senior thesis. The written proposal is patterned after those required by the National Science Foundation.",
        "units": "1",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "498",
        "title": "Senior Thesis",
        "description": "Prerequisites: GEOL 497; Instructor consent. Following approval by the thesis advisor of a written proposal, the student completes an original research project in consultation with the faculty advisor. Upon completion of the research, the student will submit the written thesis to the advisor and give an oral presentation to the Department of Geological Sciences.",
        "units": "3",
        "prerequisites": "GEOL 497; Instructor consent",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "See Independent Study under Courses of Study. Cannot be used for General Education credit.",
        "units": "1",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "533",
        "title": "Geology Of Earthquakes",
        "description": "Preparatory: GEOL 310. Lecture topics will include a review of plate tectonics, rock mechanics, seismology, tectonic geodesy, paleoseismology, tectonic geomorphology and seismic hazard assessment. Detailed discussions will include study of recent major earthquakes that have occurred in strike-slip, thrust-reverse, megathrust (subduction zone) and normal-fault tectonic settings. Labs will include study of air photos, geologic maps, trench logs and core descriptions from studies of recent earthquakes, and the collection and analysis of field data used in earthquake studies. 2 hours lecture, 3 hours lab, field trips.",
        "units": "2",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "533L",
        "title": "Geology Of Earthquakes Lab",
        "description": "Preparatory: GEOL 310. Lecture topics will include a review of plate tectonics, rock mechanics, seismology, tectonic geodesy, paleoseismology, tectonic geomorphology and seismic hazard assessment. Detailed discussions will include study of recent major earthquakes that have occurred in strike-slip, thrust-reverse, megathrust (subduction zone) and normal-fault tectonic settings. Labs will include study of air photos, geologic maps, trench logs and core descriptions from studies of recent earthquakes, and the collection and analysis of field data used in earthquake studies. 2 hours lecture, 3 hours lab, field trips.",
        "units": "1",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "536",
        "title": "Igneous Petrology",
        "description": "Corequisite: GEOL 536L. Preparatory: GEOL 307. Study of the more important kinds of igneous rocks, emphasizing distribution, origin, causes of compositional variation and relation to tectonic factors. Representative rock suites and computer techniques are studied in the lab. 3 hours lecture, 3 hours lab, field trips.",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "GEOL 536L"
    },
    {
        "subject": "GEOL",
        "catalog_number": "548",
        "title": "Seismology",
        "description": "Prerequisite: MATH 150A or MATH 255A. Corequisite: GEOL 548L. Recommended Preparatory: GEOL 101, MATH 280. This course provides an introduction to fundamental concepts in seismology and the study of elastic waves in the solid earth. Topics include: seismic wave equation, stress/strain theory, ray theory, tomography, reflection seismology, body waves, surface waves, source theory, anisotropy, inverse problems, signal processing, and introduction to normal modes. Concepts will be approached through lectures, scientific readings, group projects, analysis of seismic data sets, and study of basic seismology theory. Designed for upper-level undergraduate and graduate students in geology, geophysics, and related sciences. 3 hours lecture, 3 hours lab.",
        "units": "2",
        "prerequisites": "MATH 150A or MATH 255A",
        "corequisites": "GEOL 548L"
    },
    {
        "subject": "GEOL",
        "catalog_number": "548L",
        "title": "Seismology Lab",
        "description": "Prerequisite: MATH 150A or MATH 255A. Corequisite: GEOL 548L. Recommended Preparatory: GEOL 101, MATH 280. This course provides an introduction to fundamental concepts in seismology and the study of elastic waves in the solid earth. Topics include: seismic wave equation, stress/strain theory, ray theory, tomography, reflection seismology, body waves, surface waves, source theory, anisotropy, inverse problems, signal processing, and introduction to normal modes. Concepts will be approached through lectures, scientific readings, group projects, analysis of seismic data sets, and study of basic seismology theory. Designed for upper-level undergraduate and graduate students in geology, geophysics, and related sciences. 3 hours lecture, 3 hours lab.",
        "units": "1",
        "prerequisites": "MATH 150A or MATH 255A",
        "corequisites": "GEO 548"
    },
    {
        "subject": "GEOL",
        "catalog_number": "552",
        "title": "Geochemistry",
        "description": "Preparatory: GEOL 307 or instructor consent. Application of the principles of chemistry to geological problems. Topics include nucleosynthesis, origin of the solar system, elemental distribution, and stable and unstable isotopes. 3 hours lecture.",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "575",
        "title": "Hydrogeology",
        "description": "Corequisite: GEOL 575L. Preparatory: Upper division standing in Geology; Formal geologic field reports, including geologic maps and cross-sections, one for GEOL 430A and one for GEOL 430B. Students must enroll in both courses during the same Summer session. Available for graduate credit.",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "GEOL 575L"
    },
    {
        "subject": "GEOL",
        "catalog_number": "575L",
        "title": "Hydrogeology Lab",
        "description": "Corequisite: GEOL 575L. Preparatory: Upper division standing in Geology; Formal geologic field reports, including geologic maps and cross-sections, one for GEOL 430A and one for GEOL 430B. Students must enroll in both courses during the same Summer session. Available for graduate credit.",
        "units": "1",
        "prerequisites": "None",
        "corequisites": "GEO 575"
    },
    {
        "subject": "GEOL",
        "catalog_number": "590",
        "title": "Lit Seminar",
        "description": "Preparatory: Senior undergraduate or graduate standing in Geological Sciences. Students will make oral presentations of and lead discussions about current research literature in geological sciences.",
        "units": "1",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "694",
        "title": "Grad Res Design",
        "description": "Instruction and practice in the process required to construct a research proposal, culminating in the development of a graduate-level research proposal suitable as a master’s thesis project.",
        "units": "1",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "696C",
        "title": "Directed Graduate Research",
        "description": "Directed Graduate Research",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "698C",
        "title": "Thesis Or Graduate Project",
        "description": "Thesis or Graduate Project",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "GEOL",
        "catalog_number": "699A",
        "title": "Independent Study",
        "description": "See Independent Study under Courses of Study. Cannot be used for General Education credit.",
        "units": "1",
        "prerequisites": "None",
        "corequisites": "None"
    }
]