[
    {
        "subject": "GWS",
        "catalog_number": "100",
        "title": "Introduction to Gender and Women’s Studies",
        "description": "Interdisciplinary study of women in American society, including such topics as social conditions, laws, symbols, values, communication and power. (Available for General Education, C2 Humanities or F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "GWS",
        "catalog_number": "110",
        "title": "Women, Work, and Family",
        "description": "Focuses on historical and contemporary relationship between home and community work and the marketplace within which women perform. Examines the differences in experience of work and family as these are shaped by race, class, gender and sexuality. (Available for General Education, D1 Social Sciences or F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "GWS",
        "catalog_number": "220",
        "title": "Men, Masculinity and Patriarchy",
        "description": "Recommended Preparatory: GWS 100. This course provides a multidisciplinary investigation of ways in which masculinity is constructed in the context of fatherhood, media, sports, fraternities, law, militarization, racialization, state violence and men’s movements. The course evaluates and critically analyzes how male identities are created, negotiated and explicated in theories of gender, sexuality, ethnicity, race and class. Of particular interest is the way social institutions sustain and elaborate how masculinity is organized and what it has come to mean. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "GWS",
        "catalog_number": "300",
        "title": "Women as Agents of Change",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: GWS 100 or GWS 110, or consent of instructor. New definitions and options for women within the family, community and society. Students study and report on women’s resources and organizations for change within the local community, as well as on the national and international scene. (Available for General Education, D1 Social Sciences or F Comparative Cultural Studies.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "GWS",
        "catalog_number": "301",
        "title": "Feminist Theories",
        "description": "Prerequisite: GWS 100, or GWS 110 or GWS 300 or instructor consent. This required course for Gender and Women Studies majors and minors concentrates on the multitude of feminist theories, from the early feminist theories to the more contemporary and complex theories by a diversity of theorists, within the U.S. and globally.",
        "units": "3",
        "prerequisites": "{{GWS 100} || {GWS 110} || {GWS 300} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "GWS",
        "catalog_number": "302",
        "title": "Feminist Methods",
        "description": "Prerequisite: GWS 100 or GWS 110 or GWS 300 or instructor consent. In this course, students will be introduced to qualitative and quantitative research methods. The course will provide an overview of some of the critical concepts in the history of feminist research (e.g., feminist empiricism, feminist standpoint, inclusion of difference) and debates surrounding epistemology and methodology. The course will examine and evaluate interdisciplinary feminist research that have been proposed as uniquely suited for gender and women’s studies, as well as its proposed elements, goals and politics.",
        "units": "3",
        "prerequisites": "{{GWS 100} || {GWS 110} || {GWS 300} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "GWS",
        "catalog_number": "305",
        "title": "Gender and Women’s Studies Community Service",
        "description": "Prerequisite: Completion of the lower division writing requirement. Students work in a variety of community settings—educational, political and/or social service agencies—to apply theoretical understanding of gender and women’s studies to practical and concrete community situations that affect women’s daily lives. Includes regular class meetings. Offers a community service opportunity with activities relating to concepts and theories presented. (Available for General Education, E Lifelong Learning.)",
        "units": "1",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "GWS",
        "catalog_number": "305CS",
        "title": "Gender and Women’s Studies Community Service",
        "description": "Prerequisite: Completion of the lower division writing requirement. Students work in a variety of community settings—educational, political and/or social service agencies—to apply theoretical understanding of gender and women’s studies to practical and concrete community situations that affect women’s daily lives. Includes regular class meetings. Offers a community service opportunity with activities relating to concepts and theories presented. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "GWS",
        "catalog_number": "320",
        "title": "Women and Urban Life/Urban Space",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examines the gendered use of space and how women have balanced and crossed public and private spheres. Examines women and urban issues from the micro-level (community-based organizations and grassroots mobilizations) to the macro-level (national and international states and corporate entities). (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "GWS",
        "catalog_number": "340",
        "title": "Women, Gender and Global Development",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examines women’s roles and concerns in socioeconomic and political development processes. Positive and negative effects of colonization, post-colonial modernization, democratization and capitalist and socialist development strategies on women in the “Third,” “Second,” and “First” World countries are examined. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "GWS",
        "catalog_number": "351",
        "title": "Gender, Race, Class and Sexuality",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examines historical and contemporary issues surrounding the diversity of women living in the U.S. and other cultures. Gender, race, socioeconomic class and sexuality are presented as central theoretical concepts and as conditions of experience that affect all women and men, as well as being primary categories of social relations for us all cross-culturally. (Available for General Education, C2 Humanities or D1 Social Sciences or F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "GWS",
        "catalog_number": "370",
        "title": "Women and Violence",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course focuses on dimensions of violence women experience in the U.S. and internationally. It provides an overview of sexual violence, including rape in intimate partnerships, childhood sexual assault, sexual harassment, sex trafficking and violence against women under foreign occupation. Varied feminist scholarship around three broad areas will be covered: Sexual Violence Against Women; Physical Violence Against Women; and Perpetrators of Violence Against Women. The course includes an examination of case studies that illumine domestic abuse, judicial abuse and war rape among others. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "GWS",
        "catalog_number": "400",
        "title": "Senior Seminar in Gender and Women’s Studies",
        "description": "Prerequisite: GWS 301. This course is a culmination (capstone) of the students’ undergraduate studies and will not necessarily introduce new topics. Instead, students reflect on and review important women’s studies theories, key principles and questions. Each student conducts a research project applying feminist methodology and writes a research paper on a topic within the discipline. The purpose of this course is to review the cross-cultural and international literature in women’s studies/feminist studies as well as to equip students for graduate school and/or the work setting. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{GWS 301}",
        "corequisites": "{None}"
    },
    {
        "subject": "GWS",
        "catalog_number": "410",
        "title": "Sex, Lies and Media",
        "description": "In this course, students employ critical perspectives to examine narrow definitions of gender/sexuality constructed in media representations. Students deconstruct norms of masculinity and femininity generated by industries such as television, film and advertising that perpetuate and naturalize the commodification of women’s bodies. Special attention is paid to bodies and modes of sexuality that transgress (representations of the queer body, for example). Students also construct alternative imagery and generate new ideas about gender and sexuality through discussion and various projects. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "GWS",
        "catalog_number": "420",
        "title": "Women and Gender in Islamic Societies",
        "description": "This interdisciplinary and cross-cultural course explores how religious authorities, and scriptural and legal sources have contributed to the status and legal rights of women and to the construction of theories, laws and practices concerning gender roles and sexuality in the Islamic tradition. Students study how these constructed gender roles, sexual norms and attitudes have reflected, resisted or changed in response to modern cultural, social, economic and political changes. The course examines how Muslim women themselves have sought to articulate and define their roles and identities. What has been the impact of modernity, modernization, colonialism, nationalism, democratization and globalization, especially the global feminist movements, on the status of Muslim women and gender relations? What is the impact of the recent waves of Islamist movements (“fundamentalism”), the identity politics, and politics of the veil on women and the gender arrangement in Muslim societies? Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]