[
    {
        "subject": "JAPN",
        "catalog_number": "101",
        "title": "Elementary Japanese I",
        "description": "Prerequisite: Not open to students with oral and writing proficiency or who attended schools where Japanese was the language of instruction. Study of the fundamentals of Japanese, including grammatical structure, reading and practice in the spoken language. May not be challenged by exam. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Not open to students with oral and writing proficiency or who attended schools where Japanese was the language of instruction}",
        "corequisites": "{None}"
    },
    {
        "subject": "JAPN",
        "catalog_number": "102",
        "title": "Elementary Japanese II",
        "description": "Prerequisite: JAPN 101 or instructor consent. Not open to students with oral and writing proficiency or who attended schools where Japanese was the language of instruction. Continuation of the study of the fundamentals of Japanese, including grammatical structures, reading and practice in the spoken language. May not be challenged by exam. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "4",
        "prerequisites": "{{JAPN 101} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JAPN",
        "catalog_number": "201",
        "title": "Intermediate Japanese I",
        "description": "Prerequisite: JAPN 102 or equivalent. Japanese students with sufficient oral fluency and knowledge of fewer than 100 kanji may enroll in 201 only. Study of grammar, sentence patterns and writing. May not be challenged. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{JAPN 102}",
        "corequisites": "{None}"
    },
    {
        "subject": "JAPN",
        "catalog_number": "202",
        "title": "Intermediate Japanese II",
        "description": "Prerequisite: JAPN 201 or equivalent. Students with sufficient oral proficiency and knowledge of fewer than 250 kanji may enroll in 202 only. May not be challenged. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "2",
        "prerequisites": "{JAPN 201}",
        "corequisites": "{None}"
    },
    {
        "subject": "JAPN",
        "catalog_number": "204",
        "title": "Kanji II",
        "description": "Prerequisite: JAPN 102 or equivalent. Can be taken concurrently with JAPN 201. Students learn to read and write 500 basic kanji characters, and learn to use them in context. The course will provide students with the opportunity to further their study of Japanese language and culture and to increase functional language competence. Reading comprehension and writing skills will be targeted with the use of readings, compositions and exercises, including web-based programs and reading materials. The course will include formal study of language structure, although not as the central focus of the course content. The course will be particularly helpful to students planning on learning as many kanji as possible, and eventually all the 1,950 “Kanji for Common Use.” (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{JAPN 102}",
        "corequisites": "{None}"
    },
    {
        "subject": "JAPN",
        "catalog_number": "205",
        "title": "Kanji III",
        "description": "Prerequisite: JAPN 201 or equivalent. Can be taken concurrently with JAPN 202. Students learn to read and write 750 kanji, and learn to use them in context. The course will provide students with the opportunity to further their study of Japanese language and culture and to increase functional language competence. Reading comprehension and writing skills will be targeted with the use of readings, compositions and exercises, including web-based programs and reading materials. The course will include formal study of language structure, although not as the central focus of the course content. The course will be particularly helpful to students planning on learning as many kanji as possible, and eventually all the 1,950 “Kanji for Common Use.”",
        "units": "3",
        "prerequisites": "{JAPN 201}",
        "corequisites": "{None}"
    },
    {
        "subject": "JAPN",
        "catalog_number": "300",
        "title": "Advanced Japanese Conversation",
        "description": "Prerequisite: Completion of second year sequence in Japanese. Designed to develop further the students’ ability to express themselves in spoken Japanese. Strongly recommended for students planning to participate in study abroad programs in Japan.",
        "units": "3",
        "prerequisites": "{Completion of second year sequence in Japanese}",
        "corequisites": "{None}"
    },
    {
        "subject": "JAPN",
        "catalog_number": "304",
        "title": "Advanced Grammar and Composition",
        "description": "Prerequisite: Completion of second year sequence in Japanese. Consisting of advanced studies in grammar, syntax, and kanji characters, with composition exercises designed to develop the students’ command of the written language.",
        "units": "3",
        "prerequisites": "{Completion of second year sequence in Japanese}",
        "corequisites": "{None}"
    },
    {
        "subject": "JAPN",
        "catalog_number": "305",
        "title": "Language and Culture in Japanese",
        "description": "Prerequisite: JAPN 300 or equivalent. Practice in communication utilizing grammatical and socio-linguistic studies. Through video presentation, role play, interpretation exercises and other activities, the students describe the situation, identify any problems and practice solving problems or accomplishing goals in a non-confrontational manner appropriate in the Japanese social context.",
        "units": "3",
        "prerequisites": "{JAPN 300}",
        "corequisites": "{None}"
    },
    {
        "subject": "JAPN",
        "catalog_number": "306",
        "title": "Advanced Reading and Composition",
        "description": "Prerequisite: JAPN 304 or equivalent. Aims to increase balanced skills in reading and writing. Focuses on various aspects of Japanese society and values. Designed to develop ability to address intercultural differences and resulting problems.",
        "units": "3",
        "prerequisites": "{JAPN 304}",
        "corequisites": "{None}"
    },
    {
        "subject": "JAPN",
        "catalog_number": "400",
        "title": "Japanese Language and Society",
        "description": "Prerequisite: JAPN 304 or equivalent. The goal of this course is for students to learn how the Japanese people and society are depicted in the media, and to use Japanese skills for authentic communication purposes. The course will focus on advanced grammar, idioms and reading comprehension skills, enabling students to become better able to express themselves and comprehend both spoken and written Japanese. The course will cover 250 new kanji characters. The course will be conducted through interactive group/pair activities and discussions, as well as written and web-based assignments. Students also will engage in collaborative projects with a partner class at a Japanese university.",
        "units": "3",
        "prerequisites": "{JAPN 304}",
        "corequisites": "{None}"
    },
    {
        "subject": "JAPN",
        "catalog_number": "401",
        "title": "Introduction To Literature In Japanese",
        "description": "Prerequisite: JAPN 400 or equivalent. In this course students read authentic work of literature beginning with poetry essays and short stories. The goal of this course is for students to improve their facility to read and to recognize the subtle differences in the ways Japanese and Americans communicate interact and live their lives. This course focuses on 250 new kanji characters advanced grammar idioms and reading comprehension skills enabling students to become better able to comprehend both spoken and written Japanese and express themselves. The course is conducted through interactive group/pair activities discussions and written and web-based assignments such as listening to podcast readings of a literary work.\n",
        "units": "3",
        "prerequisites": "{JAPN 400}",
        "corequisites": "{None}"
    }
]