[
    {
        "subject": "JS",
        "catalog_number": "100",
        "title": "JEWISH REL CULTR",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JS",
        "catalog_number": "151",
        "title": "Natural Environment in Judaism",
        "description": "Corequisite: RTM 151F. An examination of teachings on the natural environment found in Jewish literature and oral teachings with an emphasis on values and practices related to respect for natural life and environmental conservation. Arranged wilderness field trips are required.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "JS",
        "catalog_number": "210",
        "title": "History of the Jewish People",
        "description": "Study of the Jewish people from their beginning in the ancient Near East to the establishment of the modern state of Israel. (Cross listed with HIST 210) (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JS",
        "catalog_number": "300",
        "title": "Humanities in Jewish Society: Ancient and Medieval",
        "description": "Preparatory: Completion of Lower Division writing requirement. Study of ancient and medieval Jewish culture examining literature art and architecture law music philosophy and science. Their distinctive genres styles methods of inquiry and creative processes are examined as are the links between these areas of Jewish culture and their contribution to and dependence on similar expressions in non-Jewish cultures. Regular written assignments are required. (Available for General Education Arts and Humanities.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JS",
        "catalog_number": "306",
        "title": "JEWSH FAML + COMM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JS",
        "catalog_number": "318",
        "title": "Jewish Ethics and Society",
        "description": "Prerequisite: Completion of lower-division writing requirement. An investigation of Jewish social ethics using social-scientific methods from history and sociology. Students learn how ethical positions change over time and interact with their particular social economic and cultural environments. Examples are taken from biblical rabbinic Ashkenazic and Sephardic sources. Topics include ethics of business war and conflict medical ethics social welfare and philanthropy and discrimination and theother. (Available for General Education: Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JS",
        "catalog_number": "330",
        "title": "Women in the Jewish Experience",
        "description": "Preparatory: Completion of Lower Division writing requirement. Examines a minority culture -- women in Jewish communities from antiquity to the present. Course perspective is international with significant focus on Mediterranean West Asian and African Jewish societies. Contemporary topics such as sexuality creative ritual Israeli/Palestinian politics and body image also are discussed. (Cross listed with GWS 330.) (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JS",
        "catalog_number": "390CS",
        "title": "Service Learning in the Jewish Community",
        "description": "Prerequisite: Instructor consent. Preparatory: Completion of Lower Division writing requirement. Work experience in Jewish schools synagogues social welfare or political organizations. Faculty supervisor assists students in obtaining appropriate work placements. Work experience is complemented by academic study and written assignments offers a community service opportunity with service learning activities relating to concepts and theories presented. Requires 100 hours of community-based field work. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "JS",
        "catalog_number": "409",
        "title": "History of the Jews in the Modern Era",
        "description": "A history of the Jewish people from the 17th century to the present. Principal themes include the transformation of the traditional community the changes in Jews political status the emergence of modern antisemitism and ethnic and gender distinctions within Jewry. (Cross listed with HIST 409.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JS",
        "catalog_number": "335",
        "title": "JEWSH IDENTITY US",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JS",
        "catalog_number": "357",
        "title": "HIST OF HOLOCAUST",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JS",
        "catalog_number": "392IP",
        "title": "ISRAEL: JEWISH RED",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JS",
        "catalog_number": "427",
        "title": "Israel&#8217;s History and Peoples",
        "description": "A history of the modern State of Israel from the emergence of modern Jewish nationalism to the present time. The conflicts between Jews Palestinians and imperial and regional powers will be examined as well as the relations between the diverse peoples that constitute Israels multicultural multireligious and multinational society.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JS",
        "catalog_number": "546",
        "title": "The Holocaust and Genocide for Educators",
        "description": "An overview of the Holocaust and the concept of genocide with a focus on the analysis and evaluation of varied resources for educators including film photographs literature art music documents and other primary source materials. (Cross listed with HIST 546.)\n",
        "units": "3",
        "class_type": "SEM"
    }
]