[
    {
        "subject": "KIN",
        "catalog_number": "115A",
        "title": "Adapted and Therapeutic Exercise",
        "description": "Special course designed for men and women unable to participate in regular activity classes. Classification is made by University physician. Course may be repeated for 4 units of credit. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "KIN",
        "catalog_number": "117",
        "title": "Adapted Aquatic Exercise",
        "description": "Prerequisite: Medical release with doctors approval. Provides an aquatic exercise program designed for students with physical disabilities. Students develop strength flexibility cardiovascular endurance posture balance and improved ambulation through the application of adapted and therapeutic aquatic exercise. Concepts of water safety physics of aquatic activity and specific movement skills are addressed. Course may be repeated for credit. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "KIN",
        "catalog_number": "118",
        "title": "Adapted Self-Defense",
        "description": "This course is designed to provide instruction and practice in the basic techniques of attack prevention and personal defense skills for individuals with specialized needs. Each student will develop a personalized program to discover and fortify those skills that fall within her/his range. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "123A",
        "title": "ARCHERY",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "124A",
        "title": "Basketball I",
        "description": "Development of understanding of rules strategies and basic skills in competitive basketball. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "125A",
        "title": "Fitness for Life",
        "description": "Introductory course offering a wide variety of conditioning activities (i.e. general aerobics jogging weight training stretching) designed to increase the individuals understanding of conditioning principles and level of fitness necessary for participation in sports or other conditioning activity courses. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "126A",
        "title": "Strength Training",
        "description": "Designed to emphasize physical fitness with special emphasis on muscular strength. Evaluation of individual needs and fitness programming are included. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "128",
        "title": "Fitness Walking",
        "description": "Introduction to the performance of fitness walking as a lifelong activity that maintains and enhances well-being. Develop proficiency and increased knowledge about fitness walking as well as understand and implement a physical fitness program that features walking as a primary activity. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "129A",
        "title": "Running Conditioning I",
        "description": "Development of skill and training methodology for intermediate distance and cross country running. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "130A",
        "title": "Karate I",
        "description": "Development of skill in basic techniques of Japanese karate including self defense and an examination of karate history philosophy and traditions. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "131A",
        "title": "Taekwondo",
        "description": "Development of skill in basic techniques of Korean martial art including self-defense and an examination of Taekwondo history philosophy and traditions. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "132A",
        "title": "Aikido",
        "description": "Study of the techniques and philosophy of Aikido a Japanese martial art. Focus on control techniques and is based on a blending of movement and intention so that what appears as a combative situation can be resolved without conflict. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "133A",
        "title": "Tai Chi Ch&#8217;uan",
        "description": "Study of the philosophy and basic techniques of Tai Chi Chuan with special focus on breathing fluidity of movement and the application of the techniques to other physical disciplines. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "135A",
        "title": "Aerobic Dance I",
        "description": "Exercises designed specifically for improving cardiovascular function and physical fitness through the mode of dynamic rhythmic dance movements. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "137A",
        "title": "Dance",
        "description": "Ballroom ISurvey analysis practice and development of social dance etiquette and of proficiency in the fundamental skills of ballroom dancing.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "139A",
        "title": "Ballet I",
        "description": "Development of proficiency in basic ballet skills and development of understanding and appreciation for ballet as an art form. (Available for General Education Arts and Humanities.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "139B",
        "title": "Ballet II",
        "description": "Prerequisite: KIN 139A. Continued study of ballet techniques with emphasis on combinations of basic skills.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "141A",
        "title": "Jazz Dance I",
        "description": "Development of proficiency in jazz dance techniques skill and development of an understanding and appreciation of jazz dance as an art form.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "141B",
        "title": "Jazz Dance II",
        "description": "Development of intermediate jazz dance techniques skill and development of an understanding and appreciation for jazz dance as an art form.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "142A",
        "title": "Dance",
        "description": "Latin America IDevelopment of proficiency in Latin American folk dance skills in choreography and in performance of group dances based upon the traditional forms. Introduction to historical background of music.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "143A",
        "title": "HIP HOP DANCE I",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "143B",
        "title": "HIP HOP DANCE II",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "144A",
        "title": "Dance",
        "description": "Modern IDevelopment of proficiency in modern dance technique skills and development of an understanding and appreciation for modern dance as an art form. (Available for General Education Arts and Humanities.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "147",
        "title": "Pilates",
        "description": "An introduction to the Pilates method -- a mind-body movement program designed to stretch strengthen and balance the body. Exercises focus on postural symmetry breath control abdominal strength spine pelvis and shoulder stabilization muscular flexibility joint mobility and strengthening through the complete range of motion of all joints. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "148",
        "title": "DANCE COND & SOM",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "149",
        "title": "Yoga",
        "description": "Philosophy and basic techniques of yoga. Through asanas (postures) stretches and deep breathing flexibility and strength are developed and all systems of the body are revitalized. Deep breathing relaxation and meditation techniques enhance overall health and improve ability to handle stress. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "151A",
        "title": "Personal Defense",
        "description": "Instruction and practice in the basic techniques of anticipating avoiding and when necessary protecting oneself from attack. Emphasis is on the avoidance of physical confrontation and the discouragement of an attacker.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "152A",
        "title": "Soccer I",
        "description": "Designed to practice performance techniques analyze strategies and promote team play and sportsmanship in soccer. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "153",
        "title": "Sexual Assault Defense for Women",
        "description": "A womens self defense course against sexual assault. Course topics include awareness risk reduction avoidance basic physical defense aerosol defense and keychain defense. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "154",
        "title": "Sexual Assault Defense for Men",
        "description": "Mens self defense course against sexual assault. Course topics include awareness risk reduction avoidance basic physical defense aerosol defense and keychain defense. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "172",
        "title": "Ultimate Frisbee",
        "description": "Development of proficiency in and increased knowledge of disc sports with emphasis on Ultimate Frisbee with the goal of improving physical skills physical conditioning agility and teamwork. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "177A",
        "title": "Swimming for Non-swimmers",
        "description": "Introduction for the non-swimmer which includes fundamental skills for basic swimming strokes safety and survival techniques. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "178A",
        "title": "Swimming I",
        "description": "Practice in performance and analysis of swimming diving and other aquatic skills at the elementary level. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "179A",
        "title": "Swimming Conditioning",
        "description": "Survey of various training methods and development of physical fitness utilizing aquatic activity. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "185A",
        "title": "Tennis I",
        "description": "Development of skill in playing tennis inclusion of etiquette rules and techniques. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "195A",
        "title": "Volleyball I",
        "description": "Development of proficiency in volleyball skills including background rules and strategy. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "200",
        "title": "Foundations of Kinesiology",
        "description": "Using a holistic and integrated approach students will actively explore the multi-faceted field of Kinesiology. Course/student outcomes will include exposure to and development of liberal learning skills professional development a working definition and appreciation for the field and the initiation of a portfolio.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "236",
        "title": "Introduction to Choreography",
        "description": "Prerequisite: Instructor consent. Principles of dance composition -- movement sources rhythmic spatial and dynamic techniques of organization and thematic development. Composition of solo and small group dances. (Available for General Education Arts and Humanities.)\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "236L",
        "title": "Introduction to Choreography and Lab",
        "description": "Lab practice in choreography. (Available for General Education Arts and Humanities.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "242",
        "title": "Movement Forms: Basic Dance",
        "description": "Introduction for the major student to the study of stylized dance (social ethnic ballet jazz) as a human movement form. Serves as a base for continued study of the knowledge and applications of kinesiology.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "250SW",
        "title": "Professional Activities: Swimming",
        "description": "Prerequisite: Physical Education Option Students or Instructor Permission.  This course is designed for Kinesiology majors enrolled in the Physical Education option who possess basic swimming skills. Students enrolled in this course must be completely confident in deep water (13 feet or more). Activities may include but not limited to basic water safety and self-rescue skills stroke technique beginning diving skills training theory and practice and aquatic fitness and water games.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "271",
        "title": "Fundamental Movement: Gymnastics and Rhythms",
        "description": "Prerequisite: KIN 200 or 240. An introductory course in the fundamental movement patterns appropriate for the developing child in elementary physical education. This course is designed to develop competency in these fundamental movement patterns. Students will develop competency in knowledge and understanding of ways in which motor skills can be organized into developmentally appropriate progressions in a variety of movement settings including educational games gymnastics rhythms and dance. Systematic observations of children during field experiences will be provided.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "271L",
        "title": "Fundamental Movement: Gymnastics and Rhythms Lab",
        "description": "Prerequisite: KIN 200 or 240. An introductory course in the fundamental movement patterns appropriate for the developing child in elementary physical education. This course is designed to develop competency in these fundamental movement patterns. Students will develop competency in knowledge and understanding of ways in which motor skills can be organized into developmentally appropriate progressions in a variety of movement settings including educational games gymnastics rhythms and dance. Systematic observations of children during field experiences will be provided.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "273",
        "title": "ALYAPP GAMES",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "273L",
        "title": "GAMESPTLAB",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "292IP",
        "title": "SALSA DANCE",
        "description": null,
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "300",
        "title": "Foundations and Analysis of Human Movement",
        "description": "Prerequisites: BIOL 211 212. Examination of anatomical and neuromechanical concepts relevant to human movement analysis and muscular control of movement. Application of functional anatomy to fundamental movements and select movement forms in exercise sport and dance emphasizing movement analysis across the lifespan and across a full range of abilities.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "303",
        "title": "SPORTMGT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "304",
        "title": "Dance and the Child",
        "description": "Prerequisites: KIN 120/L; Restricted to students in the ITEP Freshman Option. Provides students the opportunity to revisit dance (creative multicultural and international dance forms) and apply their knowledge of this area to working with children. Students extend and integrate their knowledge of dance to all of the visual and performing arts. Experiences include planning teaching and assessing dance lessons in field-based settings. Students also engage in critical analysis and reflection to discover ways to guide children in 3 unique roles -- as creators performers and observers of dance as an art form.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "305",
        "title": "Historical and Philosophical Bases of Kinesiology",
        "description": "Prerequisite: KIN 200 or 240. Survey of the historical and philosophical bases of kinesiology.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "306",
        "title": "Socio-Psychological Aspects of Physical Activity",
        "description": "Examination of the socio-psychological setting for physical activity with an emphasis on social values individual and collective behavior and group interaction.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "309",
        "title": "SCI TECH SPORTS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "310",
        "title": "Visualization and Sport",
        "description": "Examination of approaches for helping athletes understand develop and/or refine visual skills mental skills and strategies essential for maximizing athletic performance.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "311",
        "title": "Adapted Therapeutic Exercise Principles and Applications",
        "description": "Prerequisite: KIN 201/L or 241. Corequisite: KIN 311L. Lecture and laboratory courses designed to introduce principles and applications in adapted therapeutic exercise. Lab: Hands-on experiences in working with individuals with various physical disabilities are provided under clinical supervision at the Center of Achievement.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "311L",
        "title": "Adapted Therapeutic Exercise Principles and Applications Lab",
        "description": "Prerequisite: KIN 201/L or 241. Corequisite: KIN 311. Lecture and laboratory courses designed to introduce principles and applications in adapted therapeutic exercise. Lab: Hands-on experiences in working with individuals with various physical disabilities are provided under clinical supervision at the Center of Achievement.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "313",
        "title": "Adapted and Therapeutic Aquatic Exercise",
        "description": "Prerequisite: KIN 201/L or 241. Corequisite: KIN 313L. Lecture and lab courses designed to introduce a theoretical overview of the benefits of adapted and therapeutic aquatic exercise for individuals with physical limitations. Lab: Hands-on experiences in working with individuals with various physical disabilities are provided under clinical supervision at the Center of Achievement.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "313L",
        "title": "Adapted and Therapeutic Aquatic Exercise Lab",
        "description": "Prerequisite: KIN 201/L or 241. Corequisite: KIN 313. Lecture and lab courses designed to introduce a theoretical overview of the benefits of adapted and therapeutic aquatic exercise for individuals with physical limitations. Lab: Hands-on experiences in working with individuals with various physical disabilities are provided under clinical supervision at the Center of Achievement.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "314",
        "title": "Creative Dance for Children",
        "description": "Corequisite: KIN 314L. Study of the elements of time space and energy as related to childrens dance as an art form. Principles techniques and exploration of directions of teaching dance to children. 2 hours lecture 2 hours lab.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "314L",
        "title": "Creative Dance for Children Lab",
        "description": "Corequisite: KIN 314. Study of the elements of time space and energy as related to childrens dance as an art form. Principles techniques and exploration of directions of teaching dance to children. 2 hours lecture 2 hours lab.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "316",
        "title": "CHOREOGRAPH FORMS",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "316L",
        "title": "CHOREO FORMS LAB",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "317",
        "title": "AA DANCE FM-BL&MD",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "319",
        "title": "Intermediate Modern Dance",
        "description": "Prerequisite: KIN 139A or 144A or instructor consent. An intermediate course for undergraduate dance specialists in modern dance technique. May be repeated to a maximum of 6 units in different semesters. 6 studio hours.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "333",
        "title": "Injury Prevention Clinical Reasoning",
        "description": "Prerequisites: KIN 338/L; Open to Athletic Training students only. Corequisite: KIN 341. Athetic Training students will practice clinical reasoning and differential diagnosis skills via case studies while integrating knowledge and skills from injury prevention lower extremity evaluation and rehabilitation domains.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "335",
        "title": "HR FITNESS K12 PE",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "335L",
        "title": "HR FIT K12 PE L",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "KIN",
        "catalog_number": "336",
        "title": "APP FITNESS TRNG",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "336L",
        "title": "APP FITNESS LAB",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "337",
        "title": "Prevention and Care of Athletic Injuries",
        "description": "Prerequisites: BIOL 211 212. Corequisite: KIN 337L. An introductory course to the field of athletic training. The history of the athletic training profession the role of the athletic trainer as part of the sports medicine team pharmacology nutrition emergency management risk management and injury assessment domains will be introduced. Lab: Injury-prevention principles and techniques for the application of protective taping/bracing stretching therapeutic exercise and testing and environmental conditions/illnesses.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "337L",
        "title": "Prevention and Care of Athletic Injuries Lab",
        "description": "Prerequisites: BIOL 211 212. Corequisite: KIN 337. An introductory course to the field of athletic training. The history of the athletic training profession the role of the athletic trainer as part of the sports medicine team pharmacology nutrition emergency management risk management and injury assessment domains will be introduced. Lab: Injury-prevention principles and techniques for the application of protective taping/bracing stretching therapeutic exercise and testing and environmental conditions/illnesses.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "KIN",
        "catalog_number": "338",
        "title": "L E EVAL TECH",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "338L",
        "title": "L E EVAL TECH LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "KIN",
        "catalog_number": "341",
        "title": "Prevention and Evaluation Clinical Experience",
        "description": "Prerequisites: KIN 338/L; Open to Athletic Training students only. Corequisite: KIN 333. Prevention and lower extremity evaluation clinical experience. Athetic Training students practice apply and synthesize knowledge and skills from the injury prevention and lower extremity injury evaluation domains with a physically active population under the supervision of a certified athletic trainer. The required 10 hours per week assimilates Athetic Training students into the profession.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "345",
        "title": "Biomechanics",
        "description": "Prerequisite: KIN 300. Corequisite: KIN 345L. Analysis of the ways in which anatomical makeup and mechanical laws govern the mechanics of human motion. Lab experiments designed to provide practical demonstration of mechanical laws and structured learning of qualitative and quantitative procedures for analyzing human motion.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "345L",
        "title": "Biomechanics Lab",
        "description": "Prerequisite: KIN 300. Corequisite: KIN 345. Analysis of the ways in which anatomical makeup and mechanical laws govern the mechanics of human motion. Lab experiments designed to provide practical demonstration of mechanical laws and structured learning of qualitative and quantitative procedures for analyzing human motion.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "KIN",
        "catalog_number": "346",
        "title": "Physiology of Exercise",
        "description": "Prerequisite: BIOL 281; KIN 201/L or 241. Corequisite: KIN 346L. Effects of physical activity on the human physiological processes and of the physiological aspects of skill endurance fatigue training and other phenomena related to physical performance.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "346L",
        "title": "Physiology of Exercise Lab",
        "description": "Prerequisite: BIOL 281; KIN 201/L or 241. Corequisite: KIN 346. Effects of physical activity on the human physiological processes and of the physiological aspects of skill endurance fatigue training and other phenomena related to physical performance.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "KIN",
        "catalog_number": "347",
        "title": "Introduction to Adapted Physical Education",
        "description": "Study of common disabilities and deviations in growth development and motor function in students including the role played by all physical educators in accommodating special needs students.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "349",
        "title": "General Medical Conditions",
        "description": "Prerequisites: KIN 337/L; Open to Athletic Training students only. Will provide students with the knowledge and skills to assess sensory and motor function related to spine injuries handle crisis situations and recognize systemic diseases in patients who are physically active. Pathology of the systems of the body will be covered.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "371",
        "title": "Physical Education Content Development for Children",
        "description": "Prerequisite: KIN 271/L. Not available for credit to students who have completed KIN 470/L. Content methodology materials and equipment central to the planning implementation and evaluation of developmental physical activity programs for children. Lab provides observation active participation and practical experiences in activity programs for children with emphasis on elementary-school physical education.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "371L",
        "title": "Physical Education Content Development for Children Lab",
        "description": "Prerequisite: KIN 271/L. Not available for credit to students who have completed KIN 470/L. Content methodology materials and equipment central to the planning implementation and evaluation of developmental physical activity programs for children. Lab provides observation active participation and practical experiences in activity programs for children with emphasis on elementary-school physical education.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "377",
        "title": "MOTOR LEARNING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "385",
        "title": "Women in Sport",
        "description": "Survey of womens past and present involvement with sport. Examines the social cultural and developmental implications of sport participation. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "392IP",
        "title": "BIOENERGETICS OF EXERCISE",
        "description": null,
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "405",
        "title": "Ethics and Kinesiology",
        "description": "Prerequisite: KIN 305.  This course examines how basic ethical theories relate to problems in kinesiology.  It provides critical analysis of ethical dilemmas in contemporary sport.  It also emphasizes the understanding of ethical frameworks and the application of these frameworks to ethical problems arising in other contexts related to kinesiology professions.(Available for graduate credit)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "407",
        "title": "Sport",
        "description": "Culture and SocietyPrerequisite: KIN 306. Study of the role meaning and use of American sports from colonial times to the present. Examination of the effects of forces that influence sports in this society and the status of international sports including the role of U.S. factors affecting sport at the international level and future directions.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "408",
        "title": "The Olympic Games",
        "description": "Prerequisite: KIN 305. Study of sport through the perspective of the ancient and modern Olympic Games from a historical and philosophical point of view.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "409",
        "title": "Advanced Sport Psychology",
        "description": "Prerequisites: Score of 8 or better on Upper Division Writing Proficiency Exam; Not available to students who have taken PSY 409. Recommended Preparatory: KIN 306 and/or PSY 150. Addresses the evolution of sport psychology as a science including the psychological variables associated with successful performance in sport and physical activity settings. Available for graduate credit with consent of students graduate advisor. KIN Majors receive Upper Division elective credit toward KIN Degree in Options that allow electives. (Cross listed with PSY 409.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "417",
        "title": "Theoretical and Technical Aspects of Resistance Exercise",
        "description": "Prerequisites: KIN 345/L 346/L. Corequisite KIN 417L. A course designed to prepare students to plan develop and implement resistance-training programs. Topics included will pertain to muscular strength and endurance conditioning physiology of strength conditioning muscular strength testing and evaluation and organization/administration of strength-training programs. Students who complete this course are prepared to sit for the Certified Strength and Conditioning Specialist Examination.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "417L",
        "title": "Theoretical and Technical Aspects of Resistance Training Laboratory",
        "description": "Prerequisites: KIN 345/L 346/L. Corequisite: KIN 417. A hands-on lab in which students will perform various resistance-training techniques that will pertain to muscular strength and endurance conditioning physiology of strength conditioning muscular strength testing and evaluation and organization/administration of strength-training programs. Students who complete this course are prepared to sit for the Certified Strength and Conditioning Specialist Examination.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "KIN",
        "catalog_number": "418",
        "title": "Advanced Classical and Contemporary Ballet Technique",
        "description": "Prerequisite: KIN 318 or 496BAL or instructor consent. Recommended Preparatory: Previous formal dance training. A course for students interested in a dance specialty. Class is designed at the advanced-skill level in ballet technique. May be repeated for a maximum of 6 units in different semesters. 6 studio hours per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "420",
        "title": "Coaching Competitive Sports",
        "description": "Prerequisite: Upper Division standing. Psychological sociological and philosophical perspectives of coaching are examined as these relate to motivation discipline and interpersonal relations in competitive sports programs.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "421",
        "title": "Advanced Urban Contemporary Dance",
        "description": "Prerequisites: KIN 319 or KIN 321 or Instructor Permission. An advanced course in urban contemporary dance. May be repeated to a maximum of 6 units in different semesters.  This course is open to graduate students (6 studio hours).\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "426",
        "title": "Choreography",
        "description": "KIN 316 or instructor consent. View of dance composition including movement sources rhythmic spatial and dynamic techniques of organization; thematic development and dramatic intent. Composition of solo and small-group dances.\n",
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "428",
        "title": "Aesthetics of Human Movement",
        "description": "Prerequisite: KIN 305.  Examines historical and contemporary physical activity movement forms (such as sport dance and exercise) and the human body as aesthetic expressions and culturally symbolic representations.(Available for graduate credit)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "436",
        "title": "Applied Exercise and Sports Physiology",
        "description": "Prerequisite: KIN 346 with a grade ofC- or better. Physiological conditioning concepts including the effects of acute and chronic bouts of exercise training for the enhancement of health objectives and improvement of sports performance. Regular written assignments required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "437",
        "title": "Athletic Training Administration",
        "description": "Prerequisite: KIN 339/L. Athletic Training students will learn techniques and strategies required to manage athletic training programs in the professional world. Professional development and acute care of injuries also will be addressed.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "441",
        "title": "Administration and Treatment Clinical Experience",
        "description": "Prerequisites: KIN 342; Open to Athletic Training students only. Corequisite: KIN 443. Athetic Training students practice apply and synthesize knowledge and skills from the administrative modalities and general medical domains with a physically active population under the supervision of a certified athletic trainer. The required 20 hours per week will assimilate Athetic Training students into the profession.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "443",
        "title": "Advanced Activities Clinical Reasoning",
        "description": "Prerequisites: KIN 334; Open to Athletic Training students only. Corequisite: KIN 441. Athetic Training students will develop clinical reasoning and differential diagnosis skills via case studies while integrating knowledge and skills from injury prevention injury evaluation general medical rehabilitation modalities and administrative domains.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "445",
        "title": "Quantitative Biomechanics",
        "description": "Prerequisites: KIN 345 with a grade ofC- or better; MATH 104 or 105. Evaluation and interpretation of motor skill performance on the basis of applied mechanics.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "446",
        "title": "Research in Exercise Physiology",
        "description": "Prerequisite: KIN 346 with a grade ofC- or better. Corequisite: KIN 446L. Explores advanced theory of exercise physiology as well as concepts and techniques of research. Lab experience provides competency in the application of biomedical instrumentation to exercise physiology research.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "446L",
        "title": "Research in Exercise Physiology Lab",
        "description": "Prerequisite: KIN 346 with a grade ofC- or better. Corequisite: KIN 446. Explores advanced theory of exercise physiology as well as concepts and techniques of research. Lab experience provides competency in the application of biomedical instrumentation to exercise physiology research.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "KIN",
        "catalog_number": "452",
        "title": "APA FOR CHILDREN",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "452L",
        "title": "APA FOR CHILD LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "KIN",
        "catalog_number": "456",
        "title": "Exercise Program Design",
        "description": "Prerequisite: KIN 346 with a grade ofC- or better. This course will examine the application of exercise guidelines for adults and children based on the standards of the American Heart Association and the American College of Sports Medicine. Additionally this course will review field tests for determination of muscular strength and endurance flexibility body composition and aerobic endurance. This course will include formal lectures group discussions and presentations. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "462",
        "title": "Physical Education Content Development for Adolescents",
        "description": "Prerequisite: KIN 472/L. Corequisite: KIN 462L. Course provides Physical Education Option students with early field and university-based experiences required to develop and apply a variety of physical education content for adolescents in team individual and activity settings.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "462L",
        "title": "Physical Education Content Development for Adolescents Lab",
        "description": "Prerequisite: KIN 472/L. Corequisite: KIN 462. Course provides Physical Education Option students with early field and university-based experiences required to develop and apply a variety of physical education content for adolescents in team individual and activity settings.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "467",
        "title": "THER EX",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "467L",
        "title": "THER EX LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "KIN",
        "catalog_number": "470",
        "title": "Physical Education for Children",
        "description": "Corequisite: KIN 470L. Not available for credit for Kinesiology majors. Focuses on the growing/moving/learning elementary-age child and on purposes content procedures materials and equipment central to elementary school physical education. Lab: Observation and lab experience in elementary school physical education.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "470L",
        "title": "Physical Education for Children Lab",
        "description": "Corequisite: KIN 470. Not available for credit for Kinesiology majors. Focuses on the growing/moving/learning elementary-age child and on purposes content procedures materials and equipment central to elementary school physical education. Lab: Observation and lab experience in elementary school physical education.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "472",
        "title": "Learner Assessment and Technology in K-12 Physical Education",
        "description": "Prerequisite: KIN 335/L. Corequisite: KIN 472L. A conceptual and practical understanding of alternative and traditional assessment of student learning in school physical education. Emphasis will be on formal and informal assessment and technological strategies that enhance learning assess performance provide feedback and communicate progress.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "472L",
        "title": "Learner Assessment and Technology in K-12 Physical Education Lab",
        "description": "Prerequisite: KIN 335/L. Corequisite: KIN 472. A conceptual and practical understanding of alternative and traditional assessment of student learning in school physical education. Emphasis will be on formal and informal assessment and technological strategies that enhance learning assess performance provide feedback and communicate progress.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "KIN",
        "catalog_number": "476",
        "title": "Musculoskeletal Biomechanics and Injury",
        "description": "Prerequisite: KIN 345 or instructor consent. Anatomical physiological and mechanical characteristics of human musculoskeletal tissues and their responses to mechanical loading. Detailed examination of injury mechanisms and their mechanical correlates.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "477",
        "title": "Motor Development",
        "description": "Prerequisite: KIN 377 or instructor permission. Corequisite: KIN 478. Study of age-related changes in motor skills the processes that underlie these changes and the factors that influence them.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "478",
        "title": "Application of Motor Behavior Principles",
        "description": "Corequisite: KIN 477.  Course designed for students to use a life span perspective to demonstrate how to design implement and assess motor skill programs for any group of individuals regardless of age developmental level or movement task.\n",
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "479",
        "title": "Perception and Movement",
        "description": "Prerequisite: KIN 377 or permission of instructor. Integrated approach into the nature of human movement across the life span with special emphasis on examining the relation between perception and movement as a function of the environment in which one lives.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "481",
        "title": "SOC HIS SPORT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "492IP",
        "title": "FIT + SPORT MGMT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "494A",
        "title": "ACAD INTERNSHIP",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "KIN",
        "catalog_number": "494I",
        "title": "Academic Internship Evaluation",
        "description": "Corequisite KIN 494A or B. Supervised on and off-campus internship to apply content and research in selected areas of Kinesiology (Credit/No Credit Only).\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "KIN",
        "catalog_number": "498WC",
        "title": "Dance Concert Modes",
        "description": "Prerequisite: KIN 316 or instructor consent. Analysis and application of advanced choreographic structures to compose individual or group choreography for dance concert productions Available to graduate students.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "KIN",
        "catalog_number": "499C",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "KIN",
        "catalog_number": "513",
        "title": "ADP THR EX AS DSN",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "513L",
        "title": "ADP TH EX AD LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "KIN",
        "catalog_number": "526",
        "title": "TEACH EFFECT KIN",
        "description": null,
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "526L",
        "title": "TEACH EFFECT KIN LAB",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "543",
        "title": "DANCE PERF ANALYS",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "575",
        "title": "BIOMECH ANALYSIS",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "575L",
        "title": "BIO ANALYSIS LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "KIN",
        "catalog_number": "579",
        "title": "Advanced Studies in Human Motor Behavior",
        "description": "Prerequisites: KIN 325 or 329; Acceptance into the Kinesiology M.S. Program or consent of instructor. An in-depth investigation into the theories principles and research in motor development motor learning and motor control with emphasis on describing and explaining changes in movement patterns across the lifespan.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "595PE",
        "title": "APPL METH PE",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "601",
        "title": "ADV EVID PRAC KIN",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "602",
        "title": "Seminar in Current Issues in Kinesiology",
        "description": "Intensive study of current issues and problems in physical education through philosophical examination and analysis of literature and research findings.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "605",
        "title": "Research Methods and Design",
        "description": "Prerequisite: KIN 302 or MATH 140. Study of various types of research used in kinesiology and techniques employed in collecting classifying interpreting and presenting data.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "606",
        "title": "Seminar in Social Psychology of Sport",
        "description": "Prerequisite: KIN 306. Advanced study of the influence of social-psychological variables as they relate to motor performance. Topics may include aggression attitude formation and change arousal and anxiety achievement motivation attribution theory social facilitation social reinforcement observational learning and the competition process.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "607",
        "title": "Seminar in Sport History",
        "description": "Prerequisite: KIN 305. Significant trends and problems that affected the growth and present structure of sport from the primitive through the modern period.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "610",
        "title": "Quantitative Analysis of Research in Kinesiology",
        "description": "Prerequisite: KIN 302. Study of advanced statistical methods for quantitative analysis of research data in kinesiology including computer analysis.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "646",
        "title": "Seminar in Exercise Physiology",
        "description": "Prerequisite: KIN 446 or instructor consent. Advanced human physiological variability and potentialities and requirements for muscular activity.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "679",
        "title": "Seminar in Motor Behavior",
        "description": "Prerequisites: KIN 325 or 329 and acceptance into the Kinesiology M.S. program or consent of instructor. Study and seminar discussion of selected topics in motor behavior.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "696A",
        "title": "Directed Graduate Research",
        "description": "Prerequisites: Classified status; Graduate Coordinator consent. Special graduate studies in kinesiology.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "KIN",
        "catalog_number": "698A",
        "title": "Thesis or Graduate Project",
        "description": "Prerequisites: Classified status; Thesis/Project Chair consent. May be repeated but not more than 6 units may be included among the 30 total units required for the M.S. Degree.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "KIN",
        "catalog_number": "699C",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "KIN",
        "catalog_number": "120",
        "title": "Arts Immersion: Dance",
        "description": "Prerequisite: Restricted to students in ITEP Freshman Option. Corequisite: KIN 120L. Introductory course in study of dance as an art form. Concepts of dance are explored as a means of personal expression. Students engage in creative dance activities and multicultural and international dance forms. Students extend and integrate their knowledge of dance to all the visual and performing arts. 1 hour lecture 2 hours lab per week.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "120L",
        "title": "Arts Immersion: Dance Lab",
        "description": "Prerequisite: Restricted to students in ITEP Freshman Option. Corequisite: KIN 120. Introductory course in study of dance as an art form. Concepts of dance are explored as a means of personal expression. Students engage in creative dance activities and multicultural and international dance forms. Students extend and integrate their knowledge of dance to all the visual and performing arts. 1 hour lecture 2 hours lab per week.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "134",
        "title": "Shaolin Kung Fu",
        "description": "Study of the philosophy and basic techniques of Kung Fu with special focus on breathing fluidity of motion and the application of the techniques to other physical disciplines. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "155A",
        "title": "Golf I",
        "description": "Development of basic skill in playing golf including rules etiquette and background. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "167A",
        "title": "Racquetball I",
        "description": "Development of proficiency in racquetball skills knowledge of rules and techniques and basic strategy. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "272",
        "title": "Non-traditional Games and Activities",
        "description": "Prerequisite: KIN 200 or 240. Recommended Prepatory: KIN 201/L. Students will be introduced to a variety of non-traditional games and activities that include team challenges problem-solving activities and cooperative games. Students will actively explore the impact of non-traditional games and activities for the K-12 setting.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "272L",
        "title": "Non-traditional Games and Activities Lab",
        "description": "Prerequisite: KIN 200 or 240. Recommended Prepatory: KIN 201/L. Students will be introduced to a variety of non-traditional games and activities that include team challenges problem-solving activities and cooperative games. Students will actively explore the impact of non-traditional games and activities for the K-12 setting.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "308",
        "title": "MARKETING SPORT IND",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "315",
        "title": "Analysis and Application of Multi-Cultural Dance Forms for Children and Adolescents",
        "description": "Prerequisites: KIN 201/L 242. Corequisite 315L. Analysis of basic to intermediate skills of multi-cultural dance including ballroom contra ethnic round and square. Students develop performance analysis skills and the ability to plan and conduct instructional activities in multi-cultural dance.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "315L",
        "title": "Analysis and Application of Multi-Cultural Dance Forms for Children and Adolescents Lab",
        "description": "Prerequisites: KIN 201/L 242. Corequisite 315. Analysis of basic to intermediate skills of multi-cultural dance including ballroom contra ethnic round and square. Students develop performance analysis skills and the ability to plan and conduct instructional activities in multi-cultural dance.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "318",
        "title": "Intermediate Classical and Contemporary Ballet Technique",
        "description": "Prerequisite: KIN 139B or 141 or 144 or 244 or 496BAL or instructor consent. Recommended Preparatory: Previous formal dance training. An intermediate course for undergraduate dance specialists in classical and contemporary ballet technique. May be repeated to a maximum of 6 units in different semesters. 6 studio hours.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "321",
        "title": "INT CONTEMP DANCE",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "380",
        "title": "Perspectives of Dance",
        "description": "Corequisite: KIN 380L. History aesthetics performance forms musical forms cultural and racial heritages and contemporary directions of dance in education and art. Dance is examined as a performing art ritual social/recreational activity and subject for scholarly investigation and analysis. Students participate in dance techniques related to content presented in the classroom. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "380L",
        "title": "Perspectives of Dance Lab",
        "description": "Corequisite: KIN 380. History aesthetics performance forms musical forms cultural and racial heritages and contemporary directions of dance in education and art. Dance is examined as a performing art ritual social/recreational activity and subject for scholarly investigation and analysis. Students participate in dance techniques related to content presented in the classroom. (Available for General Education Arts and Humanities.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "406",
        "title": "Social Change and Development through Sport",
        "description": "Prerequisite: KIN 306. This class critically assesses the use of sports as a mechanism for social change and development. Students will participate in a leadership role in a youth sport development program and apply critical theories to understand and assess the efficacy of sport programs in effecting social change and development.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "410",
        "title": "Psychosocial Aspects of Athletic Injury",
        "description": "Prerequisite: KIN 306 or instructor consent. This course examines the psychosocial factors involved in athletic injuries and the rehabilitation process. Relevant theory and research will be discussed as well as practical applications. Topics may include: stress responses to injury mental skills/tools used to manage injury (i.e. imagery goal setting motivation confidence) social support common problems faced during rehabilitation returning to sport after injury and stress-related growth.(Available for graduate credit)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "415",
        "title": "Medical Aspects of Sport and Related Injuries",
        "description": "Prerequisite: KIN 345. Review of selected medical aspects of sport taught by guest medical experts from community hospitals and private practice.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "419",
        "title": "Advanced Modern Dance",
        "description": "An advanced course for undergraduate dance specialists in modern dance technique. May be repeated to a maximum of 6 units in different semesters. 6 studio hours per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "427",
        "title": "Dance Production",
        "description": "KIN 316 or instructor consent. Study of techniques and materials in dance as applied to music analysis and advanced individual and group choreography for performance.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "442",
        "title": "Advanced Clinical Experience Techniques",
        "description": "Prerequisites: KIN 441; Open to Athletic Training students only. Corequisite: KIN 444. Athetic Training students practice apply and synthesize knowledge and skills from the pharmacology and acute-care domains with a physically active population under the supervision of a certified athletic trainer. The required 15 hours per week assimilates Athetic Training students into the profession.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "KIN",
        "catalog_number": "444",
        "title": "Professional Preparation",
        "description": "Prerequisites: KIN 443; Open to Athletic Training students only. Corequisite: KIN 442. Athletic Training students will prepare for the Board of Certification Examination become involved in the community and promote the athletic training profession through directed activities.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "451",
        "title": "Adapted Aquatic Therapeutic Exercise: Assessment",
        "description": "Evaluation and Program DesignRecommended Prepatory: KIN 311/L 313/L. Corequisite: KIN 451L. This course is designed to introduce intermediate/advanced knowledge in adapted aquatic therapeutic exercise. Assessment and evaluation processes to be learned include observations screenings and various measurement instruments for the purpose of designing exercise programs for individuals and groups with special needs.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "457",
        "title": "Therapeutic Modalities for Sports Medicine",
        "description": "Prerequisite: KIN 338/L. Corequisite: KIN 457L. Laboratory experiences designed to provide competency in the application of selected therapeutic agents.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "457L",
        "title": "Therapeutic Modalities for Sports Medicine Lab",
        "description": "Prerequisite: KIN 338/L. Corequisite: KIN 457. Laboratory experiences designed to provide competency in the application of selected therapeutic agents.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "KIN",
        "catalog_number": "511",
        "title": "Perceptual-Motor Development of Students with Disabilities",
        "description": "Prerequisite: KIN 347 or instructor consent. Descriptive analysis of motor characteristics of students with disabilities including theories of specialized instruction evaluation and prescribing and implementing instruction in adapted physical education/activity programs.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "512",
        "title": "Curriculum Development and Instruction in Adapted Physical Education",
        "description": "Prerequisite: KIN 347 or instructor consent. Study of curriculum development and instructional principles used in organizing implementing and instructing students with disabilities in various physical education instructional settings.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "520",
        "title": "Seminar in Coaching the Modern Athlete",
        "description": "Prerequisite: KIN 420. Examines different teaching and coaching personalities styles and communication processes as they relate to interpersonal relations motivation discipline self expression competition cooperation and problems associated with athletic coaching for different age groups and levels of competition.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "560",
        "title": "Clinical EKG and Exercise Stress Testing",
        "description": "Prerequisite: KIN 446/L. Course in electrocardiography that includes detailed evaluation of basic EKG arrhythmias and their relationship to exercise testing and training.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "603",
        "title": "Seminar in Pedagogy in Kinesiology",
        "description": "Seminar in current issues and developments in physical education pedagogy through examination and analysis of literature and research findings.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "612",
        "title": "Qualitative Research Design",
        "description": "This course will provide an intensive study of qualitative research designs through critical examination of the research literature. The course content includes an intensive review of the issues surrounding measurement data analysis interpretation and ethical aspects of conducting qualitative research.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "645",
        "title": "Seminar in Biomechanics",
        "description": "Prerequisite: KIN 345 or instructor consent. Analysis of current and classical research literature related to human biomechanics. Emphasis on sport and ergonomic applications.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "647",
        "title": "Seminar in Adapted Physical Activity",
        "description": "Prerequisites: KIN 605 610. An advanced study of theory and literature regarding adapted physical activity for individuals with disabilities. This course is designed to develop in-depth knowledge by integrating the sub-disciplines of kinesiology as they relate to adapted physical activity on land and in the water. Specific topics include pedagogical psycho-social physiological and biomechanical aspects of adapted physical activity.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "KIN",
        "catalog_number": "652",
        "title": "Seminar in Exercise Physiology of Skeletal Muscle",
        "description": "Prerequisites: KIN 446/L; CHEM 235. Study of the physiological anatomical morphological and biochemical adaptations of skeletal muscle to exercise training.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "KIN",
        "catalog_number": "694",
        "title": "Advanced Internship in Adapted Physical Education",
        "description": "Prerequisites: Preliminary Education Specialist Credential Preliminary Multiple Subject Credential or Preliminary Single Subject Physical Education Credential; KIN 511 512 513/L 514; APE Program Director consent. Advanced teaching internship for candidates in the Adapted Physical Education Added-Authorization Program. Clinical supervision is provided through credentialed cooperating teachers/site supervisors and through analysis of videos by University supervisor and online reflections. Completion of Adapted Physical Education Professional Portfolio is required to receive credit.\n",
        "units": "3",
        "class_type": "SUP"
    }
]