[
    {
        "subject": "NURS",
        "catalog_number": "302",
        "title": "Basic Pathophysiology",
        "description": "Prerequisite: Approval of faculty advisor. Study of the pathogenesis and clinical picture of common disease processes that impact the self-care of individuals. Focuses on the impact of environmental genetic and individual factors in creating or perpetuating disturbed physiology as well as on physiological adaptive responses and the interdependence of body systems. (See Program advisor for information on credit by challenge examination)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "NURS",
        "catalog_number": "303",
        "title": "Professional Nursing",
        "description": "Preparatory: Admission to Nursing Program; Completion of Lower Division writing requirement. Focuses on the practice of professional nursing critical thinking therapeutic nursing interventions nursing process advocacy humanistic approach to the treatment of human beings selected bio-psycho-social and nursing theories spirituality communication information technology role change values culture and oral and written communication skills. Regular written assignments and oral presentations are required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "NURS",
        "catalog_number": "307",
        "title": "Health Assessment in Self Care Agency",
        "description": "Corequisite: NURS 307L. Recommended Corequisite: Admission to SNCP or RN-BSN program. Provides skills in complete assessment of individual health in using bio-psycho-social-spiritual-cultural concepts. Includes nursing assessment through all developmental stages. Emphasis on self-care agency. On-campus supervised lab practice and application of concepts from NURS 307 in self-care agency. Passing grade must be earned in both NURS 307 and 307L concurrently for credit in both courses. 3 hours lab per week.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "NURS",
        "catalog_number": "307L",
        "title": "Health Assessment in Self Care Agency Lab",
        "description": "Corequisite: NURS 307. Recommended Corequisite: Admission to SNCP or RN-BSN program. Provides skills in complete assessment of individual health in using bio-psycho-social-spiritual-cultural concepts. Includes nursing assessment through all developmental stages. Emphasis on self-care agency. On-campus supervised lab practice and application of concepts from NURS 307 in self-care agency. Passing grade must be earned in both NURS 307 and 307L concurrently for credit in both courses. 3 hours lab per week.\n",
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "NURS",
        "catalog_number": "308",
        "title": "Family Systems Nursing",
        "description": "Prerequisite: Admission to BSN Program and NURS 303. The focus of this course is on nursing care of families. Family nursing theory and research is applied to Orem-defined units of family nursing practice individual self-care agents dependent-care dyads and family units as wholes. Emphasis is on health/safety promotion and disease prevention including assessment of individuals within family systems family issues/trends and global perspectives.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "NURS",
        "catalog_number": "310",
        "title": "Principles of Nursing Research",
        "description": "Prerequisite: MATH 140 or equivalent. Historical philosophical and ethical aspects of nursing research and relationship to nursing science theory and practice. Includes principles and methods of research for use in professional roles leadership and development of nursing systems. Knowledge of the research process is developed and applied to critique of research studies process of research proposal development and application of research findings to practice. Regular written assignments are required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "NURS",
        "catalog_number": "315",
        "title": "Pharmacology and Self-Cafe Agency",
        "description": "Prerequisite: Admission into the Accelerated BSN Pathway. This course examines the principles of pharmacokinetics and pharmacodynamics for major drug classes as they impact self-care of the individual. Assessment and management of the therapeutic and toxic effects of pharmacological interventions are emphasized.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "NURS",
        "catalog_number": "318",
        "title": "INTRO PROFNURSING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "NURS",
        "catalog_number": "318L",
        "title": "INTRO PROFNURSLAB",
        "description": null,
        "units": "4",
        "class_type": "LAB"
    },
    {
        "subject": "NURS",
        "catalog_number": "426",
        "title": "Nursing Systems Issues and Ethics",
        "description": "Preparatory: All 300-level Nursing courses. Deals with issues arising within the community the health-care systems and the profession of nursing that influence self-care agency and the development of nursing systems. Discusses ethical aspects of providing therapeutic self-care. Regular written assignments required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "NURS",
        "catalog_number": "427",
        "title": "Dynamics of Nursing Leadership and Leadership in Nursing",
        "description": "Prerequisites: All 300-level Nursing courses; NURS 426. Corequisite: NURS 427L. Focuses on the function of the professional nurse as self-care agent through leadership administration and change. Presents theories of group dynamics leadership organizations planned change power and conflict as they apply in the nursing unit. Regular written assignments are required. Lab: Application of self-care agency through use of leadership and administration theories and skills in clinical settings. Students synthesize professional nursing roles through individualized learning contract. Credit given only if a passing grade is earned. 3 hours lecture 6 hours lab per week.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "NURS",
        "catalog_number": "427L",
        "title": "Dynamics of Nursing Leadership and Leadership in Nursing Lab",
        "description": "Prerequisites: All 300-level Nursing courses; NURS 426. Corequisite: NURS 427. Focuses on the function of the professional nurse as self-care agent through leadership administration and change. Presents theories of group dynamics leadership organizations planned change power and conflict as they apply in the nursing unit. Regular written assignments are required. Lab: Application of self-care agency through use of leadership and administration theories and skills in clinical settings. Students synthesize professional nursing roles through individualized learning contract. Credit given only if a passing grade is earned. 3 hours lecture 6 hours lab per week.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "NURS",
        "catalog_number": "428",
        "title": "Community Health Nursing",
        "description": "Prerequisites: All 300-level Nursing courses; HSCI 488; NURS 426. Corequisite: NURS 428L. Theory and multicultural society. Study of self-care agency and therapeutic self-care needs of individuals families the community and society. Regular written assignments required. Clinical experience in community health agencies under the leadership of nursing faculty. Credit given only if a passing grade is earned. 3 hours lecture 6 hours lab per week.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "NURS",
        "catalog_number": "428L",
        "title": "Community Health Nursing Lab",
        "description": "Prerequisites: All 300-level Nursing courses; HSCI 488; NURS 426. Corequisite: NURS 428. Theory and multicultural society. Study of self-care agency and therapeutic self-care needs of individuals families the community and society. Regular written assignments required. Clinical experience in community health agencies under the leadership of nursing faculty. Credit given only if a passing grade is earned. 3 hours lecture 6 hours lab per week.\n",
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "NURS",
        "catalog_number": "495",
        "title": "ADV PROF PRAC",
        "description": null,
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "NURS",
        "catalog_number": "499A",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "NURS",
        "catalog_number": "560",
        "title": "Theories of Teaching and Instruction in Nursing",
        "description": "Prerequisite: Instructor consent. This course focuses on examining prominent theories of teaching and models of instruction that are applicable to the classroom nursing skill laboratory and clinical education. Theoretical approaches classified as behaviorist social interactionist and cognitive as well as adult learning theories are discussed and analyzed. Evidence-based research relative to nursing education is reviewed and critiqued.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "NURS",
        "catalog_number": "561",
        "title": "Teaching and Learning Strategies in Nursing",
        "description": "Prerequisite: Instructor consent. This course focuses on providing mentored training in integrating evidence-based learning-centered teaching and learning strategies. Students are teamed with faculty mentors in the classroom skill laboratory and clinical settings to apply and implement learned teaching strategies under the direct supervision of faculty mentors. Special emphasis is made on integrating multiculturalism in teaching and learning.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "NURS",
        "catalog_number": "563",
        "title": "Evaluation and Assessment in Nursing Educations",
        "description": "Prerequisites: NURS 560 561 562; Instructor consent. This course explores various theories on assessments and evaluation and examines important theoretical ethical and practical issues in assessment evaluations measurement and testing in nursing education.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "NURS",
        "catalog_number": "664",
        "title": "Faculty Role Development in Nursing",
        "description": "Prerequisites: NURS 560 562 563; Instructor consent. This course focuses on examining models of the nurse faculty role and on analyzing strategies for effective teaching practice scholarship and service. Leadership is examined through the lens of a system framework for effective change and transformation.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "NURS",
        "catalog_number": "306",
        "title": "Supportive/Educative Nursing Systems",
        "description": "Application of nursing knowledge and skills in self-care agency with individuals families groups communities and populations. Content includes theories and principles of learning teaching strategies and methodologies teaching resources and evaluation of instruction as applied to the development of nursing systems in the nursing process. Regular written assignments and oral presentations required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "NURS",
        "catalog_number": "430",
        "title": "Psychiatric/Mental Health Nursing: Clinical",
        "description": "Focuses on the unique role of the professional nurse in assessing promoting maintaining restoring and evaluating the self-care and dependent-care functions of persons with actual or potential altered mental health processes. Topics include selected theories of human behavior and current knowledge of psychiatric/mental health nursing care psychopathology psychiatric treatment psychopharmacology environmental management and influences of family. Lab: Demonstration of beginning professional role in psychiatric/mental health nursing by applying knowledge from lecture corequisite. Passing grades must be earned in lecture course and lab concurrently for credit in both courses.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "NURS",
        "catalog_number": "430L",
        "title": "Psychiatric/Mental Health Nursing: Clinical Lab",
        "description": "Focuses on the unique role of the professional nurse in assessing promoting maintaining restoring and evaluating the self-care and dependent-care functions of persons with actual or potential altered mental health processes. Topics include selected theories of human behavior and current knowledge of psychiatric/mental health nursing care psychopathology psychiatric treatment psychopharmacology environmental management and influences of family. Lab: Demonstration of beginning professional role in psychiatric/mental health nursing by applying knowledge from lecture corequisite. Passing grades must be earned in lecture course and lab concurrently for credit in both courses.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "NURS",
        "catalog_number": "443",
        "title": "NSNG CHILDRN",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "NURS",
        "catalog_number": "443L",
        "title": "NSNG CHILDRN LAB",
        "description": null,
        "units": "1.5",
        "class_type": "CLN"
    },
    {
        "subject": "NURS",
        "catalog_number": "444",
        "title": "NSNG CHLDBR FAM",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "NURS",
        "catalog_number": "444L",
        "title": "NSNG CHLDBR FAM L",
        "description": null,
        "units": "1.5",
        "class_type": "CLN"
    }
]