[
    {
        "subject": "PHIL",
        "catalog_number": "100",
        "title": "General Logic",
        "description": "Prerequisites: Completion of the lower division writing requirement; GE section B4 Mathematics/Quantitative Reasoning or MATH 210. Not open to students who have completed PHIL 200. Study of deductive and inductive inferences. Attention to formal and informal fallacies and the relations of logic and language. Emphasis on critical thinking and the attainment of skill in it. (Available for General Education, Basic Skills A3 Critical Thinking.)",
        "units": "3",
        "prerequisites": "{{Completion of the lower division writing requirement} && {{GE section B4 Mathematics/Quantitative Reasoning} || {MATH 210}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "150",
        "title": "Introduction to Philosophical Thought",
        "description": "Prerequisite: Multiple Measures Placement in GE-level writing, or completion of 113A or 114A, or completion of the lower division writing requirement. Introduction to philosophy emphasizing the concepts of knowledge, reality and mind, with attention to such topics as skepticism, dogmatism, common sense, materialism, mind-body dualism, the existence of God and free will. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{{Multiple Measures Placement in GE-level writing} || {{ENGL 113A} || {ENGL 114A}} || {completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "165",
        "title": "Today’s Moral Issues",
        "description": "Prerequisite: Multiple Measures Placement in GE-level writing, or completion of 113A or 114A, or completion of the lower division writing requirement. Philosophical examination of a range of today’s moral issues, such as abortion, euthanasia, physician-assisted suicide, the environment, war and world hunger. (Available for General Education, C2 Humanities.) (IC)",
        "units": "3",
        "prerequisites": "{{Multiple Measures Placement in GE-level writing} || {{ENGL 113A} || {ENGL 114A}} || {completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "170",
        "title": "Philosophy and Popular Culture",
        "description": "In this course, students will examine philosophical themes within popular culture, and will use philosophy to investigate how they relate to popular culture. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "180",
        "title": "Human Nature and the Meaning of Life",
        "description": "Examines a variety of theories of human nature. Students in the course will discuss how those theories answer questions like: “What are we? Why are we here; what is the meaning of life?” Students in the course will come to understand these theories, learn to critically examine them, and try to determine what implications the theories have for our conception of ourselves and for our conception of a good or happy or meaningful life. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "200",
        "title": "Critical Reasoning",
        "description": "Prerequisites: Completion of the lower division writing requirement; GE section B4 Mathematics/Quantitative Reasoning or MATH 210. Not open to students who have completed PHIL 100. Examination of the relationship between logic and language. Accelerated introduction to the concepts essential to the identification, analysis and evaluation of arguments, with attention to deduction, induction and common fallacies. Emphasis on the application of these concepts. (Available for General Education, Basic Skills A3 Critical Thinking.)",
        "units": "3",
        "prerequisites": "{{Completion of the lower division writing requirement} && {{GE section B4 Mathematics/Quantitative Reasoning} || {MATH 210}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "201",
        "title": "Ancient Philosophy",
        "description": "Prerequisite: Multiple Measures Placement in GE-level writing, or completion of 113A or 114A, or completion of the lower division writing requirement. Critical examination of selected topics in ancient Western philosophic thought, with attention to the pervasive influence of Plato and Aristotle. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{{Multiple Measures Placement in GE-level writing} || {{ENGL 113A} || {ENGL 114A}} || {completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "202",
        "title": "Modern Philosophy",
        "description": "Prerequisite: Multiple Measures Placement in GE-level writing, or completion of 113A or 114A, or completion of the lower division writing requirement. Critical examination of topics in modern philosophic thought selected from the writings of such figures as Descartes, Spinoza, Locke, Leibniz, Berkeley, Hume and Kant. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{{Multiple Measures Placement in GE-level writing} || {{ENGL 113A} || {ENGL 114A}} || {completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "210",
        "title": "Reasoning in the Sciences",
        "description": "Prerequisites: Completion of the lower division writing requirement; GE section B4 Mathematics/Quantitative Reasoning or MATH 210. Concepts, methods, and limitations involved in the systematic procedures of empirical inquiry in the sciences and in ordinary thought, such as probability, measurement, causal relations, statistical inference, and the concepts of law and theory. (Available for General Education, Basic Skills A3 Critical Thinking.)",
        "units": "3",
        "prerequisites": "{{Completion of the lower division writing requirement} && {{GE section B4 Mathematics/Quantitative Reasoning} || {MATH 210}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "225",
        "title": "Evolutionary Reasoning",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course introduces basic concepts and skills of critical reasoning and scientific reasoning in the context of reasoning about evolution. These include argument identification, argument analysis, and argument evaluation. Key ideas in evolutionary thinking are also introduced. This course emphasizes the attainment of skills applied in evolutionary reasoning. (Available for General Education, Basic Skills A3 Critical Thinking.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "230",
        "title": "Introduction to Formal Logic",
        "description": "Prerequisites: Completion of the lower division writing requirement; GE section B4 Mathematics/Quantitative Reasoning or MATH 210. Introduction to modern deductive logic, including propositional logic and theory of quantification. (Available for General Education, Basic Skills A3 Critical Thinking.)",
        "units": "4",
        "prerequisites": "{{Completion of the lower division writing requirement} && {{GE section B4 Mathematics/Quantitative Reasoning} || {MATH 210}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "240",
        "title": "Environmental Ethics",
        "description": "Examines the meaning and value of nature and the environment from a variety of ethical perspectives, including feminist and de-colonial perspectives. Questions can include: How should human beings relate to the natural world? How can we build sustainable interactions with the natural world? Do we have moral obligations toward non-human animals and other parts of nature? What do we owe to other beings, including future generations, with respect to the environment? In the face of catastrophic climate change, is it moral to procreate or to eat meat? (Cross-listed with SUST 240.) (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "250",
        "title": "Philosophy of Technology",
        "description": "Introduction to the main issues in philosophy of technology, including the nature of technology, the distinction between technology and science, technology and values, the relationship between technology and society, and feminist approaches to the philosophy of technology. Applied issues to be addressed in this course may include: technology and the environment, the digital divide, the ethics of information technology, transhumanism, artificial intelligence, and existential risk. (Available for General Education, C2 Humanities or E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "303",
        "title": "Sexual Ethics",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examination of some of the moral issues in sexual conduct.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "305",
        "title": "Business Ethics and Public Policy",
        "description": "Prerequisite: Completion of the lower division writing requirement. Application of the insights and methods of moral philosophy to a practical examination of contemporary moral problems and normative issues of public policy concerning the conduct and responsibilities of individuals and firms in business and the organization and role of business and economic institutions in society. Regular written assignments are required. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "310",
        "title": "Philosophical Problems",
        "description": "Prerequisites: Completion of the lower division writing requirement; 3 units of Philosophy. Introduction for upper division students to such central philosophic problems as knowledge, truth, reality and mind. Regular written assignments will be required. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{{Completion of the lower division writing requirement} && {3 units of Philosophy}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "313",
        "title": "Philosophy of Film and Literature",
        "description": "Prerequisite: Completion of the lower division writing requirement. Investigation of philosophical concepts and problems relating to and expressed through film and literature. Regular written assignments will be required.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "317",
        "title": "History of American Philosophy",
        "description": "Prerequisite: Completion of the lower division writing requirement. An introduction to the history of American philosophy with an emphasis on American pragmatism and its intellectual precursors, especially in Native- and African-American thought. Key themes include the relationship between the individual and community, pluralism and democracy, economic and social freedom, and the pragmatic conception of truth and meaning, with an emphasis on how diverse philosophies of resistance and social critique have shaped American institutions and ideals. Attention is also paid to the contemporary landscape of American political philosophy. (Available for General Education, C3 American History, Institutions and Ideals.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "319",
        "title": "Medieval Philosophy",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. An introduction to medieval European philosophy through some of its most important texts and through an examination of some of the forces that helped to shape it including the interaction of classical Greek philosophies for example those of Plato and Aristotle with Christian Islamic and Jewish traditions.\n",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "325",
        "title": "Philosophy and Biology",
        "description": "Prerequisite: Completion of the lower division writing requirement. The course addresses philosophical issues central to biological sciences, including the creation/evolution debate and other social implications of contemporary biological theories. It also introduces basic concepts in philosophy of science, such as demarcation, scientific explanation and the scientific method, which are necessary for examining the above issues. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "330",
        "title": "Philosophy of Science",
        "description": "Prerequisite: Completion of the lower division writing requirement. Analysis of the concepts reality, knowledge, mind and theory that attempts to answer the question: What is the character of the scientific picture of human beings and nature? (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "331",
        "title": "Intermediate Formal Logic",
        "description": "Prerequisite: PHIL 230. Continuation of PHIL 230. Preliminary examination of various extensions of classical formal systems such as theory of identity theory of descriptions and modal logic and an introduction to the methods of appraising formal systems (consistency and semantic completeness).\n",
        "units": "4",
        "prerequisites": "{PHIL 230}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "333",
        "title": "American Indian Philosophy",
        "description": "Prerequisite: Completion of the lower division writing requirement. A survey of American Indian philosophy from issues arising out of oral traditions, to early colonial Indigenous impacts on American democracy and pragmatism, to recent work on knowledge, value, and being as well as applied issues such as sovereignty and the environment. (Cross-listed with AIS 333.) (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "337",
        "title": "Philosophy of Religion",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examination of the conceptual problems religious claims pose and arguments regarding knowledge of God, evil, miracles, death and survival, religious experience, religion and morals, faith and reason. Regular written assignments will be required. (Available for General Education, C2 Humanities or E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "343",
        "title": "Indian Philosophy",
        "description": "Prerequisite: Completion of the lower division writing requirement. Survey of Indian philosophy from the Vedic period to the modern era, with attention to relationships between India’s philosophies, history and culture. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "344",
        "title": "Chinese Philosophy",
        "description": "Prerequisite: Completion of the lower division writing requirement. Survey of Chinese philosophy from Confucius to the People’s Republic, with attention to relationships between China’s philosophies, history and culture. Regular written assignments required. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "348",
        "title": "Philosophy and Feminism",
        "description": "Prerequisite: Completion of the lower division writing requirement. Philosophical analysis of the concept woman in contemporary U.S. culture and other central concepts in feminist thought, including the nature of oppression, equality and justice, and relationships between sex, gender and sexuality. A critical study of philosophical issues in feminism. Regular written assignments will be required. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "349",
        "title": "Contemporary Social and Political Issues",
        "description": "Prerequisite: Completion of the lower division writing requirement. Philosophical examination of the concepts, values and arguments relevant to understanding and evaluating practical social and political issues central to current public debates concerning such matters as civil and political rights, social and economic inequality, the environment, biotechnology, economic policy and global trade, and the national defense. Regular written assignments will be required. (Available for General Education, C2 Humanities.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "350",
        "title": "Epistemology",
        "description": "Prerequisites: Completion of the lower division writing requirement; 3 units of Philosophy. An investigation into ways of acquiring knowledge and into traditional epistemological problems. Attention will be given to major positions, such as empiricism and rationalism, foundationalism and coherentism, and skepticism, and to theories of knowledge, such as reliabilism and contextualism. Regular written assignments will be required.",
        "units": "3",
        "prerequisites": "{{Completion of the lower division writing requirement} && {3 units of Philosophy}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "352",
        "title": "Metaphysics",
        "description": "Prerequisites: Completion of the lower division writing requirement; 3 units of Philosophy. An examination of traditional and contemporary views concerning major issues in metaphysics, such as continued existence through change, universals and particulars, realism, causation, necessity and possibility, possible worlds and time and space. Regular written assignments will be required.",
        "units": "3",
        "prerequisites": "{{Completion of the lower division writing requirement} && {3 units of Philosophy}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "353",
        "title": "Existentialism",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of representative works of the major existentialists, with the aim of discovering the fundamental tenets of existentialism. Emphasis placed on existentialism’s influence on and relevance to contemporary thought. Regular written assignments will be required. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "355",
        "title": "Philosophy of Mind",
        "description": "Prerequisites: Completion of the lower division writing requirement; 3 units of Philosophy. An examination of traditional and contemporary views concerning the mind, such as the nature of consciousness and intentionality, the prospects and limitations of artificial intelligence and psychological explanation, the nature of mental causation, and the relationship between mind and body. Regular written assignments will be required.",
        "units": "4",
        "prerequisites": "{{Completion of the lower division writing requirement} && {3 units of Philosophy}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "360",
        "title": "Ethical Theory",
        "description": "Prerequisites: Completion of the lower division writing requirement; 3 units of Philosophy. A survey of classical and contemporary theoretical approaches to moral philosophy. Covers such theories as utilitarianism, deontology, virtue ethics, ethical relativism and divine command. Regular written assignments will be required.",
        "units": "4",
        "prerequisites": "{{Completion of the lower division writing requirement} && {3 units of Philosophy}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "365",
        "title": "Social and Political Philosophy",
        "description": "Prerequisites: Completion of the lower division writing requirement; 3 units of Philosophy. A survey of classical and contemporary theoretical approaches in social and political philosophy. Covers such theories as anarchy, absolutism, liberalism, libertarianism, communism, communitarianism and socialism, as well as topics concerning justice, liberty, equality, pluralism and democracy. Regular written assignments will be required.",
        "units": "3",
        "prerequisites": "{{Completion of the lower division writing requirement} && {3 units of Philosophy}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "380",
        "title": "Aesthetics",
        "description": "Prerequisites: Completion of the Lower Division writing requirement; 3 units of Philosophy. An examination of issues in aesthetics such as the nature of art the paradox of fiction the role of censorship the idea of ineffability the concepts of beauty and genius and the relationship of art to morality cognition aesthetic experience and theory.\n",
        "units": "3",
        "prerequisites": "{{Completion of the lower division writing requirement} && {3 units of Philosophy}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "390",
        "title": "Philosophy Of Law",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Philosophical questions arising from the analysis and evaluation of concepts and theories connected with law including law and morality justice freedom and responsibility and the nature of judicial reasoning. Regular written assignments will be required.\n",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "401",
        "title": "Advanced Ancient Philosophy",
        "description": "Prerequisites: 6 units of Philosophy, including PHIL 201. Recommended Preparatory: PHIL 350, PHIL 352, PHIL 355, PHIL 360, or PHIL 365. A detailed study of selected works by Ancient philosophers, with an emphasis on Plato and Aristotle.",
        "units": "3",
        "prerequisites": "{{6 units of Philosophy} && {PHIL 201}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "402",
        "title": "Advanced Modern Philosophy",
        "description": "Prerequisites: 6 units of Philosophy, including PHIL 202; Recommended Preparatory: PHIL 350, PHIL 352, PHIL 355, PHIL 360, or PHIL 365. A detailed study of selected works by modern philosophers from Descartes to Mill.",
        "units": "3",
        "prerequisites": "{{6 units of Philosophy} && {PHIL 202}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "403",
        "title": "Contemporary Philosophy",
        "description": "Prerequisites: 6 units of Philosophy, including PHIL 350, PHIL 352, PHIL 355, PHIL 360, or PHIL 365. An examination of selected contemporary philosophical writings.",
        "units": "3",
        "prerequisites": "{{6 units of Philosophy} && {{PHIL 350} || {PHIL 352} || {PHIL 355} || {PHIL 360} || {PHIL 365}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "406",
        "title": "Philosophy of Sex, Gender, Sexuality",
        "description": "Prerequisites: PHIL 303 or PHIL 348, or QS 301 or QS 302. An examination of issues in philosophy of sex, gender or sexuality, with emphasis on non-normative sex, gender or sexuality.",
        "units": "3",
        "prerequisites": "{{PHIL 303} || {PHIL 348} || {QS 301} || {QS 302}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "431",
        "title": "Philosophical Topics in Logic",
        "description": "Prerequisites: 6 units of Philosophy, including PHIL 230. Recommended Preparatory: PHIL 350, PHIL 352, PHIL 355, PHIL 360, or PHIL 365. An examination of philosophical issues in logic, such as the nature of and choices between logical systems and the relation of logic to traditional philosophical issues.",
        "units": "3",
        "prerequisites": "{{6 units of Philosophy} && {PHIL 230}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "439",
        "title": "Phenomenology",
        "description": "Prerequisites: 6 units of Philosophy, including PHIL 350, PHIL 352 or PHIL 355. A study of the phenomenological approach to such issues as the nature of consciousness, the role of intentionality and meaning in experience, and our experiential relations to others and the world around us. The focus will usually be on one or more historically significant phenomenologists, such as Husserl, Heidegger and Merleau-Ponty, Sartre.",
        "units": "3",
        "prerequisites": "{{6 units of Philosophy} && {{PHIL 350} || {PHIL 352} || {PHIL 355}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "445",
        "title": "Philosophy of Language",
        "description": "Prerequisites: 6 units of Philosophy including PHIL 350, PHIL 352 or PHIL 355. An examination of selected topics concerning the nature of language, such as sense and reference, theories of meaning, pragmatics and speech acts, meaning skepticism, the analytic/synthetic distinction and metaphor.",
        "units": "3",
        "prerequisites": "{{6 units of Philosophy} && {{PHIL 350} || {PHIL 352} || {PHIL 355}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "446",
        "title": "Advanced Social and Political Philosophy",
        "description": "Prerequisites: 6 units of Philosophy, including PHIL 360 or PHIL 365. An advanced analysis and evaluation of selected topics in social and political philosophy, such as the nature of justice, equality, liberty, political rights and the law.",
        "units": "3",
        "prerequisites": "{6 units of Philosophy} && {{PHIL 360} || {PHIL 365}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "450",
        "title": "Advanced Epistemology and Metaphysics",
        "description": "Prerequisites: 6 units of Philosophy, including PHIL 350, PHIL 352 or PHIL 355. An advanced study of selected topics in epistemology, such as internalism and externalism, rationalism and empiricism, theories of knowledge and skepticism.",
        "units": "3",
        "prerequisites": "{{6 units of Philosophy} && {{PHIL 350} || {PHIL 352} || {PHIL 355}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "452",
        "title": "Advanced Metaphysics",
        "description": "Prerequisites: 6 units of Philosophy, including PHIL 350, PHIL 352 or PHIL 355. An advanced study of selected topics in metaphysics, such as continued existence through change, universal and particular, realism, causation, necessity and possibility, possible worlds and time and space.",
        "units": "3",
        "prerequisites": "{{6 units of Philosophy} && {{PHIL 350} || {PHIL 352} || {PHIL 355}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "455",
        "title": "Advanced Philosophy of Mind",
        "description": "Prerequisites: 6 units of Philosophy including PHIL 350, PHIL 352 or PHIL 355. Recommended Preparatory: PHIL 355. An advanced study of selected topics concerning the mind and its relations to reality, such as the nature of consciousness, intentionality, mental causation, psychological explanation, artificial intelligence and the mind/body problem.",
        "units": "3",
        "prerequisites": "{{6 units of Philosophy} && {{PHIL 350} || {PHIL 352} || {PHIL 355}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "460",
        "title": "Advanced Ethical Theory",
        "description": "Prerequisites: 6 units of Philosophy, including PHIL 360 or PHIL 365. An investigation of advanced topics in ethical theory, such as moral responsibility, justice, human rights, intrinsic values and the justification of punishment.",
        "units": "3",
        "prerequisites": "{6 units of Philosophy} && {{PHIL 360} || {PHIL 365}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "495",
        "title": "Advanced Philosophy Of The Sciences",
        "description": "Prerequisite: 6 units of Philosophy including PHIL 330 350 352 or 355. An advanced study of 1 or more key issues in the philosophy of science or philosophical issues in the special sciences such as explanation causality laws and theories theory evaluation realism and anti-realism and relations between the physical and social sciences.\n",
        "units": "3",
        "prerequisites": "{{6 units of Philosophy} && {{PHIL 350} || {PHIL 352} || {PHIL 355}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "497",
        "title": "Senior Research Seminar",
        "description": "Preparatory: Senior standing; At least 21 units in Philosophy courses. Extended research project on a topic of the student’s choice. Collaborative learning is required. Team projects are encouraged. Focus is on formulating a thesis and pursuing appropriate means of developing it in a research project. Class meetings focus on research methodologies and on students discussion of their projects.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Course may be repeated for credit.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]