[
    {
        "subject": "PHYS",
        "catalog_number": "100A",
        "title": "General Physics I",
        "description": "Prerequisite: MATH 105 or MATH 106, or a score on the Mathematics Placement Test (MPT) sufficient for entry into MATH 150A or MATH 255A. Introductory course in physics. Topics covered include mechanics, heat and sound. (Available for General Education, B1 Physical Science. Students may satisfy the B3 Science Laboratory Activity requirement by completing PHYS 100AL.)",
        "units": "3",
        "prerequisites": "MATH 105 or MATH 106, or a score on the Mathematics Placement Test (MPT) sufficient for entry into MATH 150A or MATH 255A",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "100AL",
        "title": "General Physics I Lab",
        "description": "Prerequisite: MATH 105 or MATH 106, or a score on the Mathematics Placement Test (MPT) sufficient for entry into MATH 150A or MATH 255A. Recommended Corequisite or Preparatory: PHYS 100A. 3 hours per week. (Available for General Education, B3 Science Laboratory Activity requirement provided PHYS 100A is also completed.)",
        "units": "1",
        "prerequisites": "MATH 105 or MATH 106, or a score on the Mathematics Placement Test (MPT) sufficient for entry into MATH 150A or MATH 255A",
        "corequisites": "PHYS 100A"
    },
    {
        "subject": "PHYS",
        "catalog_number": "100B",
        "title": "General Physics Ii",
        "description": "Prerequisite: PHYS 100A. Continuation of PHYS 100A. Topics covered include electricity and magnetism, light, and modern physics. (Available for General Education, B1 Physical Science. Students may satisfy the B3 Science Laboratory Activity requirement by completing  PHYS 100BL.)",
        "units": "3",
        "prerequisites": "PHYS 100A",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "100BL",
        "title": "General Physics Ii Lab",
        "description": "Prerequisite: PHYS 100A. Recommended Corequisite or Preparatory: PHYS 100B. 3 hours per week. (Available for General Education, B3 Science Laboratory Activity requirement provided PHYS 100B is also completed.)",
        "units": "1",
        "prerequisites": "PHYS 100A",
        "corequisites": "PHYS 100B"
    },
    {
        "subject": "PHYS",
        "catalog_number": "220A",
        "title": "Mechanics",
        "description": "Prerequisite: MATH 150A or MATH 255A; Recommended Corequisite or Preparatory: MATH 150B or MATH 255B. Dynamics and statics of particles and rigid bodies, harmonic vibrations and fluid mechanics. (Available for General Education, B1 Physical Science. Students may satisfy the B3 Science Laboratory Activity requirement by completing PHYS 220AL.)",
        "units": "3",
        "prerequisites": "MATH 150A or MATH 255A; Recommended Corequisite or Preparatory: MATH 150B or MATH 255B",
        "corequisites": "MATH 150B or MATH 255B"
    },
    {
        "subject": "PHYS",
        "catalog_number": "220AL",
        "title": "Mechanics Lab",
        "description": "Prerequisite: MATH 150A or MATH 255A. Recommended Corequisite or Preparatory: MATH 150B or MATH 255B and PHYS 220A or PHYS 225. 3 hours per week. (Available for General Education, B3 Science Laboratory Activity requirement provided PHYS 220A or PHYS 225 is also completed.)",
        "units": "1",
        "prerequisites": "MATH 150A or MATH 255A",
        "corequisites": "MATH 150B or MATH 255B and PHYS 220A or PHYS 225"
    },
    {
        "subject": "PHYS",
        "catalog_number": "220B",
        "title": "Electricity And Magnetism",
        "description": "Prerequisites: PHYS 220A; MATH 150B or MATH 255B. Recommended Corequisite or Preparatory: MATH 250. Electric and magnetic fields, circuit theory and electromagnetic induction. (Available for General Education, B1 Physical Science. Students may satisfy the B3 Science Laboratory Activity requirement by completing PHYS 220BL.)",
        "units": "3",
        "prerequisites": "PHYS 220A; MATH 150B or MATH 255B",
        "corequisites": "MATH 250"
    },
    {
        "subject": "PHYS",
        "catalog_number": "220BL",
        "title": "Electricity And Magnetism Lab",
        "description": "Prerequisites: PHYS 220A or PHYS 225; MATH 150B or MATH 255B. Recommended Corequisite or Preparatory: MATH 250; PHYS 220B or PHYS 226. 3 hours per week. (Available for General Education, B3 Science Laboratory Activity requirement provided PHYS 220B or PHYS 226 is also completed.)",
        "units": "1",
        "prerequisites": "PHYS 220A or PHYS 225; MATH 150B or MATH 255B",
        "corequisites": "MATH 250; PHYS 220B or PHYS 226"
    },
    {
        "subject": "PHYS",
        "catalog_number": "225",
        "title": "Physics I",
        "description": "Prerequisite: MATH 150A. Recommended Corequisite or Preparatory: MATH 150B. First course of a sequence intended primarily for physical science majors. Calculus-based course on mechanics, fluids, waves and acoustics.",
        "units": "4",
        "prerequisites": "MATH 150A",
        "corequisites": "MATH 150B"
    },
    {
        "subject": "PHYS",
        "catalog_number": "226",
        "title": "Physics Ii",
        "description": "Prerequisites: MATH 150B; PHYS 225. Recommended Corequisite or Preparatory: MATH 250. Second course of a sequence of courses intended primarily for physical science majors. Calculus-based course on electricity, magnetism and optics.",
        "units": "4",
        "prerequisites": "MATH 150B; PHYS 225",
        "corequisites": "MATH 250"
    },
    {
        "subject": "PHYS",
        "catalog_number": "227",
        "title": "Physics Iii",
        "description": "Prerequisites: MATH 150B; PHYS 226 or PHYS 220B. Recommended Corequisite or Preparatory: MATH 280. Third course of a sequence of courses intended primarily for physical science majors. Calculus-based course on thermodynamics, waves and modern physics.",
        "units": "4",
        "prerequisites": "MATH 150B; PHYS 226 or PHYS 220B",
        "corequisites": "MATH 280"
    },
    {
        "subject": "PHYS",
        "catalog_number": "227L",
        "title": "Physics Iii Lab",
        "description": "Recommended Corequisite or Preparatory: PHYS 227. 3 hours per week.",
        "units": "1",
        "prerequisites": "None",
        "corequisites": "PHYS 227"
    },
    {
        "subject": "PHYS",
        "catalog_number": "301",
        "title": "Analytical Mechanics I",
        "description": "Preparatory: MATH 250, PHYS 280; PHYS 227; Recommended Corequisite or Preparatory: PHYS 389. Newtonian mechanics of a single particle, oscillations, systems of particles, central force motion, calculus of variations and Lagrangian and Hamiltonian mechanics.",
        "units": "4",
        "prerequisites": "None",
        "corequisites": "PHYS 389"
    },
    {
        "subject": "PHYS",
        "catalog_number": "305",
        "title": "Physics Of Music",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course is currently taught entirely and only online. History and development of the science of sound and music, physical concepts necessary for the study of wave motion, mechanics of the construction of sound and musical tones, and basic physical principles involved in the production of sound in instruments and the human voice, including studies of the production of language. A good understanding of the composition of sounds and musical tones is obtained without detailed mathematics through experiments carried out in the home or other locations using the student’s computer with installed software. A final project is required. (Available for General Education, B5 Scientific Inquiry and Quantitative Reasoning.) (IC)",
        "units": "3",
        "prerequisites": "Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "305L",
        "title": "Physics Of Music Lab",
        "description": "Prerequisite: Completion of the lower division writing requirement. Corequisite: PHYS 305. This course is currently taught entirely and only online. History and development of the science of sound and music, physical concepts necessary for the study of wave motion, mechanics of the construction of sound and musical tones, and basic physical principles involved in the production of sound in instruments and the human voice, including studies of the production of language. A good understanding of the composition of sounds and musical tones is obtained without detailed mathematics through experiments carried out in the home or other locations using the student’s computer with installed software. A final project is required.",
        "units": "1",
        "prerequisites": "Completion of the lower division writing requirement",
        "corequisites": "PHYS 305"
    },
    {
        "subject": "PHYS",
        "catalog_number": "311",
        "title": "Electromagnetism I",
        "description": "Preparatory: MATH 250, MATH 280; PHYS 227; Recommended Corequisite or Preparatory: PHYS 389. Vector calculus, electrostatics, magnetostatics, Faradays Law and introduction to Maxwell’s equations.",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "PHYS 389"
    },
    {
        "subject": "PHYS",
        "catalog_number": "331",
        "title": "Physics Of Sports",
        "description": "Prerequisite: Completion of the lower division writing requirement. Why do ice skaters spin faster when they pull their arms in? Why does a golf ball have dimples? How does a baseball pitcher make a ball curve? Why does a quarterback throw a spiral? These and similar questions can be understood via the laws of physics. In this course, students use sports to explore the laws and concepts of physics: kinematics, dynamics, momentum, angular momentum, energy, and power. For each physics concept studied, students explore real-world applications in sports. At the end of the course, students will embark on a project where they apply what they learn to a situation in their favorite sport. (Available for General Education, B5 Scientific Inquiry and Quantitative Reasoning.)",
        "units": "3",
        "prerequisites": "Completion of the lower division writing requirement",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "365",
        "title": "Experimental Physics I",
        "description": "Preparatory: MATH 250, MATH 280; PHYS 227, PHYS 227L; Recommended Corequisite or Preparatory: PHYS 389. Introduction to computational physics with application to topics including dynamical systems, celestial mechanics, climate science, thermodynamics, electromagnetism, and other topics chosen by the instructor. Students are trained to use constructs, such as variables, loops, branching, and functions, in a modern programing language. Concurrently, students use these skills to implement basic numerical procedures to solve physical and mathematical problems.",
        "units": "2",
        "prerequisites": "None",
        "corequisites": "PHYS 389"
    },
    {
        "subject": "PHYS",
        "catalog_number": "366",
        "title": "Experimental Physics Ii",
        "description": "Preparatory: MATH 250, MATH 280; PHYS 227 and PHYS 227L, PHYS 389. Advanced experimental techniques in physics, with topics including optics, nuclear physics, thin-film characteristics, microwaves, data acquisition via computer interface, computer simulations, solar observations and other topics chosen by the instructor. Students are trained in advanced experimental techniques and complete two experimental modules for 2 units of credit. 6 hours per week.",
        "units": "2",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "375",
        "title": "Quantum Physics I",
        "description": "Preparatory: PHYS 301, PHYS 389. Classical background, the wave function, Schroedinger equation, time development and stationary states, 1-dimensional problems, harmonic oscillator and formalism of quantum mechanics.",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "376",
        "title": "Radiologic Physics",
        "description": "Preparatory: PHYS 100A, PHYS 100AL, PHYS 100B, PHYS 100BL or instructor consent. Specialized course devoted to the nature and production of X-radiation. Topics include the interaction of radiation with matter, attenuation of X-rays and the principles behind radiographic equipment and components.",
        "units": "4",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "389",
        "title": "Mathematical Methods In Physics I",
        "description": "Preparatory: PHYS 227; MATH 280 or MATH 351. An introduction to the mathematical methods used in junior and senior level physics courses. Topics covered include vector analysis, linear algebra, and partial differentiation.",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "402",
        "title": "Analytical Mechanics Ii",
        "description": "Preparatory: PHYS 301, PHYS 389. Noninertial reference frames, rigid body motion, coupled oscillations, nonlinear mechanics, scattering, vibrating string and Fourier analysis. Available for graduate credit.",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "410",
        "title": "Electromagnetism Ii",
        "description": "Preparatory: PHYS 301, PHYS 311, PHYS 389. Maxwell’s equations and applications, electromagnetic waves, radiation and special relativity. Available for graduate credit.",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "420",
        "title": "Modern Optics",
        "description": "Preparatory: PHYS 311, PHYS 375. Propagation of electromagnetic waves. Geometrical optics. Physical optics, including refraction, reflection, interference, diffraction, and polarization. Atomic spectroscopy. Lasers. Available for graduate credit.",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "431",
        "title": "Thermodynamics And Statistical Mechanics",
        "description": "Preparatory: PHYS 301, PHYS 375. Laws of thermodynamics, thermodynamic potentials, kinetic theory, phase transitions, equilibrium ensembles and related formalism with applications to classical and quantum systems. Available for graduate credit.",
        "units": "4",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "451",
        "title": "Quantum Physics Ii",
        "description": "Preparatory: PHYS 311, PHYS 375. Hydrogen atom, angular momentum, spin, matrix representation, quantum statistics, perturbation theory and scattering. Available for graduate credit.",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "465",
        "title": "Experimental Physics Iii",
        "description": "Preparatory: PHYS 365. Advanced experimental techniques in physics with topics including optics, nuclear physics, thin-film characteristics, microwaves, data acquisition via computer interface, computer simulations, solar observations and other topics chosen by the instructor. Students are trained in advanced experimental techniques and will complete two experimental modules for 2 units of credit. Available for graduate credit. 6 hours per week.",
        "units": "2",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "466",
        "title": "Experimental Physics Iv",
        "description": "Preparatory: PHYS 365. Advanced experimental techniques in physics with topics including optics, nuclear physics, thin-film characteristics, microwaves, data acquisition via computer interface, computer simulations, solar observations and topics chosen by the instructor. Students are trained in advanced experimental techniques and will complete two experimental modules for 2 units of credit. Available for graduate credit. 6 hours per week.",
        "units": "2",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "480",
        "title": "Introduction To Solid State Physics",
        "description": "Preparatory: PHYS 311, PHYS 375. Structure of crystals; electron theory of metals; theory of semiconductors; and mechanical, electrical and magnetic behavior of substances in the solid state. Available for graduate credit.",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "489",
        "title": "Mathematical Methods In Physics Ii",
        "description": "Prerequisite: PHYS 389 or graduate standing; Preparatory: MATH 380, PHYS 375 (may be taken concurrently). Topics include complex variables, ordinary and partial differential equations, special functions, and boundary value problems with physical applications. Available for graduate credit.",
        "units": "3",
        "prerequisites": "PHYS 389 or graduate standing; Preparatory: MATH 380, PHYS 375 (may be taken concurrently)",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "490",
        "title": "Computer Applications In Physics",
        "description": "Preparatory: PHYS 301 and 365 or instructor consent. Applications of numerical analysis and computer programming to the solution of problems in classical and modern physics. Available for graduate credit.\n",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "493",
        "title": "Physics And Astronomy Colloquium",
        "description": "Preparatory: Junior, senior or graduate standing in Physics. Series of lectures presented weekly by faculty members and invited speakers on topics of current interest in physics, astronomy and related fields. Available for graduate credit. May be repeated twice for credit.",
        "units": "1",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "497",
        "title": "Senior Project",
        "description": "Prerequisite: Permission of instructor. This is a senior project course. In it, students work independently throughout the semester on a project assigned by their faculty advisor. Students are required to find a faculty advisor before the course starts. Student project work is done independently, but class will meet weekly to discuss progress, practice talks, writing, and work on practice problems before taking a comprehensive exam in the last week of the semester. Students will write a report and give a presentation on their project at the end of the semester.",
        "units": "3",
        "prerequisites": "Permission of instructor",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "498",
        "title": "Undergraduate Thesis",
        "description": "Preparatory: Admission to Honors Program in Physics.",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "See Independent Study under Courses of Study.",
        "units": "1",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "585",
        "title": "Comp Mat Theory",
        "description": "Prerequisite: PHYS 451 or PHYS 650 or instructor permission. Introduction to the mathematical and physical principles underlying computational materials theory based on quantum mechanics. Topics will include the density functional theory– the cornerstone of modern electronic structure calculations for atoms, molecules, and solids. We will also cover quantum transport, magnetism, and many body physics. The emphasis is to develop theoretical models for real materials and solve the problem by applying advanced numerical methods. The course is aimed at advanced undergraduates and graduate students in understanding advanced physics in material science through hands-on research projects.",
        "units": "3",
        "prerequisites": "PHYS 451 or PHYS 650 or instructor permission",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "588",
        "title": "Multiferroics",
        "description": "Prerequisite: PHYS 451. The lectures cover a wide area of topics ranging from electronic structure, to mechanical properties, to experimental methods of multiferroic systems. Upon completing the course, the student will gain a good overview of multiferroic materials ranging from history to devices applications. Different types of multiferroic materials will be studied with basic crystal structure of single-phase multiferroics presented as well as the fundamental physics underlying ferroelectricity and ferromagnetism. A material science description of these materials focusing on linear and nonlinear behavior with associated mechanisms such as spin reorientation will be discussed. We will also present analytical tools used to predict materials’ response ranging from constitutive relations to governing equations including elastodynamics and Maxwell’s. Analytical and physical descriptions used to explain several devices manufactured with multiferroics including magnetometers, memory devices, motors and antennas will also be presented.",
        "units": "3",
        "prerequisites": "PHYS 451",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "600",
        "title": "Classical Mechanics",
        "description": "Preparatory: PHYS 402, PHYS 410, PHYS 451. Advanced course in classical mechanics, with topics selected from Lagrangian and Hamiltonian dynamics, continuum mechanics, nonlinear systems and chaos.",
        "units": "4",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "601",
        "title": "Selected Topics In Astrophysics",
        "description": "Preparatory: PHYS 375, PHYS 402, PHYS 410. Advanced treatment of the observational and theoretical foundations of astrophysics. Topics may include stellar structure, radio sources, relativistic cosmology, the origin of the elements and galaxy formation.",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "610",
        "title": "Electromagnetic Theory",
        "description": "Preparatory: PHYS 410, PHYS 489. Advanced theoretical treatment of the electrostatic field with introduction of mathematical techniques. Introduction to electromagnetic waves and radiation from sources.",
        "units": "4",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "630",
        "title": "Statistical Physics",
        "description": "Preparatory: PHYS 431, PHYS 451, PHYS 600. Theoretical foundations of thermodynamics and statistical mechanics for equilibrium and non-equilibrium systems. Applications to Bose and Fermi assemblies, real gases, liquids, solids, solutions, phase transitions and chemical reactions.",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "650",
        "title": "Quantum Mechanics I",
        "description": "Preparatory: PHYS 451. Recommended Corequisite or Preparatory: PHYS 600. Mathematical foundation of quantum theory. Scattering theory. Angular momentum and spin. Identical particles. Heisenberg and Schrodinger representations. Perturbation theory.",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "PHYS 600"
    },
    {
        "subject": "PHYS",
        "catalog_number": "651",
        "title": "Quantum Mechanics Ii",
        "description": "Preparatory: PHYS 650. Relativistic wave equations. Advanced scattering theory. Selected topics from quantum theory of atoms and molecules.",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "696A",
        "title": "Directed Graduate Research",
        "description": "Directed Graduate Research",
        "units": "1",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisite: Consent of the graduate coordinator. (Credit/No Credit Only)",
        "units": "1",
        "prerequisites": "Consent of the graduate coordinator",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "698C",
        "title": "Thesis",
        "description": "Preparatory: Classified graduate status; Permission of the Department; Instructors consent to serve as Thesis Advisor. Dissertation of a specialized advanced topic in physics such as a critical evaluation and extension of an existing theoretical treatment the construction and use of advanced research apparatus or an original theoretical analysis.\n",
        "units": "3",
        "prerequisites": "None",
        "corequisites": "None"
    },
    {
        "subject": "PHYS",
        "catalog_number": "699A",
        "title": "Independent Study",
        "description": "Preparatory: At least one graduate course in Physics; Instructor consent. Investigation of a special topic in physics, with emphasis on advanced theoretical or experimental skills. See Independent Study under Courses of Study.",
        "units": "1",
        "prerequisites": "None",
        "corequisites": "None"
    }
]