[
    {
        "subject": "RTM",
        "catalog_number": "150",
        "title": "Introduction to Outdoor Education in the Backcountry",
        "description": "Prerequisite: Restricted to Kinesiology majors. Introduction to safe back country camping and travel, including elements of trip preparation; cross-country navigation; effects of environmental conditions of cold, heat and altitude on the human body; and nutrition and environmental hazards. Emphasis on safety, environmental awareness and minimizing environmental impact. Arranged field trips are required.",
        "units": "2",
        "prerequisites": "{Restricted to Kinesiology majors}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "151A",
        "title": "Backpacking",
        "description": "Introduction to backpacking as an outdoor pursuit. Emphasis on proper use of equipment and safety of participants in the natural environment. This course is designed to give students a general overview of and experience in backpacking and spending time in the back country. Arranged field trips are required.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "151B",
        "title": "Rock Climbing and Mountaineering",
        "description": "Basic elements of rock climbing, mountaineering and alpine travel will be examined, including climbing ethics, fitness and the physiological effects of environmental stress and work at high altitudes. Emphasis will be on safety, proper use of equipment, climbing technique and minimizing impacts on the natural environment. Arranged field trips are required.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "151C",
        "title": "Winter Mountaineering",
        "description": "Advanced instruction in mountaineering and travel in the back country, with particular emphasis on snow and ice climbing, avalanche prediction, physical effects of high altitudes and winter camping skills. Emphasis is on technique, proper use of equipment, environmental practices and safety. Arranged field trips are required.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "151D",
        "title": "Flat-Water Boating",
        "description": "Introduction to safe travel by kayak or canoe on lakes, rivers and oceans. Includes equipment, navigation and techniques for flat-water boating and emergency self-rescue. Emphasis will be on safety, environmental awareness and skill development. Arranged field trips are required.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "151F",
        "title": "Survival",
        "description": "Studies in the skills essential for wilderness survival in a variety of physical environments. Includes topics of shelters, water, navigation and edible plants and animals. Emphasis on techniques with primitive technologies, environmental conservation and safety. Arranged field trips are required.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "151G",
        "title": "Challenge/Ropes Courses",
        "description": "Introduction to the safe operation of challenge/ropes course activities for outdoor experience. Emphasis on proper use of equipment and safety of both high- and low-component challenge courses. This course is designed to give students a general overview of and experience in the practice of group challenges utilizing initiatives and high ropes elements. Arranged field trips are required.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "151H",
        "title": "Caving",
        "description": "Introduction to the safe exploration of caves and the underground environment, including cave formations and features, techniques and special hazards. Emphasis on safety techniques for horizontal and vertical caves, environmental awareness and skill development. Arranged field trips are required.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "202",
        "title": "Planning Programs and Events for Recreation Experiences",
        "description": "Prerequisite: Lower division writing requirement; Corequisite: RTM 202L. Overview of the program- and event-planning processes as they relate to the provision of human and leisure services through play, recreation and leisure experiences for a variety of service recipients and settings. Lab experiences applying skills and principles addressed.",
        "units": "2",
        "prerequisites": "{Lower division writing requirement}",
        "corequisites": "{RTM 202L}"
    },
    {
        "subject": "RTM",
        "catalog_number": "202L",
        "title": "Planning Programs and Events for Recreation Experiences Lab",
        "description": "Prerequisite: Lower division writing requirement; Corequisite: RTM 202L. Overview of the program- and event-planning processes as they relate to the provision of human and leisure services through play, recreation and leisure experiences for a variety of service recipients and settings. Lab experiences applying skills and principles addressed.",
        "units": "1",
        "prerequisites": "{Lower division writing requirement}",
        "corequisites": "{RTM 202}"
    },
    {
        "subject": "RTM",
        "catalog_number": "204",
        "title": "Introduction to Recreation Therapy",
        "description": "Study of the nature and function of recreation in a variety of agencies and settings. Overview of the physical, cognitive, affective and social characteristics of a variety of individuals with special needs, with emphasis on planning and adapting recreation programs both in clinical and community/inclusive settings. Participation in fieldwork is required.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "251",
        "title": "Recreation and the Natural Environment",
        "description": "Study of recreational use of outdoor/natural areas and the trends creating changing patterns of use. Overview of human, animal and vehicular impacts on the outdoor recreation resources. (Available for General Education, E Lifelong Learning.) (IC)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "265",
        "title": "Water Skiing and Wakeboarding",
        "description": "Prerequisite: Basic swimming skills. Develops proficiency in water skiing skills, including wakeboarding, with an emphasis on safety and the proper use of equipment.",
        "units": "1",
        "prerequisites": "{Basic swimming skills}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "267",
        "title": "Sailing",
        "description": "Prerequisite: Elementary swimming skills. Corequisite: RTM 267L. Development of the skills and art of sailing, including the development of basic seamanship, small boat handling competency, safety procedures and regulations and introductions to competitive sailing and ocean cruising. 1 hour lecture, 2 hours lab per week.",
        "units": "1",
        "prerequisites": "{Elementary swimming skills}",
        "corequisites": "{RTM 267L}"
    },
    {
        "subject": "RTM",
        "catalog_number": "267L",
        "title": "Sailing Lab",
        "description": "Prerequisite: Elementary swimming skills. Corequisite: RTM 267L. Development of the skills and art of sailing, including the development of basic seamanship, small boat handling competency, safety procedures and regulations and introductions to competitive sailing and ocean cruising. 1 hour lecture, 2 hours lab per week.",
        "units": "1",
        "prerequisites": "{Elementary swimming skills}",
        "corequisites": "{RTM 267}"
    },
    {
        "subject": "RTM",
        "catalog_number": "278",
        "title": "Exploring the World of Tourism, Hospitality, Recreation, and Parks",
        "description": "Introduction to conceptual foundations in tourism, hospitality, recreation, and parks. Overview of tourism, hospitality, recreation, and parks and the various sectors that make up these industry groups from local to international levels. Exposure to career opportunities in tourism, hospitality, recreation, and parks. Regular written assignments are required. (Available for General Education, E Lifelong Learning).",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "280",
        "title": "Organizing Campus Recreation and Sport",
        "description": "Overview of the concepts and applications for effective campus recreation and sport programming and administration. Of value to current and future leaders in the field of campus recreation and sport. Includes specific field observation experiences.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "300",
        "title": "Recreation and Community Development",
        "description": "Prerequisite: Lower division writing requirement. Examination of the multicultural dynamics of urban life, and recreation’s role in building community and in developing youth capacity and indigenous leadership.",
        "units": "3",
        "prerequisites": "{Lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "302",
        "title": "Dynamics of Leadership in Recreation and Human Services",
        "description": "Prerequisites: Lower division writing requirement. Includes an analysis of personal leadership theory and small-group dynamics and a review of classic leadership studies, with emphasis on leadership values and methods, including group dynamics, communication, decision making and motivation. Emphasis on competencies and skills needed for successful leadership of small groups. Experiential components are an integral part of class design. Field trip experiences required.",
        "units": "2",
        "prerequisites": "{Lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "303",
        "title": "Promotion of the Recreation Experience",
        "description": "Interpretation and promotion of recreation programs and services through the use of media processes and resources, marketing principles and computer applications.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "304",
        "title": "Entrepreneurial Ventures in Recreation and Human Services",
        "description": "Analysis of approaches and techniques necessary to initiate an entrepreneurial start-up in the recreation and human service arenas. Topics include the nature of entrepreneurialism, development of a business plan, organization of the enterprise, financial and operations management, and computer applications.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "305",
        "title": "Dynamics of Early Childhood Play",
        "description": "Study of play in relation to the child’s early growth and development. Implications for functional, environmental and leadership dimensions of organized play experiences in early years. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the Schedule of Classes for the CS Designation.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "306",
        "title": "Leadership Coaching",
        "description": "Preparatory: RTM 302. A basic foundation for understanding and practicing coaching methodology for leadership development. Content includes core coaching competencies and principles, the coaching conversation model, ethics and standards, application of skills necessary for one-to-one coaching to produce positive change in leaders.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "310",
        "title": "Adventure Recreation and Human Relations",
        "description": "Prerequisite: Completion of the lower division writing requirement. Corequisite: RTM 310L. Explore issues of cultural identity, racial and ethnic diversity, gender, ableism, and self-esteem through readings, written assignments, and recitation. Diversity issues introduced through personal growth and adventure experiences. Regular written assignments required. Lab: Diversity issues introduced through experiential learning in group initiatives, challenge course or wilderness activities, and group dialogue. (Available for General Education, E Lifelong Learning or F Comparative Cultural Studies.) (IC)",
        "units": "2",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{RTM 310L}"
    },
    {
        "subject": "RTM",
        "catalog_number": "310L",
        "title": "Adventure Recreation and Human Relations Lab",
        "description": "Prerequisite: Completion of the lower division writing requirement. Corequisite: RTM 310L. Explore issues of cultural identity, racial and ethnic diversity, gender, ableism, and self-esteem through readings, written assignments, and recitation. Diversity issues introduced through personal growth and adventure experiences. Regular written assignments required. Lab: Diversity issues introduced through experiential learning in group initiatives, challenge course or wilderness activities, and group dialogue. (Available for General Education, E Lifelong Learning or F Comparative Cultural Studies.) (IC)",
        "units": "1",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{RTM 310}"
    },
    {
        "subject": "RTM",
        "catalog_number": "314",
        "title": "Hospitality and Customer Service",
        "description": "Prerequisite: Lower division writing requirement. Study of various aspects of hospitality and customer service as applied to recreation, tourism and hospitality industries. A systems approach is used to study the design and organization of components of providing outstanding hospitality and customer service.",
        "units": "3",
        "prerequisites": "{Lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "330",
        "title": "Women, Leisure and Ethnicity in the United States",
        "description": "Prerequisite: Lower division writing requirement. Examines the relationship among women, ethnicity and leisure. Provides opportunities to investigate a variety of factors affecting women in the U.S. Regular written assignments required. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the Schedule of Classes for the CS Designation. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "351",
        "title": "Outdoor and Environmental Education",
        "description": "Study of outdoor educational philosophy and methods as they apply to the outdoor educator. Includes the history, development and basic principles of outdoor/ environmental education, but emphasizes strategies for teaching, interpreting and program planning in outdoor environments.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "352",
        "title": "Play and Human Potential",
        "description": "Prerequisite: Lower division writing requirement. Examination of the play phenomenon across the lifespan. Exploration, analysis and evaluation of the play phenomenon in development of human potential. Regular written assignments are required. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the Schedule of Classes for the CS Designation. (Available for General Education, E Lifelong Learning.) (IC)",
        "units": "3",
        "prerequisites": "{Lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "353",
        "title": "Literature of the Wilderness Experience",
        "description": "Prerequisite: Lower division writing requirement. Corequisite: RTM 353L. Review of the writings of various wilderness adventurers both past and present (such as Boone, Powell, Muir, Leopold and Abbey). Emphasis on assessing their experiences in the wilderness, their goals and their methods. Regular written assignments are required. Lab: Allows students to personally experience some of the values of wilderness environments discussed in RTM 353. In addition, students develop personal goals (such as those sought by previous wilderness adventurers) to be achieved on arranged field trips to wilderness areas. (Available for General Education, E Lifelong Learning.)",
        "units": "2",
        "prerequisites": "{Lower division writing requirement}",
        "corequisites": "{RTM 353L}"
    },
    {
        "subject": "RTM",
        "catalog_number": "353L",
        "title": "Literature of the Wilderness Experience Lab",
        "description": "Prerequisite: Lower division writing requirement. Corequisite: RTM 353L. Review of the writings of various wilderness adventurers both past and present (such as Boone, Powell, Muir, Leopold and Abbey). Emphasis on assessing their experiences in the wilderness, their goals and their methods. Regular written assignments are required. Lab: Allows students to personally experience some of the values of wilderness environments discussed in RTM 353. In addition, students develop personal goals (such as those sought by previous wilderness adventurers) to be achieved on arranged field trips to wilderness areas. (Available for General Education, E Lifelong Learning.)",
        "units": "1",
        "prerequisites": "{Lower division writing requirement}",
        "corequisites": "{RTM 353}"
    },
    {
        "subject": "RTM",
        "catalog_number": "402",
        "title": "Models of Play, Leisure and Recreation",
        "description": "Examines the historical, theoretical and philosophical foundations of play, leisure and recreation and their relevance to the professional today. Explores how play theory and philosophy impact the provision of service to individuals across the lifespan and with diverse needs. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "403",
        "title": "Evaluation Research in Recreation and Human Services",
        "description": "Investigation into the fields and methods of recreation and leisure systems, including special techniques and concepts of research as applicable to these systems.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "406",
        "title": "Enhancing Childhood Creativity",
        "description": "Corequisite: RTM 406L. Integrative seminar and lab experience focusing on the theoretical approaches for enhancing childhood creativity. The uses of play and fantasy are explored as the means for developing programs that are child-oriented. Regular written assignments are required. Available for graduate credit. (Cross-listed with CADV 406/L.)",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{RTM 406L}"
    },
    {
        "subject": "RTM",
        "catalog_number": "406L",
        "title": "Enhancing Childhood Creativity Lab",
        "description": "Corequisite: RTM 406L. Integrative seminar and lab experience focusing on the theoretical approaches for enhancing childhood creativity. The uses of play and fantasy are explored as the means for developing programs that are child-oriented. Regular written assignments are required. Available for graduate credit. (Cross-listed with CADV 406/L.)",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{RTM 406}"
    },
    {
        "subject": "RTM",
        "catalog_number": "414",
        "title": "Food and Beverage Management",
        "description": "Understand food and beverage operations in the hospitality industry. Study operations, food service marketing, menu cost and pricing strategies, hospitality accounting, customer service experiences, facility design, and sanitation and safety issues. Opportunity to qualify for the American Hotel and Lodging Association (AHLA) Food and Beverage Management Certification. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "415",
        "title": "Leisure and Aging",
        "description": "Study of the psycho-social aspects of aging as related to leisure and recreation. Implications for functional environmental and leadership dimensions of leisure and recreation experiences in the later years. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the Schedule of Classes for the CS Designation. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "424",
        "title": "Meetings and Conventions Management",
        "description": "Preparatory: RTM 314. The meetings and conventions sector represents a significant component of hospitality and tourism. Components of planning, coordinating and managing meetings and conventions will be examined. Factors such as impacts, policies, feasibility, and risk management of meetings and conventions will be examined in detail. Case studies will be evaluated and critiqued. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "434",
        "title": "Accommodations Management",
        "description": "Preparatory: RTM 314. Students develop a sound understanding of the accommodations industry. Students will examine techniques, issues, and problems of rooms division management systems, food and beverage, and other functional areas according to hotel category. Review current information technology used in hotel operations. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "444",
        "title": "Nonprofit Organizations and Fund-Development in Leisure and Human Services",
        "description": "Historical survey of the development of the volunteer movement and its leisure function in American society; theory of voluntary participation and philanthropy; structure and function of volunteer boards; and analysis of fundraising organization and techniques. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "452",
        "title": "Outdoor Recreation Leadership",
        "description": "Prerequisite: RTM 351. Corequisite: RTM 452L. Analysis of leadership theory and small group dynamic as they apply to such unique outdoor recreation circumstances as camps, sailing programs or wilderness expedition. Emphasis on the competencies, training, methods and procedures that are critical to the leading of safe outdoor programs. Lab: Development of outdoor leadership through the direct application of leadership theories and methods in outdoor recreation programs and backcountry settings. Preparatory course for outdoor recreation professionals. Arranged field trips are required. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{RTM 351}",
        "corequisites": "{RTM 452L}"
    },
    {
        "subject": "RTM",
        "catalog_number": "452L",
        "title": "Outdoor Recreation Leadership Lab",
        "description": "Prerequisite: RTM 351. Corequisite: RTM 452L. Analysis of leadership theory and small group dynamic as they apply to such unique outdoor recreation circumstances as camps, sailing programs or wilderness expedition. Emphasis on the competencies, training, methods and procedures that are critical to the leading of safe outdoor programs. Lab: Development of outdoor leadership through the direct application of leadership theories and methods in outdoor recreation programs and backcountry settings. Preparatory course for outdoor recreation professionals. Arranged field trips are required. Available for graduate credit.",
        "units": "2",
        "prerequisites": "{RTM 351}",
        "corequisites": "{RTM 452}"
    },
    {
        "subject": "RTM",
        "catalog_number": "480",
        "title": "Recreational Tourism: Issues and Trends",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of the phenomena of domestic and international recreational tourism. Emphasis on investigating and understanding the variables that impact recreational tourism and travel destination areas. Regular written assignments are required.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "481",
        "title": "Principles of Sustainable Tourism",
        "description": "Preparatory: RTM 480. An indepth analysis of the principles and theories of sustainability as they pertain to tourism. Various types of tourism will be examined and evaluated from economic, social and natural environment perspectives. Striking a balance among competing impacts of tourism development will be emphasized. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "490",
        "title": "Challenges in Leisure Services Seminar",
        "description": "Analytical approach to theories and principles of recreation, leisure and play as they relate to field observations and practical applications.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "494C",
        "title": "Supervised Internship",
        "description": "Prerequisites: RTM 490 (required for undergraduate students); Senior standing (required for undergraduate students). Supervised internship in professional recreation settings. Available for graduate credit. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{RTM 490 (required for undergraduate students)} && {Senior standing (required for undergraduate students)}}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "498A",
        "title": "Field Assignment and Reports",
        "description": "Analysis and reports of the student’s study project in a field site location. Available for graduate credit.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Independent study. Available for graduate credit.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "500",
        "title": "Foundations in Tourism Hospitality and Recreation",
        "description": "This course examines hospitality, tourism, and recreation from psychological, social, and economic perspectives, and reviews different segments of the hospitality, tourism, and recreation industries.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "510",
        "title": "Trends and Issues in Tourism, Hospitality and Recreation",
        "description": "Identification and analysis of current and future trends, challenges and issues that affect management of tourism, hospitality and recreation services and programs.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "520",
        "title": "Trends and Issues in Recreational Sport",
        "description": "Identification and analysis of current trends, challenges and issues that affect management of recreational sport facilities and programs. An examination of history of the profession, current professional and research issues, along with anticipation and preparation for the future.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "530",
        "title": "Cultural Aspects and Global Perspectives in Tourism",
        "description": "Preparatory: RTM 314 or RTM 480. Addresses issues culture as it is affected by tourism. We will examine issues of authenticity, co modification of culture and the interaction of hosts and guests in different contexts, ranging from the industrialized world to developing countries.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "540",
        "title": "Human Resources in Tourism, Hospitality and Recreation",
        "description": "This course provides an understanding and application of key concepts/practices in human resource management as related to the tourism, hospitality and recreation industries.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "550",
        "title": "Marketing and Promotion in Tourism, Hospitality and Recreation",
        "description": "An in-depth study of the theory and application of marketing and promotion as they relate to the tourism, hospitality and recreation industries.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "560",
        "title": "Facility Design in Recreational Sport",
        "description": "Investigation of principles of design, planning, management and operation of recreational sport facilities. Students will be introduced to facility and event management, facility components, specifications, recreation spaces, specialty areas and facility trends.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "580",
        "title": "Seminar in Tourism Planning: A Cultural and International Perspective",
        "description": "Analysis and evaluation of the impact of historical tourism planning trends and their influence on human services and quality-of-life issues. Advanced study of the application of contemporary tourism planning models.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "610",
        "title": "Sustainability in Hospitality and Tourism",
        "description": "Addresses issues of sustainability as they pertain to hospitality and tourism. Traditionally, these sectors have operated with a short-term perspective and have been largely consumptive in nature. Students will evaluate principles of sustainability, how they relate to hospitality and tourism, and their effectiveness in different regions of the world.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "620",
        "title": "Effective Teams and Leaders in Tourism, Hospitality, and Recreation Organizations",
        "description": "Application of research on effective teams and executive leadership for organizations in the tourism, hospitality, and recreational sport industries.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "660",
        "title": "Crisis Management for Tourism, Hospitality, or Recreation Organizations",
        "description": "Preparation for and response to a major crisis for a hospitality, tourism, or recreation destination. Students will gain the knowledge and skills to identify potential threats such as a natural disaster or human tragedy and develop disaster mitigation and crisis management procedures from guest safety to media response.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "684",
        "title": "Research Methods and Design",
        "description": "Discussion and application of scientific research in the field of tourism, hospitality, and recreation. Procedure in research design, data collection, data analysis, data presentation, and data interpretation/utilization.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "693B",
        "title": "Supervised Internship II",
        "description": "Prerequisite: Instructor consent. Supervised internships requiring completion of 300 hours in an approved setting in recreational sport management or hospitality or travel and tourism. The supervised internship is designed to provide a hands-on learning experience in management of recreational sport or tourism or hospitality.",
        "units": "3",
        "prerequisites": "{Instructor consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "This course is for students to enroll in during the preparation and examination phase of their M.S. degree. This course will allow students to review and synthesize the information learned during the program, reflect and assess the level of mastery attained, prepare preparatory case studies and complete their culminating examination. Students will be expected to develop links between the various courses and, during the course of the exam, apply this integrated information to develop answers to current problems in the field. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "698",
        "title": "Graduate Project or Thesis",
        "description": "Prerequisite: Instructor consent. Culminating experience for the graduate degree. Planning, preparation and completion of a graduate project or thesis on an advanced topic in the field of recreational sport management or hospitality, travel and tourism.",
        "units": "3",
        "prerequisites": "{Instructor consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "698D",
        "title": "Graduate Culminating Project",
        "description": "Prerequisite: Instructor Consent. Culminating experience for the graduate degree. Planning, preparation and completion of a graduate project on an advanced topic in the field of recreational management or hospitality, travel and tourism.",
        "units": "3",
        "prerequisites": "{Instructor Consent}",
        "corequisites": "{None}"
    }
]