[
    {
        "subject": "SOC",
        "catalog_number": "150",
        "title": "Introductory Sociology",
        "description": "Study of human society from the perspective of contemporary social science. Particular emphasis on analysis and understanding of modern society and its salient problems. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "200",
        "title": "Social Crises of Today",
        "description": "Helps the student understand the bases of some of the major social crises of the present day. Topics include alcoholism, delinquency and street crime, ethnic tensions, gambling, international tensions, organized crime, political corruption and terrorism. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "202",
        "title": "Sociological Analysis",
        "description": "Prerequisite: SOC 150. Discussion of the logic and procedures of scientific analysis of social phenomena. Practice in conceptualizing and operationalizing social variables, and in formulating testable hypotheses. Examination of the role of quantitative techniques and data reduction in current sociological analysis.",
        "units": "3",
        "prerequisites": "{SOC 150}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "230",
        "title": "Introduction to Human Sexual Behavior",
        "description": "Prerequisite: ANTH 150, PSY 150 or SOC 150. Introductory overview of human sexual function and sexual behavior. Emphasis on the historical and religious backgrounds of the prevailing attitudes toward sex in our culture, as well as to current sexual practices from the perspective of contemporary social science. Additional topics include sexual values and ethics, love, legal aspects of sexual behavior and eroticism in American culture. (Cross-listed with ANTH 230 and PSY 230.)",
        "units": "3",
        "prerequisites": "{{ANTH 150} || {PSY 150} || {SOC 150}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "303",
        "title": "The Family",
        "description": "Prerequisite: SOC 150. Family as a social institution on the basis of the data of ethnology, history and contemporary studies. Special attention to contemporary culture patterns.",
        "units": "3",
        "prerequisites": "{SOC 150}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "304",
        "title": "Sociology of Deviance",
        "description": "Preparatory: CJS 102. Deviant behavior in contemporary American society. Various definitions of deviance and social responses to the phenomenon. Theories of structural conditions and personal motivations contributing to different life styles. Analysis of deviant subcultures and individual case studies.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "305",
        "title": "Culture and Personality",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: ANTH 150, PSY 150 or SOC 150. Cross-cultural study of the development of individual personality in the sociocultural milieu. Special attention is given to child-rearing practices, social personality, social character, mental health and illness, and conforming and deviant behavior in several Western and non-Western societies. Not to be taken for credit in addition to ANTH 305. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "306",
        "title": "Sociology of Jewish Families and Communities",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: SOC 150. This course uses the perspectives and tools of sociology to explore how different cultural and social structures affect Jewish families and communities throughout the Jewish diaspora. (Cross-listed with JS 306.) (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "307",
        "title": "Ethnic Diversity in America",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: SOC 150. Description and analysis of contemporary, changing ethnic cultures and lifestyles in American society. Focused analysis of ethnic cultures/lifestyles by social class, family form, sex role and orientation, age-grouping and influences of social movements and popular culture. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "324",
        "title": "Sociology of Sex and Gender",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: SOC 150. Analysis of contemporary and historical sex roles in major societal institutions, including economic, political, educational, legal and medical systems, and institutions of marriage and family. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "325",
        "title": "Sex Roles and Work",
        "description": "Prerequisite: SOC 150. Examination of current research on women in the labor force in U.S. and other industrial societies, including the impact of affirmative action programs, changes in structure and function of industrial labor forces, and projections of future roles of women and men in the labor force.",
        "units": "3",
        "prerequisites": "{SOC 150}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "335",
        "title": "Jewish Identity in the U.S.",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: SOC 150. This course is a social-scientific study of American Jewish religious and ethnic identity. It focuses on the social institutions and processes involved in Jewish identity, and compares the experience of Jews with other religious, ethnic, and cultural groups in the U.S. (Cross-listed with JS 335.) (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "340",
        "title": "Sociology of Work",
        "description": "Prerequisite: SOC 150. Analysis of the structural context of work in contemporary society, including preparation for access to different positions within the occupational structure. Study of work settings, including formal and informal characteristics, changes in the structure of work and case histories involving work experiences and occupational subcultures.",
        "units": "3",
        "prerequisites": "{SOC 150}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "345",
        "title": "Social Psychology",
        "description": "Prerequisite: SOC 150. Study of the group-setting of the individual, theories, concepts, principles and their application. History of the field as an interdisciplinary specialty. Current research and trends.",
        "units": "3",
        "prerequisites": "{SOC 150}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "348",
        "title": "Juvenile Delinquency",
        "description": "Preparatory: CJS 102. Extent and distribution of delinquency, with emphasis on the local area. Meaning, implications and treatment of delinquency. Individual-level and social environmental theoretical explanations.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "350",
        "title": "Population Dynamics",
        "description": "Prerequisite: SOC 150. Analysis of the nature, causes and consequences of major world population trends as they are related to urban studies, medical sociology and ecology. Studies fertility, mortality and migration; sex ratios; race and ethnic composition; marital, educational and occupational status; and census and vital statistics.",
        "units": "3",
        "prerequisites": "{SOC 150}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "355",
        "title": "Criminology",
        "description": "Preparatory: CJS 102. Nature of crime, causal factors of criminal behavior and group control of the crime problem.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "356",
        "title": "Social Welfare Institutions",
        "description": "Prerequisite: SOC 150. Exploration of social welfare institutions as one of the basic institutions in contemporary society. Examines varied political and social ideologies that contribute to the development of social welfare institutions, programs, and policies.",
        "units": "3",
        "prerequisites": "{SOC 150}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "357",
        "title": "Anti-Oppressive Social Work Practice",
        "description": "Prerequisite: SOC 150. Introduction to social work and social justice practice from an anti-oppressive perspective. Application of critical social work theories and anti-oppressive approaches in social work/social justice from micro through macro practice with emphasis placed on intersecting issues of privilege and oppression. Requires 40 volunteer field hours in approved community organization.",
        "units": "3",
        "prerequisites": "{SOC 150}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "370",
        "title": "Political Sociology",
        "description": "Lecture-discussion of the social and cultural bases of political ideologies and processes. Study of power and its varying relationships to decision making at community and national levels. Analyses of the roles, structure and interaction of voluntary and political organizations in the political system, including conflict and its resolution. Sociological interpretations of contemporary American political behavior.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "400",
        "title": "Organizational Theory",
        "description": "Study of contemporary sociological theories of organizational dynamics and behavior. Analysis of the social structural and interactional dynamics of organizational settings. Includes supervised individual or group projects and reports. Available for graduate credit.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "401",
        "title": "Class, Status and Power",
        "description": "Analysis of the distribution of wealth, prestige and power. Study of the causes of poverty, life chances of the poor, lifestyles of the wealthy, upward and downward mobility, and class and group conflict in society. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "410",
        "title": "Urban Sociology",
        "description": "Worldwide processes of urbanization, both historical and contemporary. Theoretical approaches and research and their implications for urban policy and change. Focuses on social structure, social differentiation and lifestyles found within a metropolitan area and in diverse metropolitan areas and their implications. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "411",
        "title": "Sociology of Education",
        "description": "Sociological analysis of education as an institution of socialization, including relevant theories, its structure, the challenges of diversity, the complexities of the urban/suburban school setting and current professional issues. Focuses on how issues of diversity impact the institution at the macro level, as well as the experiences of administrators, teachers, students, families and communities. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "424",
        "title": "Statistical Techniques in Social Research",
        "description": "Prerequisite: MATH 140. Recommended Preparatory: SOC 150. Corequisite: SOC 424L. The application and understanding of statistical techniques used in sociological research, related to univariate and multi-variate descriptions, as well as probability and hypothesis testing in statistical inference. Techniques include tabular and graphical presentations, central tendency and dispersion, cross-tabulation analysis, simple and multiple correlation, and regression and hypothesis testing involving means and proportions.  Lab involves problems and assignments using computer application of these techniques.",
        "units": "3",
        "prerequisites": "{MATH 140}",
        "corequisites": "{SOC 424L}"
    },
    {
        "subject": "SOC",
        "catalog_number": "424L",
        "title": "Statistical Techniques in Social Research Lab",
        "description": "Prerequisite: MATH 140. Recommended Preparatory: SOC 150. Corequisite: SOC 424L. The application and understanding of statistical techniques used in sociological research, related to univariate and multi-variate descriptions, as well as probability and hypothesis testing in statistical inference. Techniques include tabular and graphical presentations, central tendency and dispersion, cross-tabulation analysis, simple and multiple correlation, and regression and hypothesis testing involving means and proportions.  Lab involves problems and assignments using computer application of these techniques.",
        "units": "1",
        "prerequisites": "{MATH 140}",
        "corequisites": "{SOC 424}"
    },
    {
        "subject": "SOC",
        "catalog_number": "426",
        "title": "Social Legislation and Social Policy",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of the historical, social, and political aspects related to the development of social policies. Learn how to apply a practitioner policy analysis perspective to pertinent social welfare policies, including TANF, managed mental healthcare, Social Security, substance abuse policies, and child welfare policies. Regular written assignments required. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "430",
        "title": "Theory I – Classical Sociological Theory",
        "description": "Prerequisite: SOC 150. Discussion and analysis of classical sociological theories and theorists.",
        "units": "4",
        "prerequisites": "{SOC 150}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "433",
        "title": "Sociology of Globalization",
        "description": "Prerequisite: SOC 150. This course examines the sociological study of globalization with a focus on theories and debates about the economic, geopolitical, and cultural processes that have led to increased global connectivity. Topics to be addressed include: the shift from a developmental to global economy, culture and globalization, migration and family structures, global identity formations, development and remittances, and transnational social movements. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{SOC 150}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "434",
        "title": "The Sociology of Law",
        "description": "Preparatory: CJS 102. Introduction to the sociological study of law and the legal system, with emphasis on social analysis of criminal law and the courts. Specifically, the course addresses social perspectives on the origins of law and law-making, the application and enforcement of law, and the administration of justice through the legal process. Critical thinking and writing skills are emphasized in the course through the use of legal case study, essay examinations and a final research paper dedicated to the application of legal sociology to current crime issues. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "440",
        "title": "Sociology of Aging",
        "description": "Analysis of aging in its social and social-psychological aspects throughout the lifespan. Emphasis on particular social problems of the elderly, including retirement, widowhood, suicide, housing, income maintenance, attitudes toward death and dying and more. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "450",
        "title": "Medical Sociology",
        "description": "Survey of sociological theory and research techniques related to mortality, illness and medical treatment. Emphasis on the epidemiological aspects of these phenomena in various groups, hospitals, community health settings and more. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "451",
        "title": "Sociological Aspects of Human Sexuality",
        "description": "Prerequisite: SOC 230. Emphasizes the sociological influences shaping human sexual behavior, with an emphasis on learning social scripts. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{SOC 230}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "452",
        "title": "Sociology of Lesbian, Gay, Bisexual and Transgender Communities",
        "description": "Prerequisites: Junior standing. Analysis of cross-cultural and historical treatment of lesbian, gay, bisexual, transgender and queer communities. Survey of sociological research on these communities, including an examination of theory and practice. Analysis of homophobia and other attitudes toward these communities. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Junior standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "459",
        "title": "Child Welfare",
        "description": "Trends in the movement toward establishing the rights of the child to protection and care. Emphasis on the child and the law, compulsory education, school social work, child labor legislation, institutional and foster care for the healthy and the sick child, and adoption legislation. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "461",
        "title": "Sociology of Immigration",
        "description": "Prerequisite: SOC 150. This course provides a sociological understanding of contemporary migration both globally and with a particular focus on the U.S. Understanding the immigration process from a sociological perspective offers insight into why individuals and groups move, how they are received and incorporated into the host society, how migration is sustained over time, and the implications for the native-born and for those who stay behind. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{SOC 150}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "467",
        "title": "Sociology of Religion",
        "description": "Sociological theories of religious behavior from Max Weber to the present. Comparative study of the relationships between the role, ritual and belief systems of religious institutions and their social contexts. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "468",
        "title": "Theory II – Contemporary Sociological Theory",
        "description": "Prerequisite: SOC 150. Discussion and analysis of contemporary sociological theories and theorists.",
        "units": "3",
        "prerequisites": "{SOC 150}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "476",
        "title": "Social Movements",
        "description": "Prerequisite: SOC 150. This course is an overview of the core sociological concepts and perspectives in the social movement literature. This course will examine the factors that lead people to participate in social movements and how social movement participation shapes people’s lives. The course will explore theoretical perspectives developed in the study of social movements and apply them to concrete examples of both historical and contemporary movements. Topics will include: the emergence and diffusion of social movements, social movement tactics, the effectiveness of movements in changing both policy and cultural norms, as well as reactions to social movements, such as countermobilization and repression. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{SOC 150}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "482SOC",
        "title": "Practicum in Work and Society",
        "description": "Supervised field experience in counseling and guidance activities, paraprofessional work settings. Community field placements consistent with student career needs. Class size limited to 15 students. An Academic Internship course. (Letter Grade only)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "486SOC",
        "title": "Social Science Career Internship",
        "description": "Prerequisites: Upper Division standing in a social or behavioral science Major; Appropriate methods course as specified by the Department; Instructor consent. Social and behavioral science principles will be applied to the workplace. Students complete learning contracts and submit written reports related to their internships. At least 9 hours per week of supervised field work is required. See section on Academic Internships. (Cross listed with GEOG PAS POLS and PSY 486SOC.)\n",
        "units": "3",
        "prerequisites": "{{Upper Division standing in a social or behavioral science Major} && {Appropriate methods course as specified by the Department} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "490S",
        "title": "Supervised Field Seminar and Fieldwork",
        "description": "Prerequisites: SOC 357 and overall GPA of 3.0. Corequisites: SOC 490F and SOC 490S are taken concurrently. Pre-enrollment by specific date during the preceding semester is required. This course provides an opportunity for students to apply social work theories to practice, to advocate for social justice, and to gain experience in an agency setting. The student is provided the opportunity to develop anti-oppressive practice skills needed for working with individuals, families, groups, organizations, and communities in a selected social service agency with field and faculty supervision. Student-interns will complete 120 hours field placement. (Credit/No Credit only)",
        "units": "1",
        "prerequisites": "{{SOC 357} && {overall GPA of 3.0}}",
        "corequisites": "{{SOC 490F} && {SOC 490S}}"
    },
    {
        "subject": "SOC",
        "catalog_number": "492",
        "title": "Human Behavior in the Social Environment",
        "description": "This course presents students with a range of theories that seek to understand human behavior across the lifespan. It integrates biological, psychological, structural, environmental, political, global, and sociocultural perspectives. This course also explores the relationship between the person and the environment including families, groups, organizations, communities, and institutions. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "493",
        "title": "Diversity and Social Justice",
        "description": "This course explores diversity, privilege and oppression on individual, social/cultural and institutional levels, based on the intersections of race, ethnicity, nationality, gender, sexual orientation, religion, age, (dis)ability status, and social class. Students will examine their own social identities, social group memberships and social roles along the lines of power, privilege, marginalization, and representation. An anti-oppressive theoretical framework will provide knowledge of how to build alliances and develop effective strategies for addressing social injustice. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "497",
        "title": "Qualitative and Quantitative Research Methods",
        "description": "Prerequisite: SOC 424/L. Corequisite: SOC 497L. Application of the scientific method to social phenomena, including both quantitative and qualitative methods of collecting, analyzing, interpreting, and presenting data, as well as considerations about research design, the role of theory, and ethics. Methods covered may include survey research, experimental research, secondary data analysis, content analysis, focus groups, qualitative interviews, fieldwork, ethnography, and historical comparative research.\nLab: Exercises related to both qualitative and quantitative research design and data analysis.",
        "units": "3",
        "prerequisites": "{SOC 424/L}",
        "corequisites": "{SOC 497L}"
    },
    {
        "subject": "SOC",
        "catalog_number": "497L",
        "title": "Qualitative and Quantitative Research Methods Lab",
        "description": "Prerequisite: SOC 424/L. Corequisite: SOC 497L. Application of the scientific method to social phenomena, including both quantitative and qualitative methods of collecting, analyzing, interpreting, and presenting data, as well as considerations about research design, the role of theory, and ethics. Methods covered may include survey research, experimental research, secondary data analysis, content analysis, focus groups, qualitative interviews, fieldwork, ethnography, and historical comparative research.\nLab: Exercises related to both qualitative and quantitative research design and data analysis.",
        "units": "1",
        "prerequisites": "{SOC 424/L}",
        "corequisites": "{SOC 497}"
    },
    {
        "subject": "SOC",
        "catalog_number": "498AEE",
        "title": "The Sociological Experience",
        "description": "Prerequisite: Instructor consent. This course enhances what is taught in the Sociology Major by extending student learning beyond the classroom. It provides students with opportunities to use newly acquired academic skills and knowledge in real-life situations in their own communities. Students will participate in research internship or service-learning projects under the direction of the instructor. The experience culminates in a written report that demonstrates the students ability to apply sociological perspectives and research techniques. (Credit/No Credit only)\n",
        "units": "2",
        "prerequisites": "{Instructor consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "524",
        "title": "Gender and Society",
        "description": "Prerequisite: Graduate class standing. Examination of the foundational and contemporary theories of the sociology of gender. Analysis of the ways in which gender structures individual identities, interpersonal relations, role expectations, and patterns of social inequality within institutions such as the family, education, and work. Topics covered include the social construction of gender, intersectionality, sexual identities, and masculinities.",
        "units": "3",
        "prerequisites": "{Graduate class standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "601",
        "title": "Classical Sociological Theory",
        "description": "Critical examination of significant theoretical formulations and trends in classical sociology.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "670",
        "title": "Contemporary Sociological Theory",
        "description": "Critical examination of significant theoretical formulations and trends in contemporary sociology.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "685",
        "title": "Qualitative Research Methods",
        "description": "The study of research methods sociologists use to gather, analyze and interpret qualitative data. Emphasis is placed on philosophical assumptions, interpretive frameworks and diverse approaches to qualitative inquiry such as interviews, content analysis, participant observation, ethnography and historical-comparative research. Topics covered include research ethics, positionality, reflexivity and validity.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "690",
        "title": "Quantitative Research Methods",
        "description": "The advanced study of research methods sociologists use to gather, analyze and interpret quantitative data. Topics covered include survey construction, experimental design and secondary data analysis. Emphasis is placed on descriptive and inferential statistical analyses.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "696A",
        "title": "Directed Graduate Research",
        "description": "This course is designed to prepare students for the culminating experience in the master’s degree program in sociology. Students pursuing the thesis option are required to write and defend a thesis proposal and secure IRB approval (if required). Students pursing the comprehensive exam option are required to do an extensive review of the research in a subfield of sociology and write several papers in the areas of sociological theory and research methods.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisites: SOC 601, SOC 670, SOC 685, SOC 690. Limited to students preparing to take the comprehensive examination for the M.A. degree in Sociology. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{SOC 601} && {SOC 670} && {SOC 685} && {SOC 690}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "698",
        "title": "Thesis",
        "description": "Prerequisites: Classified graduate status; Instructor consent. Limited to students completing a thesis project for the M.A. degree in Sociology. (Credit/No Credit only)",
        "units": "4",
        "prerequisites": "{{Classified graduate status} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "699A",
        "title": "Independent Study",
        "description": "Independent Study",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]