[
    {
        "subject": "SOM",
        "catalog_number": "120",
        "title": "Basic Business Statistics",
        "description": "Prerequisite: MATH 103 or a higher-level mathematics course with a grade ofC or higher. Basic elements of statistics for students in business and economics. Descriptive statistics elements of probability probability distributions (including normal) sampling distributions statistical inference for means and proportions (including estimation and hypothesis testing) simple linear regression and correlation. Applications of these topics in business and economics are emphasized. The course requires assignments in which students are required to explain the results of statistical computations using personal computer software. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SOM",
        "catalog_number": "306",
        "title": "Operations Management",
        "description": "Prerequisite: SOM 120 or MATH 140. Recommended Corequisite or Preparatory: BUS 302/L. Discusses operational issues facing organizations and introduces operations management concepts and techniques. Students develop skills necessary to improve productivity and quality of operations in both manufacturing and service organizations. Topics include international competitiveness quality assurance forecasting design and control of operations systems creating value for the customer project management and supply chain and inventory management. \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SOM",
        "catalog_number": "307",
        "title": "Data Analysis and Modeling for Business",
        "description": "Prerequisite: SOM 120 or MATH 140. Recommended Corequisite or Preparatory: BUS 302/L. Statistical methods and stochastic models to support decision making by managers. Topics include: exploratory data analysis probability distributions and assessment expected value variation estimation of means and proportions hypothesis testing for one and several populations F test chi-square test simple and multiple regression and correlation decision trees waiting lines and simulation. Applications to business are emphasized. Written assignments based on computer software required. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SOM",
        "catalog_number": "416",
        "title": "Supply Chain Management",
        "description": "Prerequisites: SOM 306; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L are prerequisites for Business majors. This course covers the fundamental concepts principles and tools associated with supply chain management. Topics include supply chain integration logistics network configuration inventory management strategic alliances procurement and outsourcing warehousing quality management global logistics and the impacts of information technology on supply chain management. Global implications will be discussed throughout the course. This course involves case studies a simulation game and a culminating term project. (Crosslisted with SCM 416.) \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SOM",
        "catalog_number": "464",
        "title": "Manufacturing Resource Planning",
        "description": "Prerequisites: SOM 306 or MSE 304; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L are prerequisites for Business majors. Planning and control systems for the management of production and operations. Topics include demand management and forecasting Enterprise Resource Planning (ERP) supply chain management inventory management master production scheduling Material Requirements Planning (MRP) capacity planning just-in-time (JIT) production activity sequencing and other current topics. Includes a term project as well as an in-depth case study using integrated manufacturing planning and control software such as Manufacturing Resource Planning (MRP II) or Enterprise Resource Planning.  \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SOM",
        "catalog_number": "466",
        "title": "Project Management",
        "description": "Prerequisites: SOM 120 391 or MATH 140; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L are prerequisites for Business majors. Introduction to the operations management of small intermediate and large projects. The course surveys project organization staffing planning and scheduling (PERT/CPM) control budgeting and quality. The project environments including international issues are explored. Various project management software packages are utilized. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SOM",
        "catalog_number": "467",
        "title": "Quality Management and Control",
        "description": "Prerequisites: SOM 306 or MSE 304; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L are prerequisites for Business majors. Application of total quality control for improvement of products and services including both statistical techniques and managerial approaches. Control charts quality costs responsibility for quality quality at the source ethical issues and ISO 9000. International differences in philosophy of quality. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SOM",
        "catalog_number": "468",
        "title": "Managing for Service Excellence",
        "description": "Prerequisites: SOM 306; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L are prerequisites for Business majors. Techniques learned will benefit service managers and entrepreneurs by improving skills in managing efficiency and quality. Students will learn concepts and tools useful for service management. Topics include service assessment improvement and innovation yield management service technologies (including management of Internet businesses) quality and productivity and new service development. The course involves case studies as well as software applications. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SOM",
        "catalog_number": "485",
        "title": "Decision Support Systems",
        "description": "Prerequisites: SOM 306; IS 312; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L are prerequisites for Business majors. Concepts development and application of Decision Support Systems (DSS) and related management support systems (Executive Information Systems and Expert Systems). Design framework and Management Science models for DSS. DSS development process and tools user interface evaluation and implementation. Study of recent development in model-based DSS applications with knowledge base enhancement. Class project designing prototype management support systems will be required. \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SOM",
        "catalog_number": "498A",
        "title": "Field Assignments and Reports Systems and Operations Management",
        "description": "Prerequisite: Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L are prerequisites for Business majors. Individual study pertaining to present or future career. Student must obtain approved employment. Consultation with employer and instructor determines program. A maximum of 12 units may be earned by combining Field Assignments and Reports (SOM 498) and Independent Study (SOM 499). This is an Academic Internship course. \n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "SOM",
        "catalog_number": "499C",
        "title": "IND STUDY SOM",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SOM",
        "catalog_number": "686",
        "title": "Seminar in Internationally Competitive Operations Management",
        "description": "Prerequisites: SOM 591 or both 306 and 307. Subjects include productivity and global competitiveness of modern enterprises diagnostic studies of production strategies managerial implications of advanced operations technologies of world-class organizations (Flexible Manufacturing Systems Computer Integrated Manufacturing Statistical Process Control and Total Quality Management). Also covered are in-depth case analyses of progressive U.S. and International firms addressing these issues. A team case project is a key course requirement. \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SOM",
        "catalog_number": "699",
        "title": "Independent Study Systems and Operations Management",
        "description": "Prerequisites: Permission of Graduate Advisor and Department Chair. No more than 6 units of Independent Study may be taken in any one department and no more than 6 units may be taken in the College of Business without prior approval of the Dean. Only those graduate students who have a current 3.0 or higher GPA may register in a 600-level Independent Study course. Note: See Graduate Business Interdepartmental Courses for GBUS 696D 697D and 698D. \n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SOM",
        "catalog_number": "306BH",
        "title": "OPERATIONS MGMT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SOM",
        "catalog_number": "498C",
        "title": "Field Assignments and Reports Systems and Operations Management",
        "description": "Prerequisite: Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L are prerequisites for Business majors. Individual study pertaining to present or future career. Student must obtain approved employment. Consultation with employer and instructor determines program. A maximum of 12 units may be earned by combining Field Assignments and Reports (SOM 498) and Independent Study (SOM 499). This is an Academic Internship course. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "SOM",
        "catalog_number": "591",
        "title": "Statistics and Stochastic Models for Managers",
        "description": "Prerequisite: Permission of the Director of Graduate Programs. Statistical methods and stochastic models to support decision making by managers. Topics include: exploratory data analysis probability distributions and assessment expected value variation estimation of means and proportions hypothesis testing for one and several populations F test chi square test simple and multiple regression and correlation time series and forecasting decision trees waiting lines and simulation. Applications in service organizations and small businesses are provided along with applications for production organizations and large businesses. A key element is a group project involving the application of one or more course topics to a current business problem.  \n",
        "units": "3",
        "class_type": "SEM"
    }
]