[
    {
        "subject": "URBS",
        "catalog_number": "150",
        "title": "The Urban Scene",
        "description": "Lecture-discussion course that includes a historic view of human settlements and cities. It emphasizes cities in the U.S. It explores urban society including population housing economics infrastructure transportation environment government land use law planning growth and sustainability. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "206",
        "title": "Introduction to Graphic Communication Tools Used by Urban Studies and Planning Professionals",
        "description": "This course will focus on graphic communication tools commonly used by planning professionals.  The development of maps charts drawings and 3D visualizations enhance the ability of professionals to interact with clients and the public.  The use of Geographic Information Systems (GIS) to perform spatial analysis and present spatial data will be emphasized.  The course will also provide a fundamental knowledge of computer aided design (CAD) for creating maps and drawings and of 3D visualization tools to enhance public understanding of proposals.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "URBS",
        "catalog_number": "250",
        "title": "Planning the Multiethnic City",
        "description": "Comprehensive analysis of the social cultural and land use structure of cities in the U.S. during the 20th century. Major focus on the significant demographic changes that have influenced urban and public policy since 1975. Explores issues related to multiethnic constituencies in American cities.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "310",
        "title": "Growth and Sustainable Development of Cities",
        "description": "Examination of the forces contributing to the form structure and sustainable development of cities. Emphasis on urban areas of the U.S. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "340A",
        "title": "QUAN URB RES METH",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "345",
        "title": "The General Plan and Zoning",
        "description": "This course deals with the requirements for comprehensive planning and zoning in the state of California. Emphasis will be placed on the mandated general plan elements of land use housing circulation Open space conservation safety and noise. Special attention will be paid to formulating a framework for a general plan and preparation adoption and amendment of the general plan. As the major tool for the implementation of the general plan zoning will be addressed in terms of the enactment process and administration through the use of the variance conditional use permits and zone changes. Students will be required to participate in a series of field-based and studio-based exercises focusing on general plan formulation and current zoning problems.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "350",
        "title": "Cities of the Third World",
        "description": "Prerequisites: Upper Division standing; Completion of Lower Division writing requirement. Cultural analysis of Third World urbanization and counter-urbanization with emphasis on particular aspects of urban life and social change in Africa Latin America the Middle East and Southeastern Asia. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "380",
        "title": "Los Angeles: Past, Present, Future",
        "description": "Multidisciplinary investigation of the Los Angeles urban area its patterns of population and resources distribution; its historical economic social and cultural developments; and policies models designed to cope with its problems and to develop its potential as an ethnically diverse metropolis on the Pacific Rim. Application of social science methodology. Series of faculty and guest speakers weekly discussion sessions and field trips. (Cross listed with HIST and POLS 380.) (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "392IP",
        "title": "CULT,ECNMY & DEV PROBS ZI",
        "description": null,
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "400",
        "title": "Planning for the Natural and Built Environment",
        "description": "Prerequisites: ECON 160 or 161 or 300; Completion of the Lower Division writing requirement. Relationships between people and technology in the city and the application of resources to supply such urban needs as transportation waste disposal water and communication. Technological change and forecasting.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "408",
        "title": "Policy Making for Urban Planners",
        "description": "The course will comprehensively address the complex arena of public policy in relation to city planning land-use issues and urban policy. This will incorporate how a society based on pluralist democracy balances the demands of a range of interest groups including planners city bureaucracies politicians community groups private-sector economic interests the non-profit sector state and federal agencies and the general public. The focus will be on issues related to the built environment and the controversial nature of constant transformation of land uses in cities. In addition the course will address the interrelationship between local government implementation strategies and federal urban program laws and regulations. The course is designed to provide students with a comprehensive understanding of the linkages between urban social policy distributional equity in local and federal programs and environmental considerations within the arena of governmental decision making systems.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "416",
        "title": "Urban Housing",
        "description": "Prerequisites: Upper Division standing; Completion of Lower Division writing requirements. This course is designed to help students explore the complexity of housing and housing-related issues from a planning perspective. Students will develop a basic understanding of the housing market its relationship to community development and its importance to communities and the U.S. economy. A wide variety of topics will be discussed including the use and meaning of housing the development of federal state and local housing policy the changing dynamics of housing policy the housing market housing finance the challenge of providing affordable housing and the relationship of housing to community development/neighborhood transformation. Considerable emphasis will be placed on housing issues in the Los Angeles metropolitan area. Class time will be devoted to lectures guest lectures class discussions and group discussions.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "425",
        "title": "Social Policy",
        "description": "Environmental Justice and the CityAddresses the linkages between urban social policy distributional equity in local and federal programs and environmental movements initiated as a response to regressive land use and/or planning strategies. Specific areas of social policy that are analyzed in this course are housing policies and programs economic development and revitalization transportation urban recreation and cultural projects and local governmental implementation strategies.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "440",
        "title": "Community-Based Urban Design",
        "description": "Prerequisite: URBS 340A 340B or other equivalent research methods courses. Study of current urban design techniques and policies and their application to local communities and neighborhoods.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "450",
        "title": "Urban Problems Seminar",
        "description": "Prerequisites: Senior standing; Completion of the Lower Division writing requirement. Advanced seminar on problems and issues in urban and environmental studies. Interdisciplinary symposia and opportunities for critical appraisal and exchange of ideas on special studies developed in or stemming from field work. Emphasis on case studies and other problem approaches.\n",
        "units": "4",
        "class_type": "SEM"
    },
    {
        "subject": "URBS",
        "catalog_number": "460",
        "title": "Legal Foundations of Planning",
        "description": "Prerequisites: Upper Division standing; Completion of the Lower Division writing requirement. This course is a general introduction to land use planning law in the U.S. It looks primarily at the state regional and municipal levels with an emphasis on practices and procedures to manage land use and growth in California. The course covers 4 broad areas: Introduction to Law and the U.S. Legal System State and Local Planning Law; Managing Urban Land Use: Conflicts and Quality of Life; and Managing Growth.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "490C",
        "title": "Field Work",
        "description": "Prerequisites: URBS 340A 340B. Introduction to urban field analysis and interview techniques through supervised field work and individual projects.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "URBS",
        "catalog_number": "494C",
        "title": "Internship",
        "description": "Prerequisite: Senior standing. Upon prior approval by the Internship Coordinator students may earn up to 6 units for professional experience in a planning department social service agency or other public or private organization dealing with urban problems. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "URBS",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "No course description.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "URBS",
        "catalog_number": "610",
        "title": "Contemporary Urban Planning in the United States and California",
        "description": "Provides an overview of urban planning as practiced in the U.S. The course assumes some familiarity with urban planning and builds on common issues and problems in the field utilizing a topical approach. Such critical issues as transportation housing social and environmental justice citizen participation urban design urban sprawl sustainable development and New Urbanism will be examined in detail.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "630",
        "title": "Sustainable Development and Environmental Impact Analysis",
        "description": "This course deals with approaches to planning for sustainable development and the requirements for environmental planning and policy associated with the California Environmental Quality Act (CEQA). This act and regulatory guidelines can serve as a model for impact analysis in any global setting. A special emphasis will be placed on understanding the implications of sustainable development for typical projects that occur in urban settings and the techniques used to assess impacts. Supporting field trips and discussions with planners and project managers are planned.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "660",
        "title": "PLANNING LAW",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "670",
        "title": "VISUAL COMM SKILL",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "680",
        "title": "QUANT ANALYSIS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "690",
        "title": "Field Project in Urban Planning",
        "description": "This course will serve as the Capstone course for the Certificate Program. Field projects will be defined and approved prior to the students completion of the 4 preceding courses. The course will focus on application of Certificate course content to a specific urban-environmental planning problem at the local level in a local city. Students will be required to be in contact with the professor as the project evolves.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "300",
        "title": "The Planning Idea",
        "description": "Prerequisite: URBS 150. Detailed examination of the foundational ideas and issues of the urban planning profession drawn from planning history alternative models of planning and planning ethics. Planning principles are examined in the context of case studies drawn from the Los Angeles region the U.S. and world cities.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "340B",
        "title": "QUAL URB RES METH",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "412",
        "title": "Grant Writing",
        "description": "Prerequisites: URBS 340A and 340B; Upper Division standing. This course is intended to provide students with basic knowledge in the research writing and planning skills involved in preparing grant proposals. The presumption is that students possess no substantive prior knowledge of grant writing. Students will learn the basic phases of writing a grant proposal how to search for sources of grant funding and the process of submitting grant proposals to public and private agencies and foundations. Students also will learn how to use the internet to search for grant opportunities. Emphasis will be placed on non-profit organizations that deal with human service needs. The course will address how to manage the implementation of a grant proposal and how to measure the impact a particular service has on a community.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "415",
        "title": "The California Environmental Quality Act for Urban Planners",
        "description": "This course deals with Californias statutory requirements for environmental planning and policy. The focus of the course will be on the California Environmental Quality Act (CEQA) process that addresses issuance of Negative Declarations preparation of draft and final environmental impact reports (EIRs) litigation decision making and the requirements of professional consulting. A special emphasis will be placed on understanding the environmental implications of typical projects that occur in an urban setting.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "435",
        "title": "Planning for Community Development",
        "description": "Prerequisite: URBS 310. Examination of the theories of local economic development and how each theory informs real-world policy and practice. Implementation and implications of alternative strategies are illustrated by specific case studies.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "480",
        "title": "Urban Transportation Planning",
        "description": "Prerequisites: URBS 150 or 250; or instructor consent. This course is a general introduction to the interrelated systems of urban transportation and urban land use and their effects on the growth development and future of human settlements. The course will provide entry-level competence for students seeking employment in transportation planning in the public or private sectors. 4 broad areas are covered: transportation planning history; transportation and land use theory; transportation planning process and techniques; and urban transportation policy.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "494A",
        "title": "Internship",
        "description": "Prerequisite: Senior standing. Upon prior approval by the Internship Coordinator students may earn up to 6 units for professional experience in a planning department social service agency or other public or private organization dealing with urban problems. (Credit/No Credit only)\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "URBS",
        "catalog_number": "615",
        "title": "ANALYT PRINCIPLES",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "620",
        "title": "Seminar in Comprehensive Planning",
        "description": "This course provides a comprehensive introduction to the general plan and zoning process in the U.S. and California.  Special emphasis will be placed on the plan elements dealing with land use housing circulation open space conservation safety and noise. Zoning will be addressed in terms of the structure and content of zoning ordinances and the administration process. Other topics include administrative aspects of planning and negotiation skills for planners in implementing the comprehensive plan. Supporting field trips and discussions with planners and project managers are planned.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "640",
        "title": "Seminar in Planning for Communities and Local Economic Development",
        "description": "This course focuses on the study of human behavior as it is affected by basic human needs and urban conditions. Special attention will be given to: 1) the manner in which local neighborhoods and communities are integrated into the planning process and how needs are articulated; and 2) the manner in which local economic development can be affected by the planning process and by the integration of community participation. Supporting field trips and discussions with planners and project managers are planned.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "650",
        "title": "SEM POL AN & IMPL",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "685",
        "title": "QUALITAT RESEARCH",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "URBS",
        "catalog_number": "698",
        "title": "PROFESSIONAL PROJ",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    }
]