[
    {
        "subject": "ANTH",
        "catalog_number": "108",
        "title": "Latin American Cultures",
        "description": "Study of major social institutions and lifestyles in Central and South America focusing on contemporary peoples, their traditional cultural base and current cultural changes. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "150",
        "title": "The Human Adventure: Introduction to Anthropology",
        "description": "Overview of human physical and cultural origins and the development and distribution of diverse populations, languages, social institutions and beliefs; introduction to the methods and insights of cultural anthropology, archaeology, linguistics and physical anthropology. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "151",
        "title": "Introduction to Biological Anthropology",
        "description": "Anthropological perspective on biological variation in human and non-human primates in the past and the present; examines the interaction between biology and culture in the evolution of human society. Evolution and behavior of non-human primates are examined for what they reveal about the human condition. (Available for General Education, B2 Life Science or D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "152",
        "title": "Introduction to Cultural Anthropology",
        "description": "Study of the variety of cultural patterns that human societies use to adapt to the environment, guide social interaction and understand the human condition. Emphasizes the ideas and methods anthropologists use to develop a scientific and humanistic understanding of the world’s cultures. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "153",
        "title": "Temples, Tombs and Treasures? An Introduction to Archaeology",
        "description": "Although we are often captivated by the ancient past, many of the reconstructions of this past found in popular culture are not based on the premises of scientific archaeological practice. This course introduces students to the methods, theories and results of scientific archaeological study. Students learn how archaeologists collect and analyze data in order to reconstruct the lifeways and culture histories of our prehistoric ancestors from the Pleistocene to the first civilizations. Students analyze the causes and effects of significant events in humankind’s prehistoric cultural development and their relevance to the present. Students also learn the importance of the stewardship of archaeological resources and principles of cultural heritage management. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "212",
        "title": "Anthropology of Sex",
        "description": "This course will examine human sexuality from a holistic anthropological perspective. Subjects such as sexual anatomy and physiology, sexual intercourse, prostitution, sexual coercion, homosexuality and masturbation will be examined from a biological perspective looking to the non-human primates for comparison, and a cultural perspective using ethnographic and archeological data. Additionally, the course will examine the role of sex in language and folklore. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "222",
        "title": "Visions of the Sacred",
        "description": "Study of the varieties of religious beliefs, rituals and experiences showing the relationship between people and their society, culture, environment and universe. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "232",
        "title": "Expressive Culture",
        "description": "This course presents an introduction to the anthropological analysis of expressive culture. Each course offering will focus on a specific form of expressive culture, such as clothing, food, music, or visual art. Students explore the history of the cultural form; consider how it reflects and communicates societal structures and cultural meanings and values; and examine how the study of expressive culture can be used to probe broader environmental, social, political, economic, and ideological issues. (Available for General Education, C1 Arts.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "262",
        "title": "Forensic Anthropology",
        "description": "This course introduces forensic anthropology, the study of human skeletal remains in the context of criminal investigations, war crimes, mass fatalities, and unexplained deaths, among other contexts. Students will learn how forensic anthropologists combine traditional and cutting-edge techniques in the field and laboratory to investigate crimes, provide scientific evidence for prosecution, and resolve complex mass fatality situations, including disasters and terrorist attacks. Students will also become familiar with issues associated with positive identification, skeletal trauma analysis, the legal system, and ethical practices. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "302",
        "title": "Introduction to Applied Anthropology",
        "description": "Prerequisites: Lower division GE course in cultural anthropology, sociology, political science or cultural geography; Completion of the lower division writing requirement. This practical, hands-on course introduces students to the ways in which anthropologists apply our field’s skills, knowledge, and perspectives towards the resolution of social problems in today’s world. Students are introduced to a variety of applications anthropology has for other disciplines and professions, including education, health, environmental issues, and business. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{{Lower division GE course in cultural anthropology, sociology, political science or cultural geography} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "303",
        "title": "Anthropological Thought",
        "description": "Prerequisite: ANTH 150 or ANTH 152. Study of the conceptual foundations of contemporary anthropological thought. Topics include evolutionary theory, functionalism, historicalism, structuralism and interpretative anthropology.",
        "units": "3",
        "prerequisites": "{{ANTH 150} || {ANTH 152}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "305",
        "title": "Individual and Culture",
        "description": "Prerequisites: ANTH 150 or PSY 150 or SOC 150; Completion of the lower division writing requirement. Not to be taken for credit in addition to SOC 305. Comparative study of the relationship between the individuals and their culture. Child-rearing in nonwestern cultures. Exploration of individual identity and group character. Regular written assignments required. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{{ANTH 150 || PSY 150 || SOC 150} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "307",
        "title": "Anthropology of Native California and the Southwest",
        "description": "Prerequisite: ANTH 150 or ANTH 152. American Indians in what is now California and the Southwest from the earliest times until today.",
        "units": "3",
        "prerequisites": "{{ANTH 150} || {ANTH 152}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "308",
        "title": "Gender and Culture",
        "description": "Prerequisite: Completion of the lower division writing requirement. Discussion of gender in Western and non-Western, modernizing, industrializing, and globalizing societies; gender and the impact of cultural change. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "310",
        "title": "Language in Culture: Anthropological Linguistics",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of basic linguistic concepts in cultural contexts; an examination of language diversity and sociocultural factors of language use. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "311",
        "title": "Human Variation",
        "description": "Prerequisite: ANTH 151. Morphological, genetic and physiological aspects of human biological variability; the concept and description of race; the interaction of cultural and environmental factors in human biological adaptation.",
        "units": "3",
        "prerequisites": "{ANTH 151}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "315",
        "title": "World Cultures and Societies",
        "description": "Prerequisite: Completion of the lower division writing requirement. Compares and contrasts the world’s diverse cultures and societies and examines their current and ever changing relationships in anthropological perspective. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "319",
        "title": "World Prehistory",
        "description": "Prerequisite: Completion of the lower division writing requirement. Encompasses the origin and development of prehistoric human culture from hunting and gathering to the origin of urban societies. Surveys the archaeological evidence from both the New and Old World. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "326",
        "title": "Introduction to Folklore",
        "description": "Prerequisite: Completion of the lower division writing requirement. Introduction to the study of folklore from a cross-cultural perspective, including major forms such as folktale, legend, ballad, joke, riddle, proverb and festival, and the theories used to interpret them. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "338",
        "title": "Anthropology of Africa",
        "description": "Issues in and perspectives on culture in Africa, including views of Africa’s diversity, complexity, and relationship to colonialism and contemporary globalization.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "341",
        "title": "Bones: An Introduction to the Study of Human Remains",
        "description": "Prerequisites: ANTH 150 or ANTH 151 or ANTH 262 or BIOL 100 or BIOL 101 or BIOL 106; Completion of the lower division writing requirement. Forensic Anthropology has been popularized in recent years by a range of popular media. But what can human remains really tell us? In this class, we will review the methods used by physical anthropologists to study the human skeleton and critically examine the array of information that can actually be scientifically extracted from human skeletal remains. Based on this knowledge, we will analyze the biological and cultural information bones may yield about past human populations. (Available for General Education, B5 Scientific Inquiry and Quantitative Reasoning or D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{{{ANTH 150} || {ANTH 151} || {ANTH 262} || {BIOL 100} || {BIOL 101} || {BIOL 106}} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "345",
        "title": "Anthropology of the Contemporary United States",
        "description": "Prerequisites: ANTH 150 or ANTH 152; Completion of the lower division writing requirement. Examination of individual and group identity, including the interaction of diverse subcultures in the United States. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{{{ANTH 150} || {ANTH 152}} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "346",
        "title": "Urban Anthropology",
        "description": "Prerequisite: Completion of the Lower Division writing requirement.Cross-cultural urbanism urbanization and migration both with macro and micro focus. Regular written assignments required. \n",
        "units": "3",
        "prerequisites": "{Completion of the Lower Division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "351",
        "title": "Anthropology of Middle America",
        "description": "Prerequisite: ANTH 150 or ANTH 152 or CAS 100. Issues in and perspectives on cultures from Mexico to Panama, including the Caribbean.",
        "units": "3",
        "prerequisites": "{{ANTH 150} || {ANTH 152} || {CAS 100}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "353",
        "title": "The Maya: Ancient and Modern",
        "description": "The Maya form one of the largest indigenous linguistic groups in the Americas. This course is an introductory survey of their culture and society from prehistoric times to the present. The course addresses the cultural history, social organization and political history of the Maya, as well as their artistic and intellectual achievements. Discussions include examination of ancient Maya sites, architecture, art and writing, as well as examining the state of the Maya in the modern world.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "356",
        "title": "Anthropology of the Mediterranean",
        "description": "Prerequisite: ANTH 150 or ANTH 152. Issues in and perspectives on culture in the Mediterranean region, including Spain, southern France, Italy, Greece, the Middle East and North Africa.",
        "units": "3",
        "prerequisites": "{{ANTH 150} || {ANTH 152}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "360",
        "title": "Immigration and Ethnicity",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examines the basic concepts that inform our understanding of immigration and ethnicity: race, class, gender; the politics of multiculturalism and cultural diversity; and the conflicts and problems inherent in the immigrant experience.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "421",
        "title": "Primatology: Morphology, Behavior and Social Organization",
        "description": "Prerequisites: ANTH 151; ANTH 150 or ANTH 152. Detailed examination of that part of physical anthropology which seeks to add to understanding of human behavior and evolution by elucidating the social organizations and behavioral adaptation of the primates. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{ANTH 151} && {ANTH 150 || ANTH 152}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "423",
        "title": "Human Behavior: Evolutionary Perspectives",
        "description": "Prerequisites: ANTH 151; Completion of the lower division writing requirement. Introduction to the various methods and approaches anthropologists use to understand human behavior from a biocultural perspective. Examines the determinants of human behavior, past and present. Regular written assignments required. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{ANTH 151} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "424",
        "title": "The Supernatural in the Modern World",
        "description": "Prerequisite: ANTH 152. Ethnographic examination of supernatural belief and experience in contemporary societies. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{ANTH 152}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "425",
        "title": "Culture, Health and Healing",
        "description": "Prerequisite: ANTH 151 or ANTH 152. Introduction to medical anthropology, the study of the interaction of biological, psychological and sociocultural factors in human promotion of health and adaptation to disease. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{ANTH 151} || {ANTH 152}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "426",
        "title": "Old World Archaeology",
        "description": "Prerequisite: ANTH 153. Survey of the culture history of the Old World from Paleolithic times to the rise of the major Old World civilizations, with an emphasis on the prehistory of the Southwestern Asian, Mediterranean and European regions. Regular written assignments are required. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{ANTH 153}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "427",
        "title": "Archaeology of North America",
        "description": "Prerequisites: ANTH 153; Completion of the lower division writing requirement. Examination of the origins and adaptations of Native American Cultures. Regular written assignments are required. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{ANTH 153} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "428",
        "title": "Archaeology of Mesoamerica",
        "description": "Prerequisites: ANTH 153; Completion of the lower division writing requirement. Overview of the cultural achievements and developments in Mesoamerica prior to the Spanish Conquest. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{ANTH 153} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "429",
        "title": "Archaeology of South America",
        "description": "Prerequisites: ANTH 153; Completion of the lower division writing requirement. Overview of the cultural achievements and developments in South America prior to the colonialization by the European countries. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{ANTH 153} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "430",
        "title": "Environmental Anthropology",
        "description": "Prerequisites: ANTH 150 or ANTH 152; Completion of the lower division writing requirement. Anthropological approaches to understanding the human-environment relationship. Explores how populations interact with ecological opportunities and constraints, change in the human-environment relationship over time, and causes and consequences of unsustainability. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{{ANTH 150} || {ANTH 152}} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "432",
        "title": "Environmental Justice and Health",
        "description": "Prerequisites: ANTH 150 or ANTH 152, completion of the lower division writing requirement. Students in this course will explore issues of global development and social justice, particularly looking at the issues of environmental degradation and human health in the context of global and local inequality. Students will explore such topics as agricultural and natural resource development, the effects of war and conflict, health and environmental pollution, and food security, all in a global-to-local ethnographic context. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the schedule of classes for a CS designation. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{{ANTH 150} || {ANTH 152}} && {completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "445",
        "title": "Human Osteology",
        "description": "Prerequisites: ANTH 341; Completion of the lower division writing requirement. Corequisite: ANTH 445L. Human Osteology is the study of the human skeleton. In this class, students will learn to recognize all of the human skeletal elements and appreciate the range of skeletal variation in individuals and populations. Osteological methods used on human remains discovered in an archeological, forensic or paleoanthropological context will also be covered. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{ANTH 341} && {Completion of the lower division writing requirement}}",
        "corequisites": "{ANTH 445L}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "445L",
        "title": "Human Osteology Lab",
        "description": "Prerequisites: ANTH 341; Completion of the lower division writing requirement. Corequisite: ANTH 445L. Human Osteology is the study of the human skeleton. In this class, students will learn to recognize all of the human skeletal elements and appreciate the range of skeletal variation in individuals and populations. Osteological methods used on human remains discovered in an archeological, forensic or paleoanthropological context will also be covered. Available for graduate credit.",
        "units": "1",
        "prerequisites": "{{ANTH 341} && {Completion of the lower division writing requirement}}",
        "corequisites": "{ANTH 445}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "449",
        "title": "Historical Archaeology",
        "description": "Prerequisites: ANTH 153; Completion of the lower division writing requirement. This course discusses the concepts, strategies, and applications of historical archaeology as practiced in the United States. Associated topics include integrating documentary and archaeological histories, culture contact, identity, ethnogenesis, class and labor, conflict, modern material culture studies, historic preservation, and historical archaeology in the context of cultural resource management and heritage. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{ANTH 153} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "450",
        "title": "Historical Anthropology",
        "description": "Prerequisites: ANTH 150 or ANTH 152; Completion of the lower division writing requirement. Introduction to the anthropological study of cultures within a historical context. Examines the importance of a diachronic approach to the study of contemporary societies and introduces anthropological methods for a study of the past. Teaches critical analysis of documentary materials relevant for anthropological research. Regular written assignments required.",
        "units": "3",
        "prerequisites": "{{{ANTH 150} || {ANTH 152}} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "453",
        "title": "Human Paleontology",
        "description": "Prerequisites: ANTH 151, ANTH 153. Origin of humanity and the history of physical evolution beginning in Miocene times and continuing through to the present. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{ANTH 151} && {ANTH 153}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "460",
        "title": "Gender Archaeology",
        "description": "Prerequisites: ANTH 152 or ANTH 153; Upper division standing; completion of the lower division writing requirement. Examines the data and theories that provide insights into gender in prehistoric societies. Discussion of fundamental issues such as the origins of the gendered division of labor, the origins of gender hierarchy, the universality of female subordination and variability in women’s activities, status, and power in human societies. Taught from a cross-cultural perspective and combines insights provided by cultural anthropology, archaeology, art history, physical anthropology, and history. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{{ANTH 152} || {ANTH 153}} && {Upper division standing} && {completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "462",
        "title": "Anthropology of the Arts",
        "description": "Prerequisites: ANTH 150, ANTH 152 or ANTH 153; Completion of the lower division writing requirement. Anthropological approaches to the study of artistic expression in diverse sociocultural settings from the prehistoric to the present. Regular written assignments are required. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{ANTH 150} && {{ANTH 152} || {ANTH 153}} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "465",
        "title": "Museum Anthropology: Principles and Practices",
        "description": "Prerequisite: ANTH 152 or equivalent. This course introduces students to the theoretical and technical aspects of museum work as it relates to ethnographic and archaeological materials, as well as to the political and ethical ramifications of these practices. The course explores museum practices, skills and resources as they relate to the collection, curation, exhibition and administration of ethnographic and archaeological materials. Practices, principles and resources are considered not only for the United States but also as they pertain to museums and collections worldwide. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{ANTH 152}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "468",
        "title": "Cultural Heritage",
        "description": "Prerequisites: ANTH 152 and ANTH 153; Completion of the lower division writing requirement. Introduction to cultural heritage studies that focuses on the politics of the representation and conservation of tangible and intangible remains of the past. An examination of the issues at stake in the interpretation, management, and portrayal of the past that contribute to the complexity of contemporary identity politics. The course also explores the uses (and abuses) of the past in the present for social, political, and economic purposes. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{{ANTH 152} && {ANTH 153}} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "473",
        "title": "Theory and Method in Archaeology",
        "description": "Prerequisite: ANTH 153. Recommended Preparatory: ANTH 303. This course provides students with the basic theoretical and methodological skills and background needed to become practicing archaeologists. By the end of this course, students will be able to analyze and evaluate archaeological arguments on a range of key topics in terms of their theoretical approach, research design and logic. Students will master the key concepts that provide the underpinnings to successful research design and allow them to intelligently engage with other scholars at the national and international level. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{ANTH 153}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "475",
        "title": "Ethnographic Research Methods",
        "description": "Prerequisites: ANTH 150 or ANTH 152; Upper division standing; Completion of the lower division writing requirement. Introduction to the integration of anthropological perspectives with other social scientific research, including quantitative and advanced qualitative methods. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{{ANTH 150} || {ANTH 152}} && {Upper division standing} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "476A",
        "title": "Topics in Anthropological Methods",
        "description": "Fieldwork in any branch of anthropology, taken either in conjunction with or subsequent to an upper division course in that particular branch. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "486",
        "title": "Interrogating Globalization: The Ethnography of Global Problems",
        "description": "Prerequisite: ANTH 152 or equivalent. Preparatory: ANTH 300 or ANTH 315 or completion of regional distribution requirement. This course studies globalization using ethnography. It examines both the debates related to characterizing globalization and ethnographies that analyze some of its aspects, such as the rise of high-tech societies, the decentralization and feminization of labor, the dynamics and consequences of international migration and the causes and impacts of international commodity trade. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{ANTH 152}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "490A",
        "title": "Seminar in Anthropology",
        "description": "Prerequisites: ANTH 303; ANTH 473 or ANTH 474 or ANTH 475 or ANTH 519 or ANTH 574 or ANTH 575. Recommended Preparatory: One upper division course in the appropriate Anthropology sub-discipline. Faculty-directed research on primary data in the major sub-disciplines of Anthropology. Selected subjects in the same sub-discipline may be repeated up to two times. Available for graduate credit.\nCourse Title\nANTH 490A Archaeology\nANTH 490B Biological Anthropology\nANTH 490C Cultural Anthropology\nANTH 490D Linguistics\nANTH 490E Applied Anthropology",
        "units": "3",
        "prerequisites": "{{ANTH 303} && {{ANTH 473} || {ANTH 474} || {ANTH 475} || {ANTH 519} || {ANTH 574} || {ANTH 575}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "490B",
        "title": "Seminar In Anthropology: Biological Anthropology",
        "description": "Prerequisites: ANTH 303; Past or concurrent enrollment in ANTH 473 or 475 (after Fall 2006); One Upper Division course in appropriate subdiscipline.Faculty-directed research on primary data in the major subdisciplines of anthropology. Selected subjects in the same subdiscipline may be repeated up to 3 times. (A) Archaeology; (B) Biological Anthropology; (C) Cultural Anthropology; (D) Linguistics; (E) Applied Anthropology.  Available for Graduate Credit.\n",
        "units": "3",
        "prerequisites": "{{ANTH 303} && {Past or concurrent enrollment in ANTH 473 or 475 (after Fall 2006)} && {One Upper Division course in appropriate subdiscipline}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "490C",
        "title": "Seminar In Anthropology: Cultural Anthropology",
        "description": "Prerequisites: ANTH 303; Past or concurrent enrollment in ANTH 473 or 475 (after Fall 2006); One Upper Division course in appropriate subdiscipline.Faculty-directed research on primary data in the major subdisciplines of anthropology. Selected subjects in the same subdiscipline may be repeated up to 3 times. (A) Archaeology; (B) Biological Anthropology; (C) Cultural Anthropology; (D) Linguistics; (E) Applied Anthropology.  Available for Graduate Credit.\n",
        "units": "3",
        "prerequisites": "{{ANTH 303} && {Past or concurrent enrollment in ANTH 473 or 475 (after Fall 2006)} && {One Upper Division course in appropriate subdiscipline}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "490E",
        "title": "Seminar In Anthropology: Applied Anthropology",
        "description": "Prerequisites: ANTH 303; Past or concurrent enrollment in ANTH 473 or 475 (after Fall 2006); One Upper Division course in appropriate subdiscipline.Faculty-directed research on primary data in the major subdisciplines of anthropology. Selected subjects in the same subdiscipline may be repeated up to 3 times. (A) Archaeology; (B) Biological Anthropology; (C) Cultural Anthropology; (D) Linguistics; (E) Applied Anthropology.  Available for Graduate Credit.\n",
        "units": "3",
        "prerequisites": "{{ANTH 303} && {Past or concurrent enrollment in ANTH 473 or 475 (after Fall 2006)} && {One Upper Division course in appropriate subdiscipline}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Independent study. Available for graduate credit.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "500",
        "title": "Foundations of Anthropological Theory and Method",
        "description": "Prerequisite: Graduate standing or consent of instructor. Required for post-baccalaureate certificate and master’s students in Anthropology, and recommended for advanced undergraduate students who have not majored in anthropology yet are considering pursuing a master’s degree in that field. This course provides students with an accelerated overview of past and current anthropological theories explaining human physical and cultural origins and the development and distribution of diverse populations, languages, social institutions and beliefs. Particular emphasis in this accelerated overview is placed on how these theories relate to the methods and insights derived from cultural anthropology, archaeology, linguistics and biological anthropology research.",
        "units": "3",
        "prerequisites": "{{Graduate standing} || {consent of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "518",
        "title": "Lab Methods in Archaeology",
        "description": "Prerequisite: ANTH 473. Corequisite: ANTH 518L. Participation in description, analysis and interpretation of archaeological collections. Classification, measurement and description, cataloging and recording of pottery, lithic and other materials are discussed. 2 hours lecture; one 2-hour lab per week.",
        "units": "3",
        "prerequisites": "{ANTH 473}",
        "corequisites": "{ANTH 518L}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "518L",
        "title": "Lab Methods in Archaeology Lab",
        "description": "Prerequisite: ANTH 473. Corequisite: ANTH 518L. Participation in description, analysis and interpretation of archaeological collections. Classification, measurement and description, cataloging and recording of pottery, lithic and other materials are discussed. 2 hours lecture; one 2-hour lab per week.",
        "units": "1",
        "prerequisites": "{ANTH 473}",
        "corequisites": "{ANTH 518}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "521",
        "title": "California Archaeology",
        "description": "Prerequisite: ANTH 473. Study of the archaeology of California from the earliest times through the Mission Period, with particular attention to the ecology of foraging and the causes of the cultural changes exhibited in the sequence.",
        "units": "3",
        "prerequisites": "{ANTH 473}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "549",
        "title": "Advanced Historical Archaeology",
        "description": "Prerequisite: Graduate standing or instructor consent. This course presents advanced concepts, strategies, and applications of historical archaeology as practiced in the United States. Associated topics include integrating documentary and archaeological histories, culture contact, identity, ethnogenesis, class and labor, conflict, modern material culture studies, historic preservation, and historical archaeology in the context of cultural resource management and heritage.",
        "units": "3",
        "prerequisites": "{{Graduate standing} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "574",
        "title": "Advanced Quantitative Methods in Anthropology",
        "description": "Prerequisite: Graduate standing or instructor consent. This course covers the descriptive and inferential statistics used in anthropological research and reporting. Students gain experience incorporating quantitative applications in research, along with the knowledge of how to effectively discuss, analyze, display and present data.",
        "units": "3",
        "prerequisites": "{{Graduate standing} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "575",
        "title": "Advanced Ethnographic Research Methods",
        "description": "Prerequisite: Graduate standing or instructor consent. This course familiarizes the student to advanced methods in social science research from an anthropological perspective. Students will learn the process of research design, standards of ethical conduct when working with human subjects, quantitative and qualitative data collection methods, and the basics of data analysis and interpretation.",
        "units": "3",
        "prerequisites": "{{Graduate standing} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "602",
        "title": "Problems in Cultural Anthropology",
        "description": "Prerequisite: Classified status or instructor consent. Survey of current issues and debates in cultural anthropology.",
        "units": "3",
        "prerequisites": "{{Classified status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "603",
        "title": "Problems in Biological Anthropology",
        "description": "Prerequisite: Classified status or instructor consent. Advanced study of theories, methods, problems and data pertinent to contemporary biological anthropology.",
        "units": "3",
        "prerequisites": "{{Classified status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "606",
        "title": "Problems in Archaeology",
        "description": "Prerequisite: Classified status or instructor consent. Intensive review of current issues and concepts critical to general understanding of archaeology.",
        "units": "3",
        "prerequisites": "{{Classified status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "607",
        "title": "Seminar in Management of Archaeological Resources",
        "description": "Prerequisite: Classified status or instructor consent. Covers the practical, scientific and ethical aspects of conducting archaeological research for public and private agencies.",
        "units": "3",
        "prerequisites": "{{Classified status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "608",
        "title": "Problems in Applied Anthropology",
        "description": "Prerequisite: Classified graduate status. Survey of current issues and debates in applied anthropology.",
        "units": "3",
        "prerequisites": "{Classified graduate status}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "694",
        "title": "Practicum in Cultural Resource Management",
        "description": "Prerequisite: ANTH 607 or instructor consent. Internship involving the student directly in a work experience in cultural resource management. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{ANTH 607} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "696A",
        "title": "Anthropological Research Design",
        "description": "Prerequisite: Classified status. This seminar will focus on how anthropological research is conceived and planned, with consideration of differing theoretical viewpoints and their usefulness. Students will discuss the unique position of anthropology among the sciences and humanities and resulting issues for research design. Students will review typical anthropological research problems, discuss appropriate methods and critique completed research projects with an emphasis on identifying how their design fostered successful execution. Students will conduct preliminary research on a specific topic of interest and are expected to complete an annotated bibliography of theoretical, methodological and substantive works related to that topic.",
        "units": "2",
        "prerequisites": "{Classified status}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "696B",
        "title": "Proposal and Grant-Writing",
        "description": "Prerequisites: Classified status; Successful completion of 696A. This seminar instructs students on developing and implementing research design, preparing them to write research and grant proposals. Students will analyze successful research and grant proposals, study how research is conceptualized within each genre and subfield and practice writing effective proposals. Topics addressed include identifying researchable questions, the relationship between theory and method, designing an effective fieldwork plan, assembling a thesis committee, research ethics, IRB protocols, sources for research funding, budgeting, research proposal evaluation criteria, the peer-review process, strategies for writing and presenting research findings and methodological topics of interest to seminar participants. Students are expected to complete a proposal for their MA research.",
        "units": "2",
        "prerequisites": "{{Classified status} && {ANTH 696A}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisite: Completion of all courses required in the program. Intended for students taking the comprehensive exam. (Credit/No Credit only)",
        "units": "2",
        "prerequisites": "{Completion of all courses required in the program}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "698A",
        "title": "Thesis Or Graduate Project",
        "description": "Thesis or Graduate Project\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "698B",
        "title": "Thesis Or Graduate Project",
        "description": "Thesis or Graduate Project\n",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "699A",
        "title": "Independent Study",
        "description": "Prerequisite: Classified graduate status.",
        "units": "1",
        "prerequisites": "{Classified graduate status}",
        "corequisites": "{None}"
    }
]