[
    {
        "subject": "BLAW",
        "catalog_number": "280",
        "title": "Business Law I",
        "description": "Prerequisites: Completion of the lower division writing requirement; Sophomore standing. Study of the role of law in business, including the study of legal institutions and their role in facilitating and regulating business. Includes a study of the legal system, civil litigation, torts and the formation and performance of contracts. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{{Completion of the lower division writing requirement} && {Sophomore standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "BLAW",
        "catalog_number": "308",
        "title": "Business Law II",
        "description": "Prerequisite: BLAW 280. Corequisites/Prerequisites for Business majors: BUS 302 and BUS 302L. Study of the role of law in business, including the study of legal institutions and their role in facilitating and regulating business. Topics include agency and employment law, the various forms of business organizations and securities law.",
        "units": "3",
        "prerequisites": "{BLAW 280}",
        "corequisites": "{BUS 302/L}"
    },
    {
        "subject": "BLAW",
        "catalog_number": "368",
        "title": "Law, Business and Ethics",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of law, ethics and values in the business environment. The course will examine the ethical issues managers face in organizations within the context of values and law. Students are taught to recognize ethical issues, identify bias, examine values, explore the role of ethics in the workplace, understand the legal environment in which ethical issues arise and consider the role of professional standards in the context of business ethics. Students will learn ethical frameworks with which to analyze ethical problems and decisions. The course uses the case method to provide a process- and problem-solving orientation, to apply ethical theory to business situations, to analyze problems in the context of legal and regulatory frameworks and to provide a basis to internalize knowledge, growth and experience. Students learn skills of critical thinking. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "BLAW",
        "catalog_number": "370",
        "title": "Corporate Social Responsibility",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course examines the historical and current context, drivers, and ways that Corporate Social Responsibility (CSR) hard law, soft law, self-regulation, and ethical norms and initiatives are adapting to the increasing power and impact of businesses. The course will also consider the key theoretical and practical issues and modes of analysis relevant as businesses along with states and their various stakeholders rebalance public values and private interests in fascinating new ways. Throughout, we will consider specific case examples and use different role-playing and other exercises that will give the students the chance to consider how they would apply CSR principles in practice. The course will also examine current cases in the context of the principles presented in the course.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "BLAW",
        "catalog_number": "372",
        "title": "Ethical and Legal Aspects of Managing Technology",
        "description": "Prerequisite: Completion of the lower division writing requirement. Virtually every aspect of business and management decision making is touched by computing, information technology, and digital media. These influences are pervasive in private and public communication, transactions, and social interactions, and often serve as the infrastructure for organizations including commercial, banking and financial organizations, federal, state and local government and politics, utilities, national defense, educational organizations, and entertainment. This class will examine some of the ethical and legal issues associated with computers, information systems, and public and private networks, including the Internet, as they relate to management decision making in a wide variety of areas. Some of the areas to be covered include intellectual property protection, business-related crime, viruses, privacy, security, reliability, work environments, liability, and artificial intelligence. Balancing of the needs and desires of individuals or groups against those of other individuals or groups (including business, economic, professional, individual, governmental and social interests) within a business context will be a focus of the class.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "BLAW",
        "catalog_number": "374",
        "title": "Business Ethics: Personal Decision Making for Success in Business",
        "description": "Prerequisite: Completion of the lower division writing requirement. The purpose of this course is to help students become more proficient and effective in making ethical decisions. We explore how managers should think about the role of values and ethics in decision making. The course is designed to expose students to—and help them gain facility with—a set of ideas and concepts so as to structure their thinking and more fully develop an approach to recognizing and incorporating ethics into their own decision-making framework. This will enable students to reason more effectively about the role of ethics in a complex, dynamic, and diverse global business environment and will ultimately further develop their sense of responsible judgment.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "BLAW",
        "catalog_number": "391",
        "title": "Women and the Law",
        "description": "Prerequisite: Completion of the lower division writing requirement. Recommended Corequisites or Preparatory for Business majors: BUS 302 and BUS 302L. Study of several areas of law affecting the past and current legal status of women. Includes constitutional law, employment law and health law. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{BUS 302/L}"
    },
    {
        "subject": "BLAW",
        "catalog_number": "409",
        "title": "Wills, Estates and Trusts",
        "description": "Prerequisites: BLAW 280; BUS 302 and BUS 302L for Business majors. Introduction to the law of wills, estates, trusts and other areas connected with estate planning. Considers the nature of property, joint ownership of property, the validity and probate of wills, inheritance under the laws of intestate succession and the laws governing the establishment and administration of trusts. Also considers the law of estate taxation.",
        "units": "3",
        "prerequisites": "{{BLAW 280} && {BUS 302/L if Business major}}",
        "corequisites": "{None}"
    },
    {
        "subject": "BLAW",
        "catalog_number": "428",
        "title": "International Business Law",
        "description": "Prerequisites: BLAW 280; BUS 302 and BUS 302L for Business majors. Study of the legal environment for international commercial transactions, including an analysis of major Western and non-Western legal traditions and the supranational law of the European Community; a detailed analysis of the negotiation, formation, enforcement and financing of international sales contracts; an analysis of international trade regulation, analysis of methods of regulating global competition and of the protection of business property rights in international transactions.",
        "units": "3",
        "prerequisites": "{{BLAW 280} && {BUS 302/L if Business major}}",
        "corequisites": "{None}"
    },
    {
        "subject": "BLAW",
        "catalog_number": "430",
        "title": "Marketing Law",
        "description": "Prerequisites: BLAW 280; BUS 302 and BUS 302L for Business majors. This course explores the legal aspects of marketing strategy. The course considers the legal aspects of product ownership, distribution and competition, including liability aspects of particular business practices. Students study federal and state law related to consumer protection, trade secrets and unfair competition, selected topics in antitrust law (including pricing strategy, price fixing, predatory pricing, discriminatory pricing), marketing channel strategy (including resale price maintenance, territorial and customer restrictions, exclusive dealing and refusal to deal) and limits on market dominance. Throughout the course, the contrast between U.S. and international entities is explored, with particular examination of foreign licensing, distribution, liability and enforcement issues.",
        "units": "3",
        "prerequisites": "{{BLAW 280} && {BUS 302/L if Business major}}",
        "corequisites": "{None}"
    },
    {
        "subject": "BLAW",
        "catalog_number": "450",
        "title": "Intellectual Property Law",
        "description": "Prerequisites: BLAW 280; BUS 302 and BUS 302L for Business majors. Provides an introduction to the law of patents, copyrights, trademarks, trade secrets and related forms of intellectual property protection. Considers the nature of intellectual property rights and the scope of protection for various subject matter, including international and trade aspects relating to technology protection and transfer; the enforcement of intellectual property rights and remedies for infringement or misappropriation of such rights; and practical strategies for intellectual property development, management and licensing in the modern business environment.",
        "units": "3",
        "prerequisites": "{{BLAW 280} && {BUS 302/L if Business major}}",
        "corequisites": "{None}"
    },
    {
        "subject": "BLAW",
        "catalog_number": "451",
        "title": "Entertainment Business Law",
        "description": "Prerequisites: BLAW 280, BLAW 308; BUS 302 and BUS 302L for Business majors. This course covers the recurring legal problems that arise in the business context of the entertainment industry and the legal relationships between the parties involved in the film, television, theater, music and online entertainment fields. In particular, the course will address tort law issues, including defamation, invasion of privacy and the right of publicity; intellectual property protection, including copyright and trademark law and the protection of ideas; contract law issues, including contract formation, contractual obligations and remedies; and government regulation of entertainment content and industry practices. International aspects of each of these areas will be emphasized.",
        "units": "3",
        "prerequisites": "{{BLAW 280} && {BLAW 308} && {BUS 302/L if Business major}}",
        "corequisites": "{None}"
    },
    {
        "subject": "BLAW",
        "catalog_number": "453",
        "title": "Negotiation",
        "description": "Prerequisite: BLAW 280. BUS 302 and BUS 302L are prerequisites for Business majors. The course explores the ways that people negotiate to create value and resolve disputes. It is designed to introduce negotiation theory and to build negotiation skills. The curriculum integrates negotiation research and experiential learning activities. Some of the exercises explore aspects of bargaining, value creation and distribution, the dynamics of coalitions, multi-party negotiations with a focus on organized preparation and process analysis. The course explores building constructive relationships and resolving conflict. Students must demonstrate learning through both experiential activities and written assignments. Available for graduate credit in the real estate certificate program.",
        "units": "3",
        "prerequisites": "{{BLAW 280} && {BUS 302/L if Business major}}",
        "corequisites": "{None}"
    },
    {
        "subject": "BLAW",
        "catalog_number": "480",
        "title": "Commercial Transactions Law",
        "description": "Prerequisites: BLAW 280, BLAW 308; BUS 302 and BUS 302L for Business majors. Study of those areas of law related to commercial business transactions, including commercial paper, negotiable instruments, secured transactions, bankruptcy and the law of sales.",
        "units": "3",
        "prerequisites": "{{BLAW 280} && {BLAW 308} && {BUS 302/L if Business major}}",
        "corequisites": "{None}"
    },
    {
        "subject": "BLAW",
        "catalog_number": "481",
        "title": "Real Estate Law",
        "description": "Prerequisites: BLAW 280; BUS 302 and BUS 302L for Business majors. Legal and business aspects of real property acquisition and ownership, involving the nature of property ownership, including the acquisition of titles, easements, leases and contracts, community property, joint tenancy, tenancy in common, brokerage and land-use regulation. Available for graduate credit in the real estate certificate program.",
        "units": "3",
        "prerequisites": "{{BLAW 280} && {BUS 302/L if Business major}}",
        "corequisites": "{None}"
    },
    {
        "subject": "BLAW",
        "catalog_number": "485",
        "title": "Labor and Employment Law",
        "description": "Prerequisites: BLAW 280, BLAW 308; BUS 302 and BUS 302L for Business majors. Examines the development of labor law in the U.S. from the early common law to the current legislation. Existing federal statutes regulating labor unions and labor relations will be studied in detail. These statutes are studied as they are applied and interpreted by the federal courts and by the National Labor Relations Board. In addition, this course examines topics in U.S. employment laws such as family leave, equal pay, wrongful discharge, employee defamation, employer-related immigration laws, privacy in the workplace, discrimination based on race, sex, national origin and religion, and other new developments.",
        "units": "3",
        "prerequisites": "{{BLAW 280} && {BLAW 308} && {BUS 302/L if Business major}}",
        "corequisites": "{None}"
    },
    {
        "subject": "BLAW",
        "catalog_number": "495",
        "title": "Advanced Topics in Business Law",
        "description": "Prerequisites: BLAW 280, BLAW 308; BUS 302 and BUS 302L for Business majors. Selected advanced topics in business law are analyzed by means of readings, analysis of cases and problems, case studies and class discussion.",
        "units": "3",
        "prerequisites": "{{BLAW 280} && {BLAW 308} && {BUS 302/L if Business major}}",
        "corequisites": "{None}"
    },
    {
        "subject": "BLAW",
        "catalog_number": "508",
        "title": "Business Law",
        "description": "Prerequisite: Graduate standing. Study of the role of law in business, including the study of legal institutions and their role in facilitating and regulating business. Includes a study of the legal system, civil litigation, torts, and the formation and performance of contract, agency and employment law, the various forms of business organizations and securities law.",
        "units": "3",
        "prerequisites": "{Graduate standing}",
        "corequisites": "{None}"
    }
]