[
    {
        "subject": "CADV",
        "catalog_number": "150",
        "title": "Foundations of Child and Adolescent Development",
        "description": "This course surveys typical and atypical child and adolescent development. Topics include, but are not limited to: physical, social, cognitive, and language changes over time, as well as how to address special needs and at risk youth. Readings and coursework provide basic grounding in the major theories/theorists of human development, major topics in cognitive, social and physical development from a cultural lens and the development of basic competencies for child observation as a study methodology. (Available for General Education, D1 Social Sciences.) (IC)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "180",
        "title": "Statistics in Applied Developmental Science",
        "description": "Prerequisite: Child and Adolescent Development major. This course introduces fundamental skills of statistical reasoning used in research in the developmental sciences including techniques of data collection, organization, presentation analysis and interpretation using statistical analysis tools. Topics include descriptive statistics, probability and sampling distributions; statistical inference; correlation and linear regression; analysis of variance, chi-square and t-tests; and application of technology for statistical analysis including the interpretation of the relevance of statistical findings. Course includes focus on using data and examples from the fields of child and adolescent development and education.",
        "units": "3",
        "prerequisites": "{Child and Adolescent Development major}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "250",
        "title": "Professional Pathways and Careers in Child and Adolescent Development",
        "description": "Engages students in the process of transitioning from college student to professional employee through career planning and development. Students participate in thoughtful self-assessment of their own interests, values, and skills as well as career exploration and planning of preliminary and long-range employment options and strategies within the field of child and adolescent development. Contemporary professional issues, advocacy, and professionalism in careers that use child and adolescent development as a foundation are investigated.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "310",
        "title": "Developmental Impacts of Abuse and Neglect",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: CADV 150. Survey of the cognitive, physical, social/emotional effects of abuse and neglect spanning conception through emerging adulthood. Historical perspectives related to abuse and neglect of children, adolescents, and young adults including current trends/topics are explored. Ethical and practical issues regarding maltreatment relevant to current and prospective parents as well as professionals in the field of child and adolescent development are addressed. (Available for General Education, E Lifelong Learning.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "327",
        "title": "Infancy and Early Childhood",
        "description": "Prerequisites: CADV 150 or PSY 150; Completion of the lower division writing requirement. Corequisite for Psychology major only: PSY 301. Relevant aspects of physical, social, cognitive and emotional change are highlighted as part of human development from conception to early childhood (conception to 8 years). Emphasis on the study of the underlying processes and influences on human development. Cultural contexts of development, key changes, continuity and individual differences are examined. Includes evaluation of selected theories, contemporary issues and practical applications. (Cross-listed with PSY 327.)",
        "units": "3",
        "prerequisites": "{{{CADV 150} || {PSY 150}} && {Completion of the lower division writing requirement}}",
        "corequisites": "{PSY 301}"
    },
    {
        "subject": "CADV",
        "catalog_number": "335",
        "title": "Middle Childhood",
        "description": "Prerequisites: CADV 150 or PSY 150; completion of the lower division writing requirement. Corequisite for Psychology majors only: PSY 301. This course examines developmental changes in the middle childhood years (7-12 years). Emphasis is on current research and major theories associated with middle childhood development. Cultural contexts of development, key changes, continuity and individual differences are examined. (Cross-listed with PSY 335.)",
        "units": "3",
        "prerequisites": "{{{CADV 150} || {PSY 150}} && {completion of the lower division writing requirement}}",
        "corequisites": "{PSY 301}"
    },
    {
        "subject": "CADV",
        "catalog_number": "350",
        "title": "Applied Cognitive Development",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: CADV 150. Students survey major topics of cognitive development from infancy to adolescence, review research literature about environmental factors that influence children’s cognitive development and assess the implications for observing and working with children and their families. Students have an opportunity to learn how children’s developing ability to think and articulate can be used as a basis for communicating effectively with them.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "352",
        "title": "Applied Social Development",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: CADV 150. This course surveys human social development from infancy through adolescence. Several theoretical frameworks that inform the study of social development are presented, as well as empirical evidence extending knowledge of the processes and content of social development. Emphasis is placed on connecting theories and constructs of social development to effective practice as child and adolescent professionals, the development of observation skills and use of developmentally appropriate practices with children and adolescents in naturalistic settings.",
        "units": "3",
        "prerequisites": "Completion of the lower division writing requirement",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "361",
        "title": "Adolescence",
        "description": "Prerequisites: CADV 150 or PSY 150; Completion of the lower division writing requirement. Corequisite for Psychology majors only: PSY 301. Analysis of the physical, cognitive, social and emotional changes from puberty to adulthood. Examines contemporary youth culture from a historical and cross-cultural perspective. Discusses evaluation of age norms and deviant development. Project involving some aspect of adolescent development is required. (Cross-listed with PSY 361.)",
        "units": "3",
        "prerequisites": "{{{CADV 150} || {PSY 150}} && {completion of the lower division writing requirement}}",
        "corequisites": "{PSY 301}"
    },
    {
        "subject": "CADV",
        "catalog_number": "373",
        "title": "Emerging Adulthood",
        "description": "Prerequisite: CADV 150 or PSY 150. This course surveys the developmental changes during the period of emerging adulthood (18-25 years old). Cultural contexts, key changes, continuity and individual differences across both typical and atypical development are examined. The course explores changes in physiology, changes in thinking, changes in social interactions, the context within which these changes take place (emerging adults in family, peer, school and work environments), and the psychosocial areas in which development takes place (autonomy, identity, intimacy, sexuality, achievement). Common psychosocial problems in emerging adulthood are discussed.",
        "units": "3",
        "prerequisites": "{{CADV 150} || {PSY 150}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "380",
        "title": "Methods of Child and Adolescent Study I",
        "description": "Prerequisites: Completion of the lower division writing requirement and completion of the lower division math requirement. Preparatory: CADV 150 or MATH 140. Introductory course in techniques, use, presentation, and understanding of research principles in child and adolescent development and related fields. This course is designed to teach you to think scientifically, addressing the logic of correlational, experimental, and naturalistic design, the concept of control, the analysis of experimentally obtained data, and the principles of scientific writing. Lab: provides the opportunity to apply course concepts in a series of in-class and online activities.",
        "units": "3",
        "prerequisites": "{{Completion of the lower division writing requirement} && {completion of the lower division math requirement}}",
        "corequisites": "{CADV 380L}"
    },
    {
        "subject": "CADV",
        "catalog_number": "380L",
        "title": "Methods of Child and Adolescent Study I Lab",
        "description": "Prerequisites: Completion of the lower division writing requirement and completion of the lower division math requirement. Preparatory: CADV 150 or MATH 140. Introductory course in techniques, use, presentation, and understanding of research principles in child and adolescent development and related fields. This course is designed to teach you to think scientifically, addressing the logic of correlational, experimental, and naturalistic design, the concept of control, the analysis of experimentally obtained data, and the principles of scientific writing. Lab: provides the opportunity to apply course concepts in a series of in-class and online activities.",
        "units": "1",
        "prerequisites": "{{Completion of the lower division writing requirement} && {completion of the lower division math requirement}}",
        "corequisites": "{CADV 380}"
    },
    {
        "subject": "CADV",
        "catalog_number": "381",
        "title": "Methods of Child and Adolescent Study II",
        "description": "Prerequisites: CADV 380/L or PSY 320/L. Corequisite: CADV 381L. This course is designed to build on students’ knowledge of the scientific process of studying children and adolescents. Major topics include a consideration of the philosophical and conceptual underpinnings of research, the structures and conduct of research inquiry and the generation of research questions and hypotheses. General methodology will be covered through readings and activities from the textbooks and will be tailored to questions that focus on child and adolescent development. Students will be challenged to think critically about methodological issues in research that they read and will have an opportunity to design a research study of their own. Lab: provides the opportunity to apply course concepts in a series of in-class and online activities.",
        "units": "3",
        "prerequisites": "{{CADV 380/L} || {PSY 320/L}}",
        "corequisites": "{CADV 381L}"
    },
    {
        "subject": "CADV",
        "catalog_number": "381L",
        "title": "Methods of Child and Adolescent Study II Lab",
        "description": "Prerequisites: CADV 380/L or PSY 320/L. Corequisite: CADV 381L. This course is designed to build on students’ knowledge of the scientific process of studying children and adolescents. Major topics include a consideration of the philosophical and conceptual underpinnings of research, the structures and conduct of research inquiry and the generation of research questions and hypotheses. General methodology will be covered through readings and activities from the textbooks and will be tailored to questions that focus on child and adolescent development. Students will be challenged to think critically about methodological issues in research that they read and will have an opportunity to design a research study of their own. Lab: provides the opportunity to apply course concepts in a series of in-class and online activities.",
        "units": "1",
        "prerequisites": "{{CADV 380/L} || {PSY 320/L}}",
        "corequisites": "{CADV 381}"
    },
    {
        "subject": "CADV",
        "catalog_number": "394",
        "title": "Child and Adolescent Development Internship I",
        "description": "Prerequisites: CADV 150; PSY 150. Pre- or Corequisite: CADV 350 or CADV 352. Students must complete an application (available in Department Office) in the Spring semester prior to enrolling the following Fall. First of a two-semester internship sequence enabling students to apply theory to practice in a community setting. Internship includes 90 hours of service in a community organization/setting in addition to regular class meetings. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{CADV 150} && {PSY 150}}",
        "corequisites": "{{CADV 350} || {CADV 352}}"
    },
    {
        "subject": "CADV",
        "catalog_number": "406",
        "title": "Enhancing Childhood Creativity",
        "description": "Corequisite: CADV 406L. An Integrative seminar and lab experience focusing on the theoretical approaches for enhancing childhood creativity. The uses of play and fantasy are explored as means for developing programs that are child-oriented. Regular written assignments are required. (Cross-listed with RTM 406/L.)",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{CADV 406L}"
    },
    {
        "subject": "CADV",
        "catalog_number": "406L",
        "title": "Enhancing Childhood Creativity Lab",
        "description": "Corequisite: CADV 406L. An Integrative seminar and lab experience focusing on the theoretical approaches for enhancing childhood creativity. The uses of play and fantasy are explored as means for developing programs that are child-oriented. Regular written assignments are required. (Cross-listed with RTM 406/L.)",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{CADV 406}"
    },
    {
        "subject": "CADV",
        "catalog_number": "450",
        "title": "Helping Children Cope with Medical Environments",
        "description": "Prerequisites: CADV 150; Completion of the lower division writing requirement. The developmental impact of illness, disability and hospitalization on children and youth are studied. Methods used by child development specialists to help children cope with the emotional stress of ill health and disability will be presented.",
        "units": "3",
        "prerequisites": "{{CADV 150} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "451",
        "title": "Alternative Approaches to Discipline",
        "description": "Investigation of literature on discipline in child development settings. Practical and theoretical approaches are related and integrated.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "452",
        "title": "Child Advocacy",
        "description": "Designed to increase student knowledge of local, state and national advocacy organizations and their influence on public policy. Focus is on the individual child development professional’s role as a child advocate.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "453",
        "title": "Autism and Neurodevelopmental Disorders",
        "description": "Prerequisites: CADV 150 or PSY 150; Completion of the lower division writing requirement. Preparatory: CADV 380/L. Students investigate empirical research and evidence-based practice related to children and adolescents with autism spectrum disorders and neurodevelopmental disorders.",
        "units": "3",
        "prerequisites": "{{{CADV 150} || {PSY 150}} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "455",
        "title": "Effective Mentoring in Child and Adolescent Development",
        "description": "Prerequisites: CADV 150 or PSY 150; Preparatory: CADV 350 or CADV 352. This course will prepare students for success in graduate school and in their careers by increasing their understanding of theories of leadership/mentorship from CADV fields and providing opportunities to practice professional skills and apply leadership strategies to real-world scenarios and with increasingly diverse populations. Students will have opportunities to apply theories and principles of mentoring in structured and supervised settings.",
        "units": "3",
        "prerequisites": "{{CADV 150} || {PSY 150}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "456",
        "title": "Coping with Grief and Loss in Childhood and Adolescence",
        "description": "Preparatory: CADV 350 or CADV 352. This course will examine major theories and topics related to grief and loss affecting humans from infancy through adolescence. It will review key developmental theories and concepts regarding death and the process of bereavement. The course includes both normal and traumatic grief and loss common to children and adolescents, including divorce, romantic relationships, and community violence. Students will explore developmentally appropriate evidence-based strategies and interventions to facilitate the healthy development and adjustment of children and families.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "460",
        "title": "Race, Ethnicity, Gender and Culture in Development",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: CADV 150. Explores the development of ethnic minority children and adolescents in multicultural settings. Particular focus is placed on students’ exploration of their own understandings and awareness of culture, ethnicity and gender, based on the premise that effective professionals must clearly understand their own personal biases and level of privilege before looking at traits and characteristics of other groups. Specific attention is given to exploring the practical application of these concepts and theories in community settings.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "470",
        "title": "Advanced Theories in Child and Adolescent Development",
        "description": "Prerequisites: CADV 350 or CADV 352; CADV 380/L. This capstone course is a culminating experience for majors. It facilitates professional development through high level discussions and thinking on concepts and theories of development for transition into graduate-level programs in human development or related fields and/or into a career. Designed to synthesize the broad concepts of child and adolescent development, and to address contemporary issues in the field.",
        "units": "3",
        "prerequisites": "{{{CADV 350} || {CADV 352}} && {CADV 380/L}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "494",
        "title": "Child and Adolescent Development Internship II",
        "description": "Prerequisite: CADV 394. The second semester internship builds on the in-depth understanding of the program and experiences gained from the first semester internship. Individual goals enhance the professional development of students. Includes 90 hours of service in a community setting/organization in addition to regular class meetings. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{CADV 394}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "495A",
        "title": "Child and Adolescent Development Graduate School Skills and Applied Research Training I",
        "description": "Prerequisite: Students must complete department application. Recommended Preparatory: CADV 150; CADV 380/L or PSY 320/L or FCS 431; Completion of the lower division writing requirement. This course will address issues associated with becoming a professional in the field of child and adolescent development through developing applied research skills that will facilitate entry into graduate and professional programs in related fields. Students will: (1) develop competencies in qualitative and quantitative research methods in studying children and adolescents in both laboratory and field-based settings; and (2) gain practical experience applying knowledge of these research methods on actual active Child and Adolescent Development faculty research projects.",
        "units": "3",
        "prerequisites": "{{Students must complete department application} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "495B",
        "title": "Child and Adolescent Development Graduate School Skills and Applied Research Training II",
        "description": "Prerequisite: CADV 495A or consent of instructor. This course builds on the foundation of applied research methods in CADV 495A by providing opportunities for students to integrate the theories and constructs of applied research in the field of child and adolescent development toward further development of graduate school skills and training. Through participation in weekly seminars in addition to hands-on experience on research projects at varying stages of the research process, this course will provide students in-depth knowledge about particular phases of research (e.g., hypotheses generation, project design, data collection, data analyses and dissemination). In addition, students will develop a personal statement of their (1) research interests and (2) theoretical grounding in child and adolescent development.",
        "units": "3",
        "prerequisites": "{{CADV 495A} || {consent of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "497AA",
        "title": "Special Topics in Child and Adolescent Development",
        "description": "Recommended Preparatory: CADV 350, CADV 352, CADV 380/L. Innovative courses of study. Topics to be specified in the Schedule of Classes. Different topics may be taken for credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "497AB",
        "title": "Special Topics In Child And Adolescent Development: Issues In Adulthood",
        "description": "Recommended Preparatory: CADV 350 352 380/L. Innovative courses of study. Topics to be specified in the Schedule of Classes. Different topics may be taken for credit.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "497AC",
        "title": "Special Topics In Child And Adolescent Development: Mentoring Emerging Adults",
        "description": "Recommended Preparatory: CADV 350 352 380/L. Innovative courses of study. Topics to be specified in the Schedule of Classes. Different topics may be taken for credit.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "497AD",
        "title": "Special Topics In Child And Adolescent Development: Autism And Developmental Disorders",
        "description": "Recommended Preparatory: CADV 350 352 380/L. Innovative courses of study. Topics to be specified in the Schedule of Classes. Different topics may be taken for credit.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CADV",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Prerequisite: Arranged with the permission of the instructor. Enrollment in an Independent Study is by permission of the department chair and with the consent of the instructor who agrees to be a sponsor. Enrollment is granted based on evidence of the student’s ability to work independently on a project. Students who are on academic notice (formerly academic probation) or who have been disqualified and have not yet completed academic readmission requirements may not enroll in CADV 499 courses. Regular progress meetings with the faculty sponsor and a final written report are required before credit can be given for the course. Note that the maximum number of units from 499 courses that can be counted toward the baccalaureate degree is 6 units in a major and 6 additional units outside the major. Enrollment in an Independent Study is not allowed for the purpose of substitution for an existing course. An Independent Study is related to a major course or study and is not available for meeting a General Education requirement. (Credit/No Credit only)",
        "units": "1",
        "prerequisites": "Arranged with the permission of the instructor",
        "corequisites": "{None}"
    }
]