[
    {
        "subject": "ECON",
        "catalog_number": "101",
        "title": "Economics for Everyday Life",
        "description": "Prerequisite: Not open to Business and Economics majors or to students who have credit for ECON 160 or ECON 161. Introduction to economic principles. Explains the role of prices and profits/losses in guiding production to meet the demands of consumers in a market economy. Uses economic analysis to explain the determination of wages and employment, the consequences of international trade, the arguments for government intervention to deal with important issues such as pollution and congestion, and economic growth. The role of money in a market economy is also addressed. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Not open to Business and Economics majors or to students who have credit for ECON 160 or ECON 161}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "156",
        "title": "Introduction to Economic Analysis and Policy",
        "description": "Prerequisites: Multiple Measures Placement in (1) GE-level Mathematics or completion of MATH 093 or MATH 196QR or MATH 196S and (2) GE-level Written Communication or completion of 113A or 114A. Uses economics to analyze public policy options in the areas of healthcare, urban and regional development, international trade, education, housing, financial market regulation, job creation and other topical areas. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{{{Multiple Measures Placement in GE-level Mathematics} || {{MATH 093} || {MATH 196QR} || {MATH 196S}}} && {{Multiple Measures Placement in GE-level Written Communication} || {{ENGL 113A} || {ENGL 114A}}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "160",
        "title": "Principles of Microeconomics",
        "description": "Prerequisites: Multiple Measures Placement in (1) GE-level Mathematics or completion of MATH 093 or MATH 196QR or MATH 196S and (2) GE-level Written Communication or completion of 113A or 114A. Introduction to economics as it applies to the functioning of markets, businesses and households. Examines how individuals make decisions about how to use scarce resources efficiently and how these decisions affect markets and the overall economy. Effect of government policies on the functioning of markets also is examined. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{{{Multiple Measures Placement in GE-level Mathematics} || {{MATH 093} || {MATH 196QR} || {MATH 196S}}} && {{Multiple Measures Placement in GE-level Written Communication} || {{ENGL 113A} || {ENGL 114A}}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "161",
        "title": "Principles of Macroeconomics",
        "description": "Prerequisites: Multiple Measures Placement in (1) GE-level Mathematics or completion of  MATH 093 or MATH 196QR or MATH 196S and (2) GE-level Written Communication or completion of 113A or 114A; ECON 160. Introduction to economics as it applies to the national and international economy. Topics include differences in standards of living across countries, the monetary system and the determinants of inflation, and the factors causing growth and recessions. Examines the ability of the Federal Reserve and other government policy makers to influence the course of the economy. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{{{Multiple Measures Placement in GE-level Mathematics} || {{MATH 093} || {MATH 196QR} || {MATH 196S}}} && {{Multiple Measures Placement in GE-level Written Communication} || {{ENGL 113A} || {ENGL 114A}}} && {ECON 160}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "175",
        "title": "Introduction to U.S. Economic History",
        "description": "This course covers events in the U.S. from the middle of the 17th century to the present. The class uses economic analysis to examine social, political and economic events from the Colonial Period to the present. Students who earn credit for this course may not earn credit for ECON 375. (Available for General Education, C3 American History, Institutions and Ideals.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "307",
        "title": "Economics for Marketing Professionals",
        "description": "Prerequisites: ECON 160; Grade of a “C” or better in MATH 103 or MATH 150A or MATH 255A. Economic theory and applications relevant to marketing professionals. Topics include analysis of business location decisions, identifying relevant markets, product pricing strategies and the role of advertising in product differentiation. (Marketing majors may substitute this course for ECON 310.)",
        "units": "3",
        "prerequisites": "{{ECON 160} && {{MATH 103} || {MATH 150A} || {MATH 255A}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "308",
        "title": "Economics for Managers",
        "description": "Prerequisites: ECON 160 and ECON 161; Grade of a “C” or better in MATH 103 or MATH 150A or MATH 255A. Connects economic theory to practical issues faced by firm managers. Focuses on the way economic theory affects the firm’s behavior both internally and externally. Internal issues include organizational structure and contract design, especially as these issues relate to opportunism, rent-seeking and asymmetric information. External issues include discussions of corporate strategy, advertising and the market for corporate control. (Management majors may substitute this course for ECON 310.)",
        "units": "3",
        "prerequisites": "{{{ECON 160} && {ECON 161}} && {{MATH 103} || {MATH 150A} || {MATH 255A}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "309",
        "title": "The Use and Interpretation of Economic Data",
        "description": "Prerequisites: ECON 160 and ECON 161; SOM 120 or MATH 140; Grade of a “C” or better in MATH 103 or MATH 150A or MATH 255A. Understanding the use and interpretation of economic statistics in the mainstream media and economic literature. Topics covered include identifying and understanding the misuse of economic statistics, as well as performing some statistical analysis using economic data. Emphasis is placed on how students can use written and verbal communication to convey the meaning and relevance of economic statistics to those outside the profession.",
        "units": "3",
        "prerequisites": "{{{ECON 160} && {ECON 161}} && {{SOM 120} || {MATH 140}} && {{MATH 103} || {MATH 150A} || {MATH 255A}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "310",
        "title": "Price Theory and Applications",
        "description": "Prerequisites: ECON 160; Grade of a “C” or better in MATH 103 or MATH 150A or MATH 255A; Completion of the lower division writing requirement. The operation of the price system in market-oriented economies. Special emphasis is placed on consumer behavior, business behavior, market organization, the theory of production and cost, economic welfare and applications to international trade. Substantial written work will be required of all students. (Available for General Education, D1 Social Sciences.) (Marketing majors may substitute this course with ECON 307.) (Management majors may substitute this course with ECON 308.)",
        "units": "3",
        "prerequisites": "{{ECON 160} && {{MATH 103} || {MATH 150A} || {MATH 255A}} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "311",
        "title": "Money, Banking and the Federal Reserve",
        "description": "Prerequisites: ECON 160 and ECON 161; Grade of a “C” or better in MATH 103 or MATH 150A or MATH 255A; Completion of the lower division writing requirement. Examination of money markets, the Federal Reserve system, foreign exchange markets, the international financial system and their relationship to macroeconomic policy. Topics of special interest include the determination of income, interest rates, exchange rates and international lending. Substantial written work will be required of all students. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{{{ECON 160} && {ECON 161}} && {{MATH 103} || {MATH 150A} || {MATH 255A}} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "312",
        "title": "Macroeconomic Theory",
        "description": "Prerequisites: ECON 161; Grade of a “C” or better in MATH 103 or MATH 150A or MATH 255A; completion of the lower division writing requirement. Neoclassical, Keynesian and modern theories of the determination of aggregate output, employment and the general price level. Monetary and fiscal policy.",
        "units": "3",
        "prerequisites": "{{ECON 161} && {{MATH 103} || {MATH 150A} || {MATH 255A}} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "348",
        "title": "History Of Economic Institutions",
        "description": "Prerequisites: ECON 160 and 161 or 300. Examines the development of economic institutions and their effect on economic growth from an international perspective. Compares the development of economic institutions in Europe Asia and the Middle East.\n",
        "units": "3",
        "prerequisites": "{{{ECON 160} && {ECON 161}} || {ECON 300}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "350",
        "title": "Urban Economics",
        "description": "Prerequisite: ECON 160; Grade of a “C” or better in MATH 103 or MATH 150A or MATH 255A. Analysis of the formation and location of cities, the distribution of activities and the variation of land prices within urban areas. Economic analysis of urban housing and blight, poverty, pollution, congestion, law enforcement, optimal city size, urban finances and services.",
        "units": "3",
        "prerequisites": "{{ECON 160} && {{MATH 103} || {MATH 150A} || {MATH 255A}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "355",
        "title": "Health Economics",
        "description": "Prerequisites: ECON 160 and ECON 161; Grade of a “C” or better in MATH 103 or MATH 150A or MATH 255A. This class uses economic theory to analyze problems created by the complexities of healthcare markets. These problems include the widespread use of insurance, the important role of asymmetric information, the extent of government involvement, the role of nonprofit hospitals as sellers of healthcare and the nature of restrictions placed on competition. Additionally, the course provides background on hospital costs, labor shortages, public health concerns and international comparisons of health insurance systems.",
        "units": "3",
        "prerequisites": "{{{ECON 160} && {ECON 161}} && {{MATH 103} || {MATH 150A} || {MATH 255A}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "360",
        "title": "Environmental Economics",
        "description": "Prerequisites: ECON 160; Grade of a “C” or better in MATH 103 or MATH 150A or MATH 255A; Completion of the lower division writing requirement. Focuses on environmental issues and policies. Areas include air, water, noise and toxic waste pollution, quality of life concerns, and open space and recreational area availability. Benefits and costs of current and alternative environmental policies are analyzed. Specific attention is given to the relation between energy resource development and usage and the environment. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{{ECON 160} && {{MATH 103} || {MATH 150A} || {MATH 255A}} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "365",
        "title": "Law and Economics",
        "description": "Prerequisites: ECON 160 and ECON 161; Grade of a “C” or better in MATH 103 or MATH 150A or MATH 255A. Examination of the effects of the legal system on the allocation of resources. Selected topics include the economic implications of property rights, contract law, product liability and the criminal justice system.",
        "units": "3",
        "prerequisites": "{{{ECON 160} && {ECON 161}} && {{MATH 103} || {MATH 150A} || {MATH 255A}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "370",
        "title": "Economic Development",
        "description": "Prerequisites: ECON 160 and ECON 161; Grade of a “C” or better in MATH 103 or MATH 150A or MATH 255A. Class examines why standards of living differ across countries. Economic growth models are used to explain cross-country differences in economic performance. Emphasis is placed on the role of institutions, such as private property rights, in the economic development process. Impact of international trade, exchange rate systems and international debt on developing countries is carefully examined. Effects of government taxation, spending and monetary policies on economic growth and inflation are analyzed. Other issues covered are the impact of financial market development, population growth and agriculture on developing economies.",
        "units": "3",
        "prerequisites": "{{{ECON 160} && {ECON 161}} && {{MATH 103} || {MATH 150A} || {MATH 255A}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "375",
        "title": "Economic History Of The United States",
        "description": "Prerequisites: ECON 160 and 161 or 300. History of U.S. economic development including economic analyses of major historical issues.\n",
        "units": "3",
        "prerequisites": "{{{ECON 160} && {ECON 161}} || {ECON 300}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "403",
        "title": "Open-Economy Macroeconomics",
        "description": "Prerequisites: ECON 310 with a “C” or better; either ECON 311 or ECON 312. Examines the determination of currency values in foreign exchange markets, a country’s domestic balance of payments, interest rates and purchasing power parity and macroeconomic policies in an open economy. Other topics include the effects of financial innovation, economic integration, financial crises, and macroprudential regulation on global financial markets and national economies.",
        "units": "3",
        "prerequisites": "{{ECON 310} && {{ECON 311} || {ECON 312}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "405",
        "title": "International Trade",
        "description": "Prerequisite: ECON 310 with a “C” or better. Examines world trade in goods and services. Explains why nations trade, the distributional effects of trade, and the consequences of domestic trade policy as well as multilateral trade organizations and institutions.",
        "units": "3",
        "prerequisites": "{ECON 310}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "409",
        "title": "Introduction to Econometrics",
        "description": "Prerequisites: ECON 309 and ECON 310 with a “C” or better. How to estimate relationships between economic variables using actual data. Techniques taught are used to test economic theory and hypotheses from business. Each class member completes a term project involving the construction and estimation of an econometric model.",
        "units": "3",
        "prerequisites": "{{ECON 309} && {ECON 310}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "410",
        "title": "Industrial Organization",
        "description": "Prerequisite: ECON 310 with a “C” or better. Examination of the structure, conduct and performance of American industries in both a theoretical and empirical framework. Selected topics include effects of concentration, barriers to entry, empirical cost curves, economics of scale, oligopoly behavior models, product differentiation and alternative performance measures.",
        "units": "3",
        "prerequisites": "{ECON 310}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "411",
        "title": "The Economics of Antitrust and Regulation",
        "description": "Prerequisite: ECON 310 with a “C” or better. Economic analysis of government policies to alter or maintain market structures and the economic implications of these policies. Selected topics include the problem of antitrust, regulation and public ownership of industry, mergers, price discrimination, capital intensity of regulated firms and utility price structure.",
        "units": "3",
        "prerequisites": "{ECON 310}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "412",
        "title": "Seminar in Economic Thought",
        "description": "Prerequisite: ECON 310 with a “C” or better. Seminar in the evolution of economic theory with emphasis on mercantilism, physiocracy, classical economics and socialism.",
        "units": "3",
        "prerequisites": "{ECON 310}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "421",
        "title": "Labor Economics",
        "description": "Prerequisite: ECON 310 with a “C” or better. Analyses of the determinants of hours worked, labor productivity, labor demand, variation in wages, human capital investment and labor mobility. Examines the effect of alternative pay schemes, the impact of discrimination on wages and employment, and the impact of labor unions on employment, wages and working conditions.",
        "units": "3",
        "prerequisites": "{ECON 310}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "433",
        "title": "Public Economics",
        "description": "Prerequisites: ECON 309 and ECON 310 with a “C” or better. The class examines interaction that takes place between the government and private sectors of the economy. Effects of taxation and public expenditure decisions on the allocation of resources. Specific topics include public goods, public choice, externalities, property rights and taxation.",
        "units": "3",
        "prerequisites": "{{ECON 309} && {ECON 310}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "498A",
        "title": "Field Assignments and Reports",
        "description": "Individual study pertaining to present or future career. Student must have active, approved employment. Consultation with employer and instructor determines program. Academic Internship course. (Credit/No Credit only)",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Prerequisites: Consent of department chair; Consent of an instructor to act as sponsor. In order to complete an Independent Study assignment in the College of Business and Economics, students must have at least a 3.0 overall GPA, a 2.0 GPA in all major courses and a 2.0 GPA in their option courses. Students who do not meet these grade point requirements will not receive credit for any ECON 499 that they may take. Admission is based on evidence of ability to pursue Independent Study in-depth and approval of a project submitted at the time of registration. Regular progress meetings and reports are required throughout the semester. Completion of the project is required before credit may be received. Enrollment in Independent Study is not allowed for the purpose of substitution for an existing course. Not more than 6 units of Independent Study in the College of Business and Economics may be taken without prior approval of the Dean of the College.",
        "units": "1",
        "prerequisites": "{{Consent of department chair} && {Consent of an instructor to act as sponsor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "500",
        "title": "Survey of Economics",
        "description": "Survey of the tools, concepts, and techniques that economists use to analyze the behavior of firms, consumers, markets, and entire economies. Microeconomic topics include game theory and market structure. Macroeconomic topics include determinants of GDP, economic growth, and the role of the Federal Reserve.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "600",
        "title": "Economics of Strategy",
        "description": "Prerequisite: ECON 500. An economic analysis of the firm, including its horizontal and vertical boundaries, industry-level competition, competitive positioning, and basis of its competitive advantage and threats to sustaining competitive advantage. Economic modeling and insights are applied to complex situations, drawn from business cases and students’ own business experiences.",
        "units": "3",
        "prerequisites": "{ECON 500}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECON",
        "catalog_number": "699",
        "title": "Independent Study",
        "description": "Prerequisite: Permission of graduate advisor. Only those graduate students who have a current 3.0 GPA may register in a 600-level Independent Study course.",
        "units": "3",
        "prerequisites": "{Permission of graduate advisor}",
        "corequisites": "{None}"
    }
]