[
    {
        "subject": "FLIT",
        "catalog_number": "150",
        "title": "Gateways to Western Civilization: Greece and Rome",
        "description": "Prerequisite: May not be taken by students who have completed FLIT 350. Basic elements of modern civilization have their origins in Greece and Rome. Emphasis on historical development and on their impact on contemporary society. Conducted in English. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{May not be taken by students who have completed FLIT 350}",
        "corequisites": "{None}"
    },
    {
        "subject": "FLIT",
        "catalog_number": "151",
        "title": "Introduction to Modern Chinese Culture and Literature",
        "description": "This course provides a survey of social and cultural patterns in modern China from 1911 to the present, focusing on the post-socialist period. Broad in scope, the course will examine the main areas of contemporary Chinese life: culture, visual arts, literature, politics, society, and the environment. In the realms of popular culture, literature, and film, it will show the performativity of everyday life, while paying great attention to state regulation and global influence. Through analysis and discussion, students will better understand the lived experiences of the Chinese people, as well as the causes and consequences of social inequality, social conflicts, and social change. Students will observe the influence of social structures and institutions on personal lives, as well as how individual and collective forms of action may in turn transform institutions and structures. Special attention will be paid to issues of race, ethnicity, class, gender, religion, sexuality, and other markers of social identity that impact life experiences and social relations. (Available for General Education, C1 Arts or C2 Humanities.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "FLIT",
        "catalog_number": "234",
        "title": "Virtual Study Abroad",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course will give students a simulated experience of studying abroad via technology mediation and exposure to people and products from international cultures. Through the virtual exposure to global cultures and research projects, students will learn to use technology to access information sources, develop strategies to evaluate the accuracy and usefulness of information, and investigate how cultural information and products impact individuals and society. The course will help students become discriminating consumers of cultural products and sophisticated global citizens with skills to interact with diverse people in a culturally appropriate manner in their professional and personal lives. (Available for General Education, E Lifelong Learning.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "FLIT",
        "catalog_number": "250",
        "title": "Traditional Culture of Japan",
        "description": "Prerequisite: Completion of the lower division writing requirement. The course explores the traditions that inform the values and aesthetics of present-day Japan and make one of the most technologically advanced nations distinctly Asian and traditional. It also examines the foreign influences on Japan, the modifications that were made to suit Japanese taste and influences of Japan on other countries. The areas investigated include indigenous beliefs, religious and philosophical teachings that inform the arts and martial arts, and various aesthetic principles and their manifestations in poetry, theater and other arts. Conducted in English. (Available for General Education, C1 Arts.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "FLIT",
        "catalog_number": "295A",
        "title": "Masterpieces of European Literature I",
        "description": "Prerequisite: Completion of the lower division writing requirement. Introduction to masterpieces of European literature from the Middle Ages through the Classical period. Conducted in English. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "FLIT",
        "catalog_number": "295B",
        "title": "Masterpieces Of European Literature Ii",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Introduction to masterpieces of European literature from Romanticism to the modern period. Conducted in English. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "FLIT",
        "catalog_number": "331",
        "title": "Literary Masterpieces of Italian Humanism and Renaissance Literature",
        "description": "Prerequisite: Completion of the lower division writing requirement. No background of Italy or knowledge of the language required. This course offers students an in-depth study of major Italian literary masterpieces (fiction, poetry and drama) and aesthetic theories developed during the period of Humanism and Renaissance (1380-1550). Such a study allows students to appreciate the importance of new literary, spiritual and human values that emerged at that time and the unique role played by Italian Humanism and Renaissance on European literature and civilization. Conducted in English. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "FLIT",
        "catalog_number": "370",
        "title": "Modern Japanese Culture",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: No background knowledge of Japan or the language is required. Explores the country that quickly modernized and Westernized to become an economic and industrial force in the world and yet remains distinctly Asian. Examines the Japanese people and culture, their recent changes and the current critical issues in Japan, such as changes in the basic values, philosophy and behavior that the recent political, economic and social situations have wrought. Compares the interpretations and presentations of Japanese culture made by the Japanese and the non-Japanese, and by scholars and popular writers, to learn to critically look at issues from various perspectives. Conducted in English. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "FLIT",
        "catalog_number": "371",
        "title": "Modern Italian Culture",
        "description": "Prerequisite: Completion of the lower division writing requirement. Survey of contemporary Italy. Captures the major literary and cultural aspects and examines the social relations, customs, traditions and productive forces that have contributed to the emergence of Italy as a leading industrial European country. Conducted in English. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "FLIT",
        "catalog_number": "380",
        "title": "Cultural Development of Modern Russia and Eastern Europe",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examines the cultural history and current developments of the Slavic people in the Russian States and Eastern Europe, and traces the role of these people in American culture and society. Conducted in English. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "FLIT",
        "catalog_number": "381",
        "title": "Aspects of the Italian-American Experience in Cinema, Literature, Philosophy and Music",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course will examine different individuals within the Italian-American experience, exploring their contributions in the fields of cinema, literature, philosophy and classical music, and how through each we see an additional paradigm offered in and to the mainstream artistic and humanistic endeavor in the U.S. Conducted in English. (Available for General Education, C2 Humanities.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "FLIT",
        "catalog_number": "383",
        "title": "Hispanic Civilization And Culture: Middle Ages To Golden Age",
        "description": "Preparatory: No background knowledge of Spain or Spanish is required. This course is a survey of the Middle Ages and the Golden Age 1040-1700 and captures major literary and cultural age aspects and examines the social relations customs traditions and productive forces that transitioned Spain from kingdoms to empire. This course meets the Upper Division General Education writing requirements. Conducted in English. (Available for General Education: Art and Humanities.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "FLIT",
        "catalog_number": "391",
        "title": "Cultural Theories and Methodologies",
        "description": "Preparatory: FLIT 234. Intensive interdisciplinary study of an age, movement, problem or theme, with emphasis on the practices and methodologies of intercultural study. The topic of the seminar varies. May be repeated once for credit. (Cross-listed with HUM 391.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "FLIT",
        "catalog_number": "402",
        "title": "Japanese Literature",
        "description": "Survey of Japanese literature from earliest times to the present, with particular emphasis on Japanese cultural values as applied to Western literary forms. Conducted in English.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "FLIT",
        "catalog_number": "455",
        "title": "Women Writers Of Asia",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Study of selected literary works by women of Asia. Examines the roles of gender and womens creativity in response to the religious and ideological currents and social conditions in the region. Conducted in English.\n",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "FLIT",
        "catalog_number": "485",
        "title": "Major Russian Writers",
        "description": "Study of major Russian writers with emphasis on writers of the pre-revolutionary period. Conducted in English. (Cross listed with ENGL 485.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "FLIT",
        "catalog_number": "491",
        "title": "Capstone Seminar",
        "description": "Prerequisite: FLIT 391. Intensive interdisciplinary study of an age, movement, problem or theme, with emphasis on the application of cultural theory in interdisciplinary study. The topic of the seminar varies. Students will complete a senior project, such as a research paper or a creative performance, that demonstrates the integrated knowledge, understanding and linguistic skills they have gained in the course of studies in the Major. The project will be presented in English to fellow students and MCLL faculty members at the senior presentation. May be repeated once for credit with a different topic. (Cross-listed with HUM 491 and LRS 491.)",
        "units": "3",
        "prerequisites": "{FLIT 391}",
        "corequisites": "{None}"
    }
]