[
    {
        "subject": "GBUS",
        "catalog_number": "598C",
        "title": "MBA Internship",
        "description": "Prerequisite: Graduate student in good standing. Individual study pertaining to future career and application of knowledge, skills and abilities gained in MBA coursework. Student must obtain an approved internship requiring MBA-level responsibilities. Faculty mentor and employer will determine scope of work. This academic internship course is available on a Credit/No Credit basis only. May not be used to fulfill formal program requirements in the MBA program.",
        "units": "3",
        "prerequisites": "{Graduate student in good standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "GBUS",
        "catalog_number": "599C",
        "title": "Independent Study",
        "description": "Independent Study \n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "GBUS",
        "catalog_number": "600",
        "title": "Analysis of Contemporary Organizations",
        "description": "Interdisciplinary course introducing new graduate students to the field of business. Focuses on the nature of organizations, the inter‑relatedness of the functional areas, and how organizational culture shapes ethical behavior. Explores intellectual and historic roots of management theories through readings of primary source materials. Students develop communication and research skills through individual and group projects that focus on organizations and their environment.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "GBUS",
        "catalog_number": "607",
        "title": "Data Mining and Analytics",
        "description": "Prerequisite: SOM 591 or equivalent. Concepts and methods in data mining and analytics applicable to business settings leading to knowledge discovery from large data sets and better managerial decision making. Covers steps in the data mining process including data preparation, partitioning, model building, validation and selection. Analytics models include classification, prediction, association, clustering and neural net using both supervised/unsupervised approaches. Students will learn through a combination of lectures and hands-on short case applications using a mining software in a computer lab environment.",
        "units": "3",
        "prerequisites": "{SOM 591}",
        "corequisites": "{None}"
    },
    {
        "subject": "GBUS",
        "catalog_number": "690A",
        "title": "Selected Topics for Graduate Business Insights",
        "description": "Prerequisites: Classified Status. Completion of GBUS 600 and completion of two graduate business core courses (minimum). Advanced examination of business topics/issues that combine academic rigor and real-world relevance and insight. Topics will be specified in the Schedule of Classes. May be repeated once for credit, provided the topic is different.",
        "units": "3",
        "prerequisites": "{Classified Status}",
        "corequisites": "{None}"
    },
    {
        "subject": "GBUS",
        "catalog_number": "696F",
        "title": "Directed Graduate Research",
        "description": "Prerequisites: Permission of department chair and director of graduate programs.",
        "units": "1",
        "prerequisites": "{Permission of department chair and director of graduate programs}",
        "corequisites": "{None}"
    },
    {
        "subject": "GBUS",
        "catalog_number": "698A",
        "title": "Graduate Project",
        "description": "Prerequisite: All MBA core courses and MGT 693 completed or concurrent enrollment, classified status or applied for classified status. Permission of Director of Graduate Programs is required. Number of units allowed depends upon the study undertaken. A culminating experience is required for completion of a master’s degree program. The Nazarian College MBA Consulting Project is a significant, culminating undertaking appropriate to the business professional field. MBA candidates work collaboratively in small teams on this joint graduate project under faculty supervision. The team prepares a report and delivers a presentation for a client organization.",
        "units": "3",
        "prerequisites": "{{All MBA core courses and MGT 693 completed or concurrent enrollment} && {classified status or applied for classified status}}",
        "corequisites": "{None}"
    }
]