[
    {
        "subject": "LRS",
        "catalog_number": "100",
        "title": "Liberal Studies Freshman Seminar and Field Study",
        "description": "Prerequisite: ITEP Freshman option students only. Recommended Corequisite: LRS 100F. Introduces first-time freshman students to university culture and expectations and to fieldwork methodology in elementary education. Students focus primarily on themselves as learners with a secondary focus on children as learners. Topics: how students learn; time management; diversity; information competence; introduction to technology; university literacy; campus-specific resources and services; and an introduction to fieldwork methodology. 1 hour of lecture and 2 hours of guided field experience in elementary school classrooms per week.",
        "units": "1",
        "prerequisites": "{ITEP Freshman option students only}",
        "corequisites": "{LRS 100F}"
    },
    {
        "subject": "LRS",
        "catalog_number": "100F",
        "title": "Liberal Studies Freshman Seminar and Field Study",
        "description": "Prerequisite: ITEP Freshman option students only. Recommended Corequisite: LRS 100F. Introduces first-time freshman students to university culture and expectations and to fieldwork methodology in elementary education. Students focus primarily on themselves as learners with a secondary focus on children as learners. Topics: how students learn; time management; diversity; information competence; introduction to technology; university literacy; campus-specific resources and services; and an introduction to fieldwork methodology. 1 hour of lecture and 2 hours of guided field experience in elementary school classrooms per week.",
        "units": "1",
        "prerequisites": "{ITEP Freshman option students only}",
        "corequisites": "{LRS 100F}"
    },
    {
        "subject": "LRS",
        "catalog_number": "150",
        "title": "Liberal Studies and Anthropology and Field Study",
        "description": "Prerequisite: ITEP Freshman option students only. Recommended Corequisite: LRS 150F. Preparatory: LRS 100/F. Introduction to the study of cultural anthropology, with a focus on cultural issues that influence learning and education of multicultural populations. Students apply cultural concepts to understand themselves as learners and to children in elementary-school settings. Topics include gender, ethnicity and people who are culturally and linguistically diverse. Foundations of ethnographic observation and development of a case study of an elementary-school student. Includes 15 hours of guided field experience in elementary classrooms.",
        "units": "2",
        "prerequisites": "{ITEP Freshman option students only}",
        "corequisites": "{LRS 150F}"
    },
    {
        "subject": "LRS",
        "catalog_number": "150F",
        "title": "Liberal Studies and Anthropology and Field Study",
        "description": "Prerequisite: ITEP Freshman option students only. Recommended Corequisite: LRS 150F. Preparatory: LRS 100/F. Introduction to the study of cultural anthropology, with a focus on cultural issues that influence learning and education of multicultural populations. Students apply cultural concepts to understand themselves as learners and to children in elementary-school settings. Topics include gender, ethnicity and people who are culturally and linguistically diverse. Foundations of ethnographic observation and development of a case study of an elementary-school student. Includes 15 hours of guided field experience in elementary classrooms.",
        "units": "1",
        "prerequisites": "{ITEP Freshman option students only}",
        "corequisites": "{LRS 150F}"
    },
    {
        "subject": "LRS",
        "catalog_number": "200",
        "title": "Liberal Studies Seminar: Learning, Thinking, and Doing Physical Science",
        "description": "Prerequisite: ITEP-Freshman Option students only. Corequisite: LRS 200L. This course provides aspiring elementary school teachers with an understanding of how young children construct and comprehend key facets of science including explanations, theories, models, and experiments. In tandem with learning and doing science, students think about the philosophical and cognitive underpinnings of these facets of science. The course will also look at the nature of some of students’ alternative conceptions in science and strategies for assessing children’s existing beliefs. The laboratory component, LRS 200L, involves practicing physical science core ideas as both learners and teachers. As learners, they conduct physical science investigations themselves. As teachers, they teach lessons to elementary children based on the concepts learned and conduct interviews with the elementary children. This lab meets for 3 hours per week. 15 hours of offsite laboratory work is required.",
        "units": "3",
        "prerequisites": "{ITEP-Freshman Option students only}",
        "corequisites": "{LRS 200L}"
    },
    {
        "subject": "LRS",
        "catalog_number": "250",
        "title": "Integrating Reason, Belief and Education and Field Study",
        "description": "Prerequisite: ITEP Freshman option students only. Recommended Corequisite: LRS 250F. Introduction to the concepts essential to the identification, analysis and evaluation of arguments for students in the Integrated Teacher Education Program. Students examine the variety of sources of justification, evidence and warrant, such as argumentation, problem solving and perception. Emphasizes the application of these and learning in K-12 classrooms. Includes 15 hours of guided field experience in elementary classrooms.",
        "units": "3",
        "prerequisites": "{ITEP Freshman option students only}",
        "corequisites": "{LRS 250F}"
    },
    {
        "subject": "LRS",
        "catalog_number": "250F",
        "title": "Integrating Reason, Belief and Education and Field Study",
        "description": "Prerequisite: ITEP Freshman option students only. Recommended Corequisite: LRS 250F. Introduction to the concepts essential to the identification, analysis and evaluation of arguments for students in the Integrated Teacher Education Program. Students examine the variety of sources of justification, evidence and warrant, such as argumentation, problem solving and perception. Emphasizes the application of these and learning in K-12 classrooms. Includes 15 hours of guided field experience in elementary classrooms.",
        "units": "1",
        "prerequisites": "{ITEP Freshman option students only}",
        "corequisites": "{LRS 250F}"
    },
    {
        "subject": "LRS",
        "catalog_number": "300",
        "title": "Liberal Studies Gateway Experience",
        "description": "Prerequisites: Course is limited to Pre-Credential and ITEP Junior option students; Junior standing. Focusing on the elements required for success in integrating subject matter knowledge from multiple disciplines in preparation for a career in teaching, this course is an introduction to the academic and professional requirements for a Liberal Studies pre-credential major. Students will deepen their understanding of the eight required subject matter areas (Language Arts, Mathematics, Science, History/Social Studies, Child Development, Visual and Performing Arts, Health and Physical Education), in the context of their university-based curriculum and of the Academic Content Standards and State Curriculum Frameworks for grades K-8. Research and technology skills required for teachers are introduced and practiced. (Letter Grade only)",
        "units": "3",
        "prerequisites": "{{Course is limited to Pre-Credential and ITEP Junior option students} && {Junior standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "LRS",
        "catalog_number": "333",
        "title": "Perspectives on Literacy",
        "description": "Prerequisite: ENGL 301. Corequisites: LRS 433/F. This course examines topics related to the development of reading and writing—what people frequently refer to as literacy. These topics range from how the organization of the human brain integrates its design for language with the cognitive demands of representing language in print to understanding the roles of human interaction and culture in the development of early literacy.",
        "units": "3",
        "prerequisites": "{ENGL 301}",
        "corequisites": "{LRS 433/F}"
    },
    {
        "subject": "LRS",
        "catalog_number": "433",
        "title": "Practicum in Early Literacy",
        "description": "Prerequisite: ENGL 301. Corequisite: LRS 333. This is a practicum designed to extend information and concepts presented in LRS 333. The focus of this course is on the application of research in language, development and early literacy. The role of early intervention in the prevention of learning difficulties and concepts related to individual differences in reading and writing are examined. Students are required to connect theory with practice; reflect upon young children’s and their own reading and writing; and design, implement and evaluate evidence-based instruction. 15 hours of supervised fieldwork is required.",
        "units": "2",
        "prerequisites": "{ENGL 301}",
        "corequisites": "{LRS 333}"
    },
    {
        "subject": "LRS",
        "catalog_number": "491",
        "title": "Capstone Seminar",
        "description": "Preparatory: FLIT 391 or HUM 391. Intensive interdisciplinary study of an age, movement, problem, or theme, with emphasis on the application of cultural theory in interdisciplinary study. The topic of the seminar varies. Students will complete a senior project, such as a research paper or a creative performance that demonstrates the integrated knowledge, understanding and skills they have gained in the course of studies in the major. Available for graduate credit. (Cross-listed with FLIT and HUM 491.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]