[
    {
        "subject": "QS",
        "catalog_number": "101",
        "title": "Introduction to Queer Studies",
        "description": "Provides an introduction to the interdisciplinary field of Queer Studies, which aims to problematize rigid identity categories and destabilize essentialized norms of expression. The course will cover the history of how concepts such as gender and desire have been understood and articulated; heteronormativity and its relationship to capitalism, race, and gender roles; queer aesthetics; and queer strategies and tactics of resistance. (Available for General Education, C2 Humanities or F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "QS",
        "catalog_number": "113A",
        "title": "Approaches to University Writing A",
        "description": "Prerequisite: Placement in a supported GE subarea A2 Written Communication course. Corequisite: UNIV 061. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies, and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 113A, AFRS 113A, CAS 113A, CHS 113A, ENGL 113A, LING 113A or QS 113A. Students also are required to enroll in UNIV 061 (1 credit) or equivalent. Individual tutoring is available through the Learning Resource Center.",
        "units": "3",
        "prerequisites": "{Placement in a supported GE subarea A2 Written Communication course}",
        "corequisites": "{UNIV 061}"
    },
    {
        "subject": "QS",
        "catalog_number": "113B",
        "title": "Approaches to University Writing B",
        "description": "Prerequisite: Successful completion of 113A. Corequisite: UNIV 062. Expository prose writing, with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies, and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 113B, AFRS 113B, CAS 113B, CHS 113B, ENGL 113B, LING 113B or QS 113B. Students also are required to enroll in UNIV 062 (1 credit) or equivalent. Individual tutoring is available through the Learning Resource Center. (Available for General Education, Basic Skills A2 Written Communication.) (IC)",
        "units": "3",
        "prerequisites": "{QS 113A}",
        "corequisites": "{UNIV 062}"
    },
    {
        "subject": "QS",
        "catalog_number": "114A",
        "title": "Approaches to University Writing A",
        "description": "Prerequisite: Placement in a supported GE subarea A2 Written Communication course. Expository prose writing, with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies, and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 114A, AFRS 114A, CAS 114A, CHS 114A, ENGL 114A or QS 114A. Individual tutoring is available through the Learning Resource Center.",
        "units": "3",
        "prerequisites": "{Placement in a supported GE subarea A2 Written Communication course}",
        "corequisites": "{None}"
    },
    {
        "subject": "QS",
        "catalog_number": "114B",
        "title": "Approaches to University Writing B",
        "description": "Prerequisite: Successful completion of 114A. Expository prose writing, with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies, and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 114B, AFRS 114B, CAS 114B, CHS 114B, ENGL 114B or QS 114B. Individual tutoring is available through the Learning Resource Center. (Available for General Education, Basic Skills A2 Written Communication.) (IC)",
        "units": "3",
        "prerequisites": "{QS 114A}",
        "corequisites": "{None}"
    },
    {
        "subject": "QS",
        "catalog_number": "115",
        "title": "Approaches to University Writing",
        "description": "Prerequisite: Multiple Measures Placement in GE-level writing. Expository prose writing, with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies, and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 115, AFRS 115, CAS 115, CHS 115, ENGL 115 or QS 115. Individual tutoring is available through the Learning Resource Center. (Available for General Education, Basic Skills A2 Written Communication.) (IC)",
        "units": "3",
        "prerequisites": "{Multiple Measures Placement in GE-level writing}",
        "corequisites": "{None}"
    },
    {
        "subject": "QS",
        "catalog_number": "151",
        "title": "Fundamentals of QS Public Speaking",
        "description": "Prerequisites: Multiple Measures Placement in GE-level writing, or completion of 113A or 114A, or completion of the lower division writing requirement. This course is designed to provide both an introduction to the principles of public speaking and a forum for practicing public speaking skills with particular attention to issues and contexts of significance to LGBTQIA communities. Students will analyze speeches on queer issues and learn about public speaking in the context of advancing queer and trans rights. Through a variety of strategies students will learn the processes by which effective speeches are conceived, prepared, and delivered. Includes intensive practice in public speaking, reasoning and critical listening. Public speaking from the perspective of Queer Studies will introduce students to techniques in speaking articulately and critically on queer issues. (Cross-listed with AAS 151, AFRS 151, CAS 151, CHS 151 and COMS 151.) (Available for General Education, Basic Skills A1 Oral Communication.)",
        "units": "3",
        "prerequisites": "{{Multiple Measures Placement in GE-level writing} || {{QS 113A} || {QS 114A}} || {completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "QS",
        "catalog_number": "201",
        "title": "Race and Ethnicity in Queer Studies",
        "description": "Preparatory: Completion of the lower division writing requirement is recommended. Introduction to the process of critical thinking through the lens of race, ethnicity and sexuality. QS 201 offers an exploration of race and ethnicity and its relationship to queer studies, emphasizing critical reading of theory, praxis, and artistic texts. This course also examines the specific development of queer of color critique, its indebtedness to women of color feminism, and its emergence as a response to the whiteness of mainstream queer theory. Students will engage the work of artists, scholars, and activists to interrogate the dominant discourses in the intersections of race, gender, sexuality, class, nation, and diaspora within the context of empire and neoliberalism and in relation to citizenship, welfare, and terrorism. (Available for General Education, Basic Skills A3 Critical Thinking.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "QS",
        "catalog_number": "204",
        "title": "Queer Identity: Pop Music and Its Audience",
        "description": "This course analyzes queer identity and its relation to pop music, focusing primarily on explicit representations of LGBTQ themes, experiences, characters, and communities in pop music. Course themes include positive images, creation of alternative space, AIDS, coming out, celebrity, and the gay audience. Through close readings of queer theory and criticism, we will analyze the phenomenon of queer music by exploring the contested relationships between spectator and text, identity and commodity, realism and fantasy, activism and entertainment, desire and politics.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "QS",
        "catalog_number": "208",
        "title": "Issues in Queer Health",
        "description": "Issues in Queer Health explores and analyzes various health and illness topics affecting individuals and communities in non-normative and non-heterosexist positions in society. We explore experiences in health and illness through an interdisciplinary approach to navigate critical constructs of identity, gender, and sexuality. Through this course, we examine the intersection of non-normative communities with health status, health disparities, the healthcare system, and medicine, with a focus on the U.S., but also including a diversity of geographic contexts. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "QS",
        "catalog_number": "301",
        "title": "Perspectives in Queer Studies",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course introduces students to the current theories and histories in queer studies, including such closely related fields as transgender studies. The course also introduces students to the scope of queer studies, to scholarly, community-based and activist resources, and to the varied interdisciplinary, methodological and theoretical paradigms in the field. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "QS",
        "catalog_number": "302",
        "title": "L.A. in Transit: Communities, Organizations and Politics",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course provides students with a broad understanding of lesbian, gay, bisexual, transgender, intersexed and queer communities, organizations and politics in Los Angeles, with attention to how these are shaped by nationality, race, ethnicity, gender, class and other identifications. (Available for General Education, E Lifelong Learning.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "QS",
        "catalog_number": "303",
        "title": "Transgender Studies",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examines the interdisciplinary field of trans studies, tracing ongoing contestation over transgender identities in historical, medical, political, legal, social and cultural contexts. (Available for General Education, C2 Humanities or F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "QS",
        "catalog_number": "304",
        "title": "Queering the Screen, Queering the Spectator",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course analyzes queer film and media since the 1970s, focusing primarily on explicit representations of LGBTQ characters and communities in cinema, television, and cyberculture. Themes include positive images, AIDS, coming out, celebrity, and the gay market. Through close readings of queer theory and criticism, we will analyze the contested relationships between spectator and text, identity and commodity, realism and fantasy, activism and entertainment, desire and politics. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "QS",
        "catalog_number": "369",
        "title": "The Nature of Queer",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course introduces students to the biology of sex, gender, and sexual orientation. Students will gain an understanding of the biological determinants of sex, including the role of specific genes on human development and how hormones influence gross anatomy as well as brain development. Students will learn how to critically assess scientific literature and how the scientific method can be used to address issues of sex and gender. The biological evolution of sex from asexual to sexual reproduction will be discussed and students will be exposed to current hypotheses of the biological basis of sexual orientation. (Available for General Education, B5 Scientific Inquiry and Quantitative Reasoning.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "QS",
        "catalog_number": "401L",
        "title": "Advanced Topics In Queer Studies: Queer Leadership",
        "description": "Intensive study of selected topics in queer studies such as queer theory transgender theory queer issues in education queer popular culture the queer diaspora and the globalization and medicalization of sex and gender. Topics change from semester to semester. May be repeated for credit with instructors consent.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "QS",
        "catalog_number": "490",
        "title": "Queer Studies Senior Capstone",
        "description": "Students develop and complete theoretically informed individualized research projects in queer studies in a structured setting. The project will include peer and instructor feedback and guidance on selecting an appropriate topic; conducting research, drafting and revising the project; and presenting the completed project. Course may be offered online or in a classroom setting.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "QS",
        "catalog_number": "499",
        "title": "Queer Studies Independent Study",
        "description": "Queer Studies independent study is for advanced students who are interested in working on an independent project with a faculty sponsor. The student needs to complete an Independent Study Form with the approval signature from the faculty sponsor and the Queer Studies Coordinator.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]