[
    {
        "subject": "SED",
        "catalog_number": "511",
        "title": "Fundamentals of Secondary Education in Multiethnic Secondary Schools",
        "description": "Must be taken in the first semester of enrollment in all Single Subject Programs. Provides a general framework and introduction to secondary education and curriculum for diverse learners, including students with disabilities and English learners. Candidates are also introduced to the California curriculum standards and the Teaching Performance Expectations (TPEs). Primary emphasis is placed on engaging and supporting all students in learning (SLO 1), creating and maintaining effective and equitable classroom environments (SLO 2), and planning instruction and designing effective learning experiences for all students in secondary (Grades 6-12) classrooms (SLO 4). Completion of classroom-based activities (e.g., observations) is required.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "514",
        "title": "Computers in Instruction",
        "description": "Introduction to website development and the instructional uses of the Internet, word processing, graphics, desktop publishing, educational software, collaborative cloud-based technologies, teacher support tools, mobile technologies, assistive technologies, learning management systems, video production, e-assessment, spreadsheets, and other technology tools. Use of such applications to access and evaluate information, analyze and solve problems, and communicate and collaborate with other professionals. Strategies and skills to enable teachers to prepare their students to be lifelong learners in an information-based society. Meets the technology-education requirement for the Preliminary Credential.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "521",
        "title": "Content Area Literacy and Learning in Multiethnic Secondary Schools",
        "description": "Prerequisite: Restricted to candidates officially admitted to the Credential Program or already possessing a Teaching Credential. Prerequisite or Corequisite for Traditional, Intern, ACT, FYI and JYI: SED 511. Prerequisite or Corequisite for Dual Single Subject/Education Specialist: EPC 420. Recommended as Preparatory for Traditional Candidates: SED 525xx. Required for candidates in all Single Subject Preliminary Credential Programs. Focuses on strategies for teaching reading, writing, listening speaking, and academic language to promote learning in diverse middle school and high school content area classes for all students. Examines a multicultural context for literacy learning, reading instruction, evaluation of literacy materials, literacy assessments, differentiated instruction, the application of research-based literacy instruction, and the development of literacy lessons related to California curriculum standards and frameworks and the California English Language Development standards. Completion of a field-based activity is required.",
        "units": "4",
        "prerequisites": "{Restricted to candidates officially admitted to the Credential Program or already possessing a Teaching Credential}",
        "corequisites": "{SED 511}"
    },
    {
        "subject": "SED",
        "catalog_number": "525A",
        "title": "Methods of Teaching Art",
        "description": "Prerequisite: Restricted to candidates officially admitted to the credential program or already possessing a teaching credential. This teaching-methods course addresses strategies for teaching art in grades K-12, including the use of instructional technologies and developing disciplinary literacy. Course emphasizes pedagogies that are inclusive and equitable for diverse student populations. California curriculum standards, assessment and the California Visual Arts Framework will be addressed. Candidates will be supported in creating unit lesson plans that will enable the candidate to teach a full-year art course.",
        "units": "3",
        "prerequisites": "{Restricted to candidates officially admitted to the credential program or already possessing a teaching credential}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "525BL",
        "title": "Bilingual and Bicultural Teaching in Multiethnic Secondary Schools Lab",
        "description": "Required course for all Bilingual Authorization Program candidates. Prerequisites: SED 521 (pre Fall 2011) or SED 523 (Fall 2011 and later). Preparatory: SED 525xx. This course will examine the history, policies, programs and research on the effectiveness of bilingual education and bilingualism in the U.S., as well as the philosophical, theoretical, legal and legislative foundations of bilingual education and their effects on program design and the educational achievement of bilingual children and adolescents. Also addressed are the transferability between the primary and English language; authentic parental participation; the interrelatedness among the four domains of language (listening, speaking, reading and writing); and the application of different bilingual education models, instructional strategies, materials and skills to instructional settings. The course also will examine planning, developing, implementing and assessing standards-aligned content instruction in the primary and the English language with a variety of instructional and assessment strategies, as well as the use of a variety of criteria to select instructional materials to assess their appropriateness and suitability for the local context and to augment resources when necessary. (Cross-listed with EED 525.)",
        "units": "3",
        "prerequisites": "{{SED 521 (pre Fall 2011)} || {SED 523 (Fall 2011 and later)}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "525EN",
        "title": "Methods of Teaching English",
        "description": "Prerequisite: Required of all students enrolled in the English Credential Program. Restricted to candidates officially admitted to the credential program or already possessing a teaching credential. Methods course addressing strategies for planning instruction leading to effective teaching and assessment of student performance in literature, reading, composition, and language, including the use of instructional technologies. Course emphasizes pedagogies that are inclusive and equitable for diverse student populations. The integrated approach for literature, reading, composition, and language instruction and assessment is based on the California curriculum standards and the English/Language Arts-English Language Development Framework.",
        "units": "3",
        "prerequisites": "{Required of all students enrolled in the English Credential Program}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "525HE",
        "title": "Methods of Teaching Home Economics",
        "description": "This is a performance-based course designed to prepare professionals to successfully teach the content of Family and Consumer Sciences to a diverse population. Emphasis is placed on applying learning theory, planning curriculum, creating appropriate learning environments, presenting effective lessons that actively engage students in the learning process and assessing learning outcomes. Students are involved in peer coaching, collaborative learning and teaching demonstrations. Course emphasizes pedagogies that are inclusive and equitable for diverse student populations. The course is appropriate for students who plan to become credentialed teachers, dietitians, consumer affairs professionals and other experts in Family and Consumer Sciences, and it is the required subject-specific methods course for the Single Subject Credential in Home Economics.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "525MA",
        "title": "Methods of Teaching Mathematics in the Secondary School",
        "description": "Prerequisite: Restricted to candidates officially admitted to the credential program or already possessing a teaching credential. Corequisites: SED 525MA and 525MAL. Required of all students enrolled in the Secondary Mathematics Credential Program. This teaching-methods course addresses strategies for planning instruction, using instructional technologies, developing disciplinary literacy, assessing student performance, and implementing effective learning experiences for all students in secondary (grades 6-12) mathematics. Course emphasizes pedagogies that are inclusive and equitable for diverse student populations. Activities in the course focus on instruction of the California curriculum standards, guided by the Mathematics Framework for California Public Schools. 4 hours per week.",
        "units": "2",
        "prerequisites": "{Restricted to candidates officially admitted to the credential program or already possessing a teaching credential}",
        "corequisites": "{{SED 525MA} && {SED 525MAL}}"
    },
    {
        "subject": "SED",
        "catalog_number": "525MAL",
        "title": "Methods of Teaching Mathematics in the Secondary School Lab",
        "description": "Prerequisite: Restricted to candidates officially admitted to the credential program or already possessing a teaching credential. Corequisites: SED 525MA and 525MAL. Required of all students enrolled in the Secondary Mathematics Credential Program. This teaching-methods course addresses strategies for planning instruction, using instructional technologies, developing disciplinary literacy, assessing student performance, and implementing effective learning experiences for all students in secondary (grades 6-12) mathematics. Course emphasizes pedagogies that are inclusive and equitable for diverse student populations. Activities in the course focus on instruction of the California curriculum standards, guided by the Mathematics Framework for California Public Schools. 4 hours per week.",
        "units": "1",
        "prerequisites": "{Restricted to candidates officially admitted to the credential program or already possessing a teaching credential}",
        "corequisites": "{{SED 525MA} && {SED 525MAL}}"
    },
    {
        "subject": "SED",
        "catalog_number": "525MU",
        "title": "Methods of Teaching General Music",
        "description": "Prerequisite: Restricted to candidates officially admitted to the credential program or already possessing a teaching credential. This methods course addresses strategies for planning instruction, using instructional technologies, building disciplinary literacy, assessing student performance, and implementing effective learning experiences for all music students in grades K-12. Course emphasizes pedagogies that are inclusive and equitable for diverse student populations. Course activities focus on instruction of the California curriculum standards for music, guided by the Visual and Performing Arts Framework for California Public Schools.",
        "units": "3",
        "prerequisites": "{Restricted to candidates officially admitted to the credential program or already possessing a teaching credential}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "525PE",
        "title": "Methods of Teaching Physical Education",
        "description": "Prerequisite: Restricted to candidates officially admitted to the credential program or already possessing a teaching credential. This teaching-methods course addresses movement literacy from a holistic perspective. Class activities focus on strategies for planning instruction, implementing active learning experiences, using instructional technology, developing disciplinary literacy, and assessing student learning at the elementary, middle, and high school levels. Course emphasizes pedagogies that are inclusive and equitable for diverse student populations. Course content is aligned with national- and state-level curriculum standards.",
        "units": "3",
        "prerequisites": "{Restricted to candidates officially admitted to the credential program or already possessing a teaching credential}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "525S",
        "title": "Methods of Teaching Science in the Secondary School",
        "description": "Prerequisite: Restricted to candidates officially admitted to the credential program or already possessing a teaching credential. Corequisites: SED 525S and 525SL. Prospective secondary school science teachers learn to engage students in the practices and habits of mind described in the California curriculum standards, such as asking questions and defining problems, developing and using models, planning and carrying out investigations, analyzing and interpreting data, using mathematics and computational thinking, constructing explanations and designing solutions, engaging in argument from evidence, and obtaining, evaluating and communicating information. The lecture and laboratory components of this course focus on instructional methods and curriculum in teaching physics, chemistry, biology, earth and space science, engineering, and health in secondary schools. Students learn how to develop, adapt, evaluate, and use strategies and materials for teaching science, appropriate both to the special needs of the learners and the special characteristics of the various science disciplines, including strategies to develop disciplinary literacy. In addition, this course fosters the development of Technological Pedagogical Content Knowledge (TPCK) so that graduates are prepared to use relevant technologies to engage and enhance student learning. Course emphasizes pedagogies that are inclusive and equitable for diverse student populations. SED 525S/L serves as the subject-specific methods course for Single Subject Credentials in Physics, Science: Chemistry, Science: Biology, Science: Geoscience, Foundation Level Science, and Health Science. 4 hours per week.",
        "units": "2",
        "prerequisites": "{Restricted to candidates officially admitted to the credential program or already possessing a teaching credential}",
        "corequisites": "SED 525S and 525SL"
    },
    {
        "subject": "SED",
        "catalog_number": "525SL",
        "title": "Methods of Teaching Science in the Secondary School Lab",
        "description": "Prerequisite: Restricted to candidates officially admitted to the credential program or already possessing a teaching credential. Corequisites: SED 525S and 525SL. Prospective secondary school science teachers learn to engage students in the practices and habits of mind described in the California curriculum standards, such as asking questions and defining problems, developing and using models, planning and carrying out investigations, analyzing and interpreting data, using mathematics and computational thinking, constructing explanations and designing solutions, engaging in argument from evidence, and obtaining, evaluating and communicating information. The lecture and laboratory components of this course focus on instructional methods and curriculum in teaching physics, chemistry, biology, earth and space science, engineering, and health in secondary schools. Students learn how to develop, adapt, evaluate, and use strategies and materials for teaching science, appropriate both to the special needs of the learners and the special characteristics of the various science disciplines, including strategies to develop disciplinary literacy. In addition, this course fosters the development of Technological Pedagogical Content Knowledge (TPCK) so that graduates are prepared to use relevant technologies to engage and enhance student learning. Course emphasizes pedagogies that are inclusive and equitable for diverse student populations. SED 525S/L serves as the subject-specific methods course for Single Subject Credentials in Physics, Science: Chemistry, Science: Biology, Science: Geoscience, Foundation Level Science, and Health Science. 4 hours per week.",
        "units": "1",
        "prerequisites": "{Restricted to candidates officially admitted to the credential program or already possessing a teaching credential}",
        "corequisites": "{{SED 525S} && {SED 525SL}}"
    },
    {
        "subject": "SED",
        "catalog_number": "525SS",
        "title": "Methods of Teaching Social Studies",
        "description": "Prerequisite: Restricted to candidates officially admitted to the credential program or already possessing a teaching credential. This course covers essential elements of history/social science (HSS) curriculum and teaching in secondary schools: developing unit and lesson plans aligned with the California curriculum standards and History-Social Science Framework; recognizing theories, issues and best practices of teaching HSS; teaching historical-thinking skills; integrating basic and higher-order thinking skills for students of varying abilities and cultural backgrounds; using instructional technologies; developing disciplinary literacy; and assessing student learning. Course emphasizes pedagogies that are inclusive and equitable for diverse student populations.",
        "units": "3",
        "prerequisites": "{Restricted to candidates officially admitted to the credential program or already possessing a teaching credential}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "525WL",
        "title": "Methods of Teaching World Language Lab",
        "description": "Prerequisite: Restricted to candidates officially admitted to the credential program or already possessing a teaching credential. This course in methods of teaching World Languages examines past and current theories, research and practices related to teaching World Languages in grades 6-12. The course will provide teachers with teaching strategies aligned with the national and California curriculum standards. Students will develop skills in effective planning, instruction, and assessment, and in the use of instructional technologies, to promote receptive (reading and listening) and productive (speaking and writing) communicative proficiency in the target language within a cultural context. Course emphasizes pedagogies that are inclusive and equitable for diverse student populations.",
        "units": "3",
        "prerequisites": "{Restricted to candidates officially admitted to the credential program or already possessing a teaching credential}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "529",
        "title": "Teaching English Learners in Multiethnic Secondary Schools",
        "description": "Required for candidates in all Single Subject Teacher Basic Credential Programs. Restricted to candidates officially admitted to the Credential Program or already possessing a teaching credential. Prerequisite: SED 511. Corequisite: SED 521. Addresses state and federal legal requirements related to English learners, the California English Language Development (ELD) Standards, school programs serving English learners, language acquisition, and teaching materials and strategies for English Language Development (ELD), and Specially Designed Academic Instruction in English (SDAIE) to support content-area learning. Also focuses on diagnostic and other assessments for English learners. Completion of field-based activities is required.",
        "units": "3",
        "prerequisites": "{SED 511}",
        "corequisites": "{SED 521}"
    },
    {
        "subject": "SED",
        "catalog_number": "554",
        "title": "Supervised Field Experience and Field Experience Seminar for the Single Subject Credential",
        "description": "Prerequisites: Admission to the Single Subject Credential Program; Clearance by the Credential Office. Corequisite: SED 554 and 554S must be taken concurrently.\nPre/Corequisites for Traditional, FYI, JYI, ACT, and SSUIP Programs: EPC 420, SED 511, and one of the following: SED 525, SED 525A, SED 525EN, SED 525HE, SED 525HS, SED 525MA/L, SED 525MU, SED 525PE, SED 525S/L, SED 525SS or SED 525WL.\nAdditional Corequisites for ACT Program only: ELPS 541A, SPED 541B. Pre/co requisites for Dual Preliminary Single Subject/Education Specialist Program: EPC 420, SPED 403MME, SED 521, SPED 511, SPED 420, and one of the following: SED 525A, SED 525EN, SED 525MA/L, SED 525MU, SED 525S/L, SED 525SS, SED 525WL.\nDesigned as the introductory field experience for candidates pursuing the Single Subject Teaching Credential in the Traditional, Accelerated Collaborative Teacher (ACT), Four-Year Integrated (FYI-English or FYI-Math) or Junior-Year Entry Integrated (JYI-English or JYI-Math) Programs. The candidate is assigned to a middle school or high school site for one class period (or the time equivalent) plus conference time daily for a school’s semester or track to complete specific activities (e.g., structured observations, tutoring small groups, assuming responsibility for planning, teaching and pupil assessment) under the direction and guidance of a qualified on-site cooperating teacher. A designated member of the university faculty supervises the candidate’s assignment. During the supervised field experience sequence of SED 554 and SED 555, each teacher candidate participates in two or more subject-specific teaching assignments at the middle-school and high-school levels, and has experiences teaching English language learners and in diverse settings.\nThe SED 554/S field experience also supports interns (employed secondary-level teachers who have not yet earned the Preliminary Single Subject Credential) in the Single Subject University Intern Program (SSUIP), a program that leads to the Preliminary Single Subject Credential. SED 554/S is normally taken in the second-to-last semester of the SSUIP. The intern is supervised on-site by the university supervisor and supported by a school-based support provider.\nAll students in SED 554/S also meet weekly in a required seminar led by a university faculty member that addresses student teaching issues and the preliminary Teacher Performance Assessment. (Credit/No Credit only).",
        "units": "4",
        "prerequisites": "{{Admission to the Single Subject Credential Program} && {Clearance by the Credential Office}}",
        "corequisites": "{{SED 554} && {SED 554S}}"
    },
    {
        "subject": "SED",
        "catalog_number": "555",
        "title": "Supervised Practicum for the Single Subject Credential",
        "description": "Required for candidates in the Four-Year Integrated (FYI-English, FYI-Math), Junior-Year Integrated (JYI-English, JYI Math), Accelerated Collaborative Teacher (ACT), the Single Subject University Intern Program (SSUIP), and Traditional Single Subject Credential Programs. Prerequisites: SED 511; EPC 420; SED 554/S; and one of the following: SED 525A, SED 525EN, SED 525HE, SED 525HS, SED 525MA/L, SED 525MU, SED 525PE, SED 525S/L, SED 525SS, or SED 525WL; Clearance from the Credential Office. Corequisite: SED 555S.\nAdditional Pre/Corequisites for Traditional, SSUIP, FYI, and JYI Programs: AAS 417/AFRS 417/ARMN 417/CHS 417/ELPS 417; SED 521; SED 529; SPED 420.\nAdditional Pre/Corequisites for ACT Program only: ELPS 542A; HSCI 466ADO; SED 521; SED 529; SPED 542B.\nPrerequisites for Dual Preliminary Single Subject/Education Specialist Program: EPC 420; SPED 403MME; SPED 407; SPED 511; SED 521; one of the following: SED 525A, SED 525EN, SED 525MA/L, SED 525MU, SED 525S/L, SED 525SS, or SED 525WL; SED 554/S, SPED 420; SPED 503MME.\nPre- or corequisites for Dual Preliminary Single Subject/Education Specialist Program: AAS 417/AFRS 417/ARMN 417/ CHS 417/ ELPS 417; SPED 402; SPED 416; SPED 502MME; SPED 545; HSCI 466ADO.\nCorequisites for Dual Preliminary Single Subject/Education Specialist Program: SED 555S and SPED 580MME.\nThe Supervised Practicum is designed to provide teacher candidates with a capstone fieldwork experience in middle school or high school classrooms. Each candidate is supervised by an on-site Cooperating Teacher and a University Supervisor. The candidate is responsible for teaching 2 classes daily (or the time equivalent) and is at the school for a 3rd class period daily (or the time equivalent) for observation and conferencing for a school’s entire semester or track. During the supervised field experience sequence of SED 554 and 555, each teacher candidate has experiences teaching English language learners and participates in 2 or more subject-specific teaching assignments in diverse settings. The SED 555 field experience also supports Interns (employed secondary-level teachers who have not yet earned the Preliminary Single Subject Credential) in the Single Subject University Intern Program (SSUIP), a program that leads to the Preliminary Single Subject Credential. It is normally taken in the final semester of the SSUIP. The Intern is supervised on-site by the University Supervisor and supported by a school-based Support Provider. See the Credential Office for additional details. (Credit/No Credit only)",
        "units": "6",
        "prerequisites": "{{SED 511} && {EPC 420} && {SED 554/S} && {one of the following: SED 525A, SED 525EN, SED 525HE, SED 525HS, SED 525MA/L, SED 525MU, SED 525PE, SED 525S/L, SED 525SS, or SED 525WL} && {Clearance from the Credential Office}}",
        "corequisites": "{SED 555S}"
    },
    {
        "subject": "SED",
        "catalog_number": "593",
        "title": "Field Experience for Single Subject Interns",
        "description": "Prerequisites: Bachelor’s degree; Admission to the Single Subject University Intern Program (SSUIP); Full-time teaching position in a public school. Corequisite: SED 593S must be taken with the first enrollment in SED 593. The SED 593 field experience is designed for interns (employed secondary-level teachers who have not yet earned the Preliminary Single Subject Credential) in the SSUIP, a program that leads to the Preliminary Single Subject Credential. The intern is supervised on-site by a University supervisor and supported by a school-based support provider. Interns are required and only permitted to take SED 593 in any semester in which they are not enrolled in SED 554 or SED 555 (which are normally taken in the last two semesters). During the first enrollment in SED 593, the intern must also enroll in the introductory seminar: SED 593S. (Credit/No Credit only)",
        "units": "2",
        "prerequisites": "{{Bachelor’s degree} && {Admission to the Single Subject University Intern Program (SSUIP)} && {Full-time teaching position in a public school}}",
        "corequisites": "{SED 593S must be taken with the first enrollment in SED 593}"
    },
    {
        "subject": "SED",
        "catalog_number": "599A",
        "title": "Independent Study",
        "description": "Independent Study",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "600",
        "title": "Research in Secondary Education",
        "description": "Prerequisite: Admission to Secondary Education M.A. degree program. This course introduces key research in secondary education and provides opportunities to analyze educational research critically. Also addressed are types of research; the teacher as researcher; planning a research study; and collecting, analyzing and presenting data. A required department core course for M.A. degree candidates with a Specialization in Secondary Education.",
        "units": "3",
        "prerequisites": "{Admission to Secondary Education M.A. degree program}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "610CI",
        "title": "Educational Issues and Implications for Public Schools",
        "description": "Prerequisite: Enrollment is restricted to students in the Master of Arts in Secondary Curriculum and Instruction program or with department permission. This is a required course for the Master of Arts degree in Secondary Curriculum and Instruction. Through research, reading, collegial discussion, reflection, and writing, masters students in secondary-level curriculum and instruction will develop an understanding of some of today’s most pressing educational issues and their implications for public schools and secondary classrooms. A deep understanding of these issues will better position students for leadership as well as for personal decisions about career and professional development.",
        "units": "3",
        "prerequisites": "{Enrollment is restricted to students in the Master of Arts in Secondary Curriculum and Instruction program or with department permission}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "610EN",
        "title": "Educational Issues and Implications for Multiethnic English and Literacy Classrooms",
        "description": "Prerequisite: Enrollment is restricted to students in the Master of Arts in Secondary English Education program or with department permission. This is a required department core course for M.A. degree candidates in Secondary Education. Students engage in critical inquiry into current and pressing educational issues. Through research and reading, collegial discussion and debate, reflection and writing, students develop a thorough and nuanced understanding of these issues and their implications for multiethnic districts and schools as well as for English and literacy classrooms and instruction. Students examine research on teacher-leadership and consider ways to apply this learning to their districts, schools and the broader professional community.",
        "units": "3",
        "prerequisites": "{Enrollment is restricted to students in the Master of Arts in Secondary English Education program or with department permission}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "610MA",
        "title": "Educational Issues and Implications for Multiethnic Mathematics Classrooms",
        "description": "Prerequisite: Enrollment is restricted to students in the Master of Arts in Secondary Mathematics Education program or with department permission. This is a required course for the Master of Arts in Secondary Mathematics Education. Through research, reading, collegial discussion, reflection and writing, masters students in secondary mathematics education will develop an understanding of some of today’s most pressing educational issues and their implications for multiethnic schools and mathematics classrooms. A deep understanding of these issues will better position students for leadership as well as for personal decisions about career and professional development.",
        "units": "3",
        "prerequisites": "{Enrollment is restricted to students in the Master of Arts in Secondary Mathematics Education program or with department permission}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "610SC",
        "title": "Leadership in Science Education",
        "description": "Prerequisite: Enrollment is restricted to students in the Master of Arts in Science Education degree program or with department permission. This is a required course for the Master of Arts degree in Science Education. An examination of current issues and changes in science education in secondary classrooms and informal environments. SED 610SC prepares students to take the lead in science instruction and teacher professional development in classrooms and informal environments.",
        "units": "3",
        "prerequisites": "{Enrollment is restricted to students in the Master of Arts in Science Education degree program or with department permission}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "616",
        "title": "Computer Supported Collaborative Science",
        "description": "Prerequisite: Enrollment is restricted to students in the Master of Arts in Science Education degree program or with department permission. This is a required course for the Master of Arts degree in Science Education. SED 616 is designed to provide science educators opportunities to develop interactive websites and dynamic online activities to engage their students in scientific practices and habits of mind, such as asking questions and defining problems, developing and using models, planning and carrying out investigations, analyzing and interpreting data, using mathematics and computational thinking, constructing explanations and designing solutions, engaging in argument from evidence, and obtaining, evaluating and communicating information. This course fosters the development of Technological Pedagogical Content Knowledge (TPCK) so that science educators are prepared to use the web-based resources they develop to engage students and enhance science learning.",
        "units": "3",
        "prerequisites": "{Enrollment is restricted to students in the Master of Arts in Science Education degree program or with department permission}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "617",
        "title": "Technology in the Secondary Reading/Language Arts Curriculum",
        "description": "Prerequisite: SED 514 or instructor consent. Design, development and use of digital tools for teaching reading, writing, literature and language. A variety of current applications and tools are explored in terms of teaching the language arts. Review and analysis of research and best practice as well as equity and access issues in the teaching of digital literacy in the language arts classroom.",
        "units": "3",
        "prerequisites": "{{SED 514} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "625E",
        "title": "Theory and Research in the Teaching of Secondary School English",
        "description": "Prerequisite: SED 525EN or instructor consent. Study of recent developments and current issues in the teaching of English at the middle-school and senior high-school levels. Consideration is given to research studies and current best practice addressing literature, composition and language curriculum and instructional methods.",
        "units": "3",
        "prerequisites": "{{SED 525EN} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "625MA",
        "title": "Theory and Research in Teaching Secondary School Mathematics",
        "description": "Prerequisite: SED 525MA or instructor consent. Study of the present status, recent developments and current trends in secondary-school mathematics curricula. The identification of concepts resulting from recent research and their organization for inclusion in the secondary-school mathematics program are considered. Consideration also is given to research studies dealing with the rationale and structure of important new approaches to mathematics teaching.",
        "units": "3",
        "prerequisites": "{{SED 525MA} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "625SC",
        "title": "Theory and Research in Teaching Secondary School Science",
        "description": "Prerequisites: SED 525SC; Major or minor in science. Study of the present status, recent developments and current trends in secondary curricula. Emphasis is given to the identification of concepts resulting from recent research and their organization for inclusion in the secondary-school science program. Consideration is given to research studies dealing with the rationale and structure of important new approaches to science teaching.",
        "units": "3",
        "prerequisites": "{{SED 525SC} && {Major or minor in science}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "641",
        "title": "Curriculum in Theory and Practice",
        "description": "Prerequisite: Enrollment is restricted to students in Master of Arts programs in the Department of Secondary Education or by department consent. This course is a requirement for the Master of Arts in Secondary Curriculum and Instruction and an approved elective for all other M.A. programs and options in the Department of Secondary Education. This course explores theories, methods, and principles underlying the development and design of curriculum and instruction; best practices for developing curriculum and instruction that meet the needs of an inclusive school; and the interrelationships among curriculum, instruction, and assessment. A brief history of curriculum development and evaluation, the importance of aligning learning theory and learner variables, removal of barriers to student achievement, and how to meet diverse student needs are also addressed.",
        "units": "3",
        "prerequisites": "{Enrollment is restricted to students in Master of Arts programs in the Department of Secondary Education or by department consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "647",
        "title": "Project-Based Learning in Secondary Schools",
        "description": "Prerequisite: Enrollment is restricted to students in Master of Arts programs in the Department of Secondary Education or by department consent. This course is an approved elective for all M.A. programs in the Department of Secondary Education. SED 647 explores characteristics and benefits of project-based learning (PBL) using specific classroom scenarios. Throughout the course, teachers examine the theories and research behind PBL, while considering their own teaching practice and ways that technology supports PBL. Teachers are guided through organizing the curriculum, the classroom, technology, and students for successful technology-supported projects. The course offers opportunities to apply the PBL concepts with action planning exercises.",
        "units": "3",
        "prerequisites": "{Enrollment is restricted to students in Master of Arts programs in the Department of Secondary Education or by department consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "651",
        "title": "Assessment in Theory and Practice",
        "description": "Prerequisite: Enrollment is restricted to students in Master of Arts programs in the Department of Secondary Education or by department consent. This course is a requirement for the Master of Arts in Secondary Curriculum and Instruction and an approved elective for all other M.A. programs and options in the Department of Secondary Education. This course immerses educators in theories, issues, and practices related to K-12 assessment. State, national, and international assessments are discussed, but the focus is classroom-level assessment. Educators in this course investigate and debate assessment-related issues and apply assessment scholarship to their own teaching practice.",
        "units": "3",
        "prerequisites": "{Enrollment is restricted to students in Master of Arts programs in the Department of Secondary Education or by department consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "652",
        "title": "Computer Supported Collaborative Learning",
        "description": "Prerequisite: Enrollment is restricted to students in the Master of Arts in Educational Technology program or with department permission. This is a required course for the Master of Arts degree in Educational Technology. Students in this course will explore the theory and techniques for computer-supported collaborative learning (CSCL). CSCL is a pedagogical approach in which learning is characterized by the sharing and construction of knowledge among participants using technology as their primary means of communication or as a common resource. This course focuses on the design, development and use of computer-based curricular resources for the teaching of secondary school subjects in a collaborative online environment.",
        "units": "3",
        "prerequisites": "{Enrollment is restricted to students in the Master of Arts in Educational Technology program or with department permission}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "654",
        "title": "Leadership in Mathematics Education",
        "description": "Prerequisite: Enrollment is restricted to students in the Master of Arts in Secondary Mathematics Education program or with department permission. This is a required course for the Master of Arts in Secondary Mathematics Education. In this culminating course for the Master’s in Secondary Mathematics Education program, students take stock of what they have learned during the program and consider how to spread that learning to their classrooms, schools and wider settings. Seminar discussions and readings address various aspects of teacher leadership, with the aim of building students’ personal leadership skill and style. Students examine the dynamics of school change and explore how teachers can spearhead and facilitate educational improvement. Students begin or intensify their own leadership efforts with a project to improve education at a local or broader level and hone their ability to facilitate productive work sessions among colleagues.",
        "units": "3",
        "prerequisites": "{Enrollment is restricted to students in the Master of Arts in Secondary Mathematics Education program or with department permission}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "657",
        "title": "Career and College Readiness in Secondary Education",
        "description": "Prerequisite: Enrollment is restricted to students in Master of Arts programs in the Department of Secondary Education or by department consent. This course is an approved elective for all M.A. programs in the Department of Secondary Education. SED 657 explores national, state and local school district policies and practices in the areas of developing college and career readiness (CCR) in secondary school students, and the place of CCR in teacher education. The course explores the history of secondary school education in its capacity of educating and training individuals for both the workforce and for higher education.",
        "units": "3",
        "prerequisites": "{Enrollment is restricted to students in Master of Arts programs in the Department of Secondary Education or by department consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "671",
        "title": "Designing Computer-Based Instructional Materials",
        "description": "Prerequisite: SED 514 or instructor consent. Development of instructional materials using high-level authoring systems as a programming environment. Investigations on research findings in human perception, communication, learning theory and software development.",
        "units": "3",
        "prerequisites": "{{SED 514} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "690CI",
        "title": "The Multiple Roles of Secondary Educators",
        "description": "Prerequisite: Enrollment is restricted to students in the Master of Arts in Secondary Curriculum and Instruction program or with department permission. This is a required course for M.A. degree candidates in Secondary Curriculum and Instruction. This course fosters critical inquiry into historical and current educational issues that affect and shape the roles of the secondary school educator. Through reading, discussion and debate, reflection, and writing, students develop a thorough and nuanced understanding of these issues and their implications for their own communities, schools, and classrooms. Candidates examine research on social reproduction, special education constructs, school culture, action research, outreach, classroom power, and discourse, and consider ways to apply this learning to their own communities, schools, and classrooms.",
        "units": "3",
        "prerequisites": "{Enrollment is restricted to students in the Master of Arts in Secondary Curriculum and Instruction program or with department permission}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "690ET",
        "title": "Theory and Research in Educational Technology",
        "description": "Prerequisite: Enrollment is restricted to students in the Master of Arts in Educational Technology program or with department permission. This is a required course for the Master of Arts degree in Educational Technology. Students will explore theories of learning with educational technology and research on contemporary technologies. The course surveys the literature related to the development and use of educational technology for learning in classrooms and informal learning environments. The course addresses learning theories related to technology such as social constructivism and constructionism and explores key genres of educational technologies such as intelligent tutors, computer supported collaborative learning, educational games and computer-based assessment.",
        "units": "3",
        "prerequisites": "{Enrollment is restricted to students in the Master of Arts in Educational Technology program or with department permission}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Preparatory: Restricted to and required of M.A. degree candidates in the semester in which they take the comprehensive examination for the degree.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "699A",
        "title": "Independent Study",
        "description": "Independent Study",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]