[
    {
        "subject": "SUST",
        "catalog_number": "240",
        "title": "Environmental Ethics",
        "description": "Examines the meaning and value of nature and the environment from a variety of ethical perspectives, including feminist and de-colonial perspectives. Questions can include: How should human beings relate to the natural world? How can we build sustainable interactions with the natural world? Do we have moral obligations toward non-human animals and other parts of nature? What do we owe to other beings, including future generations, with respect to the environment? In the face of catastrophic climate change, is it moral to procreate or to eat meat? (Cross-listed with PHIL 240.) (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SUST",
        "catalog_number": "300",
        "title": "Interdisciplinary Perspectives on Sustainability",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course uses an interdisciplinary approach to help students understand concepts of sustainability from multiple perspectives. Students will build skills to apply theories to real-world problems of sustainability, and develop the ability to apply sustainability principles and critical thinking skills to their personal and professional decision-making processes. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "SUST",
        "catalog_number": "310",
        "title": "Best Practices in Sustainability",
        "description": "Prerequisite: Completion of the lower division writing requirement. In this course, students will learn current and best practices for planetary sustainability on an individual, institutional, regional and global level. Topics focus on reducing carbon emissions and pollution, and supporting a healthy and sustainable planet.  These will include clean-energy technology, water conservation, agricultural-based strategies for sustainable farming, management and preservation of natural resources, natural building techniques and clean transportation systems. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "SUST",
        "catalog_number": "401",
        "title": "Applied Sustainability",
        "description": "Prerequisite: SUST 310 or permission of instructor. Preparatory: SUST 300. This course offers a practical application of sustainability knowledge and practices to address a community problem. Environmental, equity and economic impacts must be considered in performing situation analyses and developing recommendations. Course provides the opportunity to apply sustainability knowledge in a consulting capacity and evaluate alternative solutions taking sustainability considerations into account. Affords students a community service learning experience. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{SUST 310} || {permission of instructor}}",
        "corequisites": "{None}"
    }
]