{
    "name": "B.A., Child and Adolescent Development: Early Childhood Development",
    "prog-reqq-blob": "Program Requirements\n1. Lower Division Required Courses (15-16 units)\nIntroduction to the Field\nComplete all of the following:\nCADV 150 Foundations of Child and Adolescent Development (3)\nCADV 180 Statistics in Applied Developmental Science (3)\nor MATH 140 Introductory Statistics (4)\nFCS 234 The Child in the Family and Community (3)\nHSCI 131 Health and Society (3)\nPSY 150 Introduction to Psychology (3)\n2. Additional Requirements (41 units)\na. Domains of Development (6 units)\nComplete both of the following:\nCADV 350 Applied Cognitive Development (3)\nCADV 352 Applied Social Development (3)\nb. Modes of Inquiry (8 units)\nCADV 380/L Methods of Child and Adolescent Study and Lab I (3/1)\nChoose one of the following:\nCADV 381/L Methods of Child and Adolescent Study and Lab II (3/1)\nFCS 431/FCS 431L Child and Family Assessment and Lab (3/1)\nc. Cultural/Linguistic Contexts of Development (3 units)\nCADV 460 Race, Ethnicity, Gender and Culture in Development (3)\nd. Early Childhood Education Pedagogy and Curriculum (6 units)\nChoose two of the following:\nART 383/L Art in Early Childhood and Lab (2/1)\nART 385/L Children’s Crafts and Lab (2/1)\nCADV 406/L/RTM 406/L Enhancing Childhood Creativity and Lab (2/1)\nEPC 430 Development and Learning in Early Childhood Education (3)\nMUS 362/L Music for Early Childhood and Lab (2/1)\ne. Professional Development and Practitioner-Based Skills Sets (18 units)\nComplete the following:\nCADV 470 Advanced Theories in Child and Adolescent Development (3)\nComplete any five of the following:\nAAS 417/AFRS 417/CHS 417/ELPS 417 Equity and Diversity in Schools (3)\nART 380/L Children’s Art and Lab (2/1)\nART 385/L Children’s Crafts and Lab (2/1)\nART 579/L Art Education Across Cultures and Lab (2/1)\nCADV 250 Professional Pathways and Careers in Child and Adolescent Development (3)\nCADV 310 Developmental Impacts of Abuse and Neglect (3)\nCADV 327 Infancy and Early Childhood (3)\nCADV 335 Middle Childhood (3)\nCADV 394 Child and Adolescent Development Internship I (3)\nCADV 450 Helping Children Cope with Medical Environments (3)\nCADV 451 Alternative Approaches to Discipline (3)\nor FCS 436 Parental Development (3)\nCADV 452 Child Advocacy (3)\nCADV 453 Autism and Neurodevelopmental Disorders (3)\nCADV 455 Effective Mentoring in Child and Adolescent Development (3-3)\nCADV 456 Coping with Grief and Loss in Childhood and Adolescence (3)\nCADV 494 Child and Adolescent Development Internship II (3)\nCADV 495A Child and Adolescent Development Graduate School Skills and Applied Research Training I (3)\nCADV 495B Child and Adolescent Development Graduate School Skills and Applied Research Training II (3)\nCADV 499C Independent Study (3)\nEED 500 Foundations of Elementary Teaching (3)\nEPC 314 Psychological Foundations, K-12 (3)\nor EPC 315 Psychological Foundations of Learning and Teaching (3)\nEPC 430 Development and Learning in Early Childhood Education (3)\nFCS 309 Maternal, Infant and Child Nutrition (3)\nFCS 335 Prenatal and Infant Development (3)\nFCS 433 Administration of Children’s Programs (3)\nFCS 480 The Helping Professional (3)\nSPED 400 Developmental Differences and Implications in Special Education (3)\nSPED 402 Promoting and Supporting a Positive and Inclusive School Climate (3)\nSPED 431 Atypical Development in Young Children with Disabilities (3)\nSPED 532 ECSE Curriculum and Instruction (3)\n3. General Education (48 units)\nUndergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.\n18 units are satisfied by the following courses in the major: CADV 350 satisfies B2 Life Science; CADV 180 or MATH 140 satisfies Basic Skills B4 Mathematics/Quantitative Reasoning; CADV 380 satisfies B5 Scientific Inquiry and Quantitative Reasoning; CADV 150 and PSY 150 satisfy D1 Social Sciences (CADV 150 also fulfills the Information Competence requirement); and HSCI 131 satisfies E Lifelong Learning.\nTotal Units in the Major/Option: 56-57\nGeneral Education Units: 30\nAdditional Units: 33-34\nTotal Units Required for the B.A. Degree: 120"
}