{
    "name": "B.A., Economics",
    "prog-reqq-blob": [
        "Program Requirements",
        "Double Major Requirements",
        "Students seeking a double major in the David Nazarian College of Business and Economics must have at least a 3.0 overall GPA and be able to complete both majors within a maximum of 140 units.",
        "Transfer Course Requirements",
        "Students should be aware that no grade lower than a C will be accepted on transfer from another institution to satisfy department or David Nazarian College of Business and Economics requirements.",
        "Residency Requirement",
        "At least 50 percent of the business and economics course credit units and 50 percent of the specialized major credit units required for the Bachelor of Science degrees in Accountancy, Business Administration or Information Systems and the Bachelor of Arts degree in Economics must be completed in residence at CSUN.",
        "Required Courses",
        "1. Lower Division Required Courses (21 units)",
        "ACCT 220 Introduction to Financial Accounting (3)",
        "ENGL 205 Business Communication in Its Rhetorical Contexts (3)",
        "or ENGL 305 Intermediate Expository Writing (3)",
        "or ENGL 306 Report Writing (3)",
        "ECON 160 Principles of Microeconomics (3)",
        "ECON 161 Principles of Macroeconomics (3)",
        "IS 212 Information System for Business Users (3)",
        "MATH 103 Mathematical Methods for Business (3)*",
        "SOM 120 Statistics for Business and Economics (3)**",
        "*MATH 103 or a higher-level mathematics course must be completed with a grade of C or higher. MATH 150A or 255A may be substituted. Course must be completed with a grade of C or higher.",
        "**The 4-unit MATH 140 course also satisfies this requirement.",
        "2. Upper Division Courses (27 units)",
        "Upper Division Required Courses (12 units)",
        "ECON 309 The Use and Interpretation of Economic Data (3)",
        "ECON 310 Price Theory and Applications (3)",
        "ECON 311 Money, Banking and the Federal Reserve (3)",
        "ECON 312 Macroeconomic Theory (3)",
        "Upper Division Elective Courses (15 units)",
        "Five upper division courses chosen from any Economics department listing, excluding ECON 498. At least three elective courses must be 400-level courses.",
        "3. General Education (48 units)",
        "Undergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.",
        "15 units are satisfied by the following courses in the major: MATH 103 satisfies Basic Skills B4 Mathematics/Quantitative Reasoning; ECON 309 satisfies B5 Scientific Inquiry and Quantitative Reasoning; ECON 160 and ECON 310 satisfy D1 Social Sciences; and IS 212 satisfies E Lifelong Learning and fulfills the Information Competence requirement.",
        "Total Units in the Major: 48",
        "General Education Units: 33",
        "Additional Units: 39",
        "Total Units Required for the B.A. Degree: 120"
    ],
    "link-to-major": "https://catalog.csun.edu/academics/econ/programs/ba-economics/"
}