{
    "name": "B.A., History: Junior-Year Integrated (JYI) History Subject Matter Program for the Single Subject Credential",
    "prog-reqq-blob": "Program Requirements\nThe JYI History Subject Matter Program integrates History-Social Science subject matter coursework and the coursework included in professional preparation for a career in teaching. The program includes all History major and teaching credential coursework. For admission, students must be juniors who have completed the lower division General Education requirements and the lower division core requirements for the History major. Students who successfully complete the requirements earn both a Bachelor of Arts degree in History and a Single Subject History-Social Science Preliminary Credential in three years.\n1. Program Requirements for Students in the JYI program\nThe following courses are a prerequisite for admission into the JYI program: ECON 161; GEOG 150; HIST 110; HIST 111; HIST 145 or HIST 161 or HIST 185 or HIST 192; HIST 270; HIST 271; POLS 155. Students should use ASSIST to check which General Education courses at California Community Colleges will satisfy the prerequisite requirements.\nStudents should meet with the FYI/JYI advisor once a semester.\nStudents should maintain an overall GPA of 2.75 or higher.\nStudents should earn a grade of “C” or better and a GPA of 3.0 or higher in ECON 161; GEOG 150; GEOG 321; HIST 110; HIST 111; HIST 145 or HIST 161 or HIST 185 or HIST 192; HIST 270; HIST 271; HIST 301; HIST 417 or HIST 488; HIST 497; POLS 155; Upper Division GE Section F; Upper Division Asian, African, Middle Eastern, or Latin American History; Upper Division European History; and Upper Division U.S. or Canadian History.\nStudents should earn a grade of “C” or better and a GPA of 3.0 or higher in AAS 417 or AFRS 417 or ARMN 417 or CHS 417 or ELPS 417; EPC 420; HSCI 466ADO; SED 511; SED 514; SED 521; SED 525EN; SED 529; SED 554; SED 555; and SPED 420.\nStudents should complete a Professional Teaching Portfolio (SED 555).\nStudents should develop and complete an Induction Plan (SED 555).\n2. Required Courses (72 units)\nFall Semester, Year 1 (12 units)\nHIST 389 Disability in American History and Law (3)\nChoose 3 Upper Division units from GE Section F: Comparative Cultural Studies (3)\nChoose 3 units from GE Section B5: Scientific Inquiry and Quantitative Reasoning (3)\nChoose one of the following two HIST courses:\nHIST 417 California for Educators (3)\nHIST 488 California (3)\nSpring Semester, Year 1 (12 units)\nEPC 420 Educational Psychology of Adolescence (3)\nGEOG 321 United States (3)\nHIST 301 The Historian’s Craft (3)\nUpper Division U.S. or Canadian History (3)\nFall Semester, Year 2 (12 units)\nHIST 497A-Z Proseminar (3)\nSED 511 Fundamentals of Secondary Education in Multiethnic Secondary Schools (3)\nUpper Division Asian, African, Middle Eastern, or Latin American History (3)\nUpper Division HIST any area (3)\nSpring Semester, Year 2 (12 units)\nHIST 498 Tutorial in History (3)\nSED 521 Content Area Literacy and Learning in Multiethnic Secondary Schools (3)\nSED 525SS Methods of Teaching Social Studies (3)\nUpper Division European History (3)\nAdditional Requirements for Spring Semester\nYear 2 students should:\nHave at least 45 clock hours of early field experience with a group(s) of school-aged children appropriate for the student population with whom they will be working.\nTake the CBEST examination.\nApply for admission to the Credential Program.\nApply for the Certificate of Clearance from the Commission on Teacher Credentialing.\nFall Semester, Year 3 (12 units)\nHSCI 466ADO Health Issues of the Adolescent (1)\nSED 514 Computers in Instruction (3)\nSED 529 Teaching English Learners in Multiethnic Secondary Schools (3)\nSED 554/S Supervised Field Experience and Seminar (3/2)\nSpring Semester, Year 3 (12 units)\nSED 555 Supervised Practicum for the Single Subject Credential (4)\nSED 555S Practicum Seminar for the Single Subject Credential (2)\nSPED 420 Designing Equitable Learning Through Universal Design (3)\nChoose one of the following five courses:\nAAS 417 Equity and Diversity in Schools (3)\nAFRS 417 Equity and Diversity in Schools (3)\nARMN 417 Equity and Diversity in School (3)\nCHS 417 Equity and Diversity in Schools (3)\nELPS 417 Equity and Diversity in Schools (3)\n3. General Education\nHistory majors in the Junior-Year Integrated (JYI) option satisfy General Education requirements by completion of the major.\nTotal Units Required for JYI History/Social Science: 72 units"
}