{
    "name": "B.A., History: Four-Year Integrated (FYI) History Subject Matter Program for the Single Subject Credential",
    "prog-reqq-blob": [
        "Program Requirements",
        "The FYI History Subject Matter Program integrates History-Social Science subject matter coursework and the coursework included in professional preparation for a career in teaching. The program includes all General Education, History major, and teaching credential coursework. Students who successfully complete the requirements earn both a Bachelor of Arts degree in History and a Single Subject History-Social Science Preliminary Credential in four years.",
        "1. Program Requirements for Students in the FYI program",
        "Students may not take History courses to fulfill General Education requirements.",
        "Students should meet with the FYI/JYI advisor once a semester.",
        "Students should maintain an overall GPA of 2.75 or higher.",
        "Students should earn a grade of C or better and a GPA of 3.0 or higher in AFRS 161 or POLS 155; GEOG 107 or GEOG 150; GEOG 321; HIST 110; HIST 111; HIST 145 or HIST 161 or HIST 185 or HIST 192; HIST 270; HIST 271; HIST 301; HIST 417 or HIST 488; HIST 478 or HIST 479A or HIST 479B or POLS 310; HIST 497; Upper Division Asian, African, Middle Eastern, or Latin American History; Upper Division European History; and Upper Division U.S. or Canadian History.",
        "Students should earn a grade of C or better and a GPA of 3.0 or higher in AAS 417 or AFRS 417 or ARMN 417 or CHS 417 or ELPS 417; EPC 420; HSCI 466ADO; SED 511; SED 514; SED 521; SED 525EN; SED 529; SED 554; SED 555; and SPED 420.",
        "Students should complete a Professional Teaching Portfolio (SED 555).",
        "Students should develop and complete an Induction Plan (SED 555).",
        "2. Required Courses (132 units)",
        "Fall Semester, Year 1 (15 units)",
        "COMS 151 Fundamentals of Public Speaking (3)",
        "ENGL 115 Approaches to University Writing (3)",
        "HIST 110 World History to 1500 (3)",
        "MATH 131 Mathematical Ideas (3)",
        "UNIV 100 Freshman Seminar (3)",
        "Spring Semester, Year 1 (15 units)",
        "HIST 111 World History Since 1500 (3)",
        "Choose 3 units from GE Section A3: Critical Thinking (3)",
        "Choose 3 units from GE Section B1: Physical Science (3)",
        "Choose 3 units from GE Section C1: Arts (3)",
        "Choose one of the following two courses:",
        "AFRS 161 American Political Institutions: A Black Perspective (3)",
        "POLS 155 American Political Institutions (3)",
        "Fall Semester, Year 2 (18 units)",
        "HIST 270 The United States to 1865 (3)",
        "Choose 3 units from GE Section B2 Life Science and GE Section B3 Scientific Laboratory Activity (3)*",
        "Choose 3 units from GE Section C3: American History, Institutions and Ideals (3)",
        "Choose 3 units from GE Section F: Comparative Cultural Studies (3)",
        "Choose one of the following four HIST courses:",
        "HIST 145 African Civilization to Modern Times (3)",
        "HIST 161 The History of Latin America from Pre-Columbian Times to Today (3)",
        "HIST 185 Middle East from 600CE to the Present (3)",
        "HIST 192 History of Modern East Asia (3)",
        "Choose one of the following two GEOG courses:",
        "GEOG 107 People, Places, and Landscapes (3)",
        "GEOG 150 World Geography: People, Places, and Globalization (3)",
        "*Note that students need to take one 3 unit lecture class and one lecture/lab combination (2+1).",
        "Spring Semester, Year 2 (18 units)",
        "EPC 420 Educational Psychology of Adolescence (3)",
        "GEOG 321 United States (3)",
        "HIST 271 The United States Since 1865 (3)",
        "HIST 301 The Historian's Craft (3)",
        "Choose 3 units from GE Section C2 Humanities (3)",
        "Choose 3 Upper Division units from GE Section F Comparative Cultural Studies (3)",
        "Fall Semester, Year 3 (15 units)",
        "HIST 497A-Z Proseminar (3)",
        "SED 511 Fundamentals of Secondary Education in Multiethnic Secondary Schools (3)",
        "Upper Division Asian, African, Middle Eastern, or Latin American History (3)",
        "Choose 3 units from GE Section B5: Scientific Inquiry and Quantitative Reasoning (3)",
        "Choose one of the following four courses:",
        "HIST 478 Economic History of the United States (3)",
        "HIST 479A United States Economic History to 1865 (3)",
        "HIST 479B United States Economic History Since 1865 (3)",
        "POLS 310 Problems of Political Economy (3)",
        "Spring Semester, Year 3 (18 units)",
        "HIST 498 Tutorial in History (3)",
        "SED 521 Content Area Literacy and Learning in Multiethnic Secondary Schools (3)",
        "SED 525SS Methods of Teaching Social Studies (3)",
        "Upper Division European History (3)",
        "Upper Division U.S. or Canadian History (3)",
        "Choose one of the following two HIST courses:",
        "HIST 417 California for Educators (3)",
        "HIST 488 California (3)",
        "Additional Requirements for Spring Semester",
        "Year 3 students should:",
        "Have at least 45 clock hours of early field experience with a group(s) of school-aged children appropriate for the student population with whom they will be working.",
        "Take the CBEST examination.",
        "Apply for admission to the Credential Program.",
        "Apply for the Certificate of Clearance from the Commission on Teacher Credentialing.",
        "Fall Semester, Year 4 (17 units)",
        "HIST 389 Disability in American History and Law (3)",
        "SED 514 Computers in Instruction (3)",
        "SED 529 Teaching English Learners in Multiethnic Secondary Schools (3)",
        "SED 554/S Supervised Field Experience and Field Experience Seminar for the Single Subject Credential (3/2)",
        "Upper Division HIST any area (3)",
        "Spring Semester, Year 4 (16 units)",
        "HSCI 466ADO Health Issues of the Adolescent (1)",
        "SED 555 Supervised Practicum for the Single Subject Credential (4)",
        "SED 555S Practicum Seminar for the Single Subject Credential (2)",
        "SPED 420 Designing Equitable Learning Through Universal Design (3)",
        "Upper Division HIST any area (3)",
        "Choose one of the following five courses:",
        "AAS 417 Equity and Diversity in Schools (3)",
        "AFRS 417 Equity and Diversity in Schools (3)",
        "ARMN 417 Equity and Diversity in School (3)",
        "CHS 417 Equity and Diversity in Schools (3)",
        "ELPS 417 Equity and Diversity in Schools (3)",
        "3. General Education",
        "History majors in the Four-Year Integrated (FYI) option satisfy General Education requirements by completion of the major. In addition, students must complete 3 units of coursework to meet the Ethnic Studies (ES) graduation requirement. If taken, one of the following courses in the major will also meet the Ethnic Studies (ES) requirement: AFRS 161, AFRS 417 or CHS 417. Alternatively, students may select an Ethnic Studies (ES) designated course from one of the following General Education sections: C1 Arts, C2 Humanities, C3 American History, Institutions and Ideals or F Comparative Cultural Studies.",
        "Total Units Required for FYI History/Social Science: 132"
    ],
    "link-to-major": "https://catalog.csun.edu/academics/hist/programs/ba-history-ii/four-year-integrated-fyi-history-subject-matter-program-for-the-single-subject-credential/"
}