{
    "name": "B.A., Psychology",
    "prog-reqq-blob": [
        "Program Requirements",
        "1. Lower Division Required Courses (10 units)",
        "MATH 140 Introductory Statistics (4)*",
        "PSY 150 Introduction to Psychology (3)",
        "PSY 250 Physiological Correlates of Human Behavior (3)*",
        "*A grade of C or higher is required in MATH 140 as a prerequisite to taking PSY 320/L.",
        "Note: Supporting courses in Biology, Mathematics, Philosophy and the social sciences are recommended, but not required.",
        "Note: Lower division courses other than those specified as required do not count toward a major in Psychology. These courses exist to inform students about topics of special interest and will count toward the total units required for graduation.",
        "2. Upper Division Required Courses (24 units)",
        "Note: Completion of the lower division writing requirement is prerequisite to all 300-level courses. Students are advised to complete the lower division writing requirement and to take PSY 301, 320/L and 321/L early in their program because these courses may be prerequisites to other upper division courses required in the major.",
        "a. Required Courses (9 units)",
        "PSY 301 Pre-Professional Development in Psychology (1)**",
        "PSY 320/L Statistical Methods in Psychological Research and Lab (3/1)",
        "PSY 321/L Research Methods in Psychology and Lab (3/1)",
        "**This course is a prerequisite or corequisite for the 300-level cluster courses.",
        "b. Breadth Requirement (12 units)",
        "One course from each of the following four clusters is required.",
        "Cluster 1: Clinical/Personality Psychology (3 units)",
        "Choose one of the following:",
        "PSY 310 Abnormal Psychology (3)",
        "PSY 351 Behavioral Psychology and Therapy (3)",
        "PSY 353 Psychological Interventions (3)",
        "PSY 370 Psychology of Personality (3)",
        "PSY 380 Psychology of Stress (3)",
        "Cluster 2: Cognitive Psychology (3 units)",
        "Choose one of the following:",
        "PSY 304 Cognitive Psychology and Instruction (3)",
        "PSY 367 Cognitive Psychology (3)",
        "PSY 369 Applied Cognition (3)",
        "PSY 382 Principles of Human Factors (3)",
        "Cluster 3: Developmental Psychology (3 units)",
        "Choose one of the following:",
        "PSY 313 Developmental Psychology (3)",
        "PSY 327 Infancy and Early Childhood (3)",
        "PSY 335 Middle Childhood (3)",
        "PSY 361 Adolescence (3)",
        "PSY 365 Introduction to Gerontology (3)",
        "Cluster 4: Social Psychology (3 units)",
        "Required course:",
        "PSY 345 Social Psychology (3)",
        "c. 400-Level Course Requirement (3 units)",
        "Complete a minimum of one 3-unit course at the 400-level. PSY 486SOC, PSY 495A-Z, PSY 497 and PSY 499 cannot be counted to satisfy this requirement.",
        "3. Upper Division Electives (8 units or more)",
        "Electives may include the above upper division courses not taken to satisfy other requirements or any 300- or 400-level courses in the Department of Psychology. Students may not double count the above courses as required courses and elective courses. No more than 6 units combined total of PSY 498 (Practicum) and/or PSY 499 (Independent Study) may be counted toward the major. No more than 6 units of PSY 498 and PSY 499 (12 units total) may be counted toward the B.A. degree.",
        "Note that the number of units in Psychology must total at least 42 units; transfer credit for courses that reflect fewer units than those at CSUN must be compensated for in upper division Psychology elective units.",
        "4. General Education (48 units)",
        "Undergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.",
        "9 units are satisfied by the following courses in the major: MATH 140 satisfies B4 Mathematics/Quantitative Reasoning; PSY 320 satisfies B5 Scientific Inquiry and Quantitative Reasoning; and PSY 150 satisfies 3 units of D1 Social Sciences.",
        "If taken, PSY 312, PSY 352 or PSY 365 satisfies 3 units of upper division D1 Social Sciences and fulfills the Information Competence requirement.",
        "Total Units in the Major: 42",
        "General Education Units: 39",
        "Additional Units: 39",
        "Total Units Required for the B.A. Degree: 120"
    ],
    "link-to-major": "https://catalog.csun.edu/academics/psy/programs/ba-psychology-i/"
}