{
    "name": "B.A., Communicative Disorders",
    "prog-reqq-blob": [
        "Program Requirements",
        "There are special requirements for admission to the major. Undergraduate instruction is divided between a Pre-Clinical and a Clinical Phase. There are no preadmission requirements for the department's Pre-Clinical Phase. All entering undergraduate and post-baccalaureate undeclared majors are regarded as Pre-Clinical Phase students. Once junior level or higher academic standing is achieved, Pre-Clinical Phase students must complete CD 405, CD 410, CD 415 and CD 442 or the equivalent and subsequently established themselves as Eligible for Clinical Privileges at the CSUN Language, Speech and Hearing Center as part of the Clinical Phase of instruction. Course equivalents for CD 405, 410, 415 and 442 must be submitted for review and approval by a faculty advisor and the department chair. Application established oneself as Eligible for Clinical Privileges is made during the semester in which the Pre-Clinical Phase courses are in progress of completion.",
        "Please note that satisfactory completion of Pre-Clinical Phase courses includes a grade of B or better in each of the four classes. Enrollment in clinical courses (e.g., CD 465, CD 475 or CD 469O) is not permitted without department approval of being Eligible for Clinical Privileges. Evaluation for admission to Clinical Privileges includes a faculty assessment of academic and clinical potential, passing of a criminal background check, academic transcripts and satisfactory completion of the Pre-Clinical Phase courses.",
        "Once identified as being Eligible for Clinical Privileges, the student is regarded as a Clinical Phase student and should consult an academic advisor regarding the area of major emphasis (undergraduate Speech-Language Pathology, undergraduate Audiology or post-baccalaureate undeclared majors emphasizing Speech-Language Pathology), proper course sequencing and prerequisites for advanced courses. Each Clinical Phase student maintains Clinical Privileges by (a) earning a grade of B or better in each clinical course; (b) complying with the policies and rules of the CSUN Language, Speech and Hearing Center; (c) complying with the applicable laws and regulations of the California Board of Speech-Language Pathology and Audiology; (d) observing the ASHA Code of Ethics; and (e) maintaining good academic standing (as defined by the University).",
        "If a student is identified as being Ineligible for Clinical Privileges, or if such privileges have been suspended or revoked, it is possible to complete the baccalaureate degree as a nonclinical major by substitution for all client-contact courses.",
        "Instructions, due dates and application forms for Clinical Privileges are available in the department office. Clinical Phase students are advised that Clinical Privileges may be suspended or revoked at any time by the department for failure to attain a grade of B or better in all clinical courses (e.g., CD 465 et seq., 475 et seq., 469O, 668 and 672AB), for violations of ethical conduct or state licensure regarding client care, for academic notice (formerly academic probation) beyond one semester, or for failure to adhere to the regulations and policies of the CSUN Language, Speech and Hearing Center or of the department. Further information on Pre-Clinical and Clinical Phase components of the department's programs is offered during scheduled monthly student orientation sessions.",
        "1. Lower Division Required Courses (11 units)",
        "BIOL 101 General Biology (3)",
        "BIOL 101L General Biology and Lab (1)",
        "BIOL 211 Human Anatomy (2)",
        "BIOL 212 Laboratory Studies in Human Anatomy (1)",
        "MATH 140 Introductory Statistics (4)",
        "2. Upper Division Required Courses (37 units)",
        "CD 405 Phonetics (3)*",
        "CD 410 Hearing Science (3)*",
        "CD 415 Speech and Language Development (3)*",
        "CD 442 Speech Science (3)*",
        "CD 445 Audiometry and Hearing Conservation (3)",
        "CD 446 Auditory Habilitation (3)",
        "CD 451 Phonologic and Articulatory Disorders (3)",
        "CD 462 Language Disorders I (3)",
        "CD 469A Diagnostic Methods in Communication Disorders (3)",
        "CD 485 Augmentative and Alternative Communication (3)",
        "ENGL 302 Introduction to Modern Grammar (3)",
        "PHYS 305 Physics of Music (3)",
        "PHYS 305L Physics of Music Laboratory (1)",
        "*Pre-Clinical Phase courses.",
        "3. Emphasis Courses (9-10 units)",
        "Choose either (a) Speech-Language Pathology Emphasis or (b) Audiology Emphasis.",
        "a. Speech-Language Pathology Emphasis (9 units)",
        "CD 450 Fluency and Disorders of Fluency (3)",
        "CD 480 Early Speech-Language Intervention (3)",
        "Select a minimum of 3 units from the following electives:",
        "ART 383/L Art in Early Childhood and Lab (2/1)",
        "ART 385/L Children's Crafts and Lab (2/1)",
        "BIOL 241/L Human Pregnancy and Embryology and Lab (3/1)",
        "CD 465 Clinical Practicum in Speech Pathology I (2)**",
        "CD 469O Observation and Professional Writing in Communication Disorders (3)**",
        "EPC 314 Psychological Foundations, K-12 (3)***",
        "FCS 330 Child Growth and Development (3)***",
        "HSCI 314 Organization and Delivery of Health Services (3)",
        "HSCI 336 Health Aspects of Drug Use (3)",
        "HSCI 337 Nutrition and Health (3)",
        "HSCI 345 Public Health Issues (3)",
        "PSY 200 Introduction to Lifespan Psychology (3)",
        "PSY 302 Human Learning in the Formative Years (3)",
        "PSY 313 Developmental Psychology (3)",
        "PSY 351 Behavioral Psychology and Therapy (3)",
        "PSY 365 Introduction to Gerontology (3)",
        "RTM 305 Dynamics of Early Childhood Play (3)",
        "RTM 352 Play and Human Potential (3)",
        "RTM 415 Leisure and Aging (3)",
        "SOC 440 Sociology of Aging (3)",
        "**Note: Requires Clinical Privileges.",
        "***Needed for SLP Credential.",
        "b. Audiology Emphasis (10 units)",
        "Select a minimum of 10 units from the following electives:",
        "ART 383/L Art in Early Childhood and Lab (2/1)",
        "ART 385 Children's Crafts and Lab (2/1)",
        "BIOL 241/L Human Pregnancy and Embryology and Lab (3/1)",
        "CD 465 Clinical Practicum in Speech Pathology I (2)**",
        "CD 469O Observation and Professional Writing in Communication Disorders (3)**",
        "CD 471 Advanced Audiology (3)**",
        "CD 475 Clinical Practicum in Audiology I (2)**",
        "CD 576 Clinical Practicum in Audiology II (2)**",
        "HSCI 314 Organization and Delivery of Health Services (3)",
        "HSCI 336 Health Aspects of Drug Use (3)",
        "HSCI 337 Nutrition and Health (3)",
        "HSCI 345 Public Health Issues (3)",
        "PSY 200 Introduction to Lifespan Psychology (3)",
        "PSY 302 Human Learning in the Formative Years (3)",
        "PSY 313 Developmental Psychology (3)",
        "PSY 351 Behavioral Psychology and Therapy (3)",
        "PSY 365 Introduction to Gerontology (3)",
        "RTM 305 Dynamics of Early Childhood Play (3)",
        "RTM 352 Play and Human Potential (3)",
        "RTM 415 Leisure and Aging (3)",
        "SOC 440 Sociology of Aging (3)",
        "**Note: Requires Clinical Privileges.",
        "4. General Education (48 units)",
        "Undergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.",
        "9 units are satisfied by the following courses in the major: BIOL 101 satisfies B2 Life Science; BIOL 101L satisfies B3 Science Laboratory Activity; MATH 140 satisfies Basic Skills B4 Mathematics/Quantitative Reasoning; and PHYS 305 satisfies B5 Scientific Inquiry and Quantitative Reasoning and fulfills the Information Competence requirement.",
        "If taken, HSCI 345 and/or PSY 365 satisfies 3-6 units of upper division D1 Social Sciences; and FCS 330, HSCI 336, HSCI 337 or RTM 352 satisfies E Lifelong Learning.",
        "Special Requirements",
        "In addition to degree requirements, the undergraduate course of study must fulfill requirements for successful application to graduate school, as well as provide some of the introductory required courses for professional certification, state licensure and credentialing.",
        "Total Units for the Major: 57-58",
        "General Education Units: 39",
        "Additional Units: 23-24",
        "Total Units Required for the B.A. Degree: 120"
    ],
    "link-to-major": "https://catalog.csun.edu/academics/cd/programs/ba-communicative-disorders/"
}