{
    "name": "B.A., Theatre",
    "prog-reqq-blob": "Program Requirements\nTo obtain a B.A. degree with a major in Theatre, a student must have at least a 2.0 GPA in all upper division Theatre courses (including courses transferred from other institutions and applied toward the requirements in the major) and must have taken at least 18 units of upper division Theatre courses in residence. Students may not receive credit for more than 72 units of Theatre courses (including courses transferred from other institutions and applied toward the requirements in the major). Any exceptions to this limitation must be individually approved in writing by the student’s advisor and the department chair before registration will be allowed.\nProduction Participation\nAll Theatre majors are required to complete four upper division department production participations. Completed assignments should reflect the broad spectrum of theatre production areas, including, but not limited to, acting, directing, scenery, costumes, properties, lighting, sound, makeup, technology, management and dramaturgy. Courses that require a production assignment as part of the course (TH 361P, TH 362P, TH 363P, TH 376, TH 382ABC, TH 383, TH 384, TH 390ABC, TH 459, TH 490ABC, TH 498B, TH 498C and TH 498D) will fulfill the production assignment for the semester during which the course is taken.\n1. Program Entrance Requirement (3 units)\nTH 110 Introduction to Theatre: Text/Drama/Performance (3)\n2. Lower Division Required Courses (19 units)\nTH 108A Acting I: Fundamentals (2)\nTH 142M Theatre Movement I (2)\nTH 143V Theatre Voice and Speech I (2)\nTH 155 Introduction to Design and Creativity (2)\nTH 208A Acting II: Character and Text (2)\nTH 222 Mapping World Theatre and Drama (3)\nChoose 6 units from the following:\nNote: Coursework in this section must include two corequisite production participation activities.\nTH 261/TH 261P Fundamentals of Scenery and Properties Technology (2/1)\nTH 262/TH 262P Fundamentals of Costume Technology (2/1)\nTH 263/TH 263P Fundamentals of Lighting and Sound Technology (2/1)\n3. Upper Division Required Courses (32 units)\nTH 321A World Theatre and Drama I (3)\nTH 321B World Theatre and Drama II (3)\nTH 350 Cultural and Historical Perspectives for Theatre (3)\nTH 444 Principles of Directing (3)\nChoose a minimum of 2 units from the following:\nTH 381 Management Techniques for the Theatre (2)\nTH 385 Stage Management (2)\nChoose a minimum of 3 units from the following:\nTH 355 Principles of Stage Design (2)\nTH 361A Intermediate Scenic Design and Construction Techniques (2)\nTH 361B Digital Scenic Techniques (2)\nTH 362A Intermediate Costume Techniques (2)\nTH 362B Intermediate Costume Crafts (2)\nTH 363A Intermediate Lighting Techniques (2)\nTH 363B Intermediate Sound Technology (2)\nTH 367 Intermediate Makeup Techniques (2)\nTH 382A-C Theatre Management Practicum (1-3)\nChoose one course from the following (3 units):\nTH 422 Theatre and Drama of Greece and Rome (3)\nTH 423 Theatre and Drama of the Middle Ages and Renaissance (3)\nTH 424 Theatre and Drama of the 18th and 19th Centuries (3)\nTH 425 Theatre and Drama of Europe and America from Naturalism to the Mid-20th Century (3)\nTH 426 Contemporary Theatre and Drama of Europe and America (3)\nTH 427 History of Costume (3)\nTH 432 Theatre and Drama of the United States (3)\nTH 433 The Musical Theatre in the United States (3)\nTH 475 Theatre and Drama for Young Audiences (3)\nTH 530 Theatre and Drama of Latin America (3)\nTH 531 Theatre and Drama of Asia (3)\nTH 535 Theatrical Theory and Criticism (3)\nUpper Division Electives and/or Theatre Production Participation (12 units)\nTH 390 Theatre Production Participation (1-2-3)\nor TH 490 Theatre Production Participation (1-2-3)\nor Electives selected from any 300-, 400- or 500-level courses for which prerequisites have been met.\n4. General Education (48 units)\nUndergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.\n3 units are satisfied by the following course in the major: TH 110 satisfies C1 Arts.\nTotal Units in the Major: 54\nGeneral Education Units: 45\nAdditional Units: 21\nTotal Units Required for the B.A. Degree: 120"
}