{
    "name": "B.A., Art",
    "prog-reqq-blob": "Program Requirements\n1. Lower Division Core Foundation Requirements (15 units)\nART 124A Drawing I (3)\nART 140 Beginning Two-Dimensional Design (3)\nART 141 Beginning Three-Dimensional Design (3)\nSelect two courses from the following (6 units):\nART 110 World Arts: The Western Tradition (3)\nART 112 World Arts: Africa, Oceania and the Americas (3)\nART 114 World Arts: Asia (3)\n2. Lower Division Courses by Area of Concentration (minimum of 9 units)\n100- and 200-level courses\nThe selection of lower division courses will be for the purpose of satisfying prerequisites for upper division courses and for electives, with guidance from an Art department advisor. Lower division courses may be substituted for courses from outside the Art department with approval of the Art department.\nNote: Students with a catalog year of 2014 or later are not required to take ART 200 and can obtain permission numbers for classes requiring ART 200 as a prerequisite.\n3. Upper Division Core Requirements (12 units)\nART 307 Core Art Studio (3)\nART 438/L Senior Projects and Lab (2/1)\nSelect one course from the following (3 units):\nART 318 Survey of 19th and 20th Century Arts (3)\nART 448 History of Contemporary Art (3)\nSelect one course from the following (3 units):\n300-, 400- and 500-level Art History (3)\n(ART 305, 311, 315 and 510 do not satisfy the upper division core requirements for Art majors.)\n4. Upper Division Courses by Area of Concentration (21 units)\n300-, 400- and 500-level courses\nA minimum of 21 units of upper division courses shall be selected with the aid of an art advisor from one or more areas of concentration.\nAreas of Concentration\nTo meet the specific requirements of the areas of concentration, students must complete all required core courses and select additional elective units in consultation with a faculty advisor in that area of concentration.\nNote: Advisement is mandatory for all lower division Art majors each semester. It is highly recommended that all upper division Art majors see an Art advisor each semester, and review of graduation requirements is mandatory for upper division majors. Each area of concentration provides an advisement form, available in the Art office, which lists both required core and elective courses for the area of concentration.\nCore Requirements for Areas of Concentration\nAnimation\nART 124B, ART 263, ART 363B, ART 364; select from ART 463 or ART 465.\nArt Education\nART 124B, ART 148, ART 579/L, ART 582, ART 586/L and ART 590.\nNote that ART 579, 582, 586 and 590 are required for the Single Subject Credential in Art (see Credential Information below).\nArt History\nSelect from ART 110, ART 112 or ART 114; ART 510; select five additional 400- or 500-level courses.\nCeramics\nART 235, ART 267, ART 366, ART 367, ART 467\nDrawing\nART 124B, ART 148, ART 324A, ART 330\nGraphic Design\nART 243, ART 244, ART 313, ART 343, ART 344, ART 444\nIllustration\nART 124B, ART 222, ART 322A, ART 322B, ART 322C, ART 422\nInterdisciplinary\nART 124B, ART 148, ART 488, ART 494\nPainting\nART 124B, ART 227, ART 326, ART 327, ART 429\nPhoto/Video\nART 250, ART 350, ART 351, ART 353, ART 357, ART 450, ART 455A, ART 455B, ART 455C\nPrintmaking\nART 124B, ART 237, ART 437; select from ART 337A, ART 337B, ART 337C or ART 337D.\nSculpture\nART 124B, ART 235, ART 335, ART 339, ART 435, ART 439\n5. General Education (48 units)\nUndergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.\n3 units are satisfied by the following course in the major: ART 140 satisfies C1 Arts.\nIf taken, ART 112 satisfies 3 units of F Comparative Cultural Studies.\nTotal Units in the Major: 57\nGeneral Education Units: 45\nAdditional Units: 18\nTotal Units Required for the B.A. Degree: 120\nCredential Information\nAn approved Subject Matter Program leading to a Single Subject Teaching Credential in Art (K-12) is available. The purpose of the Subject Matter Program in Art Education is to provide students with a strong foundation in and understanding of visual art, as well as coursework and field experiences necessary to teach visual art to the diverse public school student populations in the secondary schools of California. The academically rigorous and intellectually stimulating Art Education program curriculum reflects and builds upon the Visual and Performing Arts Content Standards for California Public Schools K-12: Visual Art (2001) and California State Visual Art Curriculum Framework, and it establishes a basis for continued professional development during their teaching career.\nContact the Art Department Advisement Center at (818) 677-2348 for information about the Art Subject Matter Program for the Single Subject Credential. See also the disclosure statement regarding Programs Leading to Licensure and Credentialing. Here are the steps to prepare for the Single Subject Credential:\nChoose an area of concentration.\nLower division core program.\nUpper division core program.\nGrade of “B” or better in ART 579/L, ART 582, ART 586/L and ART 590.\nMinimum of 57 units in Art.\nArt Department Contract form, approved by an Art advisor.\nPortfolio review and interview.\nOverall GPA of 2.75 or higher required to enter the credential program in the College of Education.\nGPA of 3.0 or higher in Art Subject Matter Program courses for the Single Subject Credential."
}