{
    "name": "B.M., Music: Jazz Studies",
    "prog-reqq-blob": "Program Requirements\nA. Admission to the Major\nAdmission to the major in Music for all undergraduate degrees is determined by audition. Those auditioning for the Performance options must exhibit a high-performance competence in the audition. Audition procedures and standards are listed on the Department of Music—Audition and Placement website.\nTransfer students seeking admission to Performance options must audition at the appropriate entrance level determined by the number of transferable units accepted by the University. (Example: At the time of the audition, students with more than 60 transferable units must demonstrate musical proficiency at the junior level for admission to a Performance option.) Exceptions to this policy are rare and are at the discretion of the Music department.\nB. Lesson and Ensemble Requirements\nTo qualify for individual lessons in any semester, undergraduate students must be enrolled in a minimum of 12 units, including lesson units and the correct number of ensemble units required by their option.\nEnrollment in the designated ensemble(s) for the student’s instrument is a corequisite of enrollment in private lessons each semester of enrollment. Students who do not meet this requirement by the third week of the semester will not be eligible for lessons that semester. Students enrolled in music ensembles in the Fall semester normally are expected to re-enroll in the same ensemble for the Spring semester. The nature of these classes makes it essential that consistent personnel be maintained throughout the year.\nAll students enrolled in individual lessons must demonstrate their progress in the major before a faculty jury at the end of each semester of study. Students receiving lower than a grade of “C-” in that semester of lessons will need to take additional study at their own expense to achieve their required level of performance before resuming department-paid lessons.\nC. Course Requirements\n1. Lower Division Required Courses (37 units)\nMUS 110A Keyboard Musicianship I (1)\nMUS 110B Keyboard Musicianship II (1)\nMUS 112/L Musicianship II and Lab (1/1)\nMUS 191/L Fundamentals of Music Technology and Lab (2/1)\nMUS 201 Style/Literature of Western Music I (3)\nMUS 202 Style/Literature of Western Music II (3)\nMUS 210AJ Keyboard Musicianship III: Jazz (1)\nMUS 210BJ Keyboard Musicianship IV: Jazz (1)\nMUS 211/L Musicianship III and Lab (1/1)\nMUS 212/L Musicianship IV and Lab (1/1)\nMUS 213 Harmony I (3)\nMUS 214 Harmony II (3)\nMUS 311J/L Musicianship V: Jazz and Lab (1/1)\nMUS 312J/L Musicianship VI: Jazz and Lab (1/1)\nIndividual Lessons (2-2)\nEnsembles (4)\n2. Upper Division Required Courses (9 units)\nMUS 307 Music from a Global Perspective (3)\nMUS 316 Musical Analysis (3)\nMUS 483ME/L Music Entrepreneurship and Lab (1/1)\nMUS 495 Recital/Senior Project (1)\n3. Jazz Studies Option Requirements (36 units)\nMUS 302 Jazz History (2)\nMUS 317A Jazz Arranging I (2)\nMUS 317B Jazz Arranging II (3)\nMUS 319A Jazz Improvisation III (1)\nMUS 319B Jazz Improvisation IV (1)\nIndividual Lessons (12)\nEnsembles (12)\nOne General Education category requirement must be fulfilled by one of the following:\nAFRS 221 Social Environment of the African-American (3)\nAFRS 272 African-American History Since 1865 (3)\nAFRS 300 Contemporary Issues in the African-American Community (3)\nAFRS 324 The Black Woman in Contemporary Times (3)\nAFRS 325 The Black Man in Contemporary Times (3)\nAFRS 346 Contemporary Black Female Writers (3)\nAFRS 361 African-American Politics (3)\n4. General Education (48 units)\nUndergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.\n9 units are satisfied by the following courses in the major: MUS 202 satisfies C1 Arts; MUS 191/L satisfies E Lifelong Learning; and MUS 307 satisfies 3 units of upper division F Comparative Cultural Studies.\nIf taken, MUS 397R/L satisfies B5 Scientific Inquiry and Quantitative Reasoning; AFRS 346 satisfies upper division C2 Humanities; AFRS 221 or AFRS 361 satisfies D1 Social Sciences; AFRS 272 satisfies C3 American History, Institutions and Ideals; and AFRS 300, AFRS 324 or AFRS 325 satisfies 3 units of upper division F Comparative Cultural Studies.\nTotal Units in the Major/Option: 82\nGeneral Education Units: 36\nAdditional Units: 2\nTotal Units Required for the B.M. Degree: 120",
    "general-education": "General Education (48 units)\nUndergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.\n9 units are satisfied by the following courses in the major: MUS 202 satisfies C1 Arts; MUS 191/L satisfies E Lifelong Learning; and MUS 307 satisfies 3 units of upper division F Comparative Cultural Studies.\nIf taken, MUS 397R/L satisfies B5 Scientific Inquiry and Quantitative Reasoning; AFRS 346 satisfies upper division C2 Humanities; AFRS 221 or AFRS 361 satisfies D1 Social Sciences; AFRS 272 satisfies C3 American History, Institutions and Ideals; and AFRS 300, AFRS 324 or AFRS 325 satisfies 3 units of upper division F Comparative Cultural Studies.\n"
}