{
    "name": "B.S., Computer Engineering",
    "prog-reqq-blob": "Program Requirements\nThe Computer Engineering program is based on an expectation of adequate high school preparation in science, mathematics and English. High school courses should include algebra, plane geometry, trigonometry, chemistry or physics (all desirable), and four years of English.\nCSUN provides the opportunity for students who have not had a complete background of pre-engineering work in high school to take courses to prepare for the major. These additional courses will not count toward the major and may increase the time to graduate. CSUN provides testing as outlined below to ensure that students start their engineering coursework at an appropriate level.\nPlacement Exam Requirements\nThe Mathematics Placement Test (MPT) is required prior to enrollment in MATH 150A. Students should take this exam before enrolling in their classes so they may be placed in the appropriate mathematics course. Students with scores of 4 or 5 on the AP Calculus AB or BC tests are exempt from the MPT.\nIf Computer Engineering majors elect to take CHEM 101 to satisfy their science elective requirement, the Chemistry Placement Test (CPT) is required with a score of 40 or higher prior to enrolling in CHEM 101. Students who have had high school chemistry and expect to enroll in CHEM 101 must take this test regardless of their score on the AP Chemistry exam. Students who do not receive this CPT score must receive a grade of “C” or better in CHEM 100 before taking CHEM 101.\nSpecial Grade Requirements\nAll students must complete the lower division writing requirement before enrolling in 300-level engineering courses.\nA grade of “C-” or better is required in all courses in the major. A grade of “C” or better is required in all undergraduate transfer courses.\nSenior-level courses cannot be taken unless the student previously completed or is concurrently completing all freshman-, sophomore- and junior-level core requirements.\nA grade of “C” or higher is necessary in MATH 150B to meet the prerequisite requirements for the next-level math courses.\nCourse Requirements\nThe Computer Engineering program requires a minimum of 123 units total, including General Education requirements of 27 units, a Computer Engineering core of 90 units and a minimum of 6 units of an approved elective. Computer Engineering majors must complete a minimum of 30 semester units of upper division Computer Engineering courses in residency, including Senior Design Project I and II.\nAdditional information about this program and its facilities, faculty and students can be found on the Department of Electrical and Computer Engineering website.\n1. Lower Division Required Courses (42 units)\nFreshman Year\nBIOL 106 Biological Principles I (3)\nCOMP 110/L Introduction to Algorithms and Programming and Lab (3/1)\nCOMP 182/L Data Structures and Program Design and Lab (3/1)\nMATH 150A Calculus I (5)\nMATH 150B Calculus II (5)\nPHYS 220A Mechanics (3)\nPHYS 220AL Mechanics Lab (1)\nSophomore Year\nCOMP 282 Advanced Data Structures (3)\nECE 240 Electrical Engineering Fundamentals (3)\nECE 240L Electrical Engineering Fundamentals Lab (1)\nMATH 250 Calculus III (3)\nMATH 280 Applied Differential Equations (3)\nor ECE 280 Applied Differential Equations (3)\nPHYS 220B Electricity and Magnetism (3)\nPHYS 220BL Electricity and Magnetism Lab (1)\n2. Math and Science Electives (3 units)\nSelect a minimum of 3 units from the following list with corresponding lab if one exists:\nBIOL 106L Biological Principles I Lab (1)\nBIOL 107 Biological Principles II (3)\nBIOL 107L Biological Principles II Lab (1)\nCHEM 101 General Chemistry I (3)\nCHEM 101D Problem Solving in General Chemistry I (1)\nCHEM 101L General Chemistry I Lab (1)\nCHEM 102 General Chemistry II (3)\nCHEM 102D Problem Solving in General Chemistry II (1)\nCHEM 102L General Chemistry II Lab (1)\nMATH 262 Introduction to Linear Algebra (3)\nMATH 326 Discrete Mathematics (3)\nPHYS 227 Physics III (4)\nPHYS 227L Physics III Lab (1)\nPHYS 375 Quantum Physics I (3)\n3. Upper Division Required Courses (39 units)\nNote: All students must complete the lower division writing requirement before enrolling in any 300-level course.\nJunior Year\nECE 309 Numerical Methods in Electrical Engineering (2)\nECE 320/L Theory of Digital Systems and Lab (3/1)\nECE 340/L Electronics I and Lab (3/1)\nECE 350 Linear Systems I (3)\nECE 351 Linear Systems II (3)\nMSE 304 Engineering Economy (3)\nSenior Year\nThe senior year must include a capstone design experience and additional courses with design content so that the student’s total engineering program contains at least one semester of engineering design. This engineering design requirement must be taken in residency. An advisor and the department chair must approve all senior year electives.\nECE 420 Digital Systems Design with Programmable Logic (3)\nECE 422 Design of Digital Computers (3)\nECE 425/L Microprocessor Systems and Lab (3/1)\nECE 442/L Digital Electronics and Lab (3/1)\nECE 450 Probabilistic Systems in Electrical Engineering Design and Analysis (3)\nECE 492 Senior Design Project-Electrical I (2)\nECE 493 Senior Design Project-Electrical II (1)\n4. Upper Division Electives (12 units)\nSelect a minimum of 12 units from the following:\nCOMP 322/L Introduction to Operating Systems and System Architecture and Lab (3/1)\nCOMP 380/L Introduction to Software Engineering (2/1)\nCOMP 424 Computer System Security (3)\nCOMP 429 Computer Network Software (3)\nCOMP 522 Embedded Applications (3)\nCOMP 529/L Advanced Network Topics and Lab (2/1)\nCOMP 539 Network Infrastructure (3)\nCOMP 581 Open Source Software (3)\nECE 422L Design of Digital Computers Lab (1)\nECE 443/L Pulse and Waveshaping Circuit Design and Lab (3/1)\nECE 520/L System on Chip Design and Laboratory (3/1)\nECE 524/L FPGA/ASIC Design and Optimization Using VHDL and Lab (3/1)\nECE 526/L Digital Design with Verilog and System Verilog and Lab (3/1)\nECE 527/L Application Specific Integrated Circuit Development and Lab (3/1)\nECE 546 Very Large Scale Integrated Circuit Design (3)  \nECE 551 Image Processing (3)\nECE 562 Data Communication Network (3)\nNote: Some elective courses have prerequisites that are not part of the required program. All courses must include the lab, if one exists. Other courses may be selected with the approval of the ECE department chair. The total number of units in the major is 96.\n5. General Education (48 units)\nUndergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.\n21 units are satisfied by coursework in the major. Completion of the Computer Engineering major satisfies A3 Critical Thinking. PHYS 220A satisfies B1 Physical Science; BIOL 106 satisfies B2 Life Science; PHYS 220AL satisfies B3 Science Laboratory Activity; MATH 150A satisfies Basic Skills B4 Mathematics/Quantitative Reasoning; ECE 340 satisfies B5 Scientific Inquiry and Quantitative Reasoning; MSE 304 satisfies 3 units of upper division D1 Social Science; and COMP 110/L satisfies E Lifelong Learning.\nTotal Units in the Major: 96\nGeneral Education Units: 27\nTotal Units Required for the Degree: 123"
}