{
    "name": "B.S., Computer Science",
    "prog-reqq-blob": "Program Requirements\nThe B.S. in Computer Science program requires a total of 120 units, including General Education requirements, major core courses and a 15-unit senior electives package. To graduate, a student must complete a minimum of 18 residency units from the list of upper division required courses listed below in addition to all other institutional residency requirements.\nSpecial Grade Requirements\nCarefully check course prerequisites as many courses in the major require grades of “C” or better in prerequisite courses.\nNo grade lower than a “C” will be accepted on transfer from another institution to satisfy Computer Science requirements. Where specific grade requirements are not specified, no CSUN grade lower than a “C-” will be accepted for courses required in the Computer Science program.\n1. Lower Division Required Courses (36 units)\nCOMP 110/L Introduction to Algorithms and Programming and Lab (3/1)\nCOMP 122/L Computer Architecture and Assembly Language and Lab (1/1)\nCOMP 182/L Data Structures and Program Design and Lab (3/1)\nCOMP 222 Computer Organization (3)\nCOMP 256/L Discrete Structures for Computer Science and Lab ( 3/1)\nCOMP 282 Advanced Data Structures (3)\nMATH 150A Calculus I (5)\nMATH 150B Calculus II (5)\nMATH 262 Introduction to Linear Algebra (3)\nPHIL 230 Introduction to Formal Logic (3)\n2. Lower Division Electives (12-14 units)\na. Select one of the following science sequences (8-10 units)\nBIOL 106/BIOL 106L Biological Principles I and Lab (3/1)\nand BIOL 107/BIOL 107L Biological Principles II and Lab (3/1)*\nCHEM 101/CHEM 101D/CHEM 101L General Chemistry I and Discussion and Lab (3/1/1)\nand CHEM 102/CHEM 102D/CHEM 102L General Chemistry II and Discussion and Lab (3/1/1)\nPHYS 220A/PHYS 220AL Mechanics and Lab (3/1)\nand PHYS 220B/PHYS 220BL Electricity and Magnetism and Lab (3/1)\n*BIOL 107/L has recommended prerequisites of CHEM 101 and CHEM 101L.\nb. Select an additional science course with corresponding lab outside of the sequence selected above (4-5 units)\nBIOL 106/BIOL 106L Biological Principles I and Lab (3/1)\nCHEM 101/CHEM 101D/CHEM 101L General Chemistry I and Discussion and Lab (3/1/1)\nGEOG 101/GEOG 102 The Physical Environment and Lab (3/1)\nGEOG 103/GEOG 105 Weather and Lab (3/1)\nGEOL 101/GEOL 102 Geology of Planet Earth and Lab (3/1)\nGEOL 110/GEOL 112 Earth and Life through Time and Lab (3/1)\nPHYS 220A/PHYS 220AL Mechanics and Lab (3/1)\n3. Upper Division Required Courses (24 units)\nBefore taking upper division courses in Computer Science, students must be admitted to the Computer Science major/minor programs, the Computer Information Technology major program, the Computer Engineering major program or the Information Systems/Information Technology major program.\nCOMP 310 Automata, Languages and Computation (3)\nCOMP 322/L Introduction to Operating Systems and System Architecture and Lab (3/1)\nCOMP 333 Concepts of Programming Languages (3)\nCOMP 380/L Introduction to Software Engineering and Lab (2/1)\nCOMP 482 Algorithm Design and Analysis (3)\nor MATH 482 Combinatorial Algorithms (3)\nCOMP 490/L Senior Design Project and Lab (3/1)\nCOMP 491L Senior Project Lab (1)\nSelect one of the following:\nMATH 340 Probability (3)\nMATH 341 Applied Statistics I (3)\n4. Upper Division Electives (15 units)\nComputer Science majors are required to take 15 units of senior electives.\nThe senior electives must consist of 15 units of 400- or 500-level courses in Computer Science (not COMP 450, 480/L, 482, 490/L, 491L, 494 or 499). The electives may include MATH 481A (Numerical Analysis) as 3 of the 15 units.\nRequests for taking a 400- or 500-level course as a senior elective that does not meet the requirements stated above must be approved by the student’s faculty advisor and by the department chair prior to enrollment in the course.\nIt is strongly recommended that students discuss their career goals with an advisor prior to selecting their senior electives. The advisor will suggest appropriate courses for the student to consider.\n5. General Education (48 units)\nUndergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.\n18 units are satisfied by coursework in the major. Completion of the Computer Science major satisfies A3 Critical Thinking. 6 units of Physical Science or Life Science may be used to satisfy sections B1-3. MATH 150A satisfies Basic Skills B4 Mathematics/Quantitative Reasoning; COMP 310 satisfies B5 Scientific Inquiry and Quantitative Reasoning; and COMP 110/L satisfies E Lifelong Learning.\nTotal Units in the Major: 87-89\nGeneral Education Units: 30\nAdditional Units: 1-3\nTotal Units Required for the B.S. Degree: 120",
    "general-education": "General Education (48 units)\nUndergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.\n18 units are satisfied by coursework in the major. Completion of the Computer Science major satisfies A3 Critical Thinking. 6 units of Physical Science or Life Science may be used to satisfy sections B1-3. MATH 150A satisfies Basic Skills B4 Mathematics/Quantitative Reasoning; COMP 310 satisfies B5 Scientific Inquiry and Quantitative Reasoning; and COMP 110/L satisfies E Lifelong Learning.\n"
    
}