{
    "name": "B.S., Mechanical Engineering",
    "prog-reqq-blob": "Program Requirements\nThe Mechanical Engineering program assumes that students have a strong high school preparation in science, mathematics and English. High school courses should include four years of mathematics, four years of English and at least one year of Chemistry and Physics with labs. The mathematics courses should include geometry, trigonometry and algebra. Calculus is desirable.\nCSUN provides the opportunity for students who have not had a complete background of pre-engineering work in high school to take courses to prepare for the major. These additional courses will not count toward the major and may increase the time to graduate. CSUN provides testing as outlined below to ensure that students start their engineering coursework at an appropriate level.\nPlacement Exam Requirements\nStudents entering the Mechanical Engineering program need to take the following exams:\nThe Mathematics Placement Test (MPT) is required prior to enrollment in MATH 150A. Students should take this exam before enrolling in their classes so they may be placed in the appropriate mathematics course. Students with scores of 4 or 5 on the AP Calculus AB or BC exams are exempt from the MPT.\nThe Chemistry Placement Test (CPT) is required with a minimum score of 40 prior to enrolling in CHEM 101. Students who have had high school chemistry and expect to enroll in CHEM 101 must take this test regardless of their score on the AP Chemistry exam. Students who do not achieve this CPT score must complete CHEM 100 with a grade of “C” or better before taking CHEM 101.\nSpecial Grade Requirements\nAll students must complete the lower division writing requirement before enrolling in any 300-level engineering courses.\nA grade of “C-” or better is required in all courses in the major. A grade of “C” or better is required in all undergraduate transfer courses.\nSenior-year courses cannot be taken unless the student has previously completed, or is concurrently completing, all freshman-, sophomore- and junior-year requirements.\nA grade of “C” or higher is necessary in MATH 150B to meet the prerequisite requirements for the next-level math courses.\nCourse Requirements\n1. Lower Division Required Courses (47 units)\na. Freshman Year\nCHEM 101 General Chemistry I (3)\nCHEM 101D Problem Solving in General Chemistry I (1)\nCHEM 101L General Chemistry I Lab (1)\nMATH 150A Calculus I (5)\nMATH 150B Calculus II (5)\nME 101/L Introduction to Mechanical Engineering and Lab (1/1)\nME 186/L Computer-Aided Design and Lab (1/1)\nPHYS 220A Mechanics (3)\nPHYS 220AL Mechanics Lab (1)\nb. Sophomore Year\nCE 240 Engineering Statics (3)\nECE 240 Electrical Engineering Fundamentals (3)\nECE 240L Electrical Engineering Fundamentals Lab (1)\nMATH 250 Calculus III (3)\nMATH 280 Applied Differential Equations (3)\nor ECE 280 Applied Differential Equations in Electrical Engineering (3)\nor ME 280 Differential Equations for Mechanical Engineers (3)\nME 209 Programming for Mechanical Engineers (1)\nME 286 Mechanical Engineering Design (2)\nMSE 227 Engineering Materials (3)\nMSE 227L Engineering Materials Lab (1)\nPHYS 220B Electricity and Magnetism (3)\nPHYS 220BL Electricity and Magnetism Lab (1)\n2. Upper Division Required Courses (52 units)\na. Junior Year\nAM 316 Engineering Dynamics (3)\nAM 317 Mechanics Lab (1)\nCE 340 Strength of Materials (3)\nME 309 Numerical Analysis of Engineering Systems (2)\nME 330 Machine Design (3)\nME 335/L Mechanical Measurements and Lab (1/1)\nME 370 Thermodynamics (3)\nME 375 Heat Transfer I (3)\nME 386/L Computer-Aided Analysis and Design and Lab (2/1)\nME 390 Fluid Mechanics (3)\nMSE 304 Engineering Economic Analysis (3)\nb. Senior Year\nME 384 System Dynamics: Modeling, Analysis and Simulation (3)\nME 435/L Mechatronics and Lab (2/1)\nME 486A Senior Design in Mechanical Engineering I (2)\nME 486B Senior Design in Mechanical Engineering II (2)\nME 491 Experimental Methods in Thermal-Fluids Systems (1)\nc. Upper Division Senior Electives (12 units)\nStudents must select 12 units of electives from 400- and/or 500-level engineering courses. These electives, together with the required senior-year courses listed above, constitute the student’s Mechanical Engineering senior year. The elective program must be approved by the Mechanical Engineering department before the student files a graduation check. Up to 6 units from the following list of non-ME courses may be taken as senior electives.\nAM 410 Vibration Analysis (3)\nCE 460/L Engineering Hydrology and Lab (2/1)\nCE 487 Water Pollution (3)\nECE 410/L Electrical Machines and Energy Conversion and Lab (3/1)\nECE 411 Electric Power Systems (3)\nECE 412 Power Electronics (3)\nECE 420 Digital Systems Design with Programmable Logic (3)\nECE 425/L Microprocessor Systems and Lab (3/1)\nECE 440/L Electronics II and Lab (3/1)\nECE 501 Introduction to Biomedical Engineering (3)\nMSE 527/L Mechanical Behavior of Materials and Lab (2/1)\n3. General Education (27 units)\nUndergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.\n21 units are satisfied by coursework in the major. Completion of the Mechanical Engineering major satisfies A3 Critical Thinking. 6 units of Physical Science may be used to satisfy sections B1-3. MATH 150A satisfies Basic Skills B4 Mathematics/Quantitative Reasoning; ME 370 satisfies B5 Scientific Inquiry and Quantitative Reasoning; MSE 304 satisfies 3 units of upper division D1 Social Sciences; and ME 101/L and ME 209 satisfy E Lifelong Learning.\nTotal Units in the Major: 99\nGeneral Education Units: 27\nTotal Units Required for the B.S. Degree: 126"
}