{
    "name": "B.S., Accountancy: Professional Accountancy",
    "prog-reqq-blob": "Program Requirements\nBusiness Majors\nA Business major is any student majoring in Accountancy; Information Systems; or Business Administration with an option in either Business Analytics, Business Law, Financial Analysis, Financial Planning, Global Supply Chain Management, Management, Marketing, Real Estate, Risk Management and Insurance, or Systems and Operations Management. The following are impacted majors with additional admission requirements: the B.S. in Accountancy and the B.S. in Business Administration with options in Financial Analysis, Financial Planning, and Risk Management and Insurance. All Business majors share 27 units of common lower division core courses and 19 units of common upper division core courses.\nDouble Major Requirements\nStudents seeking a double major in the David Nazarian College of Business and Economics must have at least a 3.0 overall GPA and be able to complete both majors within a maximum of 140 units.\nTransfer Course Requirements\nStudents should be aware that no grade lower than a “C” will be accepted on transfer from another institution to satisfy department or David Nazarian College of Business and Economics requirements.\nResidency Requirement\nAt least 50 percent of the business and economics course credit units and 50 percent of the specialized major credit units required for the Bachelor of Science degrees in Accountancy, Business Administration, or Information Systems and the Bachelor of Arts degree in Economics must be completed in residence at CSUN.\nEnrollment Requirements for ACCT 350\nA predetermined number of students are approved each semester to enroll in ACCT 350 through a competitive application process. The application and instructions are available on the Department of Accounting website. To obtain approval from the Admissions Committee to enroll in ACCT 350, students must first satisfy the following requirements:\nCompletion of ENGL 205 and ACCT 220 with a grade of “B” or higher in each.\nCompletion of ACCT 230, BLAW 280, ECON 160, ECON 161, IS 212, MATH 103, and SOM 120 (or MATH 140 or MATH 140BUS) with a grade of “C” or higher in each.\nAn overall and CSUN GPA of 3.2 or higher for continuing CSUN students or an overall GPA of 3.2 or higher for first-semester transfer students. A minimum GPA of 3.0 shall satisfy this requirement if seats are available.\nDeclared as a Pre-Accountancy major.\nCompletion of a minimum of 60 units of college work (junior class standing). For transfer students, the units must be CSU transferable.\nAdmission to the Accountancy Major\nUpon completion of ACCT 350 with a grade of “C” or higher, students are eligible to apply for admission to the Accountancy major. At the time of application, students must have successfully completed the Pre-Accountancy portion of the major and maintained both an overall and CSUN GPA of 3.0 or higher. The program application and instructions are available on the Department of Accounting website.\nCourse Requirements\n1. Common Lower Division Business Core (27-28 units)\nPre-Accountancy Major\nACCT 220 Introduction to Financial Accounting (3)\nACCT 230 Introduction to Managerial Accounting (3)\nBLAW 280 Business Law I (3)\nECON 160 Principles of Microeconomics (3)\nECON 161 Principles of Macroeconomics (3)\nENGL 205 Business Communication in Its Rhetorical Contexts (3)\nIS 212 Information System for Business Users (3)\nMATH 103 Mathematical Methods for Business (3)\nSOM 120 Basic Business Statistics (3)\nor MATH 140 Introductory Statistics (4)\nor MATH 140BUS Introductory Statistics for Business (4)\n2. Upper Division Business Core (19 units)\nBUS 302 The Gateway Experience (3)\nBUS 302L The Gateway Experience Laboratory (1)\nBUS 497A or BUS 497B Capstone (3)\nFIN 303 Financial Management (3)\nMGT 360 Management and Organizational Behavior (3)\nMKT 304 Marketing Management (3)\nSOM 306 Operations Management (3)\n3. Other Required Business Courses (6 units)\nBLAW 308 Business Law II (3)\nIS 312 Systems and Technologies for Managers (3)\n4. Required Accounting Courses (25 units)\nACCT 350 Intermediate Financial Accounting I (3)\nACCT 351 Intermediate Financial Accounting II (3)\nACCT 352 Intermediate Financial Accounting III (3)\nACCT 380 Cost Accounting (3)\nACCT 412L Excel Specialist Certification (1)\nACCT 440 Income Tax I (3)\nACCT 460 Auditing Principles and Analytics (3)\nCOMS 356 Intercultural Communication (3)\nRS 361 Contemporary Ethical Issues (3)\n5. Professional Accountancy Option (15 units)\nACCT 441 Income Tax II (3)\nACCT 450 Advanced Financial Accounting (3)\nACCT 475 Governmental and Nonprofit Accounting (3)\nSelect one of the following courses:\nBLAW 368 Law, Business and Ethics (3)\nJS 318 Applied Jewish Ethics (3)\nPHIL 305 Business Ethics and Public Policy (3)\nSelect one of the following courses:\nACCT 465 Advanced Auditing (3)\nACCT 497A-Z Special Topics in Accounting (3)\nACCT 542 Introduction to Federal Tax Procedure (3)\n6. General Education (48 units)\nUndergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.\n21 units are satisfied by the following courses in the major: MATH 103 satisfies Basic Skills B4 Mathematics/Quantitative Reasoning; FIN 303 satisfies B5 Scientific Inquiry and Quantitative Reasoning; RS 361 satisfies upper division C2 Humanities; ECON 160 and ECON 161 satisfy D1 Social Sciences; IS 212 satisfies E Lifelong Learning and fulfills the Information Competence requirement; and COMS 356 satisfies 3 units in upper division F Comparative Cultural Studies.\nTotal Units in the Major/Option: 92-93\nGeneral Education Units: 27\nAdditional Units: 0-1\nTotal Units Required for the B.S. Degree: 120\nCPA Licensure\nTo obtain CPA licensure, a 3-unit accounting ethics course such as ACCT 511 or equivalent is required. ACCT 511 may be taken by undergraduate students.",
    "general-education": "General Education (48 units)\nUndergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.\n21 units are satisfied by the following courses in the major: MATH 103 satisfies Basic Skills B4 Mathematics/Quantitative Reasoning; FIN 303 satisfies B5 Scientific Inquiry and Quantitative Reasoning; RS 361 satisfies upper division C2 Humanities; ECON 160 and ECON 161 satisfy D1 Social Sciences; IS 212 satisfies E Lifelong Learning and fulfills the Information Competence requirement; and COMS 356 satisfies 3 units in upper division F Comparative Cultural Studies.\n"
}