{
    "name": "B.S., Electrical Engineering",
    "prog-reqq-blob": "Program Requirements\nThe Electrical Engineering program is based on an expectation of adequate high school preparation in science, mathematics and English. High school courses should include algebra, plane geometry, trigonometry, chemistry or physics (all desirable), and four years of English.\nCSUN provides the opportunity for students who have not had a complete background of pre-engineering work in high school to take courses to prepare for the major. These additional courses will not count toward the major and may increase the time to graduate. CSUN provides testing as outlined below to ensure that students start their engineering coursework at an appropriate level.\nPlacement Exam Requirements\nThe Mathematics Placements Test (MPT) is required prior to enrollment in MATH 150A. Students should take this exam before enrolling in their classes so they may be placed in the appropriate mathematics course. Students with scores of 4 or 5 on the AP Calculus AB or BC tests are exempt from the MPT.\nThe Chemistry Placement Test (CPT) is required with a score of 40 or higher prior to enrolling in CHEM 101. Students who have had high school chemistry and expect to enroll in CHEM 101 must take this test regardless of their score on the AP Chemistry exam. Students who do not receive this CPT score must receive a grade of “C” or better in CHEM 100 before taking CHEM 101.\nSpecial Grade Requirements\nAll students must complete the lower division writing requirement before enrolling in 300-level engineering courses.\nA grade of “C-” or better is required in all courses in the major. A grade of “C” or better is required in all undergraduate transfer courses.\nSenior-level courses cannot be taken unless the student previously completed or is concurrently completing all freshman-, sophomore- and junior-level core requirements.\nA grade of “C” or higher is necessary in MATH 150B to meet the prerequisite requirements for the next-level math courses.\nCourse Requirements\nThe B.S. in Electrical Engineering program requires a minimum of 126 units total, including General Education requirements of 27 units, an Electrical Engineering core of 81 units and a minimum of 18 units of approved electives. Electrical Engineering majors must complete a minimum of 39 semester units of upper division engineering courses in residency, including Senior Design Project I and II.\nAdditional information about this program and its facilities, faculty and students can be found on the Department of Electrical and Computer Engineering website.\n1. Lower Division Required Courses (44 units)\nFreshman Year\nCHEM 101 General Chemistry I (3)\nCHEM 101D Problem Solving in General Chemistry I (1)\nCHEM 101L General Chemistry I Lab (1)\nECE 101/L Introduction to Electrical Engineering and Lab (1/1)\nECE 206/L Computing for Electrical Engineering and Lab (2/1)\nMATH 150A Calculus I (5)\nMATH 150B Calculus II (5)\nPHYS 220A Mechanics (3)\nPHYS 220AL Mechanics Lab (1)\nSophomore Year\nCE 240 Engineering Statics (3)\nECE 240 Electrical Engineering Fundamentals (3)\nECE 240L Electrical Engineering Fundamentals Lab (1)\nMATH 250 Calculus III (3)\nMATH 280 Applied Differential Equations (3)\nor ECE 280 Applied Differential Equations in Electrical Engineering (3)\nMSE 227 Engineering Materials (3)\nPHYS 220B Electricity and Magnetism (3)\nPHYS 220BL Electricity and Magnetism Lab (1)\n2. Upper Division Required Courses (37 units)\nNote: All students must complete the lower division writing requirement before enrolling in any 300-level engineering courses.\nJunior Year\nECE 309 Numerical Methods in Electrical Engineering (2)\nECE 320/L Theory of Digital Systems and Lab (3/1)\nECE 340/L Electronics I and Lab (3/1)\nECE 350 Linear Systems I (3)\nECE 351 Linear Systems II (3)\nECE 455 Mathematical Models in Electrical Engineering (3)\nMSE 304 Engineering Economy (3)\nSelect one of the following 3 unit courses:\nME 370 Thermodynamics (3)\nME 376 Heat Transfer in Electrical and Electronic Systems (3)\nSenior Year\nThe senior core consists of a set of courses considered essential for all students seeking a career in electrical engineering.\nECE 370 Electromagnetic Fields and Waves I (3)\nECE 450 Probabilistic Systems in Electrical Engineering (3)\nECE 480 Fundamentals of Control Systems (3)\nECE 492 Senior Design Project-Electrical I (2)\nECE 493 Senior Design Project-Electrical II (1)\n3. Upper Division Electives (18 units)\nThe senior elective packages must contain at least 18 units of 400-/500-level department courses and labs that are well balanced in both design and analysis. One of the electives must be either ECE 440/L (3/1) or ECE 442/L (3/1). Students will be required to take the corresponding labs for every elective chosen that offers a lab. For each lab taken, the corresponding lecture course is a corequisite. The student’s total engineering program should contain at least 18 units of engineering design.\nNote: Students can take ECE 370L and/or ECE 480L as part of their senior electives.\nAll senior electives must be completed with a faculty advisor and approved by the department chair or designee. A number of examples of suggested senior elective packages in the Electrical Engineering degree are available in the department office. Other programs also are possible and may be developed with an advisor.\n4. General Education (48 units)\nUndergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.\n21 units are satisfied by coursework in the major. Completion of the Electrical Engineering major satisfies A3 Critical Thinking. 6 units of Physical Science may be used to satisfy sections B1-3. MATH 150A satisfies Basic Skills B4 Mathematics/Quantitative Reasoning; ECE 340 satisfies B5 Scientific Inquiry and Quantitative Reasoning; MSE 304 satisfies 3 units of upper division D1 Social Sciences; and ECE 206/L satisfies E Lifelong Learning.\nTotal Units in the Major: 99\nGeneral Education Units: 27\nTotal Units Required for the Degree: 126"
}