{
    "name": "B.S., Manufacturing Systems Engineering",
    "prog-reqq-blob": "Program Requirements\nThe Manufacturing Systems Engineering program is based on an expectation of adequate high school preparation in science, mathematics and English. High school courses should include algebra, plane geometry, trigonometry and chemistry or physics (both desirable), and 4 years of English.\nCSUN provides the opportunity for students who have not had a complete background of pre-engineering work in high school to take courses to prepare for the major. These additional courses will not count toward the major and may increase the time to graduate. CSUN provides testing as outlined below to ensure that students start their engineering coursework at an appropriate level.\nPlacement Exam Requirements\nThe Mathematics Placement Test (MPT) is required prior to enrollment in MATH 150A. Students should take this exam before enrolling in their classes so they may be placed in the appropriate mathematics course. Students with scores of 4 or 5 on the AP Calculus AB or BC exams are exempt from the MPT.\nThe Chemistry Placement Test (CPT) is required with a minimum score of 40 prior to enrolling in CHEM 101. Students who have had high school chemistry and expect to enroll in CHEM 101 must take this test regardless of their score on the AP Chemistry exam. Students who do not achieve this CPT score must complete CHEM 100 with a grade of “C” or better before taking CHEM 101.\nSpecial Grade Requirements\nAll students must complete the lower division writing requirement before enrolling in 300-level engineering courses.\nA grade of “C-” or better is required in all courses in the major. A grade of “C” or better is required in all undergraduate transfer courses.\nSenior-level courses cannot be taken unless the student previously completed or is concurrently completing all freshman-, sophomore- and junior-level core requirements.\nA grade of “C” or higher is necessary in MATH 150B to meet the prerequisite requirements for the next-level math courses.\n1. Lower Division Required Courses (45 units)\nFreshman Year\nCHEM 101 General Chemistry I (3)\nCHEM 101D Problem Solving in General Chemistry I (1)\nCHEM 101L General Chemistry I Lab (1)\nMATH 150A Calculus I (5)\nMATH 150B Calculus II (5)\nMSE 101/L Introduction to Engineering and Lab (1/1)\nPHYS 220A Mechanics (3)\nPHYS 220AL Mechanics Lab (1)\nSophomore Year\nCE 240 Engineering Statics (3)\nECE 240 Electrical Engineering Fundamentals (3)\nECE 240L Electrical Engineering Fundamentals Lab (1)\nMATH 250 Calculus III (3)\nMATH 280 Applied Differential Equations (3)\nMSE 227 Engineering Materials (3)\nMSE 227L Engineering Materials Lab (1)\nMSE 248/L Engineering CAD and Graphics and Lab (2/1)\nPHYS 220B Electricity and Magnetism (3)\nPHYS 220BL Electricity and Magnetism Lab (1)\n2. Upper Division Required Courses (37 units)\nJunior Year\nAM 316 Engineering Dynamics (3)\nor ME 370 Thermodynamics (3)\nCE 340 Strength of Materials (3)\nMSE 304 Engineering Economic Analysis (3)\nMSE 362 Engineering Statistical Applications (3)\nMSE 402 Engineering Project Management (3)\nMSE 407 Manufacturing Systems (3)\nMSE 409/L Fundamentals of Computer-Aided Manufacturing and Lab (2/1)\nMSE 412/L Manufacturing Processes and Lab (2/1)\nSenior Year\nMSE 403CS Facilities Planning and Design (3)\nMSE 410/L Production Systems Modeling and Lab (2/1)\nMSE 415 Product Design (3)\nMSE 488A MSEM Senior Design I (2)\nMSE 488BCS MSEM Senior Design II (2)\n3. Upper Division Major Elective Courses (12 units)\nSelect four courses from among department 400-level and/or 500-level courses.\n4. General Education (48 units)\nUndergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.\n21 units are satisfied by coursework in the major. Completion of the Manufacturing Systems Engineering major satisfies A3 Critical Thinking. 6 units of Physical Science may be used to satisfy sections B1-3. MATH 150A satisfies Basic Skills B4 Mathematics/Quantitative Reasoning; MSE 362 satisfies B5 Scientific Inquiry and Quantitative Reasoning; MSE 304 satisfies 3 units of upper division D1 Social Sciences; and MSE 248/L satisfies E Lifelong Learning.\nTotal Units in the Major: 94\nGeneral Education Units: 27\nTotal Units Required for the Degree: 121"
}