{
    "name": "B.S., Nursing: Accelerated",
    "prog-reqq-blob": "Program Requirements\nAcademic Policies\nNursing courses from other programs may be considered nonequivalent and cannot be transferred into this program with the exception of NURS 307/L.\nStudents are admitted as a cohort. Should progression through the curriculum be interrupted, students whose progress is interrupted will need to reapply to the program and will be considered on a space-available basis. All nursing courses must be completed within 5 years after taking the first nursing course.\nA minimum grade of “C” is required in all prerequisite and nursing courses. A grade of “C-” will require the student to repeat the course or concurrent theory/lab courses. All nursing courses may be repeated only once with a maximum of 15 repeated units. Students progressing on schedule through the program will be given priority space in classes, and students repeating courses will be considered only on a space-available basis. The need to repeat some courses may interfere with the repeating student’s ability to complete the degree.\nStudents must enroll and pass concurrently both theory and clinical laboratory components of each area of study that contains these components.\nDue to clinical requirements imposed by clinical affiliates, students are required to obtain and maintain at their sole cost the following clinical requirements: health exams and immunizations; evidence of TB test, titers or other required tests; background check; drug screening; nursing liability insurance; CPR certification; fire safety card; HIPPA and Bloodborne Pathogen training; and any other requirements deemed necessary by the clinical affiliates. Students must complete a preclinical checklist and provide proof that requirements are met 4 weeks prior to the start of their first clinical course. If an affiliating clinical agency notifies faculty that they are refusing clinical placement to a student based on a background check or drug screen, the student will be unable to complete the required clinical laboratory coursework, be unable to progress in the program and, thus, be unable to meet degree requirements.\nAccess to reliable transportation is required for clinical courses off campus.\nDue to the clinical requirements imposed by external clinical partners, students must be prepared to attend clinical rotations in the community settings any day of the week, including weekends and at various times of the day, including evenings and nights. No reasonable student accommodation to clinical scheduling can be made given the cohort nature of the program and the external limitations placed on the department by hospitals and other clinical settings. Clinical rotations can change each academic semester or year given external assignments of times and days.\nGiven the cohort nature of the program and the program’s requirements to match the clinical schedule offered to our students by our affiliating clinical agencies, scheduled clinical dates, times and hours cannot be modified to meet students’ personal needs. Clinical rotations can change each academic semester or year according to changes in clinical agencies’ schedules.\nThe faculty reserves the right to make program modifications as necessary to meet current professional standards, Board of Registered Nursing requirements and accreditation criteria.\nPrior to and during clinical placements, students are required to demonstrate professional maturity and physical, emotional, ethical and moral fitness for clinical practice.\nA. Requirements for Admission to A-BSN Pathway\nAn earned bachelor’s degree from an accredited institution with a GPA of 3.21 or better or a master’s degree of 3.0 or better.\nAll prerequisite course grades must be “C” or higher. All science prerequisites must have been completed within the past 7 years. Courses that have been taken at an upper division undergraduate level or that combine prerequisite content (e.g., single course of 5 semester units in anatomy and physiology with lab) will be considered on a case-by-case basis as potentially meeting minimum requirements.\nA personal interview may be requested of all applicants.\nPotential applicants should consult The Tseng College Accelerated Bachelor of Science Nursing website for up-to-date information on application deadlines and procedures.\nB. Requirements for the Accelerated Bachelor of Science in Nursing\n1. Prerequisite Courses (28 units)\nAny of the following courses or their equivalents that were completed as part of the first degree program do not need to be repeated. Course equivalencies can be checked at ASSIST or with the help of an advisor.\nAll science prerequisites must have been completed within the past 7 years.\nScience Prerequisites (19 units)\nBIOL 211/BIOL 212 Human Anatomy and Lab (2/1)\nBIOL 215/L Introductory Microbiology and Lab (2/2)\nBIOL 281/BIOL 282 Human Physiology and Lab (3/1)\nCHEM 103/CHEM 103L Introductory Chemistry I and Lab (3/1)\nMATH 140 Introductory Statistics (4)\nGeneral Education courses from the following sections (9 units)\nA1 Oral Communication (3)\nA2 Written Communication (3)\nA3 Critical Thinking (3)\n2. Required Courses for the BSN Program (58 units)\nNURS 302 Pathophysiology (3)\nNURS 307/L Health Assessment and Lab (2/1)\nNURS 310 Nursing Research and Evidence-Based Practice (3)\nNURS 315 Pharmacology (3)\nNURS 318/L Introduction to Professional Nursing and Lab (3/4)\nNURS 320/L Intermediate Medical Surgical Nursing and Clinical Lab (4/3)\nNURS 422/L Advanced Medical Surgical Nursing and Clinical Laboratory (4/4)\nNURS 426 Nursing Systems Issues and Ethics (3)\nNURS 427/L Dynamics of Nursing Leadership and Leadership in Nursing Lab (3/1)\nNURS 428/L Community and Population Health Nursing and Lab (3/2)\nNURS 430/L Psychiatric/Mental Health Nursing and Clinical Laboratory (2/1)\nNURS 443/L Nursing Care of Children and Clinical Lab (2/1.5)\nNURS 444/L Nursing Care of Childbearing Family and Clinical Lab (2/1.5)\nNURS 498L Clinical Intensive (2) \nTotal Units Required Beyond Original B.A./B.S. Degree: 58"
}