{
    "name": "B.S., Mathematics: Statistics",
    "prog-reqq-blob": "Program Requirements\nRequirements\nIn addition to University residence requirements for a bachelor’s degree, the student must complete a minimum of 18 units of upper division Mathematics in residence at CSUN with the approval of a Mathematics advisor. Students in B.A. degree programs must fulfill the University requirement of at least 40 units of upper division coursework overall.\nIt is assumed that the student has a facility in mathematics normally gained by recent completion of four years of high school mathematics through trigonometry and “Mathematical Analysis.” Because of the variation in curricula at the high school level, it is necessary to obtain satisfactory scores on the Mathematics Placement Test (MPT) to enter the first mathematics course in the program, MATH 150A. Without satisfactory scores, a student will need to complete additional coursework.\n1. Lower Division Core for All Programs (23-24 units)\nCOMP 106/L Computing in Engineering and Science and Lab (2/1)\nor COMP 110/L Introduction to Algorithms and Programming and Lab (3/1)\nMATH 150A Calculus I (5)\nMATH 150B Calculus II (5)\nMATH 250 Calculus III (3)\nMATH 262 Introduction to Linear Algebra (3)\nPHYS 220A Mechanics (3)\nPHYS 220AL Mechanics Lab (1)\nStudents must complete the lower division core and one of the Mathematics options, and they must have at least a 2.0 GPA for all upper division units required in the major.\n2. Upper Division Required Courses (30 units)\nMATH 320 Foundations of Higher Mathematics (3)\nMATH 340 Introductory Probability (3)\nMATH 351 Differential Equations (3)\nMATH 382/L Introduction to Scientific Computing and Lab (2/1)\nMATH 440A Mathematical Statistics I (3)\nMATH 440B Mathematical Statistics II (3)\nMATH 450A Advanced Calculus I (3)\nMATH 462 Advanced Linear Algebra (3)\nMATH 483 Mathematical Modeling (3)\nMATH 494 Practical Experience in Mathematics (3)\n3. Upper Division Electives (9 units)\nChoose 9 units from among (1) all upper division Math courses (excluding MATH 310, 310L, 311, 312, 331, 391 and 490); and (2) approved courses in other departments. At least 3 units must be in Mathematics. Recommended courses: COMP 431 or COMP 465; FIN 303, FIN 431 or FIN 434; ECON 409; MATH 366, MATH 442, MATH 450B, MATH 480, MATH 481A, MATH 481B, MATH 481C, MATH 481D, MATH 482, MATH 540 or MATH 542ABCD; MKT 346; PSY 420; SOM 409, SOM 467 or SOM 591.\nAll classes taken outside the Mathematics department must have the approval of an advisor prior to enrollment, and students must either meet prerequisites or obtain permission of instructor.\nNote: Early completion of MATH 340 and MATH 440A is recommended. Courses outside the Mathematics department are encouraged.\n4. General Education (48 units)\nUndergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.\n12 units are satisfied by the following courses in the major: PHYS 220A satisfies B1 Physical Science; PHYS 220AL satisfies B3 Science Laboratory Activity; MATH 150A satisfies Basic Skills B4 Mathematics/Quantitative Reasoning; MATH 320 satisfies B5 Scientific Inquiry and Quantitative Reasoning; and COMP 110/L satisfies E Lifelong Learning.\nTotal Units in the Major/Option: 62-63\nGeneral Education Units: 36\nAdditional Units: 21-22\nTotal Units Required for the B.S. Degree: 120"
}