{
    "name": "B.S., Business Administration: Real Estate",
    "prog-reqq-blob": [
        "Program Requirements",
        "Business Majors",
        "A Business major is any student majoring in Accountancy; Information Systems; or Business Administration with an option in either Business Analytics, Business Law, Financial Analysis, Financial Planning, Global Supply Chain Management, Management, Marketing, Real Estate, Risk Management and Insurance, or Systems and Operations Management. The following are impacted majors with additional admission requirements: the B.S. in Accountancy and the B.S. in Business Administration with options in Financial Analysis, Financial Planning, and Risk Management and Insurance. All Business majors share 27 units of common lower division core courses and 19 units of common upper division core courses.",
        "Double Major Requirements",
        "Students seeking a double major in the David Nazarian College of Business and Economics must have at least a 3.0 overall GPA and be able to complete both majors within a maximum of 140 units.",
        "Transfer Course Requirements",
        "Students should be aware that no grade lower than a C will be accepted on transfer from another institution to satisfy department or David Nazarian College of Business and Economics requirements.",
        "Residency Requirement",
        "At least 50 percent of the business and economics course credit units and 50 percent of the specialized major credit units required for the Bachelor of Science degrees in Accountancy, Business Administration, or Information Systems and the Bachelor of Arts degree in Economics must be completed in residence at CSUN.",
        "Course Requirements",
        "Check course descriptions for prerequisite courses. Prerequisites must be completed prior to enrolling in the course.",
        "1. Common Lower Division Business Core (27-28 units)",
        "ACCT 220 Introduction to Financial Accounting (3)",
        "ACCT 230 Introduction to Managerial Accounting (3)",
        "BLAW 280 Business Law I (3)",
        "ECON 160 Principles of Microeconomics (3)",
        "ECON 161 Principles of Macroeconomics (3)",
        "ENGL 205 Business Communication in its Rhetorical Contexts (3)",
        "IS 212 Information Systems for Business Users (3)",
        "MATH 103 Mathematical Methods for Business (3)*",
        "SOM 120 Basic Business Statistics (3)**",
        "*MATH 103 or a higher-level mathematics course (e.g., Calculus: MATH 150A or MATH 255A) must be completed with a grade of C or better.",
        "**The 4-unit MATH 140BUS course also satisfies this requirement.",
        "2. Common Upper Division Business Core (19 units)",
        "BUS 302 The Gateway Experience (3)",
        "BUS 302L The Gateway Experience Laboratory (1)",
        "BUS 497A or BUS 497B Capstone (3)",
        "FIN 303 Financial Management (3)",
        "MGT 360 Management and Organizational Behavior (3)",
        "MKT 304 Marketing Management (3)",
        "SOM 306 Operations Management (3)",
        "3. Required Upper Division Courses, Option in Real Estate (24 units)",
        "BLAW 308 Business Law II (3)",
        "BLAW 481 Real Estate Law (3)",
        "RE 412 Real Estate Practice (3)",
        "RE 414 Real Estate Principles (3)",
        "RE 416 Real Estate Appraisal (3)",
        "RE 418 Real Estate Market and Development Analysis (3)",
        "RE 420 Real Estate Finance (3)",
        "Select 3 units from the following:",
        "BLAW 368 Law, Business and Ethics (3)",
        "BLAW 453 Negotiation (3)",
        "MGT 456 Negotiation and Conflict Management (3)",
        "4. General Education (48 units)",
        "Undergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.",
        "15 units are satisfied by the following courses in the major: MATH 103 satisfies Basic Skills B4 Mathematics/Quantitative Reasoning; FIN 303 satisfies B5 Scientific Inquiry and Quantitative Reasoning; ECON 160 and ECON 161 satisfy D1 Social Sciences; and IS 212 satisfies E Lifelong Learning and fulfills the Information Competence requirement.",
        "Total Units in the Major/Option: 70-71",
        "General Education Units: 33",
        "Additional Units: 16-17",
        "Total Units Required for the B.S. Degree: 120"
    ],
    "link-to-major": "https://catalog.csun.edu/academics/blaw/programs/bs-business-administration-iv/real-estate/"
}