[
    {
        "subject": "ART",
        "catalog_number": "100",
        "title": "Introduction to Art Processes",
        "description": "Corequisite: ART 100L. Not available for Art Major credit. Experiences for the non-art major in drawing painting sculpture and other art processes. Provides an understanding of the place of art in life through actual participation. 1 hour discussion 4 hours studio. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "100L",
        "title": "Introduction to Art Processes Lab",
        "description": "Corequisite: ART 100. Not available for Art Major credit. Experiences for the non-art major in drawing painting sculpture and other art processes. Provides an understanding of the place of art in life through actual participation. 1 hour discussion 4 hours studio. (Available for General Education Arts and Humanities.)\n",
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "110",
        "title": "World Arts: The Western Tradition",
        "description": "Survey of the visual arts of the Western cultural tradition from ancient to modern times emphasizing historical religious and socio-cultural contexts. Discussion research and writing on the visual arts including painting sculpture architecture book arts ceramics textiles and body arts. For non-art major. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "112",
        "title": "World Arts: Africa",
        "description": "Oceania and the AmericasSurvey of the visual arts of Africa Oceania and the Americas emphasizing historical religious and socio-cultural contexts. Discussion research and writing on the visual arts including painting sculpture architecture book arts ceramics textiles and body arts. For non-art major. (Available for General Education Comparative Cultures)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "114",
        "title": "World Arts: Asia",
        "description": "Survey of the visual arts of India China Japan Korea and Southeast Asia emphasizing historical religious and socio-cultural contexts. Discussion research and writing on the visual arts including painting sculpture architecture book arts ceramics textiles and body arts. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "120",
        "title": "Arts Immersion: Visual Art",
        "description": "Prerequisite: Restricted to students in the ITEP Freshman Option Program. Corequisite: ART 120L. Introduction to the study of visual arts foundation skills concepts and ideas based on the Visual and Performing Arts Framework and the Visual and Performing Arts Content Standards for California Public Schools. Foundation study in the visual arts includes application of the creative processes and skills responding to and deriving meaning from works of art and developing an understanding of art in historical and cultural context. 1 hour of lecture per week; 2 hours of lab per week. \n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "120L",
        "title": "Arts Immersion: Visual Art Lab",
        "description": "Prerequisite: Restricted to students in the ITEP Freshman Option Program. Corequisite: ART 120. Introduction to the study of visual arts foundation skills concepts and ideas based on the Visual and Performing Arts Framework and the Visual and Performing Arts Content Standards for California Public Schools. Foundation study in the visual arts includes application of the creative processes and skills responding to and deriving meaning from works of art and developing an understanding of art in historical and cultural context. 1 hour of lecture per week; 2 hours of lab per week. \n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "124A",
        "title": "Drawing I",
        "description": "Introduction to basic drawing experiences. Graphic representation of objects stressed through a variety of techniques and media. Emphasis on form structure values line and systems of perspective and space. For non-art majors; 5 hours lab. (Available for General Education Arts and Humanities)\n",
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "140",
        "title": "Beginning Two-Dimensional Design",
        "description": "Introduction to the elements and principles of 2-dimensional design that are common to the visual arts. Foundation course stressing visual perception and an effective knowledge of the graphic means of expression and communication. 5 hours per week. (Available for General Education Arts and Humanities)\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "141",
        "title": "Beginning Three-Dimensional Design",
        "description": "Study of the elements and principles of 3-dimensional design and their applications with emphasis on form in space design systems and contemporary art concepts. Experimentation in both natural and synthetic material. For non-art majors; 5 hours per week. (Available for General Education Arts and Humanities)\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "148",
        "title": "Color Theory",
        "description": "Prerequisite: ART 140. Introduction to basic theories of color. Investigations of color harmony and its development as applied to 2-and 3-dimensional visual form. Introductory studies of physiological and psychological aspects of color are investigated. 5 hours per week. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "151",
        "title": "Photography as Art",
        "description": "Not available for Art Major credit. Students must provide their own digital camera (SLR or compact digital). Introduction for non-art majors to the subject matter and aesthetics of photography. Review of artists works that have been a major influence in the field and that reflect broader issues in visual culture. Assignments include learning basic camera anatomy functions and digital applications. Students need basic working knowledge of computer operation. (Available for General Education Lifelong Learning)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "200",
        "title": "Art",
        "description": "Media and VisualizationPractical study of the way art technology and theories in visual representation shape contemporary visual practice. \n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "201",
        "title": "Introduction to Web Art",
        "description": "This course is an introduction to web art and design. In addition to an exposure to the history of the web/internet the course will cover basic web development tools terminology and aesthetics. Students will create web pages using current computer web applications. For non-Art majors. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "210",
        "title": "ANIMATION TECHNOLOGY",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "222",
        "title": "Illustration Materials and Techniques",
        "description": "Prerequisites: ART 124B. Introduction to the use of materials and techniques used in a variety of art areas and specifically in the field of illustration. Emphasis on understanding media potential and the development of refined technical skills required for the successful execution of illustrations. Covers wide range of wet- and dry-media tools and techniques. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "224A",
        "title": "Drawing II: Anatomy",
        "description": "Prerequisite: Art 124B.Study of the human form and its graphic representation. Problems dealing with anatomy, form and structure introduced by studies of the posed model. 6 hours per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "227",
        "title": "Painting I",
        "description": "Prerequisite: Art majors: Recommended Corequisite or Preparatory: ART 140. Non-Art majors: Consult Department for equivalency. Emphasis on 2-dimensional pictorial structure. Application of design fundamentals to graphic space organization and imagery. Use of various painting media. 5 hours per week. \n",
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "230",
        "title": "Perspective",
        "description": "Prerequisite: Art majors: ART 124A. Non-Art majors: Consult Department for equivalency. Understanding and use of various systems of perspective. Emphasis upon linear perspective and applications to rendering which are based upon uses of perspective. 5 hours per week. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "235",
        "title": "Sculpture I",
        "description": "ART 235. Sculpture I (3). Recommended Corequisite or prerequisite: Art 141. Introduction to the materials and basic facilities and processes of sculpture including woodworking metal forming and mixed media applications. 5 hours lab.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "237",
        "title": "Printmaking I",
        "description": "Recommended corequisite or prerequisite: ART 140. Introduction to the materials and basic processes of printmaking including intaglio relief and planographic processes. Focus is placed on fine art printmaking with self-directed content utilizing design fundamentals. 5 hours lab.\n",
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "243",
        "title": "Introduction to Typography",
        "description": "Prerequisites: ART 140; Corequisite: ART 200. History theory and practice of letter forms and typography as they apply to graphics advertising and other areas of design and visual communication. Projects cover principles of typography letter structure typeface selection fundamentals of computer typesetting and typographic layout. Fee required. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "244",
        "title": "Graphic Design I",
        "description": "Introductory survey to the professional field of advertising and graphic design as related to print multimedia entertainment environmental and other areas of visual communications. Emphasis on fundamental principles and skills with a broad approach to the application of techniques and concepts of the field. 5 hours lab. Course fee. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "250",
        "title": "Photography I",
        "description": "Basic instruction in the creative use of the camera and printing techniques. Instruction in basic principles and darkroom experience. Emphasis on photography as a fine art stressing beginning visual awareness and craftsmanship. 5 hours lab. \n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "ART",
        "catalog_number": "263",
        "title": "Animation I",
        "description": "Introduction to the fundamental principles of animation that are the basis for traditional and computer animation. Hand-drawn exercises are utilized to learn timing motion and weights. Covers introduction to the early history of animation. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "267",
        "title": "Introduction to Ceramics",
        "description": "Basic methods of hand-building and wheel-forming. Emphasis on designing decorating glazing and firing procedures. 5 hours lab. \n",
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "296PV",
        "title": "DIG PHOTO/VIDEO I",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "301",
        "title": "Web Design",
        "description": "Prerequisite: ART 200; Preparatory: ART 201 or 244. Introduction to principles and techniques for visual and information design for websites. Includes an introduction to website animation technologies. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "302",
        "title": "Video/Digital Art",
        "description": "Prerequisite: ART 200 or 202. Studies into artistic concepts and technologies involved in the creation of video art and digital time-based art forms. Investigations into digital imaging non-linear compositing and visual effects result in the creation of short artistic statements presented in video/digital format. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "304",
        "title": "VIS ART AND CHILD",
        "description": null,
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "305",
        "title": "Art Today",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Not available for Art Major credit. Art majors may take this course for University elective credit. Introduction for the non-art major to the art design and architecture of our time. Illustrated lectures explore the development techniques and ideas underlying the contemporary visual environment. (Available for General Education Arts and Humanities.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "306",
        "title": "Motion Graphics",
        "description": "This course is an introduction to Motion Graphics which includes the categories of commercial broadcast main sequence and music video. The course will include lectures showcases and demonstrations of the history techniques and applications of motion graphics. Projects will cover design composition narrative and sound development. Current industry standard computer applications will be introduced and applied. This course may be repeated twice for credit. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "307",
        "title": "CORE ART STUDIO",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "309",
        "title": "VIDEO VISUAL ART",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "315",
        "title": "Perspectives in Art History",
        "description": "Prerequisite: Completion of the Lower Division writing requirement.Not available for Art Major credit. Introduction for non-art majors. Art as a means of examining Western civilization from prehistory to the present. Comparative study of the visual/plastic arts from the historical perspectives of their function in society. (Available for General Education Comparative Cultural Studies.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "318",
        "title": "Survey of 19th and 20th Century Arts",
        "description": "Prerequisite: ART 110.A survey of major movements in 19th- and 20th-century art and art theory with reference to social political economicand ideological contexts. Included are visits to major museums galleries and performance art venues in the Los Angeles area. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "319",
        "title": "COMPARATIVE ANATOMY",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "322A",
        "title": "Illustration I",
        "description": "Prerequisites: ART 200 222. Basic principles and practices of publication and advertising illustration. Projects emphasize conceptual problem-solving composition and the development of personal style. Projects are designed for inclusion in a professional portfolio. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "322B",
        "title": "Illustration II",
        "description": "Prerequisite: ART 322A. Techniques used in illustration with an emphasis on problem solving and the development of skills necessary in illustration for publication and advertising. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "322C",
        "title": "Digital Illustration",
        "description": "Recommended Preparatory Course: ART 322A. The study and practice of digital illustration that uses both traditional fine art media and digital technology. Emphasis is on illustration problem-solving experimental techniques and the development of portfolio quality illustrations. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "324A",
        "title": "Drawing III: Figure Drawing",
        "description": "Prerequisites: ART 124A 124B 200. Study of the human figure using models. Emphasis on creative interpretation of structure gesture and space as they relate to the elements of line form value and color. 5 hours per week. \n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "324B",
        "title": "Drawing III: Figure Drawing and Painting",
        "description": "Prerequisite: ART 324A. Study of the human figure using models. Emphasis on creative interpretation of structure gesture and space as they relate to the elements of line form value and color. Introduction to a broad range of problems in the combined area of drawing and painting that are non-linear and apply to the study of human form. 5 hours per week. \n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "326",
        "title": "Painting II: Abstract Painting",
        "description": "Prerequisites: ART 227 200. Emphasis on an individuality of response to contemporary problems in painting incorporating a variety of media techniques and concepts related to abstract painting. 5 hours per week. \n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "327",
        "title": "Painting II: Representational Imagery",
        "description": "Prerequisites: ART 227 200.Emphasis on individuality of response to contemporary problems in painting incorporating a variety of media techniques and content related to representational imagery.  \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "328",
        "title": "Water Color",
        "description": "Prerequisites: ART 200. Corequisite: Upper Division standing; portfolio review required for repeat credit.Transparent and opaque watercolor techniques. Emphasis on technical proficiency and creative expressions. 5 hours per week. \n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "330",
        "title": "Drawing III: Composition",
        "description": "Prerequisites: ART 124A 124B 140 200.Problems utilizing various drawing media and techniques stressing the elements of 2-dimensional composition and pictorial organization. 5 hours per week. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "335",
        "title": "Sculpture II",
        "description": "Prerequisites: ART 141 200 235.Further exploration of sculpture concepts and media with emphasis on individual invention. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "337A",
        "title": "Printmaking II: Intaglio",
        "description": "Prerequisite: ART 237.Investigation of contemporary intaglio methods on metal and related materials, including collagraph, photo processes, and cross-media approaches, with black/white and color printing. Projects emphasize problem solving through self-directed form and content in the creation of portfolio-quality work. 6 hours lab.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "337B",
        "title": "Printmaking II: Serigraphy (Silkscreen)",
        "description": "Prerequisite: ART 237.Investigation of the methods and materials used to create serigraphs in a contemporary fine art context. Covered techniques include hand-drawn and digital/photo stencils, multi-color registration, printing with water-based ink, and cross-media approaches. Projects emphasize problem solving through self-directed form and content in the creation of portfolio-quality work. 6 hours lab.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "337D",
        "title": "Printmaking II: Relief",
        "description": "Prerequisite: ART 237.Contemporary relief methods on linoleum, wood, and other related material, with black/white and color printing, and exploration of cross-media approaches. Projects emphasize problem solving through self-directed form and content in the creation of portfolio-quality work. 6 hours lab.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "338",
        "title": "PRINTMAKING II",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "341",
        "title": "Graphic Design Production",
        "description": "Prerequisites: ART 200 244.Production mechanics of designed projects are prepared for offset printing and digital reproduction. In-depth review of color separations ink paper and current trends in print production as well as digital reproduction and multimedia. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "342",
        "title": "Exhibition Design",
        "description": "Prerequisites: ART 140 or 141; 200.Study of techniques of exhibition design. Problems of design and production in projects that emphasize creating gallery and related exhibitions or venues. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the schedule of classes for the CS designation. 5 hours per week. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "343",
        "title": "Advanced Typography",
        "description": "Prerequisites: ART 243 244.Theory and practice of letter forms and typography as they apply to graphics advertising and other areas of design and visual communication. Projects cover principles of typography letter structure type face selection fundamentals of computer typesetting and typographic layout. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "344",
        "title": "Graphic Design II",
        "description": "Prerequisite: ART 244. Corequisite: ART 200. Preparatory: ART 341 or equivalent. Introduction to intermediate skills and conceptual problems of the field. Stressed is the integration of theory with practical applications. Projects demand creative solutions to typical problems faced by the graphic designer. 5 hours lab. \n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "345",
        "title": "ENTERTAIN AD DES",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "350",
        "title": "PHOTOGRAPHY II",
        "description": null,
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "351",
        "title": "Digital Photo Imaging",
        "description": "Prerequisite: ART 250. Preparatory: ART 200. Exploration of digital photography integrating established principles of the photo medium with digital technologies. Photo images are created and manipulated through digital software processes for both fine art and commercial application. Assignments result in a portfolio. May be repeated once for credit; 5 hours lab. \n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "ART",
        "catalog_number": "352",
        "title": "Visual Effects",
        "description": "Prerequisite: ART 302. Studies in the conceptualization and techniques of digitally generated visual effects in time-based media. Creative self-expression is emphasized in the production of experimental short videos. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "353",
        "title": "Color Photography",
        "description": "Preparatory: ART 200 250 or equivalent.Investigation into the various aspects of color photography which include: exposure and development of negative film; printing with color materials utilizing the subtractive color principles that underlie color filtration and correction; a brief survey of contemporary color photographers with an emphasis on the aesthetics of their works; and refinement of the students visual eye while pursuing their own stylistic expression. May be repeated once for credit. 5 hours lab.\n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "ART",
        "catalog_number": "354",
        "title": "Computer Graphics",
        "description": "Prerequisites: Art majors: ART 200 244. Non-art majors: Consult department for equivalency. Application and principles of computer graphics as a creative technological medium. Practical experience with micro-computers in studying the potentials of graphic communication and visual expression. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "357",
        "title": "NARRATIVE D PHOTO",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "358",
        "title": "UX/UI DESIGN",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "363A",
        "title": "Animation II",
        "description": "Prerequisite: ART 263. Further study of animation skills for both traditional and computer animation. Introduction to storyboard process character design and story development. Intermediate-level animation principles including character expression lip sync and staging. Continuation of animation history 1943 to the present. 5 hours lab. \n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "ART",
        "catalog_number": "364",
        "title": "3-D Computer Animation",
        "description": "Prerequisite: ART 263. Investigation of 3-D computer animation with emphasis on animation timing modeling and lighting. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "365",
        "title": "3-D Computer Animation II",
        "description": "Prerequisite: ART 364.Intermediate study of 3-D computer animation with focus on 3-D character creation and animation. Includes: design modeling rigging key-frame lip-sync acting background lighting texturing coloring and critical analysis of 3-D characters from the game and animation fields. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "367",
        "title": "Ceramics III",
        "description": "Prerequisite: ART 267. Further investigation of the use of clay as a medium with emphasis on experimental practice. Further discussion of ideas technical processes and approaches as it relates to the work and contemporary visual art. Continued experimentation with wheel forming hand building clay bodies glaze formulation and surface treatments. 5 hours lab. Course fee. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "368",
        "title": "Game Animation and Design",
        "description": "Recommended preparatory courses: ART 365. Investigation of the creative process of game design and game animation. Practical theoretical and global aspects of game design will be explored by creating game assets and producing animation work. 9 hours lab.  \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "380",
        "title": "Children&#8217;s Art",
        "description": "Prerequisite: Junior standing. Corequisite: ART 380L. Recommended for Multiple Subjects Credential Candidates. Development of fundamentals and principles for determining art experiences for children. Understanding the significance of art in the childs development. Emphasis on developing basic art skills in criticism aesthetics history and studio production. 2 hours discussion 2 hours studio and visits to art exhibitions.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "380L",
        "title": "Children&#8217;s Art Lab",
        "description": "Prerequisite: Junior standing. Corequisite: ART 380. Recommended for Multiple Subjects Credential Candidates. Development of fundamentals and principles for determining art experiences for children. Understanding the significance of art in the childs development. Emphasis on developing basic art skills in criticism aesthetics history and studio production. 2 hours discussion 2 hours studio and visits to art exhibitions.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "383",
        "title": "Art in Early Childhood",
        "description": "Prerequisite: Junior standing. Corequisite: ART 383L. Analysis and discussion of the significance of art in the development of young children ages 3 through 8 combined with studio experiences in 2- and 3-dimensional materials. 2 hours discussion 2 hours studio. \n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "383L",
        "title": "Art in Early Childhood Lab",
        "description": "Prerequisite: Junior standing. Corequisite: ART 383. Analysis and discussion of the significance of art in the development of young children ages 3 through 8 combined with studio experiences in 2- and 3-dimensional materials. 2 hours discussion 2 hours studio. \n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "385",
        "title": "Children&#8217;s Crafts",
        "description": "Prerequisite: Junior standing. Corequisite: ART 385L.Basic skills and understandings that provide meaningful craft experiences for children. Emphasis on the educational value of crafts. Beginning techniques and processes involving 3-dimensional materials. 2 hours discussion 2hours studio.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "385L",
        "title": "Children&#8217;s Crafts Lab",
        "description": "Prerequisite: Junior standing. Corequisite: ART 385.Basic skills and understandings that provide meaningful craft experiences for children. Emphasis on the educational value of crafts. Beginning techniques and processes involving 3-dimensional materials. 2 hours discussion 2hours studio.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "389CS",
        "title": "IMPACT DESIGN",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "400",
        "title": "Developing Visual Literacy",
        "description": "Prerequisites: ART 380; Junior standing. Corequisite: ART 400L. In-depth exploration of selected art processes culminating in a significant research paper or project. 2 hours discussion 2 hours studio. \n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "400L",
        "title": "Developing Visual Literacy Lab",
        "description": "Prerequisites: ART 380; Junior standing. Corequisite: ART 400. In-depth exploration of selected art processes culminating in a significant research paper or project. 2 hours discussion 2 hours studio. \n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "401",
        "title": "History of Native North American Art",
        "description": "The visual arts of North American native cultures from the Eskimo to Canada the Northwest and Southwest areas of the United States the Plains and Eastern Indian societies. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "402",
        "title": "Advanced Video/Digital Art",
        "description": "Preparatory: ART 302. Advanced studies into video/digital art involve exploration into a broad range of artistic concepts and visual technologies utilized in video/digital media and time-based art forms. Investigation into art software applications and experimental methods lead to the production and refinement of artistic statements presented in video/digital format. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "404",
        "title": "History of African and Oceania Art",
        "description": "Visual arts of sub-Saharan tribal Africa are considered in their cultural context including related art forms such as literature music and ritual observances. Arts of the South Pacific the tribal societies of Melanesia Polynesia Micronesia and Australia. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "405",
        "title": "ADV WEB DESIGN",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "412",
        "title": "History of Korean Art",
        "description": "Prerequisite: Upper Division standing. Korean visual culture from the Neolithic period to the present time. Investigation of various art forms in different media (including ceramics calligraphy painting sculpture architecture woodblock print photograph video installation and performance) and ways in which different artistic features are connected to specific historical religious philosophical and political contexts.  \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "413",
        "title": "History of Chinese Art",
        "description": "Prerequisite: Upper Division standing. Chinese visual culture from the Neolithic period to the present time. Investigation of various art forms in different media (including ceramics jade and bronze objects calligraphy painting sculpture architecture woodblock print photographs video installations and performance) and ways in which different artistic features are connected to specific historical religious philosophical and political contexts. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "414",
        "title": "History of Japanese Art",
        "description": "Prerequisite: Upper Division standing.Japanese visual culture from the Neolithic period to the present time. Investigation of various art forms in different media (including ceramics bronze objects calligraphy painting sculpture architecture woodblock print photographs video installations and performance) and ways in which different artistic features are connected to specific historical religious philosophical and political contexts.  \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "415",
        "title": "History of the Art of India",
        "description": "Prerequisite: Upper Division standing. Indian visual culture from the Neolithic period to the present time. Investigation of various art forms in different media (including ceramics bronze objects painting sculpture architecture photographs video installations and performance) and ways in which different artistic features are connected to specific historical religious philosophical and political contexts.  \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "416",
        "title": "History of Ancient Near Eastern Art",
        "description": "Prerequisite: Upper Division standing.Study of the architecture sculpture and related art forms of the ancient Near East Mesopotamia Anatolia and Iran from prehistoric times to the beginning of the Sassanian Empire. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "420",
        "title": "History of Greek Art and Architecture",
        "description": "Prerequisite: Upper Division standing. Art and architecture of the Aegean area from the early Archaic to the end of the Hellenistic periods. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "421",
        "title": "History of Roman Art and Architecture",
        "description": "Prerequisite: Upper Division standing. Art and architecture of the Roman World from circa 700 B.C. to 400 A.D. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "422",
        "title": "Illustration III",
        "description": "Prerequisites ART 322B.Advanced study of specific problems in publication and advertising illustration. Projects require the creative implementation of the ideas media and techniques used by illustrators. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "424",
        "title": "Drawing IV: Life Drawing",
        "description": "Prerequisite: ART 324B.Advanced problems in draftsmanship and study of the human figure with special emphasis on freedom of expression and experimentation. (Portfolio review is required to be eligible for enrollment for 3rd and 4th semester repeat credit.) 5 hours per week. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "425",
        "title": "History of Italian Renaissance Art",
        "description": "Prerequisite: Upper Division standing.Study of the developments in art and architecture of Italy from 1300 to 1520 with particular emphasis on the relationship between the visual tradition and cultural context. Regular written assignments are required. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "427",
        "title": "Painting III",
        "description": "Prerequisites: ART 326 327.Emphasis on individuality and invention through independent research and experimentation. Guidelines and objectives to be established with individuals. (Portfolio review is required to be eligible for enrollment for 3rd and 4th semester repeat credit.) 5 hours per week. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "429",
        "title": "Advanced Study in Contemporary Painting",
        "description": "Prerequisites: ART 326 or Art 327. Portfolio review required upon entering the course. Projects emphasize conceptual development in painting through visual and material based research development of advanced critique and presentation skills and exposure to contemporary painting. Students are encouraged to explore contemporary painting media including installation 3-D elements and non-traditional materials and processes in addition to traditional painting technique. Portfolio development is emphasized. 5 hours per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "430",
        "title": "Drawing IV: Composition",
        "description": "Prerequisite: ART 330.Advanced drawing problems in 2-dimensional composition and pictorial organization. 5 hours per week. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "431",
        "title": "History of Baroque Art",
        "description": "Prerequisite: Upper Division standing. Preparatory: ART 426. A study of the arts from the Counter Reformation (1563) to the death of Louis XIV (1715). Painting sculpture and architecture in Europe with a special emphasis on the arts of Italy the Netherlands and France. Regular written assignments required. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "435",
        "title": "Sculpture III",
        "description": "Prerequisite: ART 335. Advanced study with special consideration of conception media and techniques through emphasis on individual projects. (Portfolio review is required to be eligible for enrollment for 3rd and 4th semester repeat credit.) 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "437",
        "title": "Printmaking III",
        "description": "Prerequisite: Art 337 or Art 337 A or 337 B or 337 C or 337 D. Advanced study of intaglio serigraphy lithography relief or experimental and combination processes within a contemporary fine art context. Emphasis is placed on self-directed exploration into process form and content in the creation of portfolio-quality work. Guidelines and goals discussed on an individual basis. (Portfolio review required to be eligible for enrollment for 3rd and 4th semester repeat credit.) Available for graduate credit. 6 hours lab.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "438",
        "title": "Senior Projects",
        "description": "Prerequisite: Senior standing. Corequisite: ART 438L. Projects that afford students the opportunity to assess their training summarize their achievement and analyze their place in the visual arts. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the schedule of classes for the CS designation. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "438L",
        "title": "Senior Projects Lab",
        "description": "Prerequisite: Senior standing. Corequisite: ART 438. Projects that afford students the opportunity to assess their training summarize their achievement and analyze their place in the visual arts. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the schedule of classes for the CS designation. \n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "439",
        "title": "Bronze Casting Sculpture",
        "description": "Prerequisite: ART 235. Lost-wax bronze-casting foundry projects. Students create sculpture to be cast in bronze. 5 hours per week. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "442",
        "title": "3-D COMP ANIM III",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "443",
        "title": "Animation Drawing",
        "description": "Prerequisite: ART 224A. Exploration of the various forms of drawing related to the field of animation. Direct drawing of the human figure from models; drawing a variety of animals from live observation; and development of layout drawing used for background painting. Emphasis on volume mass weight movement/gesture conveying attitude dramatic expression action poses acting anatomy consistent perspective and economy of line. 5 hours per week. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "444",
        "title": "Graphic Design III",
        "description": "Prerequisite: ART 344.Advanced and complex problem-solving consistent with those of graphic designers in the field. Emphasis on project of substantive scope integration of skills and presentation. Students should have developed a professional resume and portfolio by the end of this series. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "445",
        "title": "History of Modern Art",
        "description": "Prerequisite: Upper Division standing.Investigation of major movements in 20th century painting sculpture architecture with reference to the social economic and ideological context. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "446",
        "title": "Packaging Design",
        "description": "Prerequisite: ART 344.Designing for product containers identification graphics product line packaging and related displays. Coordination of the fundamental elements of packaging such as typography color imagery and package structure. 5 hours lab. \n",
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "448",
        "title": "History of Contemporary Art",
        "description": "Prerequisite: ART 110. Deals with American and European art from the mid-20th century to the present. Includes a study of developments in non-traditional media crafts and popular arts as well as painting and sculpture. Regular written assignments required. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "450",
        "title": "Photography III",
        "description": "Preparatory: Art 350AB.Advanced problems in photography. Emphasis on content: The student is encouraged to apply technical and expressive skills in photography toward some original and meaningful use of the medium. Students are required to present an original project to the class for discussion and is then required to execute it. May be repeated 3 times for credit. Portfolio review required for eligibility for enrollment for 3rd and 4th semester repeat credit. 5 hours lab. \n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "ART",
        "catalog_number": "455A",
        "title": "Advertising Photography I",
        "description": "Preparatory: ART 250.Professional problems techniques and equipment of advertising photography. Activities include the use of large format camera equipment professional lighting environmental and studio product photography professional printing and print finishing techniques. 5 hours lab. \n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "ART",
        "catalog_number": "455B",
        "title": "Advertising Photography II",
        "description": "Prerequisite: ART 455A.Advanced projects in advertising photography. Emphasis on problems of large product and exterior photography portrait and figure studies and uses of complex lighting. 5 hours lab. \n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "ART",
        "catalog_number": "455C",
        "title": "Advanced Advertising Photography",
        "description": "Preparatory: Art 455B. Investigation of advanced advertising problems in photography exploring both the technical and conceptual challenges of visual communication. Advanced projects in portraiture fashion table-top photo-illustration and editorial will be addressed. Computer imaging introduced as an important area of investigation. May be repeated once for credit. 5 hours lab. \n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "ART",
        "catalog_number": "458",
        "title": "Graphics Seminar",
        "description": "Prerequisites: ART 344; Six additional units of Upper Division advertising graphics; Senior standing. Review career options related to visual communication. Study and solve design business-related problems faced in the design profession such as incorporating team concepts building professional relationships and refining communication skills. Students develop professional résumés and portfolios (print and digital). Emphasis is placed on professional graphic design business practices and creative processes.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ART",
        "catalog_number": "460",
        "title": "HIST ANIM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "461",
        "title": "History of Graphic Arts",
        "description": "Emphasizes the study of graphic design and its impact on society from the 19th to 21st centuries including the development of typography and graphic art from the 15th to the 19th century. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "462",
        "title": "History of Photography",
        "description": "Emphasizes the aesthetics of photography and its emergence and acceptance as a fine art. In addition to slide lectures and discussions students are required to attend several photography exhibitions and lectures at galleries and museums in the area. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "463",
        "title": "Animation III",
        "description": "Prerequisite: ART 363B. Advanced level development and production of an original animation project. Students may utilize 3-D computer animation or 2-D methods. May be repeated once for credit. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "465",
        "title": "Game Animation Project",
        "description": "Prerequisites: Art 364. Advanced level design and creation of a game production project. Students may use either 2-D or 3-D animation techniques to create a video game prototype.  Includes concept development creation of character assets animation cycles and environments. May be repeated once for credit.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "467",
        "title": "Ceramics IV",
        "description": "Prerequisite: ART 367.Advanced investigation of the use of clay as it relates to a personal direction. Advanced refinement of ideas technical processes and approaches as they relate to a unified body of work and to contemporary visual art. Continued experimentation with technical processes clay bodies glaze formulation and surface treatments. Development of portfolio materials and documentation of the unified body of work. (Portfolio review is required to be eligible for enrollment for 3rd and 4th semester repeat credit). 5 hours lab. Course fee. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "468",
        "title": "History of Women in the Visual Arts",
        "description": "Prerequisite: Upper Division standing. Preparatory: WS 200. Covers the history of women as artists in the European and American traditions. Art by women in non-Western cultures also is studied together with related issues such as images of women and feminist art analysis. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "482",
        "title": "TEACHING ART PK 12",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "488",
        "title": "Public Art",
        "description": "Development and completion of art forms in the public realm. Public art investigated in a workshop format that includes speakers demonstrations field trips and art products. Emphasis on studio skills proposal development and service learning activities. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the schedule of classes for the CS designation. 5 hours per week. \n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "ART",
        "catalog_number": "488CS",
        "title": "PUBLIC ART",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "491",
        "title": "DESIGN AND BRAND",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "494",
        "title": "Internship in Arts",
        "description": "Prerequisites: Senior or Graduate standing; Portfolio review. Available for Art Major credit. Academic Internship course. Experiential education in appropriate aspects of specific area of interest. 6 units maximum. (Credit/No Credit only) \n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "ART",
        "catalog_number": "499A",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "ART",
        "catalog_number": "510",
        "title": "Methods and Practice of Art History",
        "description": "Prerequisites: Graduate standing in Art History or Senior status and instructor permission.  Seminar designed to develop student skills in Art Historical research and a critical introduction to the practice and methodology of Art History as a discipline.  Graduate students will practice the application of theoretical and philosophical frameworks in all assignments.  Satisfies upper division core requirement for Art History option only. May be taken for elective credit but does not satisfy upper division core requirement for Art majors other than Art History.]\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "520",
        "title": "Studio Problems Video/ Digital Art",
        "description": "Investigation into artistic studio problems in video/digital art. Explorations lead to resolution of personal artistic statements. Increasing complexity in concept media and presentation is required in the sequence of course work. Available for repeat credit. 6 hours per week in supervised studio work. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "521",
        "title": "Studio Problems: Painting",
        "description": "Prerequisites: Graduate standing; Instructor consent. Investigation of artistic problems in painting exploration leading to resolution in artistic statements. Problems of increasing complexity and evidence of greater depth of artistic concept required in the sequence of course work. 1 hour per week in seminar; 5 hours per week in supervised studio work. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "522",
        "title": "Studio Problems: Illustration",
        "description": "Prerequisites: Graduate standing; Instructor consent. Investigation of artistic problems in illustration with exploration leading to concrete resolutions. Problems of increased complexity and greater depth of practical problem solving required in the sequence of course work. 5 hours lab.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "524",
        "title": "Studio Problems: Drawing",
        "description": "Prerequisite: ART 424. Investigation of advanced problems in drawing or in drawing and related art disciplines. Projects of increasing complexity that require evidence of greater depth and skill in the resolution of visual statements. 1 hour per week in seminar; 5 hours per week in supervised studio work. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "525",
        "title": "Studio Problems: Printmaking",
        "description": "Prerequisites: Graduate standing; Instructor consent. Investigation of artistic problems in printmaking exploration leading to resolution in artistic statements. Problems of increasing complexity and evidence of greater depth of artistic concept required in the sequence of course work. 1 hour per week in seminar; 5 hours per week in supervised studio work. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "535",
        "title": "Studio Problems: Sculpture",
        "description": "Prerequisites: Graduate standing; Instructor consent. Investigation of advanced problems in sculpture. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "542CS",
        "title": "Advanced Exhibition Design",
        "description": "Prerequisite: Graduate standing. Advanced study of the primary components of exhibition design including curating budgeting installation and promotion. Focuses on public relations education community service tours publicity and publication as they pertain to the CSUN and/or community galleries and their functions. Several class meetings held in each of the art galleries as well as other venues. Offers a community service opportunity with activities relating to concepts and theories presented. 5 hours per week. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "544",
        "title": "Studio Problems: Graphic Design",
        "description": "Prerequisites: ART 444 or equivalent; Graduate standing; Instructor consent.Investigation of advanced problems in graphic design exploring both the technical and conceptual challenges of visual communication. Projects of increasing complexity and evidence of greater depth of artistic concept required in the sequence of course work. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "550",
        "title": "Studio Problems: Photography",
        "description": "Prerequisites: Portfolio review; Graduate standing; Instructor consent.Investigation of advanced problems in photography exploring both the technical and conceptual challenges of visual communication. Projects of increasing complexity and evidence of greater depth of artistic concept required in the sequence of course work. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "560",
        "title": "Studio Problems in Ceramics Design",
        "description": "Prerequisites: Graduate standing; Instructor consent. Investigation of artistic problems in ceramics and/or glass design exploration and experimentation leading to resolution in artistic statements. Problems in increasing complexity and evidence of greater depth of artistic concept required in the sequence of course work. 1 hour per week in seminar; 5 hours per week in supervised studio work. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "582",
        "title": "TEACHING ART PK-12",
        "description": null,
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "585L",
        "title": "TEACH 2-D ART LAB",
        "description": null,
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "588",
        "title": "Studio Problems in Public Art",
        "description": "Prerequisites: ART 488; 400-level Art course; Instructor consent.Development and completion of art forms planned for placement in the public realm. Increasing complexity and evidence of greater depth required in the sequence of course work. Public art investigated in a workshop format that includes speakers demonstrations and field trips. Emphasis on studio activities proposal development and service learning. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented in the course. Check the schedule of classes for the CS designation. 5 hours per week. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "590",
        "title": "History and Philosophy of Art Education",
        "description": "Prerequisite: Junior standing.Required for Single Subject Credential in Art. May be used as Upper Division Art elective for B.A. degree. Intensive study of the historical and chronological development of Art Education in America and abroad. Emphasis on significant trends and movements that have affected its growth and present structure. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "611",
        "title": "History and Philosophy of Art",
        "description": "Prerequisites: Minimum 1 year Art History (2 years recommended); Graduate standing. Seminar examining the development of movements and ideas in 20th century art. Research in modern art and artists. (Offered Fall semester.) \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ART",
        "catalog_number": "615",
        "title": "Art Analysis and Criticism",
        "description": "Prerequisites: Minimum 1 year of Art History; Graduate standing.Seminar exploring the critical approach to the work of art in terms of form content and expression. Aesthetic and methodological problems will be treated in particular relationship to contemporary art and its criticism. (Offered Spring semester.) \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ART",
        "catalog_number": "620",
        "title": "Advanced Studio Problems: Video/Digital Art",
        "description": "Prerequisite: ART 502 or equivalent. Investigation into advanced concepts involved in the production of video/digital art forms. Explores resolution of problems dealing with media technique and presentation. Increasing complexity and evidence of conceptual depth is required in the sequence of coursework. 5 hours per week in supervised studio work. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "621",
        "title": "Advanced Studio Problems: Painting",
        "description": "Prerequisites: Classified graduate standing; Instructor consent. Investigation of artistic problems in painting exploration leading to resolution in artistic statements. Problems of increasing complexity and evidence of greater depth of artistic concept required in the sequence of coursework. May be repeated 3 times for credit. 1 hour per week in seminar 5 hours per week in supervised studio work. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "622",
        "title": "Advanced Studio Problems: Illustration",
        "description": "Prerequisites: Classified graduate standing; Instructor consent. Investigation of advanced problems in illustration exploration leading to resolution in artistic statements. Problems of increasing complexity and evidence of greater depth of artistic concept required in the sequence of course work. 1 hour per week in seminar 5 hours per week in supervised studio work. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "624",
        "title": "Advanced Studio Problems: Drawing",
        "description": "Prerequisites: Classified graduate standing; Instructor consent. Investigation of advanced problems in drawing and related art disciplines. Projects of increasing complexity that require evidence of greater depth and skill in the resolution of visual statements. 1 hour per week in seminar; 5 hours per week in supervised studio work. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "625",
        "title": "Advanced Studio Problems: Printmaking",
        "description": "Prerequisites: Classified graduate standing; Instructor consent.Investigation of artistic problems in printmaking exploration leading to resolution in artistic statements. Problems of increasing complexity and evidence of greater depth of artistic concept required in the sequence of course work. 1 hour per week in seminar; 5 hours per week in supervised studio work. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "635",
        "title": "Advanced Studio Problems: Sculpture",
        "description": "Prerequisites: Classified graduate standing; Instructor consent.Investigation of advanced problems in sculpture. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "644",
        "title": "Advanced Studio Problems: Graphic Design",
        "description": "Prerequisites: Classified graduate standing; Instructor consent.Investigation of advanced problems in graphic design exploration leading to resolution in artistic statements. Problems of increasing complexity and evidence of greater depth of artistic concept required in the sequence of course work. 1 hour per week in seminar 5 hours per week in supervised studio work. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "650",
        "title": "Advanced Studio Problems: Photography",
        "description": "Prerequisites: 6 unites of ART 550; Classified graduate standing; Portfolio review.Investigation of advanced problems in photography exploring both the technical and conceptual challenges of visual communication. Projects of increasing complexity with evidence of greater depth of artistic concept and proficiency required in the sequence of course work. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "660",
        "title": "Advanced Studio Problems in Ceramics Design",
        "description": "Prerequisites: Classified graduate standing; Instructor consent.Investigation of artistic problems in ceramics exploration and experimentation leading to resolution in artistic statements. Problems in increasing complexity and evidence of greater depth of artistic concept required in the sequence of course work. 1 hour per week in seminar 5 hours per week in supervised studio work. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "667",
        "title": "TEACH ART HIGHER ED",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "ART",
        "catalog_number": "681A",
        "title": "Seminar in Art Education",
        "description": "Prerequisite: Classified graduate standing. Graduate students from outside the Department of Art permitted with consent of instructor. Study of the nature of creativity in art place of art in the curriculum improving teaching methods and inquiry into other disciplines for related implications. Identification of areas of greatest need for research. \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ART",
        "catalog_number": "686",
        "title": "Research in Art Education",
        "description": "Prerequisites: Graduate standing; Restricted to M.A. Art candidates. Recommended Corequisite: ART 681B. Current experiments and studies in art education; problems of conducting research unique to the area of investigation. Development of research studies with emphasis on design criteria measurement and standards of proof. \n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "ART",
        "catalog_number": "690A",
        "title": "M F A STUDIO",
        "description": null,
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "ART",
        "catalog_number": "691A",
        "title": "M F A SEMINAR",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ART",
        "catalog_number": "696B",
        "title": "Directed Graduate Research",
        "description": "Prerequisites: Classified status; Advisor consent.\n",
        "units": "2",
        "class_type": "SUP"
    },
    {
        "subject": "ART",
        "catalog_number": "698C",
        "title": "MFA Thesis/ Artistic Performance",
        "description": "Prerequisites: M.F.A.; Classified status; Completion of or current enrollment in all required Area of Concentration courses for the M.F.A. Degree; consent of Graduate Advisor and Thesis Committee; Conformance to University standards for graduate thesis. Provides the M.F.A. candidate with a culminating experience approved and supervised by the degree committee which presents the artistic endeavors pursued during the graduate program. Consists of an exhibition and/or performance of the students work photographic documentation and a written statement addressing the aesthetic philosophical and when appropriate technical aspects of the work. The final form of the thesis must adhere to University regulations for thesis presentation and be approved by the Office of Graduate Research and International Programs.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "ART",
        "catalog_number": "698D",
        "title": "GRADUATE PROJECT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ART",
        "catalog_number": "698F",
        "title": "THESIS ART PERF",
        "description": null,
        "units": "6",
        "class_type": "SUP"
    },
    {
        "subject": "ART",
        "catalog_number": "698MFA",
        "title": "MFA THESIS/PERFRM",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "ART",
        "catalog_number": "219",
        "title": "Art in Los Angeles",
        "description": "Introduction to the principles and skills relating to Art History based on study and analysis of museums galleries and other art exhibitions in the Los Angeles area.  Class visits to off-campus sites alternate with in-class seminars for review and discussion of content studied on field trips.  Art History majors are required to take this course for a grade to receive credit toward the major.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "300",
        "title": "Digital Technologies in Art",
        "description": "Prerequisite: ART 200.Exploration of the use of digital media in art and design. Provides practical experience in designing digital media products. 5 hours lab. \n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "313",
        "title": "History of Design",
        "description": "Study of important developments in the history of design: architecture and ornament interior and furniture decorative arts textile design industrial design product design and graphic design. (Offered Fall semester) \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "366",
        "title": "Ceramics II",
        "description": "Prerequisite: ART 267. Investigation of the use of clay as a medium with an emphasis on sculptural applications. Discussion of ideas technical processes and approaches as they relate to clays use as a non-utilitarian medium. Experimentation with mold making casting clay bodies glaze formulation and surface treatments. 5 hours lab. Course fee.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "484",
        "title": "Art Education Portfolio",
        "description": "Prerequisite: Complete admission to Teacher Education Program (Credentials Office). Capstone course in which students are assessed in their subject matter competency prior to student teaching. Course must be successfully completed to be cleared for entrance into student teaching. (Credit/No Credit only)\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "ART",
        "catalog_number": "499C",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "ART",
        "catalog_number": "519A-Z",
        "title": "Selected Topics in Art History",
        "description": "Prerequisites: Instructor consent or classified graduate-standing. Research in depth on specific topics within art history. Topics vary per semester. May be taken three times for credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ART",
        "catalog_number": "579",
        "title": "Art Education Across Cultures",
        "description": "Prerequisite: Junior-standing. Corequisite: 579L. Provides knowledge and practice in planning art experiences and increases teacher effectiveness in multi- and cross-cultural teaching of the arts. Incorporates focused activities for graduate students. Meets requirement for multicultural education for Multiple and Single Subject Credentials. Course contains both lecture and lab activities.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "579L",
        "title": "Art Education Across Cultures Lab",
        "description": "Prerequisite: Junior-standing. Corequisite: 579. Provides knowledge and practice in planning art experiences and increases teacher effectiveness in multi- and cross-cultural teaching of the arts. Incorporates focused activities for graduate students. Meets requirement for multicultural education for Multiple and Single Subject Credentials. Course contains both lecture and lab activities.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "ART",
        "catalog_number": "586",
        "title": "Studio Problems Teaching 3-D Art",
        "description": "Prerequisite: Junior-standing. Corequisite: 586L. Provides knowledge and practice in planning art experiences and increases teacher effectiveness in multi- and cross-cultural teaching of the arts. Incorporates focused activities for graduate students. Meets requirement for multicultural education for Multiple and Single Subject Credentials. Course contains both lecture and lab activities.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "ART",
        "catalog_number": "586L",
        "title": "Studio Problems Teaching 3-D Art Lab",
        "description": "Prerequisite: Junior-standing. Corequisite: 586. Provides knowledge and practice in planning art experiences and increases teacher effectiveness in multi- and cross-cultural teaching of the arts. Incorporates focused activities for graduate students. Meets requirement for multicultural education for Multiple and Single Subject Credentials. Course contains both lecture and lab activities.\n",
        "units": "2",
        "class_type": "ACT"
    }
]