[
    {
        "subject": "ASTR",
        "catalog_number": "152",
        "title": "Elementary Astronomy",
        "description": "Introduction to astronomy. Topics to be covered include the historical development of astronomy; the laws that govern the behavior of the universe; a survey of the properties of stars and galaxies including their origin and evolution; and the Big Bang Theory. This course also is offered online as ASTR 152OL. (Students using this course to satisfy the General Education requirement in Natural Sciences may satisfy the corresponding lab requirement by completing course ASTR 154L.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ASTR",
        "catalog_number": "154",
        "title": "ELEMENTARY ASTRONOMY",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "ASTR",
        "catalog_number": "154L",
        "title": "Observational Astronomy",
        "description": "Recommended Corequisite or Preparatory: ASTR 152. Introduction to the techniques of observational astronomy including data acquisition and interpretation. Testing of astronomical hypotheses by using data from observations of the moon planets sun stars and galaxies. 3 hours per week. (May be used to satisfy the lab requirement in General Education Natural Sciences provided ASTR 152 has been completed.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "ASTR",
        "catalog_number": "301",
        "title": "The Dynamical Universe",
        "description": "Preparatory: MATH 150B; PHYS 220A or 225; Completion of the Lower Division writing requirement. Applications of Newtonian and relativistic dynamics to astrophysical systems. Planetary and satellite motion planetary rings binary and multiple star systems clusters of stars dynamics of spiral and elliptical galaxies missing mass of galaxy clusters relativistic orbits (Mercury and the binary pulsar) black holes and the dynamical fate of the universe.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ASTR",
        "catalog_number": "352",
        "title": "Current Developments in Astronomy",
        "description": "Preparatory: Completion of the Lower Division writing requirement. In-depth examination and interpretation of astronomical discoveries occurring at the time the course is taught. Reading includes both background material and current periodicals accessible to Upper Division General Education students. Likely areas of discussion include spacecraft exploration of the solar system satellite observations of high-energy radiation from space exotic astronomical objects (e.g. double quasars black hole candidates) and new cosmological data. (Students using this course to satisfy the General Education requirement in Natural Sciences may satisfy the corresponding lab requirement by completing course ASTR 352L.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ASTR",
        "catalog_number": "352L",
        "title": "Current Developments in Astronomy Lab",
        "description": "Preparatory: Completion of the Lower Division writing requirement. Recommended Corequisite or Preparatory: ASTR 352. Use of observational and laboratory facilities and published data to explore current developments in astronomy. 3 hours per week. (May be used to satisfy the lab requirement in Natural Sciences General Education provided ASTR 352 also is completed.) (IC)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "ASTR",
        "catalog_number": "300",
        "title": "INTR ASTROPHYSICS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ASTR",
        "catalog_number": "401",
        "title": "The Radiative Universe",
        "description": "Preparatory: PHYS 227. Application of the laws of radiation atomic stucture and subatomic structure to astrophysical systems. Cosmic magnetic fields energy sources analysis of radiation from stars nebulae supernovae active galaxies and quasars the early universe and origin of the elements.\n",
        "units": "3",
        "class_type": "LEC"
    }
]