[
    {
        "subject": "CIT",
        "catalog_number": "101",
        "title": "CIT Fundamentals",
        "description": "Corequisite: CIT 101L. The discipline of CIT. Pervasive CIT themes; CIT history; organizational issues; relationship of CIT to other computing disciplines; application domains; application of math and statistics to CIT. Lab: three hours per week; covers installation and optimization of operating systems system management utilities applications including word processing spreadsheets and databases virus checkers and spyware.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "CIT",
        "catalog_number": "101L",
        "title": "CIT Fundamentals Lab",
        "description": "Corequisite: CIT 101. The discipline of CIT. Pervasive CIT themes; CIT history; organizational issues; relationship of CIT to other computing disciplines; application domains; application of math and statistics to CIT. Lab: three hours per week; covers installation and optimization of operating systems system management utilities applications including word processing spreadsheets and databases virus checkers and spyware.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CIT",
        "catalog_number": "160",
        "title": "Internet Technologies",
        "description": "Corequisite: CIT 160L. Architecture of the Internet; Internet protocols including http ftp telnet; browser technologies; current developments in Internet technologies and usage characteristics; Hypertext; self descriptive text; webpage design; web site design; ADA compliance; commercialization of the Internet; role of the Internet in CIT. Lab: 3 hours per week.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "CIT",
        "catalog_number": "160L",
        "title": "Internet Technologies Lab",
        "description": "Corequisite: CIT 160. Architecture of the Internet; Internet protocols including http ftp telnet; browser technologies; current developments in Internet technologies and usage characteristics; Hypertext; self descriptive text; webpage design; web site design; ADA compliance; commercialization of the Internet; role of the Internet in CIT. Lab: 3 hours per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CIT",
        "catalog_number": "210",
        "title": "Deployment and Management of Operating Systems",
        "description": "Prerequisites: CIT 101/L 122/L; Lower Division writing requirement. Corequisite: CIT 210L. Introduction to the basic components of CIT systems including networking web systems databases scripting system administration and maintenance and system integration. A deeper study of operating system principles network architecture and resource management including shared resources.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CIT",
        "catalog_number": "210L",
        "title": "Deployment and Management of Operating Systems Lab",
        "description": "Prerequisites: CIT 101/L 122/L; Lower Division writing requirement. Corequisite: CIT 210. Introduction to the basic components of CIT systems including networking web systems databases scripting system administration and maintenance and system integration. A deeper study of operating system principles network architecture and resource management including shared resources.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CIT",
        "catalog_number": "270",
        "title": "Integrative Programming",
        "description": "Prerequisites: CIT 160/L; COMP 182/L; MATH 103 150A or 255A. Corequisite: CIT 270L. Role of integrative programming in information technology: operating systems system management application reuse. Tools and techniques for integrative programming such as Perl TCL/tk VBscript and Python. Script programming development environments. Role of scripting in system installation and management. Client-server architecture. Interface management wrappers facades brokers and proxies. XML and XML-related technologies with emphasis on data exchange for application/system integration. Integration technologies such as web services Ruby on Rails CORBA and DCOM. Integration platforms such as .net and J2EE. Lab: 3 hours per week.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CIT",
        "catalog_number": "270L",
        "title": "Integrative Programming Lab",
        "description": "Prerequisites: CIT 160/L; COMP 182/L; MATH 103 150A or 255A. Corequisite: CIT 270. Role of integrative programming in information technology: operating systems system management application reuse. Tools and techniques for integrative programming such as Perl TCL/tk VBscript and Python. Script programming development environments. Role of scripting in system installation and management. Client-server architecture. Interface management wrappers facades brokers and proxies. XML and XML-related technologies with emphasis on data exchange for application/system integration. Integration technologies such as web services Ruby on Rails CORBA and DCOM. Integration platforms such as .net and J2EE. Lab: 3 hours per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CIT",
        "catalog_number": "292IP",
        "title": "PROGRAMMING I",
        "description": null,
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "CIT",
        "catalog_number": "360",
        "title": "CIT System Management",
        "description": "Prerequisites: CIT 210/L 270/L. Overview of enterprise system architecture principles and practices of systems administration and system management including firewalls and proxy servers networked file systems user account management resources allocation installation and configuration of operating systems startup and shutdown booting performance monitoring storage backup and restore system administration tools system maintenance user support issues web administration and integration of network storage system resources to meet user needs. Enterprise goals and objectives roles and responsibilities of a system administrator.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CIT",
        "catalog_number": "360L",
        "title": "CIT SYS MGMT LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CIT",
        "catalog_number": "384",
        "title": "WEB DEV AND HOSTING",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "CIT",
        "catalog_number": "384L",
        "title": "WEB DEV AND HOST LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CIT",
        "catalog_number": "425",
        "title": "INFO SYS SEC",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "CIT",
        "catalog_number": "425L",
        "title": "INFO SYS SEC LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CIT",
        "catalog_number": "480",
        "title": "CIT System Design and Implementation I",
        "description": "Prerequisites: COMP 484/L; IS 451; Upper Division Writing Proficiency Exam. Corequisite: 480L. CIT senior project first semester includes project proposal methods and processes feasibility studies teamwork CASE tools work breakdown structure estimating and budgeting schedule planning peer reviews and inspections and technical presentation. Professional communication. Teamwork concepts and issues. Organizational Context. Professional and ethical Issues roles and responsibilities. Lab: 3 hours per week.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "CIT",
        "catalog_number": "480L",
        "title": "CIT System Design and Implementation I Lab",
        "description": "Prerequisites: COMP 484; IS 451; Upper Division Writing Proficiency Exam. Corequisite: 480. CIT senior project first semester includes project proposal methods and processes feasibility studies teamwork CASE tools work breakdown structure estimating and budgeting schedule planning peer reviews and inspections and technical presentation. Professional communication. Teamwork concepts and issues. Organizational Context. Professional and ethical Issues roles and responsibilities. Lab: 3 hours per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CIT",
        "catalog_number": "481L",
        "title": "CIT DESIGN II LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CIT",
        "catalog_number": "481",
        "title": "CIT DESIGN II",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    }
]