[
    {
        "subject": "COMS",
        "catalog_number": "104",
        "title": "Literature in Performance",
        "description": "Corequisite: COMS 104L. Introduction to principles techniques and practices in solo performance of poetry fiction and drama. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "150",
        "title": "Introduction to Communication Studies",
        "description": "An introduction to Communication Studies with an emphasis on the history of the field and the various theories contexts and perspectives that inform the study of human communication. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "151",
        "title": "Fundamentals of Public Speaking",
        "description": "Prerequisite: EPT score of 151 or better. Corequisite: COMS 151L. Introduction to the study of the human communication process with an emphasis on effective public communication. Includes intensive practice in public speaking reasoning and critical listening. 15 hours of communication experience outside the class are required. (Cross listed with CHS and PAS 151) (Available for General Education Oral Communication.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "151EOP",
        "title": "FUND PUBLIC SPEAKING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "195",
        "title": "Forensics",
        "description": "Supervised activity in competitive intercollegiate forensics.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "COMS",
        "catalog_number": "199",
        "title": "Performance Ensemble",
        "description": "Supervised activity in group performance of literature. Participation in theatre programs before campus audiences. Course is repeatable for a maximum of three completions of credit.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "COMS",
        "catalog_number": "225",
        "title": "Argumentation",
        "description": "Prerequisite: EPT score of 151 or better. Corequisite: 225L. Studies of the strategies used for rhetorical argument. Emphasis is given to ways of finding issues using evidence and detecting fallacies in rhetorical communications. Practice is given in the formulation and critical analysis of argument in rhetorical communications. 15 hours of communication experience outside of class are required. (Available for General Education Critical Thinking )\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "251",
        "title": "INTRO INTERP COMM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "301",
        "title": "Performance",
        "description": "Language and Cultural StudiesStudy of the complex relationships among culture language and performance in communication. Examination of theory behavior practice and criticism from aesthetic and sociocultural perspectives with emphasis on contemporary research in language culture and performance studies.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "303",
        "title": "Narrative in Performance",
        "description": "Prerequisite: COMS 301. Theory and practice in performing narrative fiction and nonfiction. Analysis of the role of narrative in the communicative life of the individual and society. Solo and group performances.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "304",
        "title": "Poetry in Performance",
        "description": "Prerequisite: COMS 301. Theory and practice in performing poetry. Analysis of the role of poetry and poetic language in the communicative life of the individual and society. Solo and group performances.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "309",
        "title": "Advanced Public Speaking",
        "description": "Prerequisite: COMS 151/L or 225L. Application of the principles of audience analysis to the preparation presentation and evaluation of persuasive messages. (Available for General Education Oral Communication.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "312",
        "title": "HEALTH COMM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "315",
        "title": "COMM & AGENCY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "320",
        "title": "Communicative Functions of Language",
        "description": "Prerequisite: COMS 351. Study of the form and structure of the language of persuasive discourse including semantics syntax usage lexicography and style.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "321",
        "title": "Rhetorical Discourse",
        "description": "Prerequisites: COMS 151/L or 225/L; Completion of the Lower Division writing requirement. Study of the language and principles of human communication through the production analysis and evaluation of rhetorical messages. Satisfies the teacher credential program requirement for competence in writing.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "323",
        "title": "Group Communication",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Principles and methods of small group communication. Development of individual and group skills through application of theory to practice. Emphasis is on intra-group behavior. (Available for General Education Lifelong Learning.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "325",
        "title": "Legal Argumentation",
        "description": "Study of courtroom argument with emphasis on issues evidence forms of argument and language in lawyers pleadings and judicial opinions.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "327",
        "title": "Rhetorical Theory",
        "description": "Theories of rhetoric from classical Greece and Rome to the present. Critical methodologies inherent in rhetorical theories of each period are applied to typical examples of public discourse of that period.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "350",
        "title": "Nonverbal Communication",
        "description": "Prerequisite: COMS 351. Discussion and examination of nonverbal communication and its effects upon the individuals attitudes and verbal communication.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "351",
        "title": "Communication Theory",
        "description": "Survey of multiple theoretical perspectives on the study of human communication. Examination of the relationships among communication theory and other areas of study within the field of communication studies.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "354",
        "title": "COMM & TECHNOLOGY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "356",
        "title": "Intercultural Communication",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Cultural factors in interpersonal communication such as perception roles language codes and nonverbal communication. Students will apply and evaluate theories of intercultural communication. (Available for General Education Comparative Cultural Studies.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "360",
        "title": "Communication and the Sexes",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. An examination of the communication styles of males and females in a variety of settings. Emphasis is given to gender-related communication behavior and its implications for the ability to maintain effective personal and professional relationships. Strategies for fostering communication competence will be discussed. (Available for General Education Lifelong Learning.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "392IP",
        "title": "POL IDEOL & COMM PROPAGND",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "395",
        "title": "FORENSICS",
        "description": null,
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "399",
        "title": "PERF ENS",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "COMS",
        "catalog_number": "400C",
        "title": "Directing Oral Performance",
        "description": "Prerequisites: Available only to Upper Division students who have completed a minimum of two units of any of the following: COMS 195 198 or 199; Consent of instructor. Faculty-supervised students direct other students oral performances. May be taken for a maximum of 6 units.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "401",
        "title": "Performance and Social Change",
        "description": "Prerequisite: COMS 301. Examination and application of contemporary theories of performance as a means of change in individual and communal life. Students employ performance methodologies to examine complexities of various communication contexts and situations and enact various strategies for working through these complexities. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "404",
        "title": "Theories of Interpretation",
        "description": "Prerequisite: COMS 301. Examination of psychological social cultural literary and hermeneutic theories of interpretation with an emphasis on the interaction of text context and audience. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "406",
        "title": "PERF COMP",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "410",
        "title": "COMMUNITY PERFORM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "420",
        "title": "Language and Symbolic Processes",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Study of the structural psychological and semantic facets of language and their implications for the study of rhetorical communication. Regular written assignments will be required. Available for graduate credit. (Available for Section C of the Multicultural Requirement for Credential Candidates.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "425",
        "title": "Theories of Argument and Deliberation",
        "description": "Prerequisite: COMS 327. Exploration of theories of argument and their application to decision making. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "428",
        "title": "Freedom of Speech",
        "description": "Exploration of freedom of speech in American society. Emphasis given to a communication studies approach to issues in freedom of speech. Focus on contemporary problems of free speech in the U.S. including sedition obscenity advocacy of illegal action libel words of provocation copyright academic freedom and national security. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "430",
        "title": "Rhetorical Criticism",
        "description": "Prerequisite: Completion of Lower Division writing requirement. Instruction in the methods and applications of rhetorical criticism focusing upon the analysis and evaluation of rhetorical discourse. Regular written assignments are required. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "431",
        "title": "Persuasion",
        "description": "Prerequisite: COMS 351. Logical and psychological principles used by writers and speakers to effect social control. Analysis and evaluation of recent research in attitude modification. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "435",
        "title": "Rhetoric of Women",
        "description": "Prerequisites: COMS 327; Completion of the Lower Division writing requirement. Analysis and evaluation of the rhetoric of women involved in political social and economic reforms. Regular written assignments are required. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "436",
        "title": "COMM & FOOD",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "437",
        "title": "Communication for Youth Institute",
        "description": "Prerequisites: COMS 151/L; Prior approval of the CYI Program Coordinator. Instruction is provided in communication education. Faculty-supervised students will teach communication skills to area youth in a community service-learning program. Students work closely with the instructor in course preparation delivery of course content oral and written assignment evaluation and curricular assessment. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "440",
        "title": "Performance and Cultural Studies Criticism",
        "description": "Recommended Preparatory: COMS 301. This course is an introduction to the critical methods in performance studies and cultural studies. It provides instruction on critical interpretation and analysis as well as specific methods used in performance studies and cultural studies. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "442",
        "title": "Rhetoric of Peace and Conflict",
        "description": "Prerequisites: COMS 327; Completion of the Lower Division writing requirement. Exploration of the rhetorical implications of conflict and struggle as performed in subcultural national and international contexts. Regular written assignments are required. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "443",
        "title": "Rhetoric of Business",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Critical analysis of the rhetoric used in executive speaking advertising and labor negotiations. Regular written assignments are required. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "444",
        "title": "Political Rhetoric",
        "description": "Prerequisites: COMS 327; Completion of the Lower Division writing requirement. Study of rhetoric of recent U.S. political campaigns both local and national including persuasive techniques ethical considerations and effectiveness. Practice in planning and developing rhetorical messages for political campaigns. Regular written assignments are required. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "445",
        "title": "Communication and Popular Cultures",
        "description": "Prerequisite: COMS 301. A survey of theories of contemporary popular cultural forms as human communicative behavior. Students will learn to utilize theories of rhetoric performance and critical/cultural studies to analyze popular cultural artifacts as symbolic forms. Regular written assignments are required. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "446",
        "title": "Rhetoric of Crime and Punishment",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Study of rhetoric of crime criminal procedure punishment and justice in different societies and cultures. Regular written assignments are required. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "448",
        "title": "RHET OF X CLAIM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "450",
        "title": "Communication Research Methodology",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Examination of the strategy and methodology of contemporary research in communication. Emphasis is on scientific process the derivation and verification of hypotheses in communication and persuasion and basic communication research design. Regular written assignments are required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "451",
        "title": "Advanced Interpersonal Communication",
        "description": "Pre-requisite: COMS 351. This course examines the process of interpersonal communication as a focus of research and theory.  Attention will be given to relationship messages stages of interpersonal relationships relationship rituals intimate dialogue the dialogue of distance maintaining relationships through dialogue and developing effective communication in relationships.  The course takes a “social constructionist” approach to the study of communication meaning that individuals through various sign systems and mediums create and re-create their social worlds through a dynamic web of relationships within various contexts.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "452",
        "title": "Communication Training and Development",
        "description": "Recommended Preparatory: COMS 351 450. This course is an examination and analysis of the processes and challenges of communication training and development. Through discussion and fieldwork students explore applications of communication theory and learn how to conduct organizational culture audits and communication competency assessments through observations evaluations analyses interviews focus groups and surveys of employees and other key audiences whose input and support is needed to improve communication. Students will write audit/assessment reports and design deliver and evaluate customized communication training packages and programs for a variety of organizational settings.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "453",
        "title": "Organizational Communication",
        "description": "Prerequisite: COMS 351. Application of the principles of human communication in the formal organizational setting including communication channels networks climate and relationships.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "464",
        "title": "Digital Rhetorics",
        "description": "This course explores popular rhetorics of communication in the Digital Age and offers an examination of the influence of modern digital technologies and environments on persuasion and communication. Upper Division Standing. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "494",
        "title": "COM INTERN LEC",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "COMS",
        "catalog_number": "494L",
        "title": "COM INTERN LAB",
        "description": null,
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "COMS",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "No Course Description.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "COMS",
        "catalog_number": "600",
        "title": "Core Seminar in Communication",
        "description": "Introduction to graduate study in communication theory rhetorical theory performance language and cultural studies.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMS",
        "catalog_number": "603",
        "title": "Seminar in Performance Studies",
        "description": "Study of performance as communication. Examination of theory practice and criticism from aesthetic and sociocultural perspectives with emphasis on contemporary research in performance language and cultural studies.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMS",
        "catalog_number": "604",
        "title": "Seminar in Textual Studies",
        "description": "Study of performance implications of varying critical approaches to text.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMS",
        "catalog_number": "610",
        "title": "Current Research in Performance Studies",
        "description": "Corequisite: COMS 600. Advanced study of new and current developments in performance studies. May be repeated once for credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMS",
        "catalog_number": "631",
        "title": "Studies in Classical Rhetoric",
        "description": "Advanced study in rhetorical theory from ancient Greece through the Renaissance.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMS",
        "catalog_number": "632",
        "title": "Studies in Contemporary Rhetoric",
        "description": "Advanced study in contemporary rhetorical theory.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMS",
        "catalog_number": "633",
        "title": "Studies in Postmodern Rhetoric",
        "description": "Advanced study in postmodern rhetorical theory\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMS",
        "catalog_number": "634",
        "title": "Applied Rhetorical Studies",
        "description": "Advanced study of the application of rhetorical theories to situated discourse. Topics include rhetorical criticism argumentation analysis and/or the application of critical and social theory.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "640",
        "title": "Current Research in Rhetorical Studies",
        "description": "Corequisite: COMS 600. Advanced study of new and current developments in Rhetorical Studies. May be repeated once for credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMS",
        "catalog_number": "650",
        "title": "Seminar in Communication Theory",
        "description": "Study of historical and contemporary trends in theory and research on communication and communication processes.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMS",
        "catalog_number": "651",
        "title": "Seminar in Interpersonal Communication",
        "description": "Study of advanced principles of communication as applied to interpersonal communication theory. Special emphasis on research in the area of interpersonal communication.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMS",
        "catalog_number": "652",
        "title": "Seminar in Group Communication",
        "description": "Study of advanced principles of communication as applied to small-group communication theory and research.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMS",
        "catalog_number": "653",
        "title": "Seminar in Organizational Communication Research",
        "description": "Study of advanced principles of communication as applied to the organizational setting with special emphasis on research in organizational communication.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMS",
        "catalog_number": "660",
        "title": "Current Research in Communication Theory",
        "description": "Corequisite: COMS 600. Advanced study of new and current developments in communication theory. May be repeated once for credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMS",
        "catalog_number": "680",
        "title": "Communication Education",
        "description": "Prerequisite: Available to graduate and Upper Division undergraduate students. Exploration of the communication dimensions of adult education and critical pedagogy. Application of theory in a wide range of instructional settings including teaching college and university classrooms training in non-profit and for-profit business environments and facilitating educational programs for community organizations.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Enrollment is required in the semester in which the comprehensive examination is taken.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "COMS",
        "catalog_number": "698C",
        "title": "THESIS/GRAD PROJ",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "COMS",
        "catalog_number": "151HON",
        "title": "FUND PUBLIC SPEAKING",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "495SOC",
        "title": "INTERNSHIP",
        "description": null,
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "COMS",
        "catalog_number": "601",
        "title": "Core Seminar in Communication Research Methods",
        "description": "This course is an introduction to the epistemological assumptions design and methods of analysis in communication research. It provides a broad overview of humanistic social scientific rhetorical and critical approaches to studying communication.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "COMS",
        "catalog_number": "620",
        "title": "Seminar in Communication and Language",
        "description": "Study of contemporary theories of language and linguistics as applied to principles of communication. Emphasis on language and social interaction linguistic pragmatics and systems of symbolic representation.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMS",
        "catalog_number": "635",
        "title": "Feminist Perspectives on Communication",
        "description": "Study of contemporary feminist theories applied to communication research.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMS",
        "catalog_number": "654",
        "title": "Seminar in Communication and Technology",
        "description": "Advanced study of the principles of communication technology with emphasis on theory and research.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "COMS",
        "catalog_number": "656",
        "title": "Seminar in Intercultural Communication",
        "description": "Study of advanced principles of communication as applied to intercultural communication. Special emphasis on research in the area of intercultural communication. (IC)\n",
        "units": "3",
        "class_type": "SEM"
    }
]