[
    {
        "subject": "CTVA",
        "catalog_number": "100",
        "title": "Introduction to Mass Communication Arts",
        "description": "Not open to students with credit in JOUR 100. Survey of the fields of radio television and film as they relate to other mass media. Comparative analysis and evaluation including historical societal legal and individual considerations. (Available for General Education Lifelong Learning.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "210",
        "title": "Television-Film Aesthetics",
        "description": "TV and film communicative art forms. Representative films and television programs are exhibited and analyzed. (Available for General Education Arts and Humanities.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "215",
        "title": "CULT FILM AND TV",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "220",
        "title": "Foundations of Media Writing",
        "description": "Prerequisite: Completion of Lower Division writing requirement. Required of all pre-majors. Basic introductory course in writing for the film and electronic media with emphasis on preparing scripts in proper formats. Includes a writing evaluation component as part of the course requirement.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "230",
        "title": "Fundamentals of Audio Production",
        "description": "Introductory course in audio production. Training in digital production audio console operation use of tape recorders and microphones tape editing program formats and announcing. Lab with accompanying lecture 4 hours per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "240",
        "title": "Fundamentals of Video Production",
        "description": "Basic introduction to all aspects of television studio production audio and video; microphones audio recorders cameras lenses switching and lighting equipment. Principles of graphics and scenery. Lab with accompanying lecture 6 hours per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "250",
        "title": "Fundamentals of Film Production",
        "description": "Prerequisite: ART 250. Introductory course in Television-Film Production. Use of film as a creative medium and art form in mass communication using 16mm production techniques. 6 hours lab per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "260",
        "title": "INTRO DGTL FLMKNG",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "292IP",
        "title": "INTRO TO SCREEN PROD",
        "description": null,
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "301",
        "title": "Design of the Media Message",
        "description": "Prerequisite: CTVA 100 CTVA 210 and CTVA 220. Fundamentals of researching and designing the informational media program. Principles of determining audience needs research analysis and design and program structure as they apply to documentaries motivational programs and other educational and propaganda messages. Regular written assignments required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "305",
        "title": "History of Broadcasting",
        "description": "Prerequisite: CTVA 100. Radio and television broadcasting: beginnings development commercial and noncommercial support regulations impact on society programming and future of telecommunications.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "309",
        "title": "Film as Literature",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Survey of the art of the cinema in order to establish a unique visual literature with its own critical standards. Feature films of various types and from diverse sources are screened. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "310",
        "title": "History of American Cinema",
        "description": "Prerequisites: CTVA 100l Completion of Lower Division writing requirement. History of the development of American cinema: formats film aesthetics societal impact evolution as an entertainment medium. Screening and evaluation of representative films.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "315",
        "title": "New Directions in Electronic Media Systems",
        "description": "Prerequisite: CTVA 100. Examination of electronic media systems for program production and dissemination as well as implications for producers regulators and society as a whole.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "319",
        "title": "Criticism in Cinema and Television Arts",
        "description": "Prerequisites: CTVA 210; Completion of Lower Division writing requirement. Analysis of social cultural literary and moral aspects of radio television and film. Examination of media as distributors of information propaganda and entertainment. Regular written assignments required including the writing of critical analyses.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "320",
        "title": "Writing for Film and Television",
        "description": "Prerequisite: CTVA 220. Basic dramatic screenwriting techniques for television and film. Disciplines of plot construction characterization and dialogue are examined.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "329A",
        "title": "Program Production",
        "description": "Prerequisite: Instructor consent. CTVA 230 is required for all students working at KCSN. Principles of management programming and production with practical application. Students must work at least 3 hours a week for 1 unit. Maximum of 6 units allowable. (Credit/No Credit only)\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "CTVA",
        "catalog_number": "331",
        "title": "PRODUCING DOC",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "340",
        "title": "Advanced Video Production and Editing",
        "description": "Prerequisite: CTVA 240. Advanced course in the creative use of television studio cameras lighting sound computer graphics and editing principles in television productions including interview and dramatic formats. Both group and individual projects are structured around theory and practice. Lab with accompanying lecture 6 hours per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "341",
        "title": "Single-Camera Video Production and Editing",
        "description": "Prerequisite: CTVA 340. Overview of the theory and practice of electronic field production. Examines the technical and aesthetic requirements of single-camera video production and editing. 6 hours of lecture and lab activity per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "342",
        "title": "Digital Cinematography",
        "description": "Prerequisite: CTVA 240 or 357. Advanced course with a specialized foundation in digital cinematography. The course will explore the theory and professional practice of digital cinematography for television and film. Topics include history theory composition visual design lighting and special effects. Dual emphasis on individual creativity and production group dynamics. 3 hours lecture; three hours lab per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "343",
        "title": "TV PROD SOUND",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "346",
        "title": "EPISODIC TV PROD",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "350",
        "title": "Film Directing",
        "description": "Prerequisite: CTVA 250. Examination of basic creative elements and technical approaches necessary to achieve professional excellence in film direction. 6 lab hours per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "351",
        "title": "Anatomy of Film Producing",
        "description": "Prerequisite: CTVA 240 or 250. Organization and management for both independent and studio film production. Basic business procedures financing budgeting distribution exhibition legal matters the development of entrepreneurial skills and structure practices and current trends of the industry.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "352",
        "title": "Nonlinear Digital Editing",
        "description": "Recommended Corequisite or Preparatory: CTVA 341 or 355. Overview of the theory and practice of nonlinear editing for video and film utilizing nonlinear digital editing work stations. Examines the technical and aesthetic requirements of editing through the use of professional film and video dailies. Gives the student fundamental knowledge and experience the Editor and Assistant Editor must have to run a digital editing system. 3 hours of lecture; 3 hours of lab activity per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "355",
        "title": "Intermediate Film Production",
        "description": "Prerequisite: CTVA 250. Intermediate course in 16mm film production with emphasis on story and the creative use of the motion picture camera sound editing and other aesthetic elements. 6 hours of lab per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "356",
        "title": "Advanced Film Editing",
        "description": "Prerequisite: CTVA 355. Advanced course in post-production film technique and aesthetics including the analysis application and mastery of editing styles. 6 hours of lab per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "357",
        "title": "Advanced Cinematography",
        "description": "Prerequisite: CTVA 355. Advanced course in film production techniques and aesthetics including detailed examination of film grammar as it is created in the camera lighting technology and practice camera technology optics of lenses and their effect on aesthetics principles of composition new technologies computerized application and special cinematic situations (e.g. infrared underwater and macro-cine). 6 hours of lab per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "358",
        "title": "Advanced Film Sound",
        "description": "Prerequisite: CTVA 355. Advanced course in the theory and practice of sound gathering and mixing for motion picture production including technical and aesthetic requirements. Use of various technologies and microphones. Presents the mix and post production sound editing. 3e hours lecture; 3 hours lab per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "359",
        "title": "Post Production Sound Design for Film and Electronic Media",
        "description": "Prerequisite: CTVA 355 or 340. Advanced course with a specialized foundation in post production sound recording and mixing. The course will explore the theory and professional practice of sound design for film and electronic media. Topics include history theory dialogue editing sound effects Foley ADR and surround sound. Dual emphasis on individual creativity and production group dynamics. 3 hours lecture; 3 hours lab per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "363",
        "title": "FUND IMMERSIVE PROD",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "364",
        "title": "INTERACTIVE PROD",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "370",
        "title": "IMMERSIVE AUDIO",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "384",
        "title": "Electronic Media Advertising",
        "description": "Prerequisite: CTVA 100. Advertising as economic support for broadcast media. Audience market surveys network affiliate rate structures. Impact of Radio-TV advertising on local and national economy.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "392IP",
        "title": "WRTNG FOR MULTIMED",
        "description": null,
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "400",
        "title": "Media and Society",
        "description": "Prerequisite: CTVA 100. Examination of contemporary views of media and societal effects. Analysis of McLuhan Meyrowitz Postman and other theorists. Effects of TV violence.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "401",
        "title": "Mass Communications Research",
        "description": "Prerequisite: CTVA 100. Inquiry into research methodology in mass communication. Emphasis on solution of research problems in areas relating to the mass media.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "405",
        "title": "International Broadcasting",
        "description": "Prerequisite: CTVA 100. Comparative examination of broadcasting in foreign nations. Analysis of how radio and television reflect the social and political life of each country.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "410",
        "title": "Advanced Film Theory: Studies in Film Style",
        "description": "Prerequisites: CTVA 210 or 310; Completion of Lower Division writing requirement. Study of realistic and expressive elements as reflected in selected film and literary references. Emphasis on aesthetic implications and significance of directorial thematic cinematographic approaches and techniques in the film medium. Regular written assignments required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "412",
        "title": "Analysis of Classic Filmmakers",
        "description": "Prerequisites: CTVA 210 or 310; Completion of Lower Division writing requirement. In-depth analysis of the unique personal visions and creative accomplishments of specially selected film artists studied from the point of view of technique visual style content and sociological implications. Regular written assignments required\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "413",
        "title": "Women as Filmmakers",
        "description": "Prerequisites: Completion of Lower Division writing requirement CTVA 210 or 310. Examination of the careers and film productions of various internationally recognized women filmmakers (e.g. directors writer/directors etc.) focusing on their unique contributions in content and style. Emphasis on the present-day scene with films or video from France Germany Italy Australia and the U.S. Regular written assignments required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "415C",
        "title": "International Cinema: China",
        "description": "Prerequisites: Completion of the Lower Division writing requirement; CTVA 210 or 310. In-depth analysis of the creative accomplishments of the aesthetic and socioeconomic influences on the cinematic art of a single nation or geographic region other than the U.S. Specific nations or regions will vary from semester to semester. Up to two different sections of this course may be taken for credit in the following areas: (A) Australia; (B) Britain; (C) China; (D) Canada; (E) Eastern Europe; (F) France; (G) Germany; (H) Hispanic; (I) Italy; (J) Japan; and (S) Survey of a variety of countries. Regular written assignments required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "415J",
        "title": "International Cinema: Japan",
        "description": "Prerequisites: Completion of the Lower Division writing requirement; CTVA 210 or 310. In-depth analysis of the creative accomplishments of the aesthetic and socioeconomic influences on the cinematic art of a single nation or geographic region other than the U.S. Specific nations or regions will vary from semester to semester. Up to two different sections of this course may be taken for credit in the following areas: (A) Australia; (B) Britain; (C) China; (D) Canada; (E) Eastern Europe; (F) France; (G) Germany; (H) Hispanic; (I) Italy; (J) Japan; and (S) Survey of a variety of countries. Regular written assignments required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "416",
        "title": "The Documentary Tradition in Film and Video",
        "description": "Prerequisite: CTVA 210. Examination of the history functions ethics and aesthetics of the documentary in both theatrical and television formats. Screening of works from U.S. and international sources including those that represent the documentary purposes of observation analysis persuasion and aesthetic expression. Regular critical writing assignments required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "420",
        "title": "Screenplay Adaptation",
        "description": "Prerequisite: CTVA 320. Advanced development of student skills and techniques with emphasis on the adaptation of a published literary work. Available for graduate credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CTVA",
        "catalog_number": "421",
        "title": "Writing the Short Film",
        "description": "Prerequisites: CTVA 220; Either CTVA 320 (for Writing Option) or 355 (for Film Option); Instructor consent. Must be taken prior to submission of the senior film proposal. For those who intend to write short film screenplays to be used for senior film productions. Via lectures discussions and readings provides dramatic principles pertinent to the writing of a short film script. Students are guided incrementally in a workshop setting through the development of several drafts of the screenplay. Final outcome is a 10-15 page production-ready shooting script. Available for graduate credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CTVA",
        "catalog_number": "422",
        "title": "WRTG EPISODIC SRS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "425",
        "title": "Advanced Screenwriting",
        "description": "Prerequisite: CTVA 420. Advanced problems in writing drama program specials. Available for graduate credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CTVA",
        "catalog_number": "428",
        "title": "Writing Screenplay Comedy",
        "description": "Prerequisite: CTVA 320. An examination of the theory spectrum and structures of comedy as well as the writing of comedy scenes and screenplays. Available for graduate credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CTVA",
        "catalog_number": "440",
        "title": "Theory and Techniques of TV Directing",
        "description": "Prerequisite: CTVA 240. Theories and techniques of TV directing. Unique characteristics of video as they affect the art of directing. Screening and critique of representative TV programs.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "441",
        "title": "Directing the TV Documentary",
        "description": "Prerequisite: CTVA 341. Advanced television directing course emphasizing educational and documentary formats. Both studio and remote production assignments. Lab with accompanying lecture 6 hours per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "442",
        "title": "Directing the TV Drama/Comedy",
        "description": "Prerequisites: CTVA 341; 440. Advanced television directing course emphasizing dramatic formats. Producing and directing live and recorded studio situation comedy and drama programs. 6 hours lab per week.\n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "CTVA",
        "catalog_number": "452A",
        "title": "SENIOR FILM PROJ",
        "description": null,
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "CTVA",
        "catalog_number": "452B",
        "title": "SENIOR FILM PROJ II",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CTVA",
        "catalog_number": "453",
        "title": "ADV FILM POST PROD",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "455",
        "title": "PRODUCTION MGMT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "462",
        "title": "INTERMED IMMERS PROD",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "463CS",
        "title": "EMERGING MEDIA CAPST",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "467",
        "title": "The Management of Post Production for Television and Film",
        "description": "Prerequisite: CTVA 100. Advanced course on the management processes involved in post production including scheduling and budgeting setting up and managing an edit room and planning and carrying out cost-effective on-line sound mixing color correction and titling sessions for accurate and on-time project delivery.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "475",
        "title": "Audience Analysis",
        "description": "Prerequisite: CTVA 100. Lecture/discussion of mass audiences and the techniques used to study their wants needs motives attitudes opinions and behavior. Survey of audience measurement techniques.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "480",
        "title": "Electronic Media Management",
        "description": "Prerequisite: CTVA 100. Study of business problems of station operations. Stress placed on case studies of stations.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "481",
        "title": "Network Practices",
        "description": "Prerequisite: CTVA 100. Network as unique development in broadcasting its role in distribution of information and the national economy.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "482",
        "title": "Network Program Development",
        "description": "Prerequisites: CTVA 100. Theoretical and practical problems in producing current network television programs.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "483",
        "title": "EMRGNG PRGM PRCT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "487",
        "title": "Social Controls and Regulation of Electronic Media",
        "description": "Prerequisite: CTVA 100. Legal and social controls in the regulation of electronic media including broadcasting cable television common carriers and communication satellites. Regulatory efforts of federal agencies such as the FCC and controlling influences of public interest groups and the electronic media industry itself.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "489",
        "title": "STRATEGIC MEDIA MGMT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CTVA",
        "catalog_number": "494A",
        "title": "Internship",
        "description": "Prerequisite: CTVA major and minor -- approval through application and instructor consent. Extensive on-the-job training in specific areas of Radio TV or Film production or administration. Maximum 6 units. Academic Internship Course. (Credit/No Credit only)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "495D",
        "title": "CURR TREND TV/FLM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "495V",
        "title": "CURR TRD VIRT PREVIS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "500",
        "title": "Theory and History of Cinema and Electronic Media",
        "description": "Prerequisite: Graduate status. Survey of the history of cinema/electronic media as well as cinema and electronic media theory and criticism from the silent era through the 1950s.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CTVA",
        "catalog_number": "505",
        "title": "Contemporary Film Analysis",
        "description": "Prerequisite: Graduate Status. Exploration of screen story structure and the screenwriting tools of dramaturgy used in contemporary motion pictures to impact audiences emotionally and intellectually. Effective story outlining paradigms are investigated and story strengths and weaknesses are analyzed. Written film analysis assignments are required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "510",
        "title": "Screenplay Scene Writing",
        "description": "Prerequisite: Graduate Status. Investigates the techniques and dramatic tools used to write powerful scenes for the screen. Emphasis on the creation of fully dimensional characters use of visual elements tempo timing descriptive style and dialogue. This workshop course is product-oriented and students complete a screenplay project.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "512",
        "title": "Seminar in Cinema and Contemporary Media Theory",
        "description": "Prerequisite: CTVA 500. Seminar in specific cinema and/or electronic media theory. Includes analysis and evaluation of the works of major cinema and media theorists.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CTVA",
        "catalog_number": "595A",
        "title": "Studies in Mass Communication: Advanced Research",
        "description": "Prerequisite: Graduate Status. Graduate studies in Cinema and Television Arts Mass Communication. Faculty members will lead a small group of students in the study of the following general areas with exact content to be determined: (A) Advanced Research; (B) History; (C) Theory; (D) Writing Episodic Television; (E) TV Production; (F) Film Practicum: The Business of Film and TV; (G) Educational Media; (H) Management; and (I) International Communication.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CTVA",
        "catalog_number": "595D",
        "title": "Studies in Mass Communication: Writing Episodic Television",
        "description": "Prerequisite: Graduate Status. Graduate studies in Cinema and Television Arts Mass Communication. Faculty members will lead a small group of students in the study of the following general areas with exact content to be determined: (A) Advanced Research; (B) History; (C) Theory; (D) Writing Episodic Television; (E) TV Production; (F) Film Practicum: The Business of Film and TV; (G) Educational Media; (H) Management; and (I) International Communication.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CTVA",
        "catalog_number": "595E",
        "title": "Studies in Mass Communication: TV Production",
        "description": "Prerequisite: Graduate Status. Graduate studies in Cinema and Television Arts Mass Communication. Faculty members will lead a small group of students in the study of the following general areas with exact content to be determined: (A) Advanced Research; (B) History; (C) Theory; (D) Writing Episodic Television; (E) TV Production; (F) Film Practicum: The Business of Film and TV; (G) Educational Media; (H) Management; and (I) International Communication.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CTVA",
        "catalog_number": "595G",
        "title": "Studies in Mass Communication: Educational Media",
        "description": "Prerequisite: Graduate Status. Graduate studies in Cinema and Television Arts Mass Communication. Faculty members will lead a small group of students in the study of the following general areas with exact content to be determined: (A) Advanced Research; (B) History; (C) Theory; (D) Writing Episodic Television; (E) TV Production; (F) Film Practicum: The Business of Film and TV; (G) Educational Media; (H) Management; and (I) International Communication.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CTVA",
        "catalog_number": "595H",
        "title": "Studies in Mass Communication: Management",
        "description": "Prerequisite: Graduate Status. Graduate studies in Cinema and Television Arts Mass Communication. Faculty members will lead a small group of students in the study of the following general areas with exact content to be determined: (A) Advanced Research; (B) History; (C) Theory; (D) Writing Episodic Television; (E) TV Production; (F) Film Practicum: The Business of Film and TV; (G) Educational Media; (H) Management; and (I) International Communication.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CTVA",
        "catalog_number": "622",
        "title": "Department Colloquium",
        "description": "Prerequisite: CTVA 500. Intensive study of contemporary issues in Screenwriting by Graduate Faculty on a rotating basis.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CTVA",
        "catalog_number": "625",
        "title": "Writing the Feature-Length Screenplay",
        "description": "Prerequisites: CTVA 505 CTVA 525. In this course screen story structure creation undertaken in CTVA 525 will be continued to the completion of a feature-length screenplay.  This is a product-oriented course.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "692",
        "title": "Thesis Script Preparation",
        "description": "Prerequisite: CTVA 525. Instruction in the steps of thesis publication and individual guidance in developing original story ideas into full outlines for thesis screenplays.  The first act of a feature-length thesis script is also written as preparation for final thesis completion and publication in CTVA 698C. This is a product-oriented course.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CTVA",
        "catalog_number": "694A",
        "title": "Internship",
        "description": "Prerequisites: CTVA 602; Approval of Graduate Advisor. Intensive on-the-job training beyond the entry level in radio television and allied industries.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CTVA",
        "catalog_number": "698C",
        "title": "Thesis or Graduate Project",
        "description": "Prerequisites: CTVA 501 602; Approval of Graduate Advisor.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "CTVA",
        "catalog_number": "327",
        "title": "Writing for Industrial Media",
        "description": "Prerequisite: CTVA 220. Theory history and principles of writing industrial film and television programs for business government and other organized groups.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "361",
        "title": "Computer Fundamentals for Multimedia",
        "description": "Prerequisite: CTVA 100. General introduction to computers and their use in multimedia design production distribution and in desktop video. Covers computer fundamentals the use of the graphic user interface provides an overview of the use of computers in multimedia and familiarizes students with appropriate software. 6 hours per week.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "CTVA",
        "catalog_number": "362",
        "title": "Corporate and Instructional Media",
        "description": "Prerequisite: CTVA 100. Study of contemporary practices in corporate school medical and civic media as they relate to educational training and motivational purposes. Examination of audience needs objectives design and writing production distribution utilization and evaluation.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "415S",
        "title": "International Cinema: Survey of a Variety of Countries",
        "description": "Prerequisites: Completion of the Lower Division writing requirement; CTVA 210 or 310. In-depth analysis of the creative accomplishments of the aesthetic and socioeconomic influences on the cinematic art of a single nation or geographic region other than the U.S. Specific nations or regions will vary from semester to semester. Up to two different sections of this course may be taken for credit in the following areas: (A) Australia; (B) Britain; (C) China; (D) Canada; (E) Eastern Europe; (F) France; (G) Germany; (H) Hispanic; (I) Italy; (J) Japan; and (S) Survey of a variety of countries. Regular written assignments required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CTVA",
        "catalog_number": "461",
        "title": "Interactive Multimedia Development",
        "description": "Prerequisites: CTVA 361; Completion of Lower Division writing requirement. Development creation and integration of multimedia elements for entertainment consumer and corporate products. Introduction to design parameters pre-production (design documents budgets schedules) production post-production (testing plans) and implementation. Regular computer assignments required. Lab 6 hours.\n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "CTVA",
        "catalog_number": "501",
        "title": "Theory and History of Cinema and Electronic Media II",
        "description": "Prerequisite: CTVA 500. Survey of the history of cinema/electronic media as well as cinema and electronic media theory and criticism from the 1950s to the present.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CTVA",
        "catalog_number": "525",
        "title": "Seminar in Screenwriting",
        "description": "Prerequisites: CTVA 425 501. Identification and analysis of the student writers creative strengths and weaknesses. Format includes exercises and original screenplay material specifically designed to strengthen narrative skills.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CTVA",
        "catalog_number": "595F",
        "title": "Studies in Mass Communication: Film Practicum",
        "description": "Prerequisite: Graduate Status. Graduate studies in Cinema and Television Arts Mass Communication. Faculty members will lead a small group of students in the study of the following general areas with exact content to be determined: (A) Advanced Research; (B) History; (C) Theory; (D) Writing Episodic Television; (E) TV Production; (F) Film Practicum: The Business of Film and TV; (G) Educational Media; (H) Management; and (I) International Communication.\n",
        "units": "3",
        "class_type": "SEM"
    }
]