[
    {
        "subject": "ECON",
        "catalog_number": "101",
        "title": "ECON FOR LIFE",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "156",
        "title": "Introduction to Economic Analysis and Policy",
        "description": "Prerequisite: Qualifying scores on ELM and EPT or exemption or satisfactory completion of appropriate developmental courses. Uses economics to analyze public policy options in the areas of health care urban and regional development international trade education housing financial market regulation job creation and other topical areas. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "160",
        "title": "Principles of Microeconomics",
        "description": "Prerequisite: Qualifying scores on ELM and EPT or exemption or satisfactory completion of appropriate developmental courses. Introduction to economics as it applies to the functioning of markets businesses and households. The class examines how individuals make decisions about how to use scarce resources efficiently and how these decisions affect markets and the overall economy. Effect of government policies on the functioning of markets also is examined. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "160HON",
        "title": "MICROECON PRIN",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "161",
        "title": "Principles of Macroeconomics",
        "description": "Prerequisites: ECON 160; Qualifying scores on ELM and EPT or exemption or satisfactory completion of appropriate developmental courses. Introduction to economics as it applies to the national and international economy. Topics that the course covers include differences in standards of living across countries the monetary system and the determinants of inflation and the factors causing growth and recessions. Examines the ability of the Federal Reserve and other government policy makers to influence the course of the economy. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "175",
        "title": "INTRO US ECON HIS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "307",
        "title": "Economics for Marketing Professionals",
        "description": "Prerequisite: ECON 160 or 300. Economic theory and applications relevant to marketing professionals. Topics include analysis of business location decisions identifying relevant markets product pricing strategies and the role of advertising in product differentiation. (Marketing majors may substitute this course for ECON 310.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "308",
        "title": "Economics for Managers",
        "description": "Preparatory: ECON 160 and 161 or 300. Connects economic theory to practical issues faced by firm managers. Focuses on the way economic theory affects the firms behavior both internally and externally. Internal issues include organizational structure and contract design especially as these issues relate to opportunism rent-seeking and asymmetric information. External issues include discussions of corporate strategy advertising and the market for corporate control. (Management majors may substitute this course for ECON 310.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "309",
        "title": "The Use and Interpretation of Economic Data",
        "description": "Prerequisites: ECON 160 and 161 or 300; SOM 120 or equivalent. Understanding the use and interpretation of economic statistics in the mainstream media and economic literature. Topics covered include identifying and understanding the misuse of economic statistics as well as performing some statistical analysis using economic data. Emphasis is placed on how students can use written and verbal communication to convey the meaning and relevance of economic statistics to those outside the profession.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "310",
        "title": "Price Theory and Applications",
        "description": "Prerequisites: ECON 160 or 300; MATH 103 or a higher-level mathematics course with the grade ofC or better. The operation of the price system in market-oriented economies. Special emphasis is placed on consumer behavior business behavior market organization the theory of production and cost economic welfare and applications to international trade. Substantial written work will be required of all students. (Available for General Education Social Sciences.) (Marketing majors may subsitute this course with ECON 307.) (Management majors may substitute this course with ECON 308.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "311",
        "title": "Money",
        "description": "Banking and the Federal ReservePrerequisites: ECON 160 and 161 or 300. Examination of money markets the Federal Reserve system foreign exchange markets the international financial system and their relationship to macroeconomic policy. Topics of special interest include the determination of income interest rates exchange rates and international lending. Substantial written work will be required of all students. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "312",
        "title": "MACROECOMIC THRY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "348",
        "title": "History of Economic Institutions",
        "description": "Prerequisites: ECON 160 and 161 or 300. Examines the development of economic institutions and their effect on economic growth from an international perspective. Compares the development of economic institutions in Europe Asia and the Middle East.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "350",
        "title": "Urban Economics",
        "description": "Prerequisite: ECON 160 or 300. Analysis of the formation and location of cities the distribution of activitiesand the variation of land prices within urban areas. Economic analysis of urban housing and blight poverty pollution congestion law enforcement optimal city size urban financesand services.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "355",
        "title": "Health Economics",
        "description": "Prerequisites: ECON 160 and 161 or 300. This class uses economic theory to analyze problems created by the complexities of health care markets. These problems include the widespread use of insurance the important role of asymmetric information the extent of government involvement the role of non-profit hospitals as sellers of health care and the nature of restrictions placed on competition. Additionally the course provides background on hospital costs labor shortages public health concernsand international comparisons of health insurance systems.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "360",
        "title": "Environmental Economics",
        "description": "Prerequisite: ECON 160 or 300. Focuses on environmental issues and policies. Areas include air water noise and toxic waste pollution quality of life concerns and open space and recreational area availability. Benefits and costs of current and alternative environmental policies are analyzed. Specific attention is given to the relation between energy resource development and usage and the environment. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "365",
        "title": "Law and Economics",
        "description": "Prerequisites: ECON 160 and 161 or 300. Examination of the effects of the legal system on the allocation of resources. Selected topics include the economic implications of property rights contract law product liability and the criminal justice system.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "370",
        "title": "Economic Development",
        "description": "Prerequisites: ECON 160 and 161 or 300. Class examines why standards of living differ across countries. Economic growth models are used to explain cross-country differences in economic performance. Emphasis is placed on the role of institutions such as private property rights in the economic development process. Impact of international trade exchange rate systems and international debt on developing countries is carefully examined. Effects of government taxation spending and monetary polices on economic growth and inflation are analyzed. Other issues covered are the impact of financial market development population growth and agriculture on developing economies.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "403",
        "title": "OPEN-ECON MACRO",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "405",
        "title": "International Economics",
        "description": "Prerequisites: ECON 309 310; Upper Division Writing Proficiency Exam score of 8 or higher. Examines world trade in goods services and assets. Explains why nations trade the distribution effects of trade and the consequences of trade policy. Other topics include exchange rates the balance of payments interest rate and purchasing power parity and macroeconomic policies in an open economy.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "409",
        "title": "Introduction to Econometrics",
        "description": "Prerequisites: ECON 309 310; Upper Division Writing Proficiency Exam score of 8 or higher. How to estimate relationships between economic variables using actual data. Techniques taught are used to test economic theory and hypotheses from business. Each class member completes a term project involving the construction and estimation of an econometric model.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "410",
        "title": "Industrial Organization",
        "description": "Prerequisites: ECON 310; Upper Division Writing Proficiency Exam score of 8 or higher. Examination of the structure conductand performance of American industries in both a theoretical and empirical framework. Selected topics include effects of concentration barriers to entry empirical cost curves economics of scale oligopoly behavior models product differentiation and alternative performance measures.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "411",
        "title": "The Economics of Antitrust and Regulation",
        "description": "Prerequisites: ECON 310; Upper Division Writing Proficiency Exam score of 8 or higher. Economic analysis of government policies to alter or maintain market structures and the economic implications of these policies. Selected topics include the problem of antitrust regulation and public ownership of industry mergers price discrimination capital intensity of regulated firms and utility price structure.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "412",
        "title": "Seminar in Economic Thought",
        "description": "Prerequisites: ECON 310; Upper Division Writing Proficiency Exam score of 8 or higher. Seminar in the evolution of economic theory with emphasis on mercantilism physiocracy classical economics and socialism.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ECON",
        "catalog_number": "421",
        "title": "LABOR ECONOMICS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "433",
        "title": "Public Economics",
        "description": "Prerequisites: ECON 309 310; Upper Division Writing Proficiency Exam score of 8 or higher. The class examines interaction that takes place between the government and private sectors of the economy. Effects of taxation and public expenditure decisions on the allocation of resources. Specific topics include public goods public choice externalities property rights and taxation.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "498A",
        "title": "Field Assignments and Reports",
        "description": "Prerequisite: Upper Division Writing Proficiency Exam score of 8 or higher. Individual study pertaining to present or future career. Student must have active approved employment. Consultation with employer and instructor determines program. Academic Internship course. (Credit/No Credit only)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "ECON",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Prerequisites: Consent of Department Chair; Consent of an instructor to act as sponsor; Upper Division Writing Proficiency Exam score of 8 or higher. In order to complete an Independent Study assignment in the College of Business and Economics a student must have at least a 3.0 overall GPA a 2.0 GPA in all major courses and a 2.0 GPA in his option courses. A student who does not meet these grade point requirements will not receive credit for any ECON 499 that he/she may take. Admission is based on evidence of ability to pursue Independent Study in-depth and approval of a project submitted at the time of registration. Regular progress meetings and reports are required throughout the semester. Completion of the project is required before credit may be received. Enrollment in Independent Study is not allowed for the purpose of substitution for an existing course. Not more than 6 units of Independent Study in the College of Business and Economics may be taken without prior approval of the Dean of the College.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "ECON",
        "catalog_number": "600",
        "title": "Economics of Strategy",
        "description": "Prerequisite: ECON 500 or equivalent. An economic analysis of the modern business organization including its horizontal and vertical boundaries industry-level competition and structure competitive advantage and its short-term and long-term sustainability and sources of productivity especially human resources. Macroeconomic and international influences on business decisions are also covered.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ECON",
        "catalog_number": "699",
        "title": "Independent Study",
        "description": "Prerequisite: Permission of Graduate Advisor. Only those graduate students who have a current 3.0 GPA may register in a 600-level Independent Study course.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "ECON",
        "catalog_number": "308BH",
        "title": "MANAGERIAL ECON",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "375",
        "title": "Economic History of the United States",
        "description": "Prerequisites: ECON 160 and 161 or 300. History of U.S. economic development including economic analyses of major historical issues.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ECON",
        "catalog_number": "500",
        "title": "MBA Survey of Economics",
        "description": "Survey course of the basic principles governing the allocation and utilization of resources. Microeconomic topics include wage and price determination market mechanisms efficiency and related issues concerning industry structure. Macroeconomic topics include financial markets and the determination of national income employment and inflation.\n",
        "units": "3",
        "class_type": "SEM"
    }
]