[
    {
        "subject": "ELPS",
        "catalog_number": "203",
        "title": "Urban Education in American Society",
        "description": "Introductory Foundation course. Designed to provide students with the fundamental knowledge of the understanding of the American educational enterprise especially problems in urban multicultural schools. Concepts and methods from the fields of sociology philosophy and the politics of education are used to gain knowledge of understand and analyze the current conditions of American schools and to evaluate selected proposals/ models for reform. The California Standards for the Teaching Profession the Teaching Performance Expectations and the K-12 subject matter content standards are introduced. A minimum of 20 hours of observation and participation in a multicultural school and community setting is required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ELPS",
        "catalog_number": "417",
        "title": "Equity and Diversity in School",
        "description": "Prepares teacher candidates to examine principles of educational equity diversity and the implementation of curriculum content and school practices for elementary/secondary students. Focuses on the history and culture of a specific ethnic experience and a comparative analysis is made with other ethnic groups in California. Engages students to examine critique and reflect on their personal biases regarding children of color. (Cross listed with PAS CHS AAS and ARMN 417.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ELPS",
        "catalog_number": "541A",
        "title": "Getting Started &#8211; Introduction to Teaching in Urban Schools",
        "description": "Restricted to candidates admitted to the Accelerated Collaborative Teacher (ACT) Preparation Program. Offered Fall semester only. Prerequisite: Admission to the ACT Program. Corequisites: Multiple Subject Credential Candidates: EED/EPC 500; EED 515 520 565ACT 565M 577; ELPS 541A. Single Subject Credential Candidates: ELPS 541A; EPC 420; SED 511 514 525 554. Special Education Credential Candidates: EED 151 (optional) 520 565M 577; ELPS 541A with SPED 541B; SPED 504ACT 577ACT 579AC. The first of two Core courses in the ACT Program for elementary secondary and special education teacher candidates is taught collaboratively by a team of University and school faculty. The course is an introduction to teaching and learning in the context of P-12 urban schools with an emphasis on educational equity diversity and special populations. Topics include an introduction to the roles and responsibilities of a professional educator; teachers and students backgrounds and how they impact teaching and learning in urban schools; knowledge of relevant federal and state legislation for students with special needs; classroom practices that include planning assessment and management in urban schools; and collaboration with school professionals and parents. Teacher candidates are provided activities and discussion that emphasize the link between theory and practice.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "ELPS",
        "catalog_number": "600",
        "title": "RESEARCH ED LEAD",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "600HE",
        "title": "Research Design in Higher Education",
        "description": "The option and courses are restricted to candidates who have been admitted to the Master’s in Educational Administration in the Higher Education program. This course introduces students to education research concepts methods and contributions to higher education practice with an emphasis on how administrators can use research to inform decision-making. It is designed to provide students with the foundations of educational research so they will be able to understand basic research reports evaluate practice in light of research and begin the development of the Graduate Project Proposal.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "601HE",
        "title": "American Higher Education",
        "description": "The option and courses are restricted to candidates who have been admitted to the Master’s in Educational Administration in the Higher Education program. This course is designed for students to understand the nature scope and function of higher education in the U.S. with an emphasis given to contemporary issues and problems.  This seminar-designed class is structured to engage students in meaningful exploration of the continued evolution of American higher education and the major controversies that will shape the future of these institutions.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "650",
        "title": "Contemporary Administrative Leadership",
        "description": "Designed to assist in the development of administrative leadership skills. Focus on the knowledge and application of leadership skills necessary in effective organizations with special emphasis on schools. Topics of study include situational leadership organizational climate and culture individual and group motivation and transforming leadership as applied through school-based management shared decision making strategic planning team building and total quality management. Includes discussion of current educational reform efforts and trends.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "667HE",
        "title": "Organization and Administration of Community College Education",
        "description": "The option and courses are restricted to candidates who have been admitted to the Master’s in Educational Administration in the Higher Education program. This course is designed for students to study the administration of community colleges with an emphasis on community colleges in California.  The course focuses on administrative theory research and application of administrative policies and procedures in the areas of faculty and student personnel curriculum and instruction plant and land management and relationships with lay and governmental boards.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "673HE",
        "title": "Leadership for Managing Reform in Higher Education",
        "description": "The option and courses are restricted to candidates who have been admitted to the Master’s in Educational Administration in the Higher Education program. This course is designed to support the learning of planning and managing for reform and change within colleges and universities. The class includes focuses of change models and strategies for managing change and reform and emerging strategies to support and finance reform in higher education.  The class emphasizes the development of proposals for funding to address solutions for change in higher educational settings.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "675",
        "title": "Decision Making Simulation",
        "description": "Prerequisite: Instructor consent. Designed to provide experienced school administrators and graduate students in administration and supervision the opportunity to simulate the position of a school administrator and assume the leadership of a typical public school. Content is developed around the use of simulated materials and focuses on the individual student and his/her approach to realistic problems and situations faced by a school administrator. These responses are the basis for the students self-examination of his/her administrative behavior and enables him/her to capitalize upon strengths and ameliorate weaknesses.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "676",
        "title": "School Community Relations",
        "description": "The seminar is devoted to a study of the knowledge dispositions and skills needed by educational administrators in order to understand and respond to diverse community interests and needs collaborate effectively with families and community members mobilize community resources to benefit students and families and interpret the school to the public through a variety of media and modes.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "681",
        "title": "ORG&AD EL/SE/SPED",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "690HE",
        "title": "Research Analysis in Higher Education",
        "description": "Prerequisite: Successful completion of ELPS 688HE. The option and courses are restricted to candidates who have been admitted to the Master’s in Educational Administration in the Higher Education program. This course prepares students to understand the nature assumptions and logic of quantitative and qualitative research design and analysis.  The course will build on concepts learned in ELPS 600 and ELPS 688 by extending on issues of design conceptualization analysis and interpretation of quantitative and qualitative research procedures.  The aim of this course is to help students acquire skills and gain experience in using a variety of research techniques for the purposes of understanding and making sense of educational issues towards the completion of the program’s Graduate Project.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "697",
        "title": "DIR COMP STUDIES",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ELPS",
        "catalog_number": "700",
        "title": "The Art of Collaborative Leadership",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. This course provides educational leaders with the tools to establish and enhance their own leadership skills in P12 school/district- or community-college settings. Students study and apply the literature of collaborative leadership including team building visioning inspiring and empowering constituents and stakeholders connected to the learning organization.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "715",
        "title": "Leading Change Through Cultural Competence",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. This course assists in the development of culturally competent leaders in diverse educational settings. Students develop knowledge skills and dispositions necessary to promote policies and practices that value difference and ensure equity in effective organizations. Special emphasis is given to culturally and linguistically diverse populations in P12 schools or community colleges.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "740",
        "title": "Entrepreneurship in Public Education",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. This course examines developments and promising practices in educational entrepreneurship and community partnerships. Students learn professional skills such as grant writing collaborative planning presentation delivery and marketing. An emphasis is placed on working effectively with a variety of stakeholders across the public and private sectors to improve public P14 schools.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ELPS",
        "catalog_number": "760",
        "title": "Field Based Inquiry I",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. Doctoral students are guided in designing and conducting an intensive field-based inquiry related to organizational change efforts to improve student achievement in P12 schools or community colleges. Students develop or enhance hands-on administrative skills in action research collaborative problem solving program planning and professional presentation.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "780",
        "title": "Applied Qualitative Inquiry I",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. This course is an overview of qualitative approaches to educational research that can be applied to educational leadership for school improvement. Students learn to be critical consumers of the qualitative research literature and to use basic qualitative research methods. Action research and qualitative approaches to the dissertation process are also discussed.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "785",
        "title": "Applied Qualitative Inquiry II",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership; Successful completion of Applied Qualitative Inquiry I. This course is an advanced seminar for students who plan to use mainly qualitative research methods for their dissertation. It guides them through the process of designing a meaningful manageable qualitative study as well as advanced techniques in qualitative data collection analysis and reporting.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "789",
        "title": "Dissertation Seminar",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership; Advancement to Candidacy. Students work under the guidance of their advisor to complete requirements for the dissertation. Includes independent work as well as dissertation seminars. Minimum of 12 dissertation seminar units are required in the program. May be repeated for credit. Students must be enrolled every semester after admission to Candidacy until they successfully defend their dissertation.\n",
        "units": "2",
        "class_type": "SUP"
    },
    {
        "subject": "ELPS",
        "catalog_number": "542A",
        "title": "Meeting The Needs of All Students in Urban Schools",
        "description": "Restricted to candidates admitted to the Accelerated Collaborative Teacher (ACT) Preparation Program. Offered Spring semester only. Prerequisites: Successful completion of all Fall semester course work. Corequisites: Multiple Subject Credential Candidates: EED 565S 568ACT 575; EHSCI 496TH; ELPS 542A; KIN 595PE. Single Subject Credential Candidates: ELPS 542A; HSCI 496ADL; SED 521 555. Special Education Credential Candidates: ELPS 542A; SPED 402A 505MM 509MM 580ACT. The second of two Core courses in the ACT Program this course is designed for elementary secondaryand special education teacher candidates and taught collaboratively by a team of University and school faculty. Building on the content introduced in the first Core course related to educational equity diversity and special populations topics include developing as a reflective educator who considers the learning needs of all students; creating and managing effective and healthy classroom environments in urban schools; problem solving strategies to facilitate teaching and learning; instructional modifications and accommodations for students with disabilities in general education settings; issues related to diversity and multicultural education; and models of collaboration/consultation. Teacher candidates are provided activities and discussion that emphasize the link between theory and practice.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "ELPS",
        "catalog_number": "650HE",
        "title": "Contemporary Administrative Leadership in Higher Education",
        "description": "The option and courses are restricted to candidates who have been admitted to the Master’s in Educational Administration in the Higher Education program. This course is designed to assist in the development of administrative leadership skills.  Focus is on the knowledge and application of leadership skills necessary in effective organizations with special emphasis on higher education.  Topics of study include situational leadership organizational climate and culture individual and group motivation and transformational leadership as applied through shared decision making strategic planning team building and total quality management.  This course will also include discussion of current educational reform efforts and trends. This course requires students to complete 2-4 hours of field-based experience.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "656HE",
        "title": "Diversity and Student Success in Higher Education",
        "description": "The option and courses are restricted to candidates who have been admitted to the Master’s in Educational Administration in the Higher Education program. This course deals with current issues and challenges of diversity and student success in higher education.  Emphasis is placed on understanding the overall educational experiences of diverse college student populations across various institutional settings.  This course will require students to complete 2-4 hours of field-base experience.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "663",
        "title": "Legal Aspects of Educational Administration",
        "description": "General principles of American school law with particular emphasis on California statutes. Consideration of the legal bases of federal state and local administrative levels. Review of the salient legal provisions of the Education Code respecting administration of schools the rights of patrons and employees torts contracts certification tenure school plant planning and the rights and obligations of pupils. Analysis and significance of major court decisions having implications for public education.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "663HE",
        "title": "Policy &#038; Law in Higher Education",
        "description": "The option and courses are restricted to candidates who have been admitted to the Master’s in Educational Administration in the Higher Education program. This course explores key topics in higher education public policy and law at the federal and state levels in their historical and contemporary contexts. It emphasizes topics that are relevant to California including governance access equity higher education and state economic development K-16 planning and articulation and accountability.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "672",
        "title": "Management of Human Resources",
        "description": "Seminar in the philosophy scope function and evaluation of public school personnel administration. Emphasis on the development of a practical program.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "674HE",
        "title": "Higher Education Operations: Finance and Human Resources in Higher Education",
        "description": "The option and courses are restricted to candidates who have been admitted to the Master’s in Educational Administration in the Higher Education program. This course is designed to help students understand the philosophy scope function and evaluation of postsecondary operations related to financial and human resources.  The course covers general principles of American higher education finance and human resource administration with particular emphasis upon California law and practice.  The course focuses on problems and principles of higher education finance and human resource administration with an emphasis on California.  Further the course examines public funding of community college and public universities in California.  This course requires students to complete 2-4 hours of field-based experience.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "682",
        "title": "SUPER OF CUR&INST",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "688",
        "title": "Fieldwork in Educational Administration",
        "description": "Prerequisites: ELPS 600; Teaching experience; 6 hours or less of course work remaining in the program; Approval of the administrator of the school where the fieldwork is to be performed; Acceptance into the course by the Department of Educational Leadership and Policy Studies. Admission is by fieldwork application only which may be obtained in the Department office or online at www.csun.edu/education/elps. Applications must be received by June 15 for consideration for the Fall semester and by Dec. 15 for consideration for the Spring semester. The experience in this program is at the building site level and reflects as much as possible those functions assignments and responsibilities characteristic of the principals office. Students assume a leadership role in implementing the Action Research Project designed in ELPS 600.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "ELPS",
        "catalog_number": "688HE",
        "title": "Fieldwork in Higher Education",
        "description": "Prerequisites: Successful completion of ELPS 600HE. The option and courses are restricted to candidates who have been admitted to the Master’s in Educational Administration in the Higher Education program. This course is designed to facilitate fieldwork in educational administration with a focus on leadership through field research and professional experiences.  Following ELPS 600 where students develop a Graduate Project Proposal the course focuses on data collection proposed in the Graduate Project Proposal with the use of data collection techniques typically utilized in both quantitative and qualitative research.  The data collection in this course supports the development of the Graduate Project Proposal developed in ELPS 600 and prepares students for data analysis in ELPS 690 (Research Analysis) that leads to the Graduate Project Report (ELPS 698).  In addition the course focuses on field experiences in higher education administrative settings with a particular focus on administrative shadowing and participant observations in administrative settings.  The course emphasizes applications of research methods in the context of higher education and focuses on data collection in the field and the development of administrative skills in real-life educational settings.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "ELPS",
        "catalog_number": "697HE",
        "title": "COMPS STUDIES",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "705",
        "title": "Organizational Complexity and Change",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. This course focuses on school/district or community colleges as complex and dynamic organizations. It emphasizes the ways in which educational leaders use knowledge of organizational theory to improve management decisions facilitate organizational change and achieve positive outcomes for students.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "725",
        "title": "Instructional Assessment and Program Evaluation",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. This course includes study of instructional assessment and program evaluation for effective educational leadership. Emphasis is given to an examination of measures of student achievement and accountability systems.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "730",
        "title": "Public Policy in Education",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. (P12 cohort only.) This course examines the context for policy making and the process of policy development and implementation. It includes the study of organizational structures for educational decision making at the federal state county and local levels with emphasis on how and where influence can be exerted.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "755",
        "title": "Human Relations in Educational Organizations",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. This course enhances the effective management of human relations in collaborative organizational contexts. As the capstone course in the Doctoral Program it addresses both self-awareness and increased understanding of others.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "ELPS",
        "catalog_number": "770",
        "title": "Applied Quantitative Inquiry I",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership. This course provides an introduction to concepts principles and methods of quantitative research in education. Problem identification research design data collection techniques and interpretation of research findings are addressed. Critical analysis of relevant research literature is emphasized.\n",
        "units": "3",
        "class_type": "SEM"
    }
]