[
    {
        "subject": "EPC",
        "catalog_number": "314",
        "title": "Psychological Foundations",
        "description": "K-12This course should be taken only by students not intending to enroll in a K-12 teacher preparation program. Fulfills the requirement for the CLAD program. Study of the theory and research of educational psychology to learn principles that are basic to the successful teaching of students of all ages backgrounds and needs. These principles of educational psychology form a foundation of knowledge about teaching that is built upon in subsequent courses in teaching methods and practice. Topics include learning motivation development (cognitive language socio-emotional physical and moral) cognition assessment instruction classroom management and individual and group differences (language ability ethnicity social class gender exceptionality and family pattern). Implications for teaching students from culturally and linguistically diverse backgrounds are considered throughout the course. During the course students are required to spend a minimum of 10-20 hours participating and/or observing in public schools or an approved setting.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "EPC",
        "catalog_number": "315",
        "title": "Psychological Foundations of Learning and Teaching",
        "description": "This course should be taken only by students intending to enroll in a K-12 teacher preparation program. Study of the theory and research of educational psychology to backgrounds and needs. These principles of educational psychology form a foundation of knowledge about teaching that is built upon in subsequent courses in teaching methods and practice. Topics studied include learning motivation development (cognitive language socio-emotional physical and moral) and their relationship to learning and instruction cognition assessment classroom management and individual and group differences in learning. Implications for teaching students from culturally and linguistically diverse backgrounds as well as students with special needs are considered throughout the course. Students begin to develop a professional portfolio and spend a minimum of 20 hours participating and/or observing in public schools. Integration of course work and field work provides students the opportunity to complete various assignments in preparation for meeting Teacher Performance Expectations (TPE).\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "EPC",
        "catalog_number": "420",
        "title": "Educational Psychology of Adolescence",
        "description": "Required of candidates in the Single Subject Credential Program. Study of theory and research in educational psychology for successful teaching of adolescents. Subjects include learning development motivation instruction assessment classroom management individual/group differences peer interactions and family and community influences. Issues particularly pertinent to adolescence include identity development self-esteem suicide crisis prevention and conflict resolution. Implications for teaching students from culturally and linguistically diverse backgrounds are considered throughout the course. Students are required to complete 2 field-based assignments -- an adolescent case study and a secondary classroom learning environment analysis. Course may be offered online in a classroom setting or both.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "EPC",
        "catalog_number": "430",
        "title": "Development and Learning in Early Childhood Education",
        "description": "Examination of theoretical positions in development and learning including relevant research and implications for educational practice in early years. Some sections of this course may offer a community-service opportunity with activities relating to concepts and theories presented. Check the Schedule of Classes for the CS designation.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "EPC",
        "catalog_number": "451",
        "title": "Fundamentals of Counseling and Guidance",
        "description": "Admission restricted to seniors PBUs and Conditionally Classified graduate students. Overview of several approaches to counseling in school and community settings. Understanding of case study methods in assessing individual children is included. Overall guidance programs are studied with emphasis on counseling relationships.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "EPC",
        "catalog_number": "500",
        "title": "Fundamentals for Beginning Teachers",
        "description": "Fulfills requirement for Multiple Subjects Teaching Credential. This course emphasizes major concepts principles theories and research in development and learning with a strong application component in the design and implementation of instruction assessment and equitable healthy classroom learning communities.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "EPC",
        "catalog_number": "601",
        "title": "Individual and Group Assessment",
        "description": "Prerequisite: EPC 600 or equivalent. Examination of individual and group assessment instruments and their application in the evaluation of intellectual performance personality constructs career interest and interpersonal relations. Includes historical foundations non-discriminatory procedures ethical standards and social issues. Lab fee Required.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "603",
        "title": "Clinical Research and Program Evaluation",
        "description": "Prerequisites: EPC 600 or equivalent; Admission to a CSUN Masters Degree Program in Counseling. Introduces quantitative and qualitative clinical research methods including randomized clinical trials efficacy and effectiveness studies program evaluation client outcome clinician effectiveness and evidence-based practice strategies. Emphasis placed on conducting research and evaluating outcomes with children couples families diverse clients and vulnerable populations. Also covers federal state and private foundation agendas systems of access and channels for funding mental health research.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "603MFB",
        "title": "INTRO PROF WRITING",
        "description": null,
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "604",
        "title": "MU SY ACAD INT SP",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "621",
        "title": "SC CONSULTATION",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "622",
        "title": "American College Student and Campus Environment",
        "description": "Examines personal characteristics and attitudes social-cultural factors and developmental theory as they pertain to traditional and non-traditional college students. Explores student development student service and campus ecology approaches. Surveys environmental assessment and needs analysis techniques program planning intervention strategies and program evaluation relevant to the college population.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "632",
        "title": "Issues",
        "description": "Theories and Current Practices in Early ChildhoodPrerequisite: EPC 430. Current issues and trends in early childhood education including examination of relationships between basic assumptions theory and practice.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "634",
        "title": "Language and Concept Development in The Early School Years",
        "description": "Prerequisite: EPC 430. Study of research and current theoretical positions in language and concept development with major emphasis on the implications for learning in the school setting.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "639C",
        "title": "Field Work in Early Childhood",
        "description": "Prerequisites: EPC 430; Formal admittance into the Masters Program in Early Childhood Education. Supervised field work in a variety of early childhood and parent-child settings. Students are required to spend 20 hours in field work per academic unit (e.g. 3 units requires 60 hours of field work) and participate in a two-hour weekly seminar with their field work professor. Normally students will enroll in this course for 3 units (639C) during their first semester requiring work directly with young children. Successful completion of this course is required for students to be fully Classified in the Masters Program in Early Childhood Education. Additional semesters may be taken as program electives in settings approved by the course professor.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "EPC",
        "catalog_number": "642",
        "title": "ASSMNTEVAL IN ECE",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "643MF",
        "title": "DIVERSITY MFT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "655",
        "title": "Seminar in Counseling Theory and Practice",
        "description": "Prerequisite: Admission to a CSUN Masters Degree Program in Counseling. Counseling theories and treatment planning including psychodynamic humanistic-existential cognitive-behavioral feminist and solution-focused theories including an examination of the evidence base and history of the counseling profession. Emphasis is placed on applications with diverse populations in community school and college settings.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "656MF",
        "title": "CHILD THERAPY",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "657MF",
        "title": "CAREER INTERVENT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "659A",
        "title": "Communication Skills in Counseling",
        "description": "Prerequisite: Admission to a CSUN Masters Degree Program in Counseling; Recommended Corequisite: EPC 655. Communication theory and skills designed to help students develop greater self-knowledge and become aware of their impact on others through participation in group experiences and peer counseling. Emphasis on verbal and non-verbal cues refinement of basic response skills and the subtleties of language and style.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "659CC",
        "title": "Field Work in Counseling Services",
        "description": "Prerequisites: EPC 643 655 659A 659B. Supervised field training in an organized program for those specializing in Pupil Personnel Services at either elementary or secondary level or those in community-based counseling programs. Flexible units with consent of advisor. Normally students enroll in EPC 659C and 659D for two 3-unit semesters. A third semester may be required with consultation with the advisor. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "EPC",
        "catalog_number": "659EC",
        "title": "PRACINSCHPSYCH",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "EPC",
        "catalog_number": "659GC",
        "title": "INTRN SCH PSY",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "EPC",
        "catalog_number": "659JC",
        "title": "Field Work in College Counseling and Student Services",
        "description": "Prerequisites: EPC 620 659A/B. Intensive supervised field work experience in an organized program for those specializing in college counseling and student services. Students are required to develop a comprehensive learning plan and spend at least 2 hours per week in individual and/or group supervision. Actual number of units per semester is determined by instructor and student. Normally students will enroll in EPC 659JC/659KC for two 3-unit semester. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "EPC",
        "catalog_number": "659MFA",
        "title": "INTRO TO COUN PRAC",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "659MFC",
        "title": "MFT FIELDWORK 1",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "EPC",
        "catalog_number": "659SPA",
        "title": "COMM SKILLS FOR SP",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "663A",
        "title": "Clinical and Psychometrics Assessment Techniques",
        "description": "Prerequisites: EPC 601; SPED 610. Recommended Corequisite: EPC 659E. History theory and practice of individual assessment. Emphasis on cognitive-intellectual abilities testing as it relates to learning and adequate functioning. Supervised practice in test administration interpretation of data from multiple sources and communication of results for program planning. (Limited to students accepted into the School Psychologist Credential Program.) Lab fee required.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "663AL",
        "title": "Clinical and Psychometrics Assessment Techniques Lab",
        "description": "Prerequisites: EPC 601; SPED 610. Recommended Corequisite: EPC 659E. History theory and practice of individual assessment. Emphasis on cognitive-intellectual abilities testing as it relates to learning and adequate functioning. Supervised practice in test administration interpretation of data from multiple sources and communication of results for program planning. (Limited to students accepted into the School Psychologist Credential Program.) Lab fee required.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "664",
        "title": "Neuro-developmental",
        "description": "Emotional and Behavior DisordersThe course provides a knowledge base of the etiology and characteristics of major neuro-developmental emotional and behavior disorders in children and youth as well as an understanding of current evidence-based interventions in the schools. Students will be introduced to the ecological factors in the development of common disorders including biological bases and family school peer community and school influences. Information learned will be used as guidelines for identifying children in the schools who need treatment. Lab fee required.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "665",
        "title": "School-Based Counseling of Children and Teens",
        "description": "Prerequisites: EPC 659A 659B. Emphasizes the use of creative reflective interpersonal and critcal-thinking skills to counsel children and teenagers and to consult collaboratively with parents teachersand other professionals in a school-based inclusive learning community. Research and theory are linked to best practices in wellness promotion crisis intervention and individual and group counseling. Application of developmental diversity and ecology theories as well as legal and ethical principles is stressed.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "667",
        "title": "Introduction to School Psychology",
        "description": "Prerequisite: Admission into the School Psychology Program. Corequisite: EPC 659A. School psychology is a profession dedicated to enhancing the educational and mental health needs of all pupils. This course provides an introduction to current roles and functions of school psychologists as guided by the history of the profession professional ethical and education standards state and national legal mandates and future trends. Students spend a minimum of 50 hours in the schools getting to know the role of school psychologists and the organization of schools.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "668",
        "title": "Partnerships for Excellence in Early Childhood Education",
        "description": "Prerequisites: EPC 639C; Formal application to enroll in the course or permission of instructor prior to the beginning of the semester. Students meet with mentors and faculty to study design implement and evaluate outcomes of quality improvement consultation/collaboration in center-based early care and learning programs. Field-based experience and weekly attendance in faculty-led seminar sessions are included. Students are required to submit a course application and be approved for enrollment prior to the beginning of the semester. The course may be taken up to three times with the approval of the course instructor and/or M.A. Program Coordinator(s).\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "EPC",
        "catalog_number": "670MFA",
        "title": "SYSTEMIC THEORIES",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "671",
        "title": "Laws",
        "description": "Ethicsand Professional Issues in CounselingPrerequisite: Admission to a CSUN Masters Degree Program in Counseling. Laws ethical decision making professional identity professional advocacy mandated reporting and licensing requirements that relate to marriage and family therapists and professional counselors in California. Emphasis on differing ethical practices across contexts including recovery-oriented public mental health as well as ethical issues related to working with and advocating for diverse clients and collaborating with other professionals. The ethics codes of AAMFT ACA and CAMFT will be contrasted and compared.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "671MF",
        "title": "LAW ETHICS MFT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "672",
        "title": "Mental Health Assessment and Diagnosis",
        "description": "Prerequisite: Admission to a CSUN Masters Degree Program in Counseling. Examines clinical assessment and diagnosis of adults and children manifesting mild to severe mental disorders and includes training in the mental status examination use of the Diagnostic and Statistical Manual of Mental Disorders co-occurring disorders and recovery-oriented prognosis for severe mental illness. Emphasis on diversity and socioeconomic issues as well as evidence-based treatments and best practices.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "673MF",
        "title": "TRAUMA-INFORMED CMH",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "674MF",
        "title": "FAMILY DEVELOPMNT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "675",
        "title": "Chemical Dependency and Addictions Counseling",
        "description": "Prerequisite: Admission to a CSUN Masters Degree Program in Counseling. Major approaches for identifying evaluating diagnosing and treating persons with alcohol and substance abuse or dependency co-occurring disorders and behavioral addictions. Topics include the effects of psychoactive drug use theories of the etiology of addiction systemic dynamics of alcoholic and substance abusing families legal requirements community resources for individual teens adults and their families prevention of addiction harm reduction models evidence-based models for couple and family treatment recovery models peer support models and motivational interviewing.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "675MF",
        "title": "SUBSTANCE ABUSE MFT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "677MFA",
        "title": "COUPLES THERAPY",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "678",
        "title": "Psychopharmacology and Neurobiological Foundations",
        "description": "Prerequisites: EPC 672; Admission to a CSUN Masters Degree Program in Counseling. Introduces students to the neurobiological foundations of family therapy including an overview of sexual dysfunction interpersonal neurobiology and effects of trauma. Covers biochemical theories of mental disorders and the various classes of psychoactive medications used to treat these disorders across the lifespan. Particular attention given to utilization patterns based on sex socioeconomic status ethnicity and other diversity factors. Emphasis on the role of family therapists in the assessment referral and management of clients being treated with psychotropic medication.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "678MF",
        "title": "PSYCHOPHARM FT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "681",
        "title": "Classroom Communication and Management Methods",
        "description": "Prerequisites: Possession of Elementary School Teaching Credential; EPC 314 PSY 350 or equivalent 3-unit course. Focuses on a study of the theoretical bases and the implementation of a range of approaches to classroom communication and management (e.g. the behavioral modification approach the socio-emotional climate approach and the group-process approach). These approaches are used in role-playing and analyzing typical classroom problem situations. (Cross listed with EED 681.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "EPC",
        "catalog_number": "682",
        "title": "Foundations of School Counseling",
        "description": "Overview and introductory program course in school counseling covering the history of school counseling; academic personal/socialand career development domains of school counseling; state and national standards; the mission and philosophy of the CSUN program; social justice issues including inequity in education and achievement; model school counseling programs; and current research and trends in the field.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "683",
        "title": "Collaboration with Families in Educational Settings",
        "description": "Prerequisite: EPC 314 or 430 or equivalent course or instructor consent. Principles and practices of collaborating with families in educational settings from infant- and child-care programs through high school. Considerations of attachment family systems theory family forms the role of culture and the ecological perspective the impact of family on child development and student achievement and current research.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "690MFC",
        "title": "ADV FIELDWORK MFT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "695MF",
        "title": "SEMINAR PROF WRITING",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "695S",
        "title": "Seminar in Selected Studies: Student Personnel",
        "description": "Prerequisite: Graduate standing. Special seminars in selected topics.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "695WC",
        "title": "Seminar in Selected Studies: Grad Writing in EPC",
        "description": "Prerequisite: Graduate standing. Special seminars in selected topics.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "696",
        "title": "Directed Graduate Research",
        "description": "Students are responsible for defining and organizing their own research problems. Reports on research are expected to be made to Department faculty.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "696MF",
        "title": "DIRECTED RESEARCH FT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisite: Candidate must assemble a Comprehensive Exam Committee prior to registration. Advanced studies of comprehensive topics. Taken during final semester of program. See Department Culminating Experience Handbook for information on how to form a committee. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "EPC",
        "catalog_number": "698C",
        "title": "Thesis/Graduate Project",
        "description": "Prerequisite: Candidate must assemble a Project/Thesis Exam Committee prior to registration. Develop a thesis or project on an advanced topic in students field of specialization. Typically taken during final two semesters of program. See Department Culminating Experience Handbook for information on how to form a committee. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "EPC",
        "catalog_number": "600",
        "title": "Educational Statistics for Research and Measurement",
        "description": "Prerequisites: Undergraduate course in basic mathematics and algebra or permission of the instructor; Current graduate standing in the University. Introduction to basic descriptive and inferential statistics for applications to graduate courses in educational psychology counseling general graduate-level educational courses in tests and measurements and research. Normally a prerequisite to EPC 601 -- Fundamentals of Measurement and EPC 602 -- Principles of Educational Research except when waived by instructor or when equivalent course has been taken.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "602",
        "title": "Research Principles",
        "description": "Prerequisite: EPC 600. Introductory course in techniques use presentationa nd understanding of research principles in education and counseling and the contributions of research to the solution of problems.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "603MFA",
        "title": "CLINICAL RESEARCH",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "605",
        "title": "Advanced Psychological Foundations of Education",
        "description": "Focuses on the interaction of the learning-teaching process. Emphasis on pertinent learning theories individual differences in capacities and development of learners and evaluation of learning and instructional models.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "609",
        "title": "Human Development: A Life-Span Perspective",
        "description": "Prerequisite: EPC 430 or an equivalent course. Advanced course focusing on development from infancy through later adulthood. Theories and research with special relevance to the life-span are examined. Topics include cognitive social and personality development and will examine biological environmental and family influences. Relevance of a life-span approach to development for those in human services professions will be emphasized.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "620",
        "title": "College Counseling and Student Services Profession",
        "description": "Examines theories and research in the field of student affairs. Introduces specialty areas roles and functions of college counselors and student services professionals. Analyzes current problems future trends professional standards legal issues and ethical concerns as well as organizational patterns and the interactions of academic business and student affairs areas.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "635",
        "title": "Foundations of Developmental Curriculum for Early Childhood",
        "description": "Prerequisites: EPC 430 and 632 or instructor consent. To be taken concurrently with experiences in the field either teaching or field work.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "636",
        "title": "Systems and Policies in Infant-Toddler-Family Mental Health",
        "description": "Focus on the systems and policies that support optimal infant-toddler-family mental health. Students participate in researching the national state and local legislation that influences the related child care education and service delivery systems. This includes the exploration of private and public agencies in place to administer and/or deliver services for young children and their families. Mapping these systems of care and education as well as constructing the professionals role in the system culminates in an increased knowledge and understanding of the policies that support optimal infant-toddler-family mental health. Finally understanding the role of these systems as seen from a familys perspective informs and supports the familys successful navigation to obtain appropriate care and education resources for their child.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "EPC",
        "catalog_number": "641",
        "title": "Evaluation in The Bilingual Classroom",
        "description": "Basic course designed to deal with evaluation of the bilingual student. Primary emphasis is placed on the purpose of educational evaluation; the relationship between students identified needs instructional objectives (cognitive socio-emotional and psychomotor) and assessment strategies;criteria for instrument construction/selection; and strategies for individual diagnosis prescription and evaluation of the bilingual learner.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "EPC",
        "catalog_number": "643",
        "title": "Diversity in Counseling",
        "description": "Prerequisite: Admission to a CSUN Masters Degree Program in Counseling. Self-assessment of knowledge sensitivityand attitudes toward diverse populations including race ethnicity gender age socioeconomic status sexual orientation spirituality ability and language. Examination of family structure and social patterns in Californias ethnic populations and differences across social class. Review of cross-cultural research theories interventions and resources. Emphasis on models of societal oppression privilege cross-cultural dynamics poverty and social justice as well as the impact of social stress and prejudice on mental health recovery. Designed for family therapists and mental health counselors in school college and community settings.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "648",
        "title": "Consultation with Parents",
        "description": "Teachers and Other Human Service ProfessionalsPrerequisite: A course in Child Development. Recommended: EPC 646 or 647. Exploration and study of theory-derived practices regarding communication and consultation with parents and teachers with respect to problems they encounter with children. Educational and clinical applications. Issues regarding information-sharing with other professionals. Collaborating with other professionals and making referrals.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "653",
        "title": "Measurement for School and Career Counseling",
        "description": "Prerequisite: EPC 600. Investigation of standardized group tests with emphasis on their sources evaluation selection administration scoring and interpretation of results.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "657A",
        "title": "Seminar in Career Counseling Theory",
        "description": "Prerequisite: EPC 451. Comprehensive review and critique of current career development and decision theories. Exploration of changing concepts of work and careers and their implications for career planning. Focus on the relationship of career to other issues of counseling and development.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "658",
        "title": "Seminar in Group Counseling",
        "description": "Prerequisite: EPC 659A. Corequisite: EPC 658L. Preparatory: EPC 451 655 Instructor consent. Theory and practice of group counseling: group work and group development in various settings. Designed to develop and increase understanding and skills related to group counseling; to stimulate interest in working with groups to enable counseling personnel to consider appropriate uses for group counseling and to evaluate its effectiveness in demonstration and practice. Lab: Extensive practical experience in group counseling entailing supervised feedback. Theory is applied to the actual practice of group work.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "658L",
        "title": "Seminar in Group Counseling Lab",
        "description": "Prerequisite: EPC 659A. Corequisite: EPC 658. Preparatory: EPC 451 655 Instructor consent. Theory and practice of group counseling: group work and group development in various settings. Designed to develop and increase understanding and skills related to group counseling; to stimulate interest in working with groups to enable counseling personnel to consider appropriate uses for group counseling and to evaluate its effectiveness in demonstration and practice. Lab: Extensive practical experience in group counseling entailing supervised feedback. Theory is applied to the actual practice of group work.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "EPC",
        "catalog_number": "659B",
        "title": "Practicum in Counseling",
        "description": "Prerequisites: EPC 659A; Admission to a CSUN Masters Degree Program in Counseling. Supervised applications of counseling skills in classroom and field work settings including peer counseling and community counseling sessions. Topics include crisis management and safety planning with suicidal or homicidal clients child/elder abuse domestic violence and self-injury as well as introducing clients to counseling professional documentation case management and community referrals. Students must complete a minimum of 40 hours of direct services with clients.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "EPC",
        "catalog_number": "659DC",
        "title": "Field Work in Counseling Services",
        "description": "Prerequisites: EPC 643 655 659A 659B. Supervised field training in an organized program for those specializing in Pupil Personnel Services at either elementary or secondary level or those in community-based counseling programs. Flexible units with consent of advisor. Normally students enroll in EPC 659C and 659D for two 3-unit semesters. A third semester may be required with consultation with the advisor. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "EPC",
        "catalog_number": "659FC",
        "title": "Field Work in School Psychology",
        "description": "These two courses are designed to help the student learn the job of the school psychologist through actual field work experience. Primary emphasis is on learning the function of a school psychologist -- increasing psycho-diagnostic skills to a point where the student is able to select administer and interpret appropriate assessment measures; learning to work with children parents teachers and administrators; and acquiring skill in administrative and coordinating aspects of the job. Students work closely with the field and campus supervisors. Normally students enroll in EPC 659E and 659F for two 3-unit semesters. A third semester may be approved with consultation with the advisor. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "EPC",
        "catalog_number": "659HC",
        "title": "Internship in School Psychology",
        "description": "Prerequisites: EPC 659E 659F or PSY 655C. Intensive supervised internship in a multi-cultural school for those completing the Pupil Personnel Services Credential/School Psychologist Authorization. Course objectives require vigorous application of diagnostic prescriptive and consultative skills. Students complete a total of 6 units. Actual number of units per semester is determined by instructor and student. Normally students enroll in EPC 659G and 659H for two 3-unit semesters. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "EPC",
        "catalog_number": "659MFB",
        "title": "PRACTICUM IN MFT",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "EPC",
        "catalog_number": "659MFD",
        "title": "MFT FIELDWORK 2",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "EPC",
        "catalog_number": "661",
        "title": "Multi-Systemic Behavioral Interventions",
        "description": "Provides school psychology students with comprehensive research-based information and best practices on how to assess children with behavioral disabilities and develop interventions. A multi-systemic behavioral approach to intervention is emphasized. Use of functional assessment behavior intervention and prevention programs for students with behavioral disabilities is discussed. Additionally students learn single-case methodology and begin learning about behavior consultation.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "663B",
        "title": "Clinical and Psychometric Assessment Techniques",
        "description": "Prerequisite: EPC 663A/L. Recommended Corequisite: EPC 659F. History theory and practice of individual assessment. Emphasis on socio-emotional abilities and personality assessment related to learning and adequate functioning. Supervised practice in test administration interpretation of data from multiple sources and communication of results for program planning. (Limited to students accepted into the School Psychologist Credential Program.) Lab fee required.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "663BL",
        "title": "Clinical and Psychometric Assessment Techniques Lab",
        "description": "Prerequisite: EPC 663A/L. Recommended Corequisite: EPC 659F. History theory and practice of individual assessment. Emphasis on socio-emotional abilities and personality assessment related to learning and adequate functioning. Supervised practice in test administration interpretation of data from multiple sources and communication of results for program planning. (Limited to students accepted into the School Psychologist Credential Program.) Lab fee required.\n",
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "670MFB",
        "title": "POSTMODERN COG-BEHAV",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "670MFC",
        "title": "MFT GROUP THERAPY",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "672MFA",
        "title": "DIAGNOSIS MFT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "672MFB",
        "title": "NEUROBIO TRAUMA",
        "description": null,
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "673",
        "title": "Community Mental Health Counseling",
        "description": "Prerequisite: Admission to a CSUN Masters Degree Program in Counseling. Examines theories and skills required in contemporary community mental health settings including recovery-oriented treatment for severe mental illness disaster and trauma response services for victims of abuse and the homeless foster care case management client advocacy in-home and in-school services bilingual client services collaborating with other professionals medical family therapy and local community service resources. Provides a practical overview of public and private systems of care and opportunities to meet with the severely mentally ill and their families.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "677MFB",
        "title": "GENDER AND SEX IN FT",
        "description": null,
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "679MF",
        "title": "CLINICAL ASSESSMT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "687",
        "title": "Career Guidance",
        "description": "College Selection and Technology in School SettingsApplication of concepts and strategies for providing career/life planning and college-selection services using various aspects of technology. Focus is on the use of objective information in career counseling and college selection. Meets PPS course requirement in Career Education and Counseling.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "EPC",
        "catalog_number": "699C",
        "title": "Independent Study",
        "description": "\n",
        "units": "3",
        "class_type": "SUP"
    }
]