[
    {
        "subject": "GWS",
        "catalog_number": "100",
        "title": "Introduction to Gender and Women&#8217;s Studies",
        "description": "Interdisciplinary study of women in American society including such topics as social conditions laws symbols values communication and power. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GWS",
        "catalog_number": "110",
        "title": "Women",
        "description": "Work and FamilyFocuses on historical and contemporary relationship between home and community work and the marketplace within which women perform. Examines the differences in experience of work and family as these are shaped by race class gender and sexuality. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GWS",
        "catalog_number": "220",
        "title": "MEN & MASCULINITY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GWS",
        "catalog_number": "300",
        "title": "Women as Agents of Change",
        "description": "Preparatory: GWS 100 or 110 or consent of instructor; Completion of the Lower Division writing requirement. New definitions and options for women within the family community and society. Students study and report on womens resources and organizations for change within the local community as well as on the national and international scene. (Available for General Education Comparative Cultural Studies.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GWS",
        "catalog_number": "301",
        "title": "Feminist Theories",
        "description": "Prerequisite: GWS 100 or 110 or 300 or instructor consent. This required course for Gender and Women Studies majors and minors concentrates on the multitude of feminist theories from the early feminist theories to the more contemporary and complex theories by a diversity of theorists within the U.S. and globally.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GWS",
        "catalog_number": "302",
        "title": "Feminist Methods",
        "description": "Prerequisite: GWS 100 or 110 or 300 or instructor consent. In this course students will be introduced to qualitative and quantitative research methods. The course will provide an overview of some of the critical concepts in the history of feminist research (e.g. feminist empiricism feminist standpoint inclusion of difference) and debates surrounding epistemology and methodology. The course will examine and evaluate interdisciplinary feminist research that have been proposed as uniquely suited for gender and womens studies as well as its proposed elements goals and politics.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GWS",
        "catalog_number": "305",
        "title": "GWS CS SEMINAR",
        "description": null,
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "GWS",
        "catalog_number": "305CS",
        "title": "Gender and Women&#8217;s Studies Community Service",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Students work in a variety of community settings -- educational political and/or social service agencies -- to apply theoretical understanding of gender and womens studies to practical and concrete community situations that affect womens daily lives. Includes regular class meetings. Offers a community service opportunity with activities relating to concepts and theories presented. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "GWS",
        "catalog_number": "320",
        "title": "Women and Urban Life/Urban Space",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Examines the gendered use of space and how women have balanced and crossed public and private spheres. Examines women and urban issues from the micro-level (community-based organizations and grassroots mobilizations) to the macro-level (national and international states and corporate entities). (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GWS",
        "catalog_number": "351",
        "title": "GEN RACE CLAS SEX",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GWS",
        "catalog_number": "370",
        "title": "Women and Violence",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. This course focuses on dimensions of violence women experience in the U.S. and internationally. It provides an overview of sexual violence including rape in intimate partnerships childhood sexual assault sexual harassment sex trafficking and violence against women under foreign occupation. Varied feminist scholarship around 3 broad areas will be covered: Sexual Violence Against Women; Physical Violence Against Women; and Perpetrators of Violence Against Women. The course includes an examination of case studies that illumine domestic abuse judicial abuse and war rape among others. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GWS",
        "catalog_number": "410",
        "title": "Sex",
        "description": "Lies and MediaIn this course students employ critical perspectives to examine narrow definitions of gender/sexuality constructed in media representations. Students deconstruct norms of masculinity and femininity generated by industries such as television film and advertising that perpetuate and naturalize the commodification of womens bodies. Special attention is paid to bodies and modes of sexuality that transgress (representations of the queer body for example). Students also construct alternative imagery and generate new ideas about gender and sexuality through discussion and various projects.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GWS",
        "catalog_number": "420",
        "title": "Women and Gender in Islamic Societies",
        "description": "This interdisciplinary and cross-cultural course explores how religious authorities and scriptural and legal sources have contributed to the status and legal rights of women and to the construction of theories laws and practices concerning gender roles and sexuality in the Islamic tradition. Students study how these constructed gender roles sexual norms and attitudes have reflected resisted or changed in response to modern cultural social economic and political changes. The course examines how Muslim women themselves have sought to articulate and define their roles and identities. What has been the impact of modernity modernization colonialism nationalism democratization and globalization especially the global feminist movements on the status of Muslim women and gender relations? What is the impact of the recent waves of Islamist movements (fundamentalism) the identity politics and politics of the veil on women and the gender arrangement in Muslim societies?\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GWS",
        "catalog_number": "340",
        "title": "Women",
        "description": "Gender and Global DevelopmentPrerequisite: Completion of the Lower Division writing requirement. Examines womens roles and concerns in socio-economic and political development processes. Positive and negative effects of colonization post-colonial modernization democratization and capitalist and socialist development strategies on women in theThirdSecond andFirst World countries are examined. Available for Graduate Credit. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GWS",
        "catalog_number": "400",
        "title": "Senior Seminar in Gender and Women&#8217;s Studies",
        "description": "Prerequisite: GWS 301. This course is a culmination (capstone) of the students undergraduate studies and will not necessarily introduce new topics. Instead students reflect on and review important womens studies theories key principles and questions. Each student conducts a research project applying feminist methodology and writes a research paper on a topic within the discipline. The purpose of this course is to review the cross-cultural and international literature in womens studies/feminist studies as well as to equip students for graduate school and/or the work setting.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "GWS",
        "catalog_number": "495GHC",
        "title": "GNDR/CNFLCT ZONES",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    }
]