[
    {
        "subject": "HHD",
        "catalog_number": "185",
        "title": "PUB HLTH JUSTICE",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "HHD",
        "catalog_number": "501",
        "title": "Interdisciplinary Perspectives on Aging",
        "description": "Prerequisites: Baccalaureate Degree in health or human services or equivalent. This course provides an interdisciplinary overview of the fundamental principles theories issues and concepts in the field of gerontology. The interdisciplinary emphasis derives from the fact that to understand aging we must consider facts and explanations from a wide array of fields. Social gerontology integrates knowledge that ranges from history demography physiology philosophy science ethics medicine law mass communication and social policy among others. The course will emphasize the research literature to consider issues that include work retirement leisure health technologies and living environments.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HHD",
        "catalog_number": "503",
        "title": "Gerontology Program Development",
        "description": "Prerequisites: Baccalaureate Degree in health or human services or equivalent. Using an interdisciplinary approach this course critically examines a variety of issues relating to the administration development and evaluation of gerontology programs and services for diverse populations of older adults and their families. Topics covered include leadership organizational planning ethics in human services fiscal management program development and evaluation personnel management and marketing. The course emphasizes applications to actual problems facing government agencies and organizations serving older adults.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HHD",
        "catalog_number": "504",
        "title": "Current Issues in Aging",
        "description": "Prerequisites: Baccalaureate Degree in health or human services or equivalent. This interdisciplinary course addresses selected topics in aging presented at an advanced level. Preference is given to current topics considered key for gerontology professionals. Possible topics include emerging issues in diversity gender nutrition consumer affairs physical fitness and mental health.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HHD",
        "catalog_number": "513",
        "title": "LEAD HHD",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HHD",
        "catalog_number": "502",
        "title": "Aging Policies and Programs",
        "description": "Prerequisite: Baccalaureate Degree in health or human services or equivalent. This course is designed to provide students with knowledge of the policy process the politics of aging and an opportunity to explore selected aging policy issues in-depth. The content focus is on a few areas that provide fertile ground for policy development and/or analysis and offer insight into the historical social economic and demographic issues that have influenced the development of federal and state legislation and programs for older persons. Projects and papers will provide students with opportunities to examine issues surrounding the design and implementation of particular policies track current changes in legislation or undertake critiques of policies already in place.\n",
        "units": "3",
        "class_type": "LEC"
    }
]