[
    {
        "subject": "HIST",
        "catalog_number": "110",
        "title": "World History to 1500",
        "description": "Introduction to major developments in world history from the emergence of complex societies until 1500 c.e. Examines processes of social cultural political and economic change throughout this period and emphasizes comparisons of and interconnections between major world civilizations in Europe Asia Africa and the Americas. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "111",
        "title": "World History Since 1500",
        "description": "An introduction to the major developments in world history from 1500 to the present. The course examines the processes of social cultural economic and political change throughout this period and emphasizes the production of global cultures and reactions to them. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "150",
        "title": "Western Civilization I",
        "description": "Roots of modern civilization in the West as revealed by a study of significant cultures and societies of the past from the earliest times to 1500. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "151",
        "title": "Western Civilization II",
        "description": "Modern civilization in the West since 1500 with emphasis on the historical development of basic elements of culture and problems of contemporary times. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "161",
        "title": "Survey of the History of Latin America",
        "description": "Study of certain aspects of the culture and society of Latin America and analysis of the relation of those aspects to the contemporary scene. (Available for General Education Comparative Cultural Studies.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "192",
        "title": "History of Modern East Asia",
        "description": "A survey of major developments in the history of East Asia from 1800 to the present. Focuses on political economic social and cultural transformations in China and Japan during this time period with some attention to related developments in Korea and Vietnam. (Available for General Education: Subject Exploration Comparative Cultural Studies.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "210",
        "title": "A History of the Jewish People",
        "description": "Study of the Jewish people from their beginnings in the ancient Near East to the establishment of the modern state of Israel. (Available for General Education Comparative Cultural Studies.) (Cross listed with JS 210.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "270",
        "title": "The United States to 1865",
        "description": "Survey of the political and social development of the U.S. through the Civil War. (Meets Title 5 requirement in American History Institutions and Ideals.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "271",
        "title": "The United States Since 1865",
        "description": "Survey of the political and social development of the U.S. since the Civil War. (Meets Title 5 requirement in American History Institutions and Ideals.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "301",
        "title": "HISTORIAN'S CRAFT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "303",
        "title": "Themes in Western Civilization Before 1500",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Intended to introduce Upper Division students to the concepts and unresolved problems that have shaped the development of Western Civilization prior to 1500. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "304",
        "title": "Themes in Western Civilization After 1500",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Themes in the institutional political socio-economic and cultural development of Western Civilization since 1500. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "340",
        "title": "EARLY MODERN EUROPE",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "341",
        "title": "Modern Europe Since 1815",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Institutions culture and political development of Europe from the Congress of Vienna to the present day. (Credit will not be given for 341 if credit has already been received for either 446 or 447) (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "342",
        "title": "The World Since 1945",
        "description": "This course examines the Cold War and its international aftermath decolonization revolutionary movements national development across a variety of cases and trends in the global economy. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "345",
        "title": "War in History and Film",
        "description": "History of warfare since the Middle Ages as reflected in classic war films literary sources and historical documents. Discusses effects of media on perception of historical events.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "349A",
        "title": "Women in American History Through 1848",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Survey of womens roles and status through 1848. (Available for General Education Comparative Cultural Studies.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "349B",
        "title": "Women in American History Since 1848",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Survey of womens roles and status since 1848. (Available for General Education Comparative Cultural Studies.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "350",
        "title": "History of Women",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Roles and contributions of women from ancient times to the present. Special emphasis is given to the development of womens movements from the 18th century to the present. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "366",
        "title": "Popular Culture and Society in Latin America",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. This course will offer students the opportunity to explore and understand the complexities of Latin American societies in the 19th and 20th centuries through the historical analysis of different forms of popular culture defined broadly as those religious artistic athletic and political expressions arising from different segments of society. (Available for General Education Lifelong Learning credit.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "369",
        "title": "History of American Indians",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Interaction of white and Indian as well as Indian and Indian in the U.S. from colonial times to the present. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "370",
        "title": "Problems in American History to 1865",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Exploration of the political cultural and social themes of U.S. history prior to the Civil War with emphasis given to examining conflicting ideas about such issues as the dynamics of colonial settlement the origins of the Revolution the ratification of the U.S. Constitution the development of liberal capitalism the nature of the American democratic political system the impact of slavery and the causes of the Civil War. (Meets Title 5 requirement in American History Institutions and Ideals.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "370HON",
        "title": "QUEST AMER HIST I",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "371",
        "title": "QUEST AMER HIST II",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "374",
        "title": "Hollywood and History",
        "description": "Explores the relationship of classic Hollywood movies to the political social and cultural history of 20th century America. By placing each film in its historical context and examining it as a primary source students will learn to evaluate the extent to which American movies have expressed or challenged the dominant political themes and social and cultural values of a particular historical era.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "380",
        "title": "Los Angeles: Past, Present, Future",
        "description": "Multidisciplinary investigation of the Los Angeles urban area -- its patterns of population and resources distribution; its historical economic social and cultural developments; and policies models designed to cope with its problems -- and to develop its potential as an ethnically diverse metropolis on the Pacific Rim. Application of social science methodology. Series of faculty and guest speakers weekly discussion sessions and field trips. (Available for General Education Social Sciences.) (Cross listed with POLS and URBS 380.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "402",
        "title": "Writing Family History",
        "description": "Application of historical research techniques to the writing of ones own family history.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "409",
        "title": "History of the Jews in the Modern Era",
        "description": "A history of the Jewish people from the 17th century to the present. Principal themes include the transformation of the traditional community the changes in Jews political status the emergence of modern anti-Semitism and ethnic and gender distinctions within Jewry. (Cross listed with JS 409.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "410",
        "title": "The Ancient Greek World",
        "description": "The Mediterranean world from the rise of Greek civilization to the conquest of Greece by Rome.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "411",
        "title": "The Roman World",
        "description": "The rise and decline of the Roman Republic and the Western Roman Empire.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "415",
        "title": "The Byzantine World",
        "description": "Byzantine history and civilization from the founding of Constantinople in 324 A.D. to the Turkish conquest in 1453.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "417",
        "title": "California for Educators",
        "description": "Prerequisite: Available to Liberal Studies Pre-Credential and ITEP students. Examination of California focusing on its political social and economic growth its settlement its population patterns resource exploitation and human-environment interaction. Spatial and temporal variation of these factors is emphasized. (Cross listed with GEOG 417.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "420",
        "title": "Medieval Europe",
        "description": "Political and institutional history of Europe in the Middle Ages. (Credit may not be received for both 420 and 320.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "424",
        "title": "A History of the Medieval Middle East",
        "description": "600-1258Preparatory: History 185. This course will trace the development of religion government culture and society in the Middle East in the Early Islamic period (600-1258 CE). This course will first focus on Islamic conceptions of religion law and government. It will then examine the effect that these conceptions had on the Muslim community and on the communities of conquered peoples in the Middle East during this period. Available for Graduate Credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "425",
        "title": "History of the Early Modern Middle East",
        "description": "Recommended Preparatory: HIST 185. This course will trace the history of the Early Modern Middle East from the Mongol destruction of Baghdad in 1258 to the Napoleonic invasion of Egypt in 1798. It will focus on political events but there also will be substantial discussions of cultural economic and social history. The aftermath of the Mongol invasions and the rise and development of the Gunpowder Empires including the Mamluks Ottomans il-Khans and Safavids will be emphasized. Special attention will be paid to the interaction of these empires and the cultures that developed under their control with each other and with non-Middle Eastern states and cultures. Available for Graduate Credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "426",
        "title": "MODERN MID EAST",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "429",
        "title": "HIST CHOC",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "433",
        "title": "Public History",
        "description": "Introduction to the theory history and practice of public history (the presentation and interpretation of history for the general public). Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "434",
        "title": "European Colonialism",
        "description": "Prerequisite: Upper Division standing. Examines the expansion consolidation management disintegration and consequences of the modern European empires focusing on the ambiguities of identity produced by the encounter between European American African and Middle Eastern and cultures. Topics include such cultural constructions as cannibalism exoticism orientalism primitivism racism and tourism.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "435",
        "title": "African History to the 19th Century",
        "description": "History of the societies of sub-Saharan Africa from the early Iron Age to the 19th century.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "441",
        "title": "History of World War II",
        "description": "Study of World War II as a watershed experience in modern history with coverage of the European and Pacific theatres of war diplomatic strategies and the impact of the war on the domestic scene.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "444",
        "title": "Renaissance and Reformation",
        "description": "Europe from the Italian Renaissance through the religious schisms of the 16th century.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "445",
        "title": "Absolutism and Revolution",
        "description": "Europe in the age of colonial expansion and the rise of revolutionary doctrines through the fall of Napoleon.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "449",
        "title": "Russia to 1917",
        "description": "Russian History covering the beginnings during the Kievan period and Muscovy to the establishment of the Romanov dynasty Imperial Russia and the October Revolution in 1917. Available for Graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "450",
        "title": "Russia Since 1917",
        "description": "Starting with the collapse of Imperial Russia and the 1917 Bolshevik Revolution the course examines the Soviet period in Russian history including industrialization Stalinism the Great Patriotic War the USSR as a superpower and the demise of the Soviet Union in the late 1980s. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "453",
        "title": "Modern Britain",
        "description": "Chronological and thematic survey of social political cultural economic and intellectual developments in Britain from 1688 to the present. From world power status to national decline this course covers such topics as industrialization political reform sex and gender roles the impact of war and the tensions of a multi-ethnic multi-cultural society.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "456",
        "title": "Modern France",
        "description": "Review of French social cultural economic military and political history from the fall of Napoleon to end of the Cold War. Examines in detail the social turmoil caused by Frances many revolutions and major wars during the period. Special emphasis on the effect of class and social conflict on its modern history.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "457",
        "title": "Modern Germany",
        "description": "German social and political development since the time of the French Revolution.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "461",
        "title": "Latin America: The Colonial Period",
        "description": "Formation of the Spanish and Portuguese empires in Latin America tracing the development of society government and culture.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "462",
        "title": "19th Century Latin America",
        "description": "Examination of the struggle for independence and the social political and economic development of Latin American nations from 1810 to 1914.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "463",
        "title": "20th Century Latin America",
        "description": "Study of Latin American history since 1914 with emphasis on the impact of modernization upon the traditional order efforts toward inter-American understanding and greater interaction with the contemporary world.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "465",
        "title": "The Caribbean Area Since 1492",
        "description": "Changing role of the Caribbean area in the affairs of Europe Anglo-America and Latin America and the development of the region as a unique political social and economic community.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "466",
        "title": "Mexico",
        "description": "Internal development of Mexico and how it has affected hemispheric and world affairs. Special attention is devoted to Mexicos interaction with the U.S.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "467",
        "title": "MEXICAN REVOLUTIN",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "468",
        "title": "Social and Intellectual History of Latin America",
        "description": "Study of the principal elements and trends in Latin American Civilization with emphasis on society the humanities and philosophy.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "470",
        "title": "The United States: The Colonial Period",
        "description": "Origins and development of the 13 American colonies from the beginning of settlement to the end of the French and Indian War.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "471",
        "title": "American Revolution and Constitution",
        "description": "1763-1800Development of an American nation from the start of revolutionary activity to the end of Federalist control.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "472",
        "title": "The United States: The Era of Expansion",
        "description": "1800-1848Growth of the nation from the election of Jefferson through the age of Jackson to the completion of continental expansion at the end of the Mexican War.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "473A",
        "title": "The United States: Civil War and Reconstruction",
        "description": "Social economic and political origins of sectionalism; the Civil War and its legacy to later generations.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "473B",
        "title": "The United States: 1877-1920",
        "description": "Interpretive survey of the political cultural diplomatic and social history of the U.S. during the Gilded Age and Progressive Era through World War I.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "474A",
        "title": "The United States: 1920-1960",
        "description": "Interpretive survey of the political cultural diplomatic and social history of the U.S. from the end of World War I through the election of John F. Kennedy.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "474B",
        "title": "The United States: 1960-Present",
        "description": "Interpretive survey of the political cultural diplomatic and social history of the recent and contemporary U.S. from the election of John F. Kennedy to the present.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "475",
        "title": "Women in Modern United States History: 1920-Present",
        "description": "Study of the roles status and contributions of women in the U.S. from 1920 to the present.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "479B",
        "title": "US ECON FROM 1865",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "480",
        "title": "EARLY AM BORDERS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "485",
        "title": "Diplomatic History of the United States Since 1914",
        "description": "Analysis of the U.S. foreign policies since 1914 with emphasis on the origins nature and results of Americas involvement in the World Wars the Cold War and global international affairs since the 1950s.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "485C",
        "title": "US AND IRAQ WAR",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "486A",
        "title": "History of Los Angeles",
        "description": "Evolution of the metropolis of Los Angeles from pre-Spanish days to the present.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "488",
        "title": "California",
        "description": "Political economic social and intellectual growth of California from Spanish times to the present with emphasis on current characteristics and problems.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "489",
        "title": "A History of the African-American People in the United States",
        "description": "Examination of basic themes and issues in the history of the African-American people in the U.S. and the relevance of those themes and issues to the patterns of today.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "490",
        "title": "Traditional China",
        "description": "Study of political economic and social history of China from antiquity to the fall of the Ming Dynasty in 1644.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "491A",
        "title": "Modern China",
        "description": "Survey of political economic and social history of China from the fall of the Ming Dynasty in 1644 to the Republican Revolution of 1911 with special emphasis on early Manchu success Chinas response to the impact of the West and the Manchu decline.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "491B",
        "title": "The Rise of Communist China",
        "description": "Historical analysis of the Chinese Communist movement from its inception to the founding of the Peoples Republic of China with special emphasis on Mao Tse-tungs early revolutionary thought and strategy.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "494SOC",
        "title": "Internship Program",
        "description": "Pre-professional practicum in a history-based field open to History major and minors with 3.0 GPA.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "HIST",
        "catalog_number": "495SS",
        "title": "Capstone Seminar for Prospective History Teachers",
        "description": "Prerequisites: ANTH GEOG PAS POLS or SOC 396SS; Restricted to students in the Social Science Subject Matter Program. Intended as a capstone experience this seminar will expose students to the practices of historical thinking and guide them to develop the knowledge and skills needed to convey these practices to others. It is recommended that this course be taken in the last 12 units of the Social Science Subject Matter Program. Requires 10 hours of field observation in secondary social studies classrooms.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "HIST",
        "catalog_number": "497A",
        "title": "Proseminar",
        "description": "General principles of historical research with application to specific areas of history and historiography. Grade ofC or better is required to receive credit for this course.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "498A",
        "title": "Tutorial in History",
        "description": "Reading and discussion in a specific field or on a specific topic in a small group. May be repeated: 6 units maximum. Grade ofC or better is required to receive credit for this course.\n",
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "499C",
        "title": "Independent Study",
        "description": "Independent Study\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "HIST",
        "catalog_number": "508",
        "title": "Practicum in Archival Administration",
        "description": "Prerequisites: HIST 505; Graduate standing or instructor consent. Application of the theory of archival administration including collection preservation arrangement and exhibition of historic materials. Students may complete the practicum at one of several sites including the Urban and Old China Hands Archives at Oviatt Library the Ronald Reagan Presidential Library and the Natchez Mississippi Courthouse Record Project.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "HIST",
        "catalog_number": "510",
        "title": "Colloquium in Greek and Hellenistic History",
        "description": "Prerequisite: Graduate standing or instructor consent. Covers historiographical writings on important developments in Greek and Hellenistic history from the Bronze Age through the Persian and Peloponnesian Wars and the trial of Socrates and concludes with a discussion of Hellenistic Greece and the influence of Greek culture in the broader Mediterranean world.\n",
        "units": "3",
        "class_type": "DIS"
    },
    {
        "subject": "HIST",
        "catalog_number": "531",
        "title": "Colloquium in Modern World History",
        "description": "Prerequisite: Graduate standing or instructor consent. Designed for students who will one day teach world history as well as those who are interested in trans-national trans-regional integrative history. Provides a practical and theoretical approach to world history since 1500 by exploring the vibrant and volatile debate overThe Rise of The West. Topics include industrialization imperialism global trade environmental change military technology migration and slavery and the role of culture in economic development.\n",
        "units": "3",
        "class_type": "DIS"
    },
    {
        "subject": "HIST",
        "catalog_number": "545",
        "title": "Colloquium in the History of the Middle East",
        "description": "Prerequisite: HIST 185. Recommended preparatory: HIST 424 and 426. This course is an examination of major themes in Middle Eastern history from the Arab/Islamic conquest to the present. Possible topics include examinations of cultural economic intellectual religious and social history. The course will underscore historiography and the effect of modern political debates on the history of the region. Readings will include major scholarly works and primary sources in translation.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "546",
        "title": "The Holocaust and Genocide for Educators",
        "description": "An overview of the Holocaust and the concept of genocide with a focus on the analysis and evaluation of varied resources for educators including film photographs literature art music documents and other primary source materials. (Cross listed with JS 546.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "548",
        "title": "HISTORY AND MEMORY",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "570",
        "title": "The American Revolution",
        "description": "This course will help students come to terms with the late 18th century imperial crisis that brought about the rise of the independent U.S. Readings and discussions will focus on the origins progress and results of the American Revolution. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "571",
        "title": "SEM US COLONIAL",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "572",
        "title": "19TH CENT US HIST",
        "description": null,
        "units": "3",
        "class_type": "DIS"
    },
    {
        "subject": "HIST",
        "catalog_number": "574",
        "title": "COLLOQ RECENT US",
        "description": null,
        "units": "3",
        "class_type": "DIS"
    },
    {
        "subject": "HIST",
        "catalog_number": "585",
        "title": "COLLOQ US SOUTH",
        "description": null,
        "units": "3",
        "class_type": "DIS"
    },
    {
        "subject": "HIST",
        "catalog_number": "594",
        "title": "INTERNSHIP",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "596EG",
        "title": "Selected Topics: Enlightenment/Revolution",
        "description": "No course description\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "596F",
        "title": "FRENCH REV",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "596G",
        "title": "Selected Topics: American Borderlands",
        "description": "No course description\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "596J",
        "title": "PED AP WRLD HIST",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "596RM",
        "title": "RSCH METHODS",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "596SW",
        "title": "GREATER SOUTHWEST",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "596WR",
        "title": "WARS ROSES",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "601",
        "title": "Theory and Historiography",
        "description": "Prerequisite: Classified standing. Sophisticated graduate-level introduction to history as a discipline. Surveys the development of history as a discipline examines the various genres of historical writing explores issues and problems of historical interpretation and considers the how historians use theoretical models from other disciplines to shape their work. Readings include seminal works by major historians.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "610",
        "title": "Research Seminar in Ancient Greek History",
        "description": "Prerequisite: Classified standing. Focus on ancient Greek history from Solon to Demosthenes. Topics include Athenian democracy the Persian and Peloponnesian Wars Sparta social and intellectual history Greek historians and modern historiography.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "612",
        "title": "Research Seminar in the Roman Empire",
        "description": "Prerequisite: Classified standing. Seminar on the Roman Empire from the Julio-Claudians to the fall of the empire in the West. Topics include social political and intellectual history the rise of Christianity the transformation of the empire theories about the fall of Rome and studies of individual historians of the period.\n",
        "units": "3",
        "class_type": "DIS"
    },
    {
        "subject": "HIST",
        "catalog_number": "620",
        "title": "Research Seminar in the Middle Ages",
        "description": "Prerequisite: Classified standing. Research seminar concentrating on selected topics in western European Iberian Byzantine and/or Mediterranean history during the period between the fall of Rome and the Renaissance.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "630",
        "title": "Research Seminar in World History",
        "description": "Prerequisite: Classified standing. In addition to discussing the methodological issues involved in studying and researching world history each student writes an original primary source-based research paper on a topic in world history that is trans-national regional or comparative in focus.\n",
        "units": "3",
        "class_type": "DIS"
    },
    {
        "subject": "HIST",
        "catalog_number": "640",
        "title": "Research Seminar in Early Modern European History",
        "description": "Prerequisite: Classified standing. Research seminar concentrating on selected topics in European history from the Renaissance through the Napoleonic period.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "641",
        "title": "Research Seminar in Modern European History",
        "description": "Prerequisite: Classified standing. Research seminar concentrating on selected topics in European history since the French Revolution.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "660",
        "title": "Research Seminar in Latin American History",
        "description": "Prerequisite: Classified standing. Research seminar concentrating on topics in the history of Mexico Central and South America and the Caribbean. Students will conduct an in-depth examination employing original (primary) sources on a specific problem or issue in the history of Latin America.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "671",
        "title": "Research Seminar in Colonial American History",
        "description": "Prerequisite: Classified standing. Research seminar concentrating on selected topics in American history prior to the American Revolution.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "681",
        "title": "SEM US WEST",
        "description": null,
        "units": "3",
        "class_type": "DIS"
    },
    {
        "subject": "HIST",
        "catalog_number": "692A",
        "title": "SW BORDER",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "693",
        "title": "Directed Research",
        "description": "No course description\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "HIST",
        "catalog_number": "694",
        "title": "Practicum for Teaching Assistants",
        "description": "Prerequisite: Classified standing. Working under the close supervision of Departmental faculty and assigned to a specific undergraduate History course students gain experience in creating assignments grading papers and exams leading discussion and review sessions and giving lectures. Students have the opportunity to discuss issues and problems in teaching. May be repeated once for credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "698D",
        "title": "Graduate Culminating Project",
        "description": "Prerequisites: HIST 601 and two Graduate Level History Research Seminars. This culminating graduate course requires students to demonstrate their mastery of the historians craft. Students will revise an existing research paper that they produced in one of their graduate research seminar classes and transform it into a piece that could be submitted as a conference paper a scholarly writing sample and/or an article for publication. Students will prepare a cogent twenty-minute oral presentation of their work. This course is to be taken in the students final semester\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "699C",
        "title": "Independent Study",
        "description": "Independent Study\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "HIST",
        "catalog_number": "185",
        "title": "Civilization of the Middle East",
        "description": "Introduction to the history and culture of the Middle East from the rise of Islam in the 7th century to the present. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "305",
        "title": "Cultural History of the United States",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. American peoples evolving patterns of life in such areas as religion education art architecture and music reading matter sports travel family life and in recent times motion pictures radio and television. Emphasis is placed on the values and implications revealed by the range and popularity of cultural choices. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "357",
        "title": "History of the Holocaust",
        "description": "Examination of the Jewish experience under Hitler from its historical genesis to its final catastrophe.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "427",
        "title": "ISRAEL HIST PEOPL",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "428",
        "title": "BRITISH EMPIRE",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "436",
        "title": "African History Since the 19th Century",
        "description": "History of the societies of sub-Saharan Africa in the 19th and 20th centuries.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "446",
        "title": "19th Century Europe",
        "description": "Europe from the Congress of Vienna to the opening years of the 20th century.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "452",
        "title": "Medieval and Early Modern Britain",
        "description": "Analytical survey of the political cultural social and religious developments and upheavals in Britain during the turbulent perio from the Norman Invasion in 1066 to the Glorious Revolution in 1688.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "481",
        "title": "The American West Since 1848",
        "description": "Settlement of the last American frontiers from 1848 to 1890 and the evolution of the modern Far West as a distinctly important region during the 20th century.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "485A",
        "title": "The United States and the Indochina Wars",
        "description": "1940-1975Analysis of the wars in Vietnam Laos and Cambodia with emphasis on the U.S. involvement.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "493",
        "title": "MODERN JAPAN",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "496EH",
        "title": "US ENVIRO HIST",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "498C",
        "title": "Tutorial in History",
        "description": "Reading and discussion in a specific field or on a specific topic in a small group. May be repeated: 6 units maximum. Grade ofC or better is required to receive credit for this course.\n",
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "HIST",
        "catalog_number": "505",
        "title": "Archival Theory and Methods",
        "description": "Prerequisite: Graduate standing or instructor consent. Introductory course on the essentials of archival administration. Topics include archival theory the history of archives in the U.S. the development of collecting policies techniques for preserving historical materials and arrangement and description of collections.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "511",
        "title": "Colloquium in Roman History",
        "description": "Prerequisite: Graduate standing or instructor consent. Directed historiographical readings and discussion focusing on Roman history from the Republic through the fall of the Empire.\n",
        "units": "3",
        "class_type": "DIS"
    },
    {
        "subject": "HIST",
        "catalog_number": "541",
        "title": "Colloquium in Modern European History",
        "description": "Prerequisite: Graduate standing or instructor consent. Survey of major historiographical debates in modern European history including the French Revolution the Industrial Revolution the rise of bourgeois society nationalism imperialism and the First and Second World Wars.\n",
        "units": "3",
        "class_type": "DIS"
    },
    {
        "subject": "HIST",
        "catalog_number": "586",
        "title": "US WOMEN/GENDER",
        "description": null,
        "units": "3",
        "class_type": "DIS"
    },
    {
        "subject": "HIST",
        "catalog_number": "596I",
        "title": "US EAR NAT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HIST",
        "catalog_number": "698",
        "title": "Thesis",
        "description": "Students may enroll after they have completed 30 units of course work and had their formal program approved. Students work on their thesis and take the written Proficiency Exam in their second area of study. Students have a 2-year limit in which to finish their thesis from the time they enroll in this course.\n",
        "units": "3",
        "class_type": "SUP"
    }
]