[
    {
        "subject": "HSCI",
        "catalog_number": "131",
        "title": "Health and Society",
        "description": "Analysis of major health problems affecting the life of an individual the family and community-at-large. Evaluation planning and implementation of approaches to meeting personal and societal health needs. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "132",
        "title": "History of Preventive Medicine and Public Health",
        "description": "Historical development of the disease processes concepts and the institutions concerned with public health. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "170",
        "title": "Emergency Health Procedures",
        "description": "Application of medical self-help principles and procedures to maintain health in emergency situations with particular emphasis on physiological bases. American Red CrossResponding To Emergencies certificate issued upon successful completion of course requirements. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "181",
        "title": "Medical Imaging Sciences I",
        "description": "Prerequisite: Acceptance into the Radiologic Technology Program or instructor consent. Introduction to the role of the radiologic technologist. Study of the function and manipulation of equipment and technical factors used in the production of X-ray and in imaging systems used within radiology. Includes a progressive series of radiographic exercises in preparation for clinical experiences. (Offered Fall semester.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "231",
        "title": "Women and Health",
        "description": "Study of factors affecting health and women in our society. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "280",
        "title": "Radiological Sciences: Clinical Education I",
        "description": "Prerequisite: Acceptance into the Radiologic Sciences Program. Corequisite: HSCI 285. Orientation and introduction to clinical education in medical radiography. At an affiliated hospital each student participates with direct supervision in selected darkroom clerical and basic radiographic procedures. Includes lectures in hospital organization departmental administration and medical ethics. (Offered Fall semester.)\n",
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "HSCI",
        "catalog_number": "282",
        "title": "Radiological Sciences: Clinical Education III",
        "description": "Prerequisites: HSCI 182 281 286 385 or ARRT Certification. Clinical participation in the radiology department of an affiliated hospital. Includes patient positioning manipulation of exposure factors film analysis and methods of patient care.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "HSCI",
        "catalog_number": "283",
        "title": "Radiological Sciences: Clinical Education IV",
        "description": "Prerequisites: HSCI 182 281 282 286 385 or ARRT Certification.  Corequisite: HSCI 380 384 480 482. Clinical participation in the radiology department of an affiliated hospital. Includes patient positioning manipulation of exposure factors and advanced film analysis. (Offered Fall semester.)\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "HSCI",
        "catalog_number": "285",
        "title": "Radiographic Anatomy and Positioning I",
        "description": "Prerequisites: BIOL 211 212; Acceptance into the Radiologic Technology Program. Corequisite: HSCI 280. Comprehensive modular approach to radiographic positioning of the appendicular skeleton vertebral column genito-urinary tract chest and abdomen with emphasis on the associated anatomy physiology and medical terminology.\n",
        "units": "6",
        "class_type": "ACT"
    },
    {
        "subject": "HSCI",
        "catalog_number": "312",
        "title": "Introduction to Health Administration",
        "description": "Prerequisites-MATH 102 or 103 SOC 150 PSY 150.  Fundamentals of health administration including role integration between health administrators health professionals and allied health personnel.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "313",
        "title": "Health Administration",
        "description": "Prerequisite: HSCI 312. Theory and practice of health administration in various types of health organizations.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "314",
        "title": "Organization and Delivery of Health Services",
        "description": "Examines how the behavior and interaction of health system components consumers and the diverse interest groups in our nation impact the distribution and availability of health-care resources impede or increase access to care change or create health entitlements like Medicare and Medi-Cal and change provider reimbursement mechanisms. U.S. California and Los Angeles County public and private health systems are overviewed as are systems of health delivery in other nations.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "331",
        "title": "PRINCIPLES HEALTH ED",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "336",
        "title": "Health Aspects of Drug Use",
        "description": "Preparatory: Completion of the Lower Division writing requirement. In-depth analysis of the factors and problems related to the use and misuse of drugs and their effect on the health and welfare of the individual family and society. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "337",
        "title": "Nutrition and Health",
        "description": "Preparatory: Completion of the Lower Division writing requirement. Fundamentals of nutrition emphasizing practices and problems related to consumer and health. Credit not allowed for both HSCI 337 and FCS 207. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "345",
        "title": "Public Health Issues",
        "description": "Exploration and analysis of the issues that define public health. Economics politics history theory organization and contemporary practice methodologies are probed in light of such topics as infectious and chronic diseases maternal and child health drug abuse ethnic health mental health nutrition poverty and sexually transmitted diseases. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "380",
        "title": "Cross-Sectional Anatomy for Radiographers",
        "description": "Prerequisites: HSCI 182 281 282 286 385 or ARRT Certification.  Corequisite: HSCI 283. Introduction to cross-sectional anatomy with the use of advanced imaging techniques including Computerized Tomography Magnetic Resonance Imaging and Ultrasonography. Includes comparisons of the various modalities in demonstrating certain anatomy.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "382",
        "title": "Mammography",
        "description": "Prerequisite: California State Certificate for Radiologic Technology (CRT) or senior status in an accredited RT program. Study of breast anatomy physiology and pathology with an emphasis on breast cancer risk factors and detection techniques. Additionally mammography imaging instrumentation requirements and mammographic techniques are emphasized. Labs in quality assurance are scheduled off site. (Offered only through Open University Fall semester.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "384",
        "title": "Computers in Diagnostic Imaging",
        "description": "Prerequisites: HSCI 182 281 282 286 385 or ARRT Certification.  Corequisite: HSCI 283. Study of state-of-the-art equipment and procedures available to radiology departments. Focuses on computer software algorithms and digitization of imaging data. Topics prepare the student for specific computer applications in advanced imaging course work for MRI CT and Digital Subtraction Angiography. Clinical applications and processes that highlight the course content are conducted at affiliated medical centers.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "387",
        "title": "Radiologic Sciences Clinical Education VII",
        "description": "Prerequisites: HSCI 386 or ARRT Certification.  Corequisite: HSCI 483A. Clinical participation in the radiology department of an affiliated hospital. Includes patient positioning manipulation of exposure factors and advanced film analysis. Advanced Imaging techniques in MR CT IR and Cardiac Cath are included.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "HSCI",
        "catalog_number": "390",
        "title": "Biostatistics",
        "description": "Corequisite: HSCI 390L. Prepatory: MATH 102 or 103 or 105 or 140. Principles theory and practice of statistical analysis in health as they apply to health planning epidemiological research and experimental research. 3 hours lecture 2 hours lab.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "390L",
        "title": "Biostatistics Lab",
        "description": "Corequisite: HSCI 390. Prepatory: MATH 102 or 103 or 105 or 140. Principles theory and practice of statistical analysis in health as they apply to health planning epidemiological research and experimental research. 3 hours lecture 2 hours lab.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "HSCI",
        "catalog_number": "391",
        "title": "Computer Application in Health Sciences",
        "description": "Introduction to computer technology including legal and ethical considerations and its application to health education health research health administration and clinical health practice. Class time is proportioned between lecture-discussion and hands-on computer practice.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "412",
        "title": "MED CARE ORGNT US",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "413",
        "title": "Leadership and Direction in the Administration of Health Services",
        "description": "Prerequisite: HSCI 412. Lecture discussion demonstrations and case analyses. Introduction to the basic principles of leadership and direction for students interested in supervision and management of health programs.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "414",
        "title": "Health Law",
        "description": "Preparatory: HSCI 312 314. Overview of the legal aspects of health-care delivery and the health administrators and health professionals responsibility in the area of patient care consumer rights and malpractice.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "415",
        "title": "Health Information Systems",
        "description": "Preparatory: HSCI 412. Introduces the health-care information systems required in the health-care industry and develops an understanding of the scope and applications of these systems. Both clinical and administration information systems in the health-care industry are covered. Discusses strategic and tactical information management needs of health-care executives.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "416",
        "title": "Utilization of Professional and Allied Health Personnel",
        "description": "Prerequisites HSCI 312 412. Principles methods and procedures in the utilization of professional and allied health personnel in health organizations.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "422",
        "title": "Health Services for the Elderly and the Mentally Ill",
        "description": "Prerequisite: HSCI 412. Problems in planning financing delivering and evaluating health services for the elderly and the mentally ill. Administrative structures and public and private delivery systems are compared and critiqued.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "424",
        "title": "Health Planning",
        "description": "Prerequisites: HSCI 312 390 412. Emphasizes current approaches to the administration of community-wide health planning agencies and the administration of in-house facility health planning programs.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "425",
        "title": "Financial Planning and Reimbursement in Health Care",
        "description": "Prerequisites: ACCT 220 or equivalent; HSCI 312 412. Consideration of the highly specialized application of financial planning principles and reimbursement procedures in health organizations including government regulations and legal restraints.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "431",
        "title": "Health Behavior",
        "description": "Prerequisites: HSCI 237; PSY 150. Application of current concepts of the behavioral sciences to the health field. Approaches to behavioral changes for healthful living are stressed.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "433",
        "title": "Counseling of Health Problems",
        "description": "Consideration of concepts and techniques of counseling and guidance as they apply directly to the reduction of specific health problems.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "434",
        "title": "LACT ED PRENATAL",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "435",
        "title": "Health Science for Children and Youth",
        "description": "Examination of biological and environmental factors influencing health of children and youth and means of solving selected health problems including cardiopulmonary resuscitation. (Available for General Education Lifelong Learning -- Credential candidates only.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "436",
        "title": "Health Concerns of Adolescents",
        "description": "In-depth study of the health concerns of adolescents including cardiopulmonary resuscitation. (Available for General Education Lifelong Learning -- Credential candidates only.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "437",
        "title": "Strategies for Making Health Decisions",
        "description": "Undergraduate seminar. Techniques of developing selected strategies for making health decisions.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "439",
        "title": "Community Health Action",
        "description": "Basic concepts and techniques of community health action as applied to the initiation and enhancement of community health and health-related services.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "440",
        "title": "Family Health",
        "description": "Health aspects of the home and the family including health and personal qualifications for marriage prenatal care pregnancy infant and maternal mortality childrens diseases home accidents health plans for the family and health problems of the older members of the family.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "441",
        "title": "Community Health Education",
        "description": "Prerequisites: 431. Program planning and evaluation as applied to the practice of education in the community; factors that influence decision making about health; barriers to changing health behavior; effective utilization of community health agencies as vehicles of change.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "442",
        "title": "Health",
        "description": "Culture and DiversityAn in-depth analysis of how culture impacts individual and community health.  Includes an exploration of how social determinants of health affect health disparities.  Effective evidence-based health education strategies are presented as ways to address racial and ethnic health disparities.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "445",
        "title": "Senior Seminar in Health Education",
        "description": "Prerequisites: C- grade or better in HSCI 441; Senior standing. Study of the methodologies in planning developing implementing and evaluating programs to solve school and community health problems.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "466ADO",
        "title": "Health Issues of the Adolescent",
        "description": "An introduction to the current health concerns of adolescents in the secondary-school setting. Emphasis is placed on the role of the teacher in working with students who have special health needs and conditions and measures that enhance successful learning. Topics include attention to teacher observation skills mandated health screening and immunizations parent referral and follow-up procedures and the contribution of school personnel to a Coordinated School Health Program. This course is restricted to students in the College of Education Credential Program and is required for the Single Subject Credential.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "478",
        "title": "SEM CURRNT TRNDS",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "480",
        "title": "Computed Tomography",
        "description": "Prerequisites: HSCI 182 281 282 286 385 or ARRT Certification.  Corequisite: HSCI 283. Principles of Computed Tomography provide the Radiologic Technology student with a broad understanding of the applied physics and imaging techniques used in clinical Computed Tomography Imaging. Overviews all 5 generations of CT imaging. Clinical applications and processes that highlight the course content are conducted at the affiliated medical centers. (Offered fall semester)\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "482",
        "title": "Angiography and Interventional Technology",
        "description": "Prerequisites: HSCI 182 281 282 286 385 or ARRT Certification.  Corequisite: HSCI 283. Radiographic examinations involving surgical procedures and specialized equipment. (Offered Fall semester.)\n",
        "units": "4",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "483A",
        "title": "Medical Imaging Pathology",
        "description": "Prerequisites: HSCI 284 302 or ARRT Certification.  Corequisite: HSCI 387. Understanding the basic principles of pathology is an essential part of the radiologic technologists training. Knowing how disease processes work and recognizing the radiographic appearance of specific diseases can aid the technologist in selecting proper modalities and determining the need for repeat radiographs in different situations. This kind of knowledge enables the radiologic technologist to become a more competent professional and a contributing member of the diagnostic team.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "484A",
        "title": "PET FUSION IMAGING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "486A",
        "title": "Seminar: Advances in Radiologic Imaging I",
        "description": "Prerequisites: HSCI 181 280 285 Physics 376 or ARRT Certification. Research of diagnostic interventional or therapeutic processes being developed or used in radiologic imaging for the purpose of improving the health and/or well-being of the patient population. Students work under the guidance of the instructor to research an approved topic and to develop a scientific paper display or project. Students participate in seminar discussions on current research present their research findings and demonstrate professional communication and critical-thinking skills.\n",
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "486B",
        "title": "Seminar: Advances in Radiologic Imaging II",
        "description": "Prerequisites:  HSCI 283 380 384 480 482  or ARRT Certification. Corequisite: HSCI 284. Research of diagnostic interventional or therapeutic processes being developed or used in radiologic imaging for the purpose of improving the health and/or well-being of the patient population. Students work under the guidance of the instructor to research an approved topic and to develop a scientific paper display or project. Students participate in seminar discussions on current research present their research findings and demonstrate outstanding professional communication teaching and critical-thinking skills.\n",
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "488",
        "title": "Epidemiology: Study of Disease",
        "description": "Preparatory: HSCI 390. Nature transmission prevention and control of disease from a public-health approach. Historical background current problems and trends in disease control.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "494HA",
        "title": "INTERN HLTH ADMIN",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "HSCI",
        "catalog_number": "494IHA",
        "title": "INTERN EVAL HA",
        "description": null,
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "HSCI",
        "catalog_number": "494IPH",
        "title": "INTERN EVAL PH",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "HSCI",
        "catalog_number": "494PH",
        "title": "INTERN PUB HLTH",
        "description": null,
        "units": "2",
        "class_type": "SUP"
    },
    {
        "subject": "HSCI",
        "catalog_number": "505A",
        "title": "Health Informatics",
        "description": "The course prepares students of healthcare administration or similar background to lead in the field of healthcare administration informatics by providing a wide ranging exploration of topics related to informatics and health information technology in the US healthcare delivery system. The course starts with the unique needs of the U.S. healthcare industry by introducing the basic components of the US healthcare system payment systems and healthcare reform issues related to health information technology. Other topics will include: basic concepts of computer science health information management the electronic medical records (EMR) workflow analysis tools and approaches to re-design of healthcare processes.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "510",
        "title": "SYS HLTH DELV US",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "511",
        "title": "Health Services Administration Theory and Practice",
        "description": "Preparatory: Bachelors Degree; Conditionally Cassified status for the Masters Degree in Health Administration. Introduction to the basic historical and current theory and practice of the administration of health services organizations. Emphasis on the administrators role in a systems approach to assessing and responding proactively to the external forces in the health services delivery system and in the development of the organizations culture and processes for the provision of quality service.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "513",
        "title": "Leadership in Health Administration Practice",
        "description": "Seminar in which special emphasis is placed on the leadership skills needed in health-care organizations. Describes basic leadership principles reviews literature examines factors associated with successful leadership and discusses case studies on leadership strategies used in the health-care field. In addition a personal assessment of leadership styles are conducted as well as a culminating community class project.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "515",
        "title": "Seminar in Healthcare Information Management",
        "description": "Prerequisites: Graduate status; Basic computer literacy. Investigates current status of both clinical and administrative health-care information management systems. Topics include emerging technology selection of information systems management of information electronic medical records the internets impact on a health-care organizations business processes and other current events. For MSHA MPT MPH and other graduate students.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "517",
        "title": "Health Economics And National Health Policy",
        "description": "Application of economic theory and concepts to the analysis and formulation of both managerial decision and health-care policy. Provides a basic introduction to the relevant technical and economic aspects of the health-care industry and local state and national health-policy issues.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "518",
        "title": "Managed Care",
        "description": "Prerequisite: HSCI 412 or graduate standing. Consideration of alternate health-care delivery systems emphasizing the planning development start-up and operation of health maintenance organizations.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "521",
        "title": "Health-Care Ethics",
        "description": "Prerequisite: HSCI 412 or graduate standing. Framework for analysis of ethical issues in the provision of health care including conceptual foundations for defining biomedical ethical problems; societal institutional and individual dilemmas in health-care delivery and financing; ethical problems at the beginning and at the end of life; and administration of institutional ethics committees.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "523",
        "title": "Seminar in Health-Care Organization",
        "description": "Prerequisite: HSCI 510. Graduate seminar in health-care organization examines the structure and interrelationships of health status and health-care resources including human resources facilities and services. Approach is interdisciplinary and designed to provide the student with an understanding of the issues in health-care delivery. Emphasis is placed on providers and populations within the clinical legal political and economic systems.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "526",
        "title": "WOMENSGLOBALHLTH",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "531",
        "title": "Seminar: Health Education Program Planning and Evaluation",
        "description": "Preparatory: Graduate standing as a Conditional or Classified student in the MPH Program. Graduate students not in the Program may enroll with permission of course instructor. In-depth study of the conceptual/theoretical and practice-based methodologies of community health education program planning and evaluation.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "533",
        "title": "Advanced Concepts of Health Behavior",
        "description": "Critical analysis of theoretical issues and current methodologies related to influencing health behavior. Special emphasis will be given to the selection and application of principles to the field setting. (Offered Spring semester.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "535",
        "title": "Curriculum Development in Health Education",
        "description": "Critical analysis of curriculum theory and its application in the development of education programs in the health sciences. (Offered Fall semester.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "536",
        "title": "Cultural Issues in Health Care",
        "description": "Preparatory: Graduate standing or instructor consent. Provides the health professions student with an increased understanding of the cross-cultural factors that can influence health and disease practices across a wide range of cultural groups. Using readings classroom exercises and student-developed case studies participants explore the cultural variables impacting the delivery of health promotion/disease prevention programs and services.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "537",
        "title": "Communications in Health Education",
        "description": "Analysis development and utilization of media communication in Health Education.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "538",
        "title": "Seminar: Community Health Action",
        "description": "Comprehensive analysis of methods and techniques appropriate to community health action. (Offered Spring semester.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "539",
        "title": "Seminar: Current Issues in Health Education",
        "description": "Theory principles and research applicable to health education. Investigation of problems of social economic cultural and educational origin as they apply to sound health education programs. (Offered Fall semester.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "540",
        "title": "Grantsmanship for Health and Human Development",
        "description": "An introductory course in grant writing for graduate students. The course will focus on the fundamental characteristics of grant writing for the health and human services including identifying sources of funding writing a proposal narrative developing a realistic budget reviewing and editing proposal content and understanding how to manage an awarded grant. The course will examine the criteria for fundable projects in the health and human service arena and provide students with knowledge and tools for producing a grant application.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "541",
        "title": "Administration",
        "description": "Supervision and Consultation in Health EducationIn-depth exploration of the organization administration and legal aspects of health education programs and the principles of supervision and consultation as applied to health education. (Offered Spring semester.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "569",
        "title": "HIV / STI PREVENT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "587",
        "title": "Seminar: Epidemiology",
        "description": "Prerequisite: HSCI 488 or graduate standing. Critical analysis of literature related to the newer concepts of epidemiology as applied to preventative medicine health-care management and public health.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "589",
        "title": "Epidemiology of Common Chronic Diseases",
        "description": "Preparatory: HSCI 588 592. Selected models to evaluate analyze and investigate risk factors related to common chronic diseases.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "591",
        "title": "Quantitative Demography for Health Science",
        "description": "Preparatory: HSCI 592. Principles theory and quantitative aspects of epidemiological demographic methods utilized in health science.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "592",
        "title": "Advanced Biostatistics for the Health Sciences",
        "description": "Prerequisites: HSCI 390 488; Graduate standing. Combines data collection design of data gathering instruments data analysis statistical methods and statistical reasoning for the health sciences.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "592A",
        "title": "ADV BIOSTAT II",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "614",
        "title": "Health Administration: Financial Management",
        "description": "Prerequisites: Accounting course; Classified graduate status in Health Administration. Theory analysis and application of techniques of fiscal management in selected health-care systems.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "616",
        "title": "Quality Assurance in Health Care",
        "description": "Prerequisites: HSCI 513; Classified graduate status in Health Administration. Seminar on new developments government regulations and approaches to quality assurance in health care.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "618",
        "title": "Strategic Planning in Health Administration",
        "description": "Prerequisites: HSCI 513; Classified graduate status in Health Administration. Market and resource assessment changing regulatory and other factors in the health services environment and their impact on the strategic planning process and use of strategic plans in health administration practice.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "620",
        "title": "Seminar in Hospital Administration",
        "description": "Preparatory: Classified graduate status in Health Administration. Hospital organization; governance; relationship of administration to the medical staff; inpatient and outpatient services; professional staff organization; implications of changing MediCal and Medicare and private payer reimbursement; payer contracting; Title 22 and 24 requirements; licensing; make vs. buy decisions; community need and community benefit; differences and similarities between public private nonprofit and private investor-owned hospitals; and DSH and District and teaching hospitals are examined. Course may involve field trips to area hospitals.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "693A",
        "title": "Supervised Field Training",
        "description": "Supervised action research in selected agencies or organizations. May be repeated for up to 4 units credit. (Credit/No Credit only)\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "HSCI",
        "catalog_number": "694",
        "title": "Research Design",
        "description": "Prerequisite: HSCI 390. Critical consideration of research methodology as applied to the health sciences.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "695",
        "title": "PHEALTHPROG EVAL",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "696",
        "title": "Seminar: Research Methodology",
        "description": "Analysis of research methodology and interpretation and applied directly to student-conducted independent research.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "(Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "698C",
        "title": "Thesis or Graduate Project",
        "description": "Enrollment requires that a signed proposal be on file in the Health Science Office. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "HSCI",
        "catalog_number": "698E",
        "title": "INT GRAD PROJ",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "HSCI",
        "catalog_number": "182",
        "title": "Medical Imaging Sciences II",
        "description": "Prerequisites: HSCI 181 280 285 Physics 376 or ARRT Certification. Corequisite: HSCI 281. Study of imaging modalities and equipment utilized in radiology. Includes a progressive series of exercises involving radiation protection procedures problem-solving techniques and quality assurance programs to be used during clinical education. Considers the manipulation and use of body section radiography phototiming image intensification and stereoscopic equipment. (Offered Spring semester.)\n",
        "units": "4",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "281",
        "title": "Radiological Sciences: Clinical Education II",
        "description": "Prerequisites: HSCI 181 280 285 Physics 376 or ARRT Certification. Corequisite: HSCI 182 286 385. Clinical participation in the radiology department of an affiliated hospital. Includes patient positioning manipulation of exposure factors film analysis and methods of patient care. (Offered spring semester)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "HSCI",
        "catalog_number": "284",
        "title": "Radiological Sciences: Clinical Education V",
        "description": "Prerequisites: HSCI 283 380 384 480 482 or ARRT Certification.  Corequisite: HSCI 302 485 487. Clinical participation in the radiology department of an affiliated hospital. Includes patient positioning manipulation of exposure factors and advanced film analysis. (Offered Spring semester.)\n",
        "units": "4",
        "class_type": "ACT"
    },
    {
        "subject": "HSCI",
        "catalog_number": "286",
        "title": "Radiographic Anatomy and Positioning II",
        "description": "Prerequisites: HSCI 181 280 285 Physics 376 or ARRT Certification.  Corequisite:  HSCI 281. Methodologies and elements of pediatric radiology in depth including positioning of the skull facial bones paranasal sinuses mastoids and intraoral and extraoral radiography. Continuation of advanced technical film analysis.\n",
        "units": "5",
        "class_type": "ACT"
    },
    {
        "subject": "HSCI",
        "catalog_number": "302",
        "title": "Basic Pathophysiology",
        "description": "Prerequisites: HSCI 283 380 384 480 482 or ARRT Certification. Corequisite: HSCI 284. Study of the pathogenesis and clinical picture of common disease processes that impact the self-care of individuals. Focuses on the impact of environmental genetic and individual factors in creating or perpetuating disturbed physiology as well as on physiological adaptive responses and the interdependence of body systems. (See Program advisor for information on credit by challenge examination.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "335",
        "title": "Holistic Health",
        "description": "Critical examination of the holistic health model and selected holistic techniques.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "365LS",
        "title": "HLTH SCE ITEP",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "369",
        "title": "HIV / STI STRAT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "385",
        "title": "Quality Assurance and Evaluation of Radiology Imaging Equipment",
        "description": "Prerequisites: HSCI 181 280 285 Physics 376 or ARRT Certification. Corequisite: HSCI 281. Study of quality assurance concepts and application for radiology departments. Includes evaluation of imaging equipment in one of the affiliated medical centers.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "419",
        "title": "Hospital Administration",
        "description": "Prerequisites: HSCI 312 412. Introduction to the administration organization and evaluation of hospital services and the role of the hospital in the community health system. Topics include governance financing medical staff relations and other current topics.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "438",
        "title": "International Health",
        "description": "Analysis of health problems in selected countries. Study of the origin orientation and purposes of agencies functioning in this field.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "446",
        "title": "LAC ED POSTPARTUM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "465ELM",
        "title": "Teaching Health in The Elementary School Classroom",
        "description": "Prerequisite: Restricted to College of Education Credential students. This is a survey course that explores the practical application of selected strategies for the teaching of health education subject matter in the elementary-school classroom. The effective utilization of instructional methodologies that relate to information/concept development skill development open-ended classroom discussion and problem solving are reviewed. State guidelines are reviewed includingstandards for classroom health instruction and the Health Framework for California Public Schools. The Comprehensive School Health System (CSHS) and its specific components (health services a healthful and safe school environment. and health education) are examined.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "HSCI",
        "catalog_number": "485",
        "title": "Principles of MRI",
        "description": "Prerequisites: HSCI 283 380 384 480 482 or ARRT Certification. Corequisite: HSCI 284. Principles of Magnetic Resonance Imaging (MRI) provides the Radiologic Technology student with a basic understanding of the applied physics imaging techniques and imaged anatomy/pathology used in clinical magnetic resonance imaging. Clinical applications and processes that highlight the course content are conducted at the affiliated medical centers. (Offered Spring semester.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "487",
        "title": "Professional Development for Radiographers",
        "description": "Prerequisites: HSCI 283 380 384 480 482 or ARRT Certification. Corequisite: HSCI 284. Seminar includes discussion and application of instructional interventions used in accredited radiography programs. Discussions center on current issues and changes in practice as they apply to continuing curriculum development the national accreditation process and patient education. Additional discussions center around the professionalization of the radiographer with topics covering professional ethics professional codes of conduct and management of professionals. (Offered Fall semester.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "499A",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "HSCI",
        "catalog_number": "534",
        "title": "LACTATION FOR HCP",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "588",
        "title": "Epidemiology of Infectious Diseases",
        "description": "Prerequisites: HSCI 390 488. Critical review of infectious diseases their transmission control prevention and significance in the past present and future.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "613",
        "title": "Managing Change in Health Care Organizations",
        "description": "Prerequisites: HSCI 513; Classified graduate status in Health Administration. Graduate seminar on administrative trends issues and new developments in health-service delivery.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "615",
        "title": "Information Management for Decision Making and Control",
        "description": "Prerequisite: Classified graduate status in Health Administration. Objective is to improve the students decision-making capabilities and develop a systematic approach to problem solving. The student develops the ability to structure problems using explicit and logical decision styles and demonstrate an understanding of the theory and implementation of mathematical models. Emphasis is placed on the application of skills in a variety of health-care settings.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "619",
        "title": "Third Party Payer Impact On Health Delivery",
        "description": "Prerequisite: Classified graduate status in Health Administration. Examines how third-party pay mechanisms including traditional indemnity insurance/fee-for-service Medicare and Medicaid prospective payment systems various managed care models and other forms impact provider and consumer behavior and risk management. Other items include Workers Compensation disability insurance and liability insurance for the healing arts professions self-insured employers and ERISA and the impact of these mechanisms on access to care quality and consumer/provider economic incentives.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "625",
        "title": "Integrative Seminar in Health Administration",
        "description": "Prerequisite: Permission of instructor. Last semester of course work. Integrative seminar. Students apply the knowledge and analytic skills obtained from health administration courses to the solution of organization and system-wide problems in health care.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HSCI",
        "catalog_number": "699C",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    }
]