[
    {
        "subject": "IS",
        "catalog_number": "212",
        "title": "IS FOR BIZ USERS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "312",
        "title": "Information Systems for Business",
        "description": "Prerequisite: ACCT 220. A survey of information systems concepts including information technology business information systems and information system development and management. Preparation of group and individual projects involving hands-on learning of database management systems decision support software and web page design and publishing. Practice in the use of a formal problem-solving process that includes five tasks. Presentation of results in written and/or oral form. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "335",
        "title": "Information Technology in Business",
        "description": "Prerequisite: ACCT 220. Defines the information technology (IT) that is used in business specifically the characteristics of hardware architecture operating systems concepts and their interactions as well as properties of n-tiered information systems. The laboratory component of the course will provide practice on computer hardware architecture operating systems and software of information systems. \n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "355",
        "title": "APP DEVELOPMENT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "431",
        "title": "Systems Analysis and Design",
        "description": "Prerequisites: Grade ofC or higher in IS 312; a grade ofC or higher in BUS 302; a grade ofCR n BUS 302L; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. This course covers the systems development life cycle. Topics include standard tools and techniques to analyze and design an information system from a structured as well as an object-oriented perspective. A Computer-Aided Software Engineering (CASE) tool is used to facilitate the study. Required class work includes a group project on developing an information system in a business case.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "435",
        "title": "Business Data Communications and Networking",
        "description": "Prerequisites: Grade ofC or higher in IS 312; a grade ofC or higher in BUS 302; a grade ofCR in BUS 302L; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. An introduction to the concepts and applications of telecommunications and networking technology in a business environment. Topics include network-related hardware and software technology standards and protocols local and wide area networks network management and emerging trends. Emphasis is on the ability to integrate basic technological components to meet the business application requirements. Students will prepare a variety of projects involving the analysis design and management of network systems.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "441",
        "title": "Database Management Systems",
        "description": "Prerequisite: Grade ofC or higher in IS 312; a grade ofC or higher in BUS 302; a grade ofCR in BUS 302L; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. The design and implementation of computerized databases. Provides background for the selection and use of database management systems. Topics include types of available systems functions of database administration conceptual database design data independence integrity privacy and query. The student will design and implement a database utilizing a commercial database management system.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "451",
        "title": "Systems Development Project",
        "description": "Prerequisites: Grade ofC or higher in IS 431 and 435; a grade ofC or higher in BUS 302; a grade ofCR in BUS 302L; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. An introduction to enterprise-level system development concepts principles and practices. Evaluate and set up comprehensive system development projects for enterprises. Student teams will analyze design and plan systems of moderate complexity using current technologies and the appropriate project management methods in the solution.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "497B",
        "title": "Special Topics &#8211; Information Systems: Information Security and Assurance",
        "description": "Prerequisites: Grade ofC or higher in IS 431 435 and 441; a grade ofC or higher in BUS 302; a grade ofCR in BUS 302L; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. Innovative course of study. Topics to be specified in the Schedule of Classes. Different topics may be taken for credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "497DA",
        "title": "IS DATA ANALYTICS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "497E",
        "title": "TECH STARTUP ENTR",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "498A",
        "title": "Field Assignments and Reports Information Systems",
        "description": "Prerequisites: Consent of instructor; Approval of Program Chair. For students capable of independent work and in need of advanced and specialized study. May be repeated for a total of 6 units.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "IS",
        "catalog_number": "499B",
        "title": "Independent Study",
        "description": "Prerequisites: Consent of instructor; Approval of Program Chair. For students capable of independent work and in need of advanced and specialized study. May be repeated for a total of 6 units. \n",
        "units": "2",
        "class_type": "SUP"
    },
    {
        "subject": "IS",
        "catalog_number": "628",
        "title": "Computer-Based Information Systems",
        "description": "Prerequisite: ACCT 501 or one year of undergraduate accounting. An introduction to computer-based information systems at a fairly sophisticated level. Emphasis will be on the understanding of computer concepts computer applications in an organizational environment and the analysis and design of information systems. \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "IS",
        "catalog_number": "656",
        "title": "Information Systems Audit and Control",
        "description": "Prerequisite: IS 628 or 630. Examines concepts standards and frameworks associated with IS auditing. Topics include the post-Sarbanes Oxley IS audit environment assessment of risks and controls computer fraud legal and ethical issues and audit of the systems development process. Students work through audit simulations to develop IS audit expertise. \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "IS",
        "catalog_number": "699C",
        "title": "Independent Study",
        "description": "Prerequisites: Consent of instructor; Approval of Program Chair. For students capable of independent work and in need of advanced and specialized study. May be repeated for a total of 6 units.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "IS",
        "catalog_number": "457",
        "title": "Advanced Telecommunications and Networking",
        "description": "Prerequisites: Grade ofC or higher in IS 431 435 and 441; a grade ofC or higher in BUS 302; a grade ofCR in BUS 302L; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. An advanced course in telecommunications and networks emphasizing enterprise networking topics such as: network operating systems network analysis and design network security virtual private networks collaboration wireless networks VLAN multi-platform integration voice-over internet protocol web server strategies and storage area networks. This course will include hands-on projects involving network design and implementation.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "497A",
        "title": "Special Topics &#8211; Information Systems: Advanced Database Systems",
        "description": "Prerequisites: Grade ofC or higher in IS 431 435 and 441; a grade ofC or higher in BUS 302; a grade ofCR in BUS 302L; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. Innovative course of study. Topics to be specified in the Schedule of Classes. Different topics may be taken for credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "497C",
        "title": "Special Topics &#8211; Information Systems: IA Networking Fnd",
        "description": "Prerequisites: Grade ofC or higher in IS 431 435 and 441; a grade ofC or higher in BUS 302; a grade ofCR in BUS 302L; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. Innovative course of study. Topics to be specified in the Schedule of Classes. Different topics may be taken for credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Prerequisites: Consent of instructor; Approval of Program Chair. For students capable of independent work and in need of advanced and specialized study. May be repeated for a total of 6 units. \n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "IS",
        "catalog_number": "530",
        "title": "ACCT INFO SYSTEMS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "531",
        "title": "Healthcare Information Systems Analysis and Design",
        "description": "Gain a well rounded understanding of requirements design and control of major business processes that are integral within a healthcare enterprise system. Topics include Systems Analysis and Design methodologies and techniques for healthcare Information System development issues of privacy and confidentiality fraud and abuse as well as controls for systems reliability.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "551",
        "title": "Managing Projects in Healthcare Informatics",
        "description": "Students will gain a well rounded understanding of enterprise-level system development concepts principal and practices. Students will evaluate and setup comprehensive system development projects for departments and/or enterprises. Student teams will analyze design and plan healthcare systems of moderate complexity using current technologies and the appropriate project management methods in the solution. Also students will gain a balanced understanding of management issues related privacy and confidentiality and learn about common system implementation pitfalls as well as benchmarks for evaluating the cost and benefits of implementing new information systems.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "599C",
        "title": "Independent Study",
        "description": "Prerequisites: Consent of instructor; Approval of Program Chair. For students capable of independent work and in need of advanced and specialized study. May be repeated for a total of 6 units. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "IS",
        "catalog_number": "655",
        "title": "Information Systems Theory and Practice",
        "description": "Prerequisite: IS 628 or 630. Comprehensive coverage of current trends and management issues associated with information systems (IS) to deliver business value within organizations at local national and global levels. Topics include issues in information systems planning administration resource management and new information technology (IT) adoption to achieve the alignment between IT/IS and corporate functions.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "IS",
        "catalog_number": "657",
        "title": "Governance and Risk Management",
        "description": "Prerequisite: IS 628 or 630. Provides an overview of information systems (IS) governance and information risk management. The course stresses the importance of the alignment of IS governance to business objectives and the role of IS in achievement of organizational strategy. Topics discussed include contemporary compliance initiatives; strategic IS decision making; IS performance assessment control structure and accountability; IS project management; IS policy definition and enforcement; risk analysis and mitigation; and IS security management (i.e. security planning policy and controls). Established frameworks and standards for IS governance and control are discussed. \n",
        "units": "3",
        "class_type": "SEM"
    }
]