[
    {
        "subject": "ITAL",
        "catalog_number": "101",
        "title": "Elementary Italian I",
        "description": "Prerequisite: Not open to students who have attended schools where Italian was the language of instruction. Study of the fundamentals of Italian including grammatical structures reading and practice in the spoken language. May not be challenged. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ITAL",
        "catalog_number": "102",
        "title": "Elementary Italian II",
        "description": "Prerequisite: ITAL 101 or equivalent. Not open to students who have attended schools where Italian was the language of instruction. Continuation of the study of the fundamentals of Italian including grammatical structures reading and practice in the spoken language. May not be challenged. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "ITAL",
        "catalog_number": "201",
        "title": "Intermediate Italian I",
        "description": "Prerequisite: ITAL 102. May not be challenged if principal schooling has been in Italian. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ITAL",
        "catalog_number": "202",
        "title": "Intermediate Italian II",
        "description": "Prerequisite: ITAL 201. Recommended Corequisite: ITAL 204. Brief review of grammar. Intensive practice in pronunciation and conversation. Reading of essays short stories and plays as well as study of some problems pertinent to Italian culture. May not be challenged if principal schooling has been in Italian. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ITAL",
        "catalog_number": "290",
        "title": "Intermediate Reading and Conversation",
        "description": "Prerequisite: ITAL 202 or equivalent. This course offers the opportunity to increase functional language competence. Reading comprehension and communicative skills will be fostered with the use of active vocabulary media presentations and performances. Guided conversations reading and pronunciation will emphasize the development of accurate idiomatic expressions. Use of internet resources and multimedia materials will be an integral part of this course. Course will target computer literacy and technology competencies.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ITAL",
        "catalog_number": "300",
        "title": "Advanced Conversational Italian",
        "description": "Prerequisite: ITAL 204. One-semester course intended to encourage students to further develop their ability to express themselves in the Italian language.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ITAL",
        "catalog_number": "306",
        "title": "Translation and Style",
        "description": "Prerequisite: ITAL 204 or permission of the instructor. This course is designed to help students enhance their mastery of the Italian language through translation from English into Italian and Italian into English. This course is a study of the syntactic morphemic and semantic structures of both languages. Texts to be translated will include literary excerpts newspaper articles business letters technical and scientific material and a variety of essays. This course will allow students to understand the various stylistic differences between Italian and English to increase vocabulary proficiency and above all to achieve a higher writing competence in the target language.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ITAL",
        "catalog_number": "496MAF",
        "title": "ITALIAN MUS ART FSHN",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ITAL",
        "catalog_number": "499C",
        "title": "Independent Study",
        "description": "Experimental Topics\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "ITAL",
        "catalog_number": "204",
        "title": "Intermediate Italian Grammar and Composition",
        "description": "Prerequisite: ITAL 201 or instructor consent. Recommended corequisite: ITAL 202. One-semester course for non-native speakers consisting of extensive grammar review and literary composition. May not be challenged if principal schooling has been in Italian. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ITAL",
        "catalog_number": "305",
        "title": "Structure of the Italian Language",
        "description": "Prerequisite: ITAL 204. One-semester course devoted to the analysis of the structure of Italian.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ITAL",
        "catalog_number": "315",
        "title": "Masterpieces of Italian Literature",
        "description": "Prerequisite: ITAL 202. Presents the highlights of Italian literature from its origins to the contemporary period.\n",
        "units": "3",
        "class_type": "LEC"
    }
]