[
    {
        "subject": "JOUR",
        "catalog_number": "100",
        "title": "Mass Communication",
        "description": "Not open to students with credit in CTVA 100. Survey and analysis of newspapers books magazines radio television popular music movies advertising public relations the Internet and emerging technologies. Examines media history and economics as well as their roles rights and impact in contemporary society. Particular emphasis on media literacy critical thinking research and writing. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "104",
        "title": "INTRO JOUR",
        "description": null,
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "JOUR",
        "catalog_number": "110",
        "title": "Writing",
        "description": "Reporting and Ethics IPrerequisite: Grade ofC or better in ENGL 115 or its equivalent; typing proficiency. Basic news gathering and writing. Includes interviewing speech/meeting coverage preparing news copy and traditional- and electronic-information gathering as applied to news decision making. Introduces ethics as part of developing news judgment and learning the values practiced by professional journalists. 6 hours of classroom and lab activity.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "110L",
        "title": "NEWS REPORT I LAB",
        "description": null,
        "units": "0",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "210",
        "title": "Writing",
        "description": "Reporting and Ethics IIPrerequisite: Grade ofC or better in JOUR 110 or its equivalent. Continuation of news reporting with coverage of public affairs beats including police courts and government. Writing primarily in print but also in broadcast news online news and public relations formats. Ethics emphasized. Off-campus reporting and statistical journalism included. 6 hours of classroom and lab activity.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "210L",
        "title": "NEWS REPORT II LA",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "225",
        "title": "MULTI STORYTELL",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "250",
        "title": "Visual Communication",
        "description": "Survey of the most significant techniques and examples of visual communication as employed by the mass media including newspapers magazines television and advertising. Discussion and demonstration of the tools used in analyzing visual communication. Illustrated letures and experiences.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "255",
        "title": "INTRO PR",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "292IP",
        "title": "MASS MED:ISSUE+CONT",
        "description": null,
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "310",
        "title": "Writing",
        "description": "Reporting and Ethics IIIPrerequisite: Grade ofC or better in JOUR 210 or its equivalent. Reporting in-depth on social and political issues. Analysis and application of both classic and newer forms of explanatory storytelling with an emphasis on ethics. Feature and human interest writing. Using the Internet as a reporting tool.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "315",
        "title": "Reporting for Broadcast",
        "description": "Prerequisite: Grade ofC or better in JOUR 210 or its equivalent. Gathering reporting writing editing and presentation of news for broadcast. Out-of-class assignments writing stories and editing newscasts for radio and television. 6 hours of classroom and lab activity.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "325",
        "title": "Television News Techniques",
        "description": "Prerequisite: Grade ofC or better in JOUR 110 or its equivalent. Shooting and editing of video for television news stories. Coverage and editing of interviews speeches news conferences hard news and features. Operation of cameras and editing equipment. 2 hours of classroom and lab activity.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "335",
        "title": "Writing",
        "description": "Producing and Editing Television NewsPrerequisite: Grade ofC or better in JOUR 315 and 325. Television news writing editing and producing. Developing news judgment ethics and newsroom skills. Editing and writing to video anchoring. Students produce weekly newscasts followed by discussion and critique. 4 hours of classroom and lab activity.\n",
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "341",
        "title": "Writing and Editing for Public Relations",
        "description": "Prerequisite: Grade ofC or better in JOUR 110 and their equivalent; JOUR 340. Provides students with an intensive experience writing for public relations. Students learn and employ a variety of public relations writing techniques for print broadcast and new technologies. Examines and analyzes writing effectiveness in relevant public relations cases and current issues.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "350",
        "title": "Photojournalism",
        "description": "Prerequisite: Grade ofC or better in ART 250; Students are required to have their own cameras. Instruction in the production of black-and-white images for publication and in picture editing. Emphasis on the techniques and ethics involved in working with single images. 6 hours of classroom and lab activity.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "362",
        "title": "PR CAMPAIGNS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "365",
        "title": "NEWS LITERACY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "371",
        "title": "Women",
        "description": "Men and MediaPrerequisite: Completion of Lower Division writing requirement. Analysis of portrayals of women and men in the mass media and how media shape gender roles expectations and stereotypes. Special attention to historical and contemporary contributions and responsibilities of women media professionals. Particular emphasis on applying critical thinking research and writing skills to analyze media policies and practices and on developing strategies that empower gender equality. (Available for General Education Comparative Cultural Studies.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "372",
        "title": "Diversity and the Media",
        "description": "Prerequisite: Completion of lower division writing requirement. Analysis of media portrayals and audience perceptions of racial ethnic and sociopolitical groups and the roles and responsibilities of mainstream and specialty media in a democratic society. Particular emphasis on applying critical thinking research and writing skills to analyze media policies and practices and on developing strategies for multiculturalism. (Available for General Education Comparative Cultural Studies.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "374SLJ",
        "title": "SLJ NEWS ENVIRONM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "375",
        "title": "ENGAGE COMM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "390",
        "title": "Freedom of the Press",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Not available for those with credit in JOUR 400. Designed for non-journalism majors. Legal rights and privileges of the mass media under the Constitution. Censorship and control of the press. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "395B",
        "title": "BRDCAST NEWS PRAC",
        "description": null,
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "395C",
        "title": "BRDCST NEWS",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "397A",
        "title": "NEWSPAPER PRACTCM",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "397B",
        "title": "NEWS PRACTICUM",
        "description": null,
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "397C",
        "title": "NEWS SUNDIAL",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "398B",
        "title": "PR PRACTICUM",
        "description": null,
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "398C",
        "title": "PR AGENCY",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "400",
        "title": "Mass Communication Law and Ethics",
        "description": "Not available for students with credit in JOUR 390. Examination of the ethics and laws that protect the privileges and define the responsibility of the mass media. Topics include the First Amendment legal access to information plagiarism newsgathering public access to the media libel right of privacy fair trial/free press obscenity and censorship.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "410",
        "title": "Investigative Reporting",
        "description": "Prerequisites: Grade ofC or better in JOUR 310 or 315. Researching reporting writing and producing investigative stories on societal governmental and scientific issues for print broadcast or online media. Ethical issues problems traditional techniques and technological approaches to investigative journalism.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "415",
        "title": "Reporting for Television News",
        "description": "Prerequisite: Grade ofC or better in JOUR 315 and 325. Reporting writing editing and producing for television news. Fundamentals of television news field reporting writing researching interviewing and editing complete narrative packages. 6 hours of classroom and lab activity.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "430",
        "title": "PUB AFFS JOUR",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "JOUR",
        "catalog_number": "440",
        "title": "Public Relations Techniques",
        "description": "Prerequisites: Grade ofC or better in JOUR 340 and 341. Focus on strategic planning critical thinking management and problem solving through the use of case studies. Builds on previously acquired public relations tools and techniques. Includes campaign strategies research strategies client relations creating website content internal communications media relations crisis communication media training and budgeting.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "445",
        "title": "Advanced Television News",
        "description": "Prerequisites: Grade ofC or better in JOUR 335 and 415. Reporting writing editing anchoring and producing television newscasts for airing on cable or television. Students produce weekly newscasts in a professional environment followed by critique and discussion. 6 hours of classroom and lab activity.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "450",
        "title": "Advanced Photojournalism",
        "description": "Prerequisite: Grade ofC or better in JOUR 350. Advanced instruction in the techniques and ethics of photojournalism. Emphasis on reporting and narrative construction for the photojournalist. Includes the production of picture stories photo essays and the preparation of a professional portfolio. 6 hours of classroom and lab activity.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "480",
        "title": "History of the American News Media",
        "description": "Study of the development and influence of the news media in the U.S. from colonial times to the present. Examines social economic cultural technological and political influences on news media development. Special attention to dominant media personalities.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "491",
        "title": "MEDIA LEADERSHIP",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "494AEE",
        "title": "Internship",
        "description": "Prerequisite: Grade ofC or better in JOUR 315 or 330 or 335 or 341.Supervised employment and field study on newspaper and magazines in public relations or in radio and television news. (Credit/No Credit only)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "495BJ",
        "title": "BACKPACK JOUR",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "JOUR",
        "catalog_number": "495EJ",
        "title": "ENVIRO JOUR",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "JOUR",
        "catalog_number": "495EPR",
        "title": "ENTERTAIN PR",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "JOUR",
        "catalog_number": "495MAM",
        "title": "MUSLIMS AND MEDIA",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "JOUR",
        "catalog_number": "495MDS",
        "title": "MULTI DOC STORY",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "JOUR",
        "catalog_number": "495NM",
        "title": "NEW MEDIA",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "JOUR",
        "catalog_number": "495POD",
        "title": "PODCAST STORY",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "JOUR",
        "catalog_number": "495SMJ",
        "title": "SOC MEDIA JOURNS",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "JOUR",
        "catalog_number": "498",
        "title": "Tutorial in Mass Communication",
        "description": "Prerequisite: Senior standing; Course work appropriate to the tutorial subject. Individual supervised study in selected areas of the students interest.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "585",
        "title": "Theory of Mass Communication",
        "description": "Prerequisite: Senior or graduate status. Extended analysis of the theories which inform the study of mass communication. The course focus is on contemporary theories but is grounded in a historical understanding of the development of theory in the field. Graduate Courses In Mass CommunicationOnly courses at the 400- 500- or 600-level carry credit toward the Masters Degree in Mass Communication. Admission to the graduate seminars is restricted to those who have been granted Classified status in the Mass Communication Program.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "455",
        "title": "Documentary Photojournalism",
        "description": "Prerequisites: Grade ofC or better in JOUR 350. Production course that guides the student to a discovery and use of the principles of investigation and reporting on a subject in depth. Production of photographic images are supported by a survey of the major journalistic documentary projects in still photography. 6 hours of classroom and lab activity.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "460",
        "title": "Magazine Journalism",
        "description": "Prerequisite: Grade ofC or better in JOUR 330. Principles problems and techniques of magazine editing and design; production of department magazine; and nonfiction article research and writing. 6 hours of scheduled classroom and lab activity required.\n",
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "465",
        "title": "Mass Communication and Popular Culture",
        "description": "Study of the social political and economic influences that shape popular culture and its effects on audiences. Examines medias roles as storytellers. Particular emphasis on applying critical thinking research and writing skills to analyze media policies and practices and on developing strategies that empower consumers in the media.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "474SLJ",
        "title": "SLJ MEDIA WRIT",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "JOUR",
        "catalog_number": "478",
        "title": "International News Media",
        "description": "Study of news media systems and the influence of government economics culture and propaganda on international news practices. Examines the role of multinational media organizations.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "JOUR",
        "catalog_number": "495DME",
        "title": "Selected Topics in Journalism: Digital Media Entrepreneurship",
        "description": "Prerequisites: Grade ofC or better in JOUR 310 or 315. Advanced research writing and reporting of selected journalistic styles and/or subject matter. Ethical issues problems traditional techniques and technological approaches are integral segments of each selected topic. Subject content will change from semester to semester.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "JOUR",
        "catalog_number": "495LF",
        "title": "Selected Topics in Journalism: Long Form Journalism",
        "description": "Prerequisites: Grade ofC or better in JOUR 310 or 315. Advanced research writing and reporting of selected journalistic styles and/or subject matter. Ethical issues problems traditional techniques and technological approaches are integral segments of each selected topic. Subject content will change from semester to semester.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "JOUR",
        "catalog_number": "495SJ",
        "title": "SPORTS JOUR",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "JOUR",
        "catalog_number": "495SLT",
        "title": "Selected Topics in Journalism: Spanish Language Television",
        "description": "Prerequisites: Grade ofC or better in JOUR 310 or 315. Advanced research writing and reporting of selected journalistic styles and/or subject matter. Ethical issues problems traditional techniques and technological approaches are integral segments of each selected topic. Subject content will change from semester to semester.\n",
        "units": "3",
        "class_type": "SEM"
    }
]