[
    {
        "subject": "LING",
        "catalog_number": "113A",
        "title": "APPR UNIV WRTNG A",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "113B",
        "title": "APPR UNIV WRTNG B",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "200",
        "title": "HOW LANG MATTERS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "250",
        "title": "LANG IN CALIF",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "300",
        "title": "Approaches to Linguistic Analysis",
        "description": "This course provides a comprehensive in-depth and data-driven introduction to the questions that are raised in the major subfields of linguistics and to the prevailing scientific approaches that are applied to answer those questions. Students will learn foundational concepts of the field and learn to analyze linguistic data. Students also will learn how to describe language data and how to present linguistic arguments clearly following the conventions that are customary in the field.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "303",
        "title": "HUMAN LANGUAGE BIOL",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "309",
        "title": "LANG SOCIAL INTERACT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "310",
        "title": "Language and the Law",
        "description": "Determining what a written text or spoken utterance exactly conveys is nowhere more important than in the area of the law where subtle differences in wording can have drastic consequences in peoples lives. This course examines how language is used and interpreted in legal settings by applying insights from the linguistic fields of semantics pragmatics discourse analysis and sociolinguistics. The course has lifelong relevance for every citizen since we can expect to sign contracts receive a jury summons or engage in many other ways with the law and legal documents. The course emphasizes active student participation and an explicit connection between theory and practice. Students will be expected to apply their acquired knowledge to practical and -- wherever possible -- current societal issues. (Available for General Education Lifelong Learning.)LING 325. Language Gender and Identity (3)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "325",
        "title": "LANG & GENDER",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "330",
        "title": "FUNDAMENTALS TESL",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "402",
        "title": "Phonetics and Phonology",
        "description": "Preparatory: ANTH 310 COM S 420 or ENGL 301. Study of the physical and acoustical properties of sound in a variety of natural languages as well as phonological analysis and rule formation in phonological systems.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "403",
        "title": "Introduction to Morphology",
        "description": "Preparatory: LING 300 or equivalent. This Morphology course introduces students to the range of questions that the field of linguistics asks about speakers’ knowledge of word structure and to the methods that linguists use both to respond to such questions and develop additional ones. Students will become acquainted with central insights from the field and learn how this knowledge relates to phonology and to syntax but is nevertheless specific to morphology. Available for Graduate Credit\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "407",
        "title": "Language Varieties",
        "description": "Preparatory: ANTH 310 COM S 420 or ENGL 301. Introduction to the study of language variation. Theoretical aspects of phonological syntactic and semantic variation will be considered in their geographical and social context.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "408",
        "title": "Semantics and Pragmatics",
        "description": "Preparatory: ANTH 310 COM S 420 or ENGL 301. Linguistic study of meaning and context of discourse and the relationship of such study to grammar.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "411",
        "title": "Introduction to Historical Linguistics",
        "description": "Preparatory:  LING 300 or equivalent.  LING 411 investigates the ways languages emerge and evolve.  The course looks at gradual changes in vocabulary (lexicon) sounds (phonetics and phonology—hence spelling) and grammar (morphology and syntax).  Topics include the comparative method the genealogical and typological classification of languages language universals and the historical development of entirely “new” language varieties and language families. Much attention is devoted to how Present-day Englishes have developed from Old Anglo Saxon. Available for Graduate Credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "LING",
        "catalog_number": "417",
        "title": "Language Development and Acquisition",
        "description": "Preparatory: Upper Division standing; Introduction to the study of language. Required for both ITEP and Linguistics/TESL students and addresses topics linked to language arts and (T)ESL methods courses for students preparing to teach. Introduces students to the study of language development and acquisition including such topics as approaches to the development of childrens grammars the development of communicative competence definitions of bilingualism and multilingualism relationships between language development and learning to read issues particular to the multilingual nature of California and issues related to exceptional language development.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "427",
        "title": "Languages in Contact",
        "description": "Preparatory: ANTH 310 COM S 420 or ENGL 301. This course examines various effects of language contact -- the occurrence of lexical and grammatical borrowing such as borrowings between English and Spanish; the emergence of pidgins creoles and mixed languages; and the process of language attrition or death in the context of a dominant language. The course also addresses the ways in which speakers in multilingual speech communities navigate between the languages that they speak and the language-planning efforts of multilingual communities that are aimed at controlling which language (variety) is used/taught in which setting such as the use of ASL versus signed English. Much of this course focuses on issues of special relevance to multilingual speech communities in the U.S. and on language contact effects between English and such languages as Armenian Spanish Russian and Korean.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "441",
        "title": "Sociolinguistics",
        "description": "Preparatory: ANTH 310 COM S 420 or ENGL 301. Language in society. Examines linguistic behavior patterns as determined by such factors as age gender class ethnicity sexual orientation region and social context.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "447",
        "title": "US BILINGUALISM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "495A-Z",
        "title": "TOPICS IN LING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "499A",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "LING",
        "catalog_number": "501",
        "title": "Seminar in Phonology",
        "description": "Prerequisite: LING 402 or equivalent. Current issues in phonological theory.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "LING",
        "catalog_number": "502",
        "title": "Seminar in Research on Second Language Acquisition",
        "description": "Prerequisites: LING 402; 404 or 417 or CHS 433. Critical historical examination of research on 2nd-language acquisition. Study of analytical approaches such as contrastive analysis error analysis performance analysis and discourse analysis showing how different approaches reflect changing conceptions of language and the nature of language learners.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "LING",
        "catalog_number": "505",
        "title": "Seminar in Discourse Analysis",
        "description": "Prerequisite: LING 407 408 or 441. Seminar in the theoretical and methodological aspects of discourse analysis in a linguistic perspective.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "510",
        "title": "FND CONCEPTS LING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "517",
        "title": "FND LANG DEV/ACQ",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "520",
        "title": "Issues in ESL Reading and Writing",
        "description": "Preparatory or Recommended Corequisite: LING 502. Provides students with a foundation for understanding the processes of reading and writing -- as well as the relationships between them -- as they are experienced by adult second-language learners. Topics in the area of reading include skills and strategies that contribute to the second language learners ability to read and to comprehend a variety of texts and curricular design. Topics in writing include aspects of the composing process specific to second language students the design of curriculum and assignments and the effects of various types of responses to student writing.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "521",
        "title": "Issues in ESL Listening and Speaking",
        "description": "Preparatory or Recommended Corequisite: LING 502. Provides students with a foundation for understanding the processes of listening and speaking as these are experienced by adult second-language learners. While the course focuses on the academic environment it includes an examination of skills necessary for learners to comprehend a variety of speakers in a range of spoken discourse types covering both transactional and interactional situations. Also factors that contribute to effective participation in conversations including fluency and pronunciation and cultural and universal rules of discourse are examined bringing the areas of speaking and listening together in the context of curricular design.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "525",
        "title": "English Structures for ESL/EFL Teaching",
        "description": "Prerequisites: ANTH 310 or COMS 420 or ENGL 301; LING 404. Provides a systematic description of the structures and usages of English grammar from the perspective of someone learning English as an additional language. Students focus on ways that such material may most effectively be presented to non-native speakers of English.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "530",
        "title": "Introduction to TESL",
        "description": "This course prepares students for course work offered in the M.A. Degree in TESL Program and for careers in the TESL field. Students will learn the goals of an M.A. TESL student -- acquire practical planning skills examine the history of second and foreign language teaching develop a basic knowledge of second language acquisition use research tools in the library acquire skill in observing and analyzing ESL classes and become familiar with how to become a professional in ESL and TESL.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "LING",
        "catalog_number": "555",
        "title": "ESL Classroom Practices in Post-Secondary Academic Settings",
        "description": "Prerequisites: SED 529 or EED 570; 6 units from LING 520 521 or 525. Linguistics 555 is designed to provide students knowledge of issues related to the teaching of English as a second language (ESL) to non-native speakers of English in post-secondary academic settings and also to provide students an opportunity to gain teaching experience through supervised practicum training. The focus will be either on concerns of teaching in intensive programs or in community college settings.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "LING",
        "catalog_number": "568",
        "title": "TESL Testing and Assessment",
        "description": "This course is intended for students interested in exploring and practicing educational assessment and pursuing a career in TESL. In this course students not only learn about assessment practices but more specifically they become aware of the types of pre- post- and in-class language assessment required to run an effective English language class and/or program. Students will become aware of the various assessment tools available to them review criteria used to choose effective exams and practice techniques to design or select sound language tests to suit their needs and teaching circumstances.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "578",
        "title": "English for Specific Purposes",
        "description": "Prerequisites: LING 300 or equivalent. This course examines current research theories practices and instructional approaches to teaching English for Specific Purposes(ESP).  Students will receive an introduction to ESP and its various sub-branches-English for Academic Purposes (EAP) English for Occupational Purposes (EOP) and English for Professional Purposes (EPP). This course prepares students to teach ESP in a variety of contexts specifically business health care law enforcement and hospitality.  This course will explore various research tools for investigating specialist discourse such as ethnography genre analysis corpus analysis and discourse analysis. Students will learn to conduct a needs analysis of ESP populations. Students will design curricula and evaluate a variety of assessment tools currently used to measure the learning outcomes of second language learners in ESP settings.  This course will also focus on intercultural dynamics that impact learning outcomes within ESP contexts.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "590A-Z",
        "title": "TOPICS IN LING/TESL",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "610",
        "title": "Seminar in Syntax",
        "description": "Prerequisite: ENGL 301 or equivalent. Preparatory: ENGL 302 and LING 404. In-depth study of current approaches to syntactic analysis.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "LING",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisite: Consent of Linguistics Program Coordinator. Enrollment required in the semester that the Comprehensive Examination is taken.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "LING",
        "catalog_number": "698D",
        "title": "GRAD PROJECT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "LING",
        "catalog_number": "230",
        "title": "FORBIDDEN LANGUAGE",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "240",
        "title": "LANGUAGE & MUSIC",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "404",
        "title": "Syntax",
        "description": "Preparatory: LING 300. LING 404 takes students into the field of syntactic inquiry learning about the tools used to develop representations of what speakers of a language know about the structural relationships among the meaning-bearing elements in their language and about how such representations are evaluated in pursuit of the representations telling us the most about human language itself. Available for Graduate Credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "455",
        "title": "COMPUTATION LING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "500",
        "title": "Seminar in Phonetics",
        "description": "Prerequisities: LING 402. This course focuses on articulatory phonetics. In depth study of current issues in the articulatory and physical properties of sounds in natural languages; typology of sound inventories in world languages; perception transcription and production of sounds.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "503",
        "title": "Seminar in Cognitive Linguistics",
        "description": "Prerequisites: LING 402 404 408 441; Introduction to linguistics. Examination of recent theoretical developments in linguistics from the general perspective of cognitive science. Focus on 3 major areas: cognitive grammar semantics and pragmatic dimensions of linguistic categorization as wel ass the interface of cognition experience and grammar in natural discourse.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "LING",
        "catalog_number": "506",
        "title": "FND CONCEPTS PHON",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "515",
        "title": "Survey of Applied Linguistics",
        "description": "Preparatory: Introduction to linguistics. An introduction to multiple definitions of the field of applied linguistics and insight into the ways that scholars identify and define the concerns of the discipline. Included in the course will be an introductory survey of several specific areas of study that fall under the heading of Applied Linguistics.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "541",
        "title": "SEMINAR SOCIOLING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "566",
        "title": "Research Methods for Linguistics",
        "description": "General Track Prerequisite or Corequisites: LING 417 or consent of the instructor. Recommended preparatory: LING 402 and 404. TESL Track: Prerequisites or Corequisites: LING 417 530 or consent of the instructor. Recommended Preparatory: LING 402 and 404. An introduction to research in linguistics including quantitative qualitative and mixed methods research. Data collection and analysis are covered along with methods for writing research reports.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "604",
        "title": "Acoustic and Instrumental Phonetics",
        "description": "Prerequisites: LING 402. This course focuses on acoustic phonetics. In depth empirical and theoretical study of the acoustic properties of speech production perception and audition. In addition  students will develop expertise in the use of laboratory equipment and instrumentation in the analysis of experimental phonetic data.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "LING",
        "catalog_number": "698C",
        "title": "Thesis",
        "description": "Prerequisite: Consent of Linguistics Program Coordinator.\n",
        "units": "3",
        "class_type": "SUP"
    }
]