[
    {
        "subject": "SED",
        "catalog_number": "511",
        "title": "Fundamentals of Secondary Education in Multiethnic-Secondary Schools",
        "description": "Preparatory: Admission to a Single Subject Credential Program. Must be taken in the 1st session of enrollment in all Single Subject Programs. Provides a general framework and introduction to secondary education and curriculum within a multiethnic American society. Candidates investigate various classroom discipline and management techniques teaching strategies and techniques and lesson planning. Candidates are also introduced to the California Academic Content Standards and the 13 Teaching Performance Expectations (TPEs). Primary emphasis is placed on the TPEs in 3 domains: 1) Creating and maintaining effective classroom environments; 2) Engaging and supporting all students in learning; and 3) Planning instruction and designing learning experiences. Completion of classroom-based activities is required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SED",
        "catalog_number": "514",
        "title": "Computers in the Instructional Program",
        "description": "Introduction to the instructional uses of the Internet local networks telecommunications text processing graphics desktop publishing educational software electronic reference tools teacher support tools databases spreadsheets and other software applications and related media. Use of such applications to access and evaluate information analyze and solve problems and communicate with other professionals. Strategies and skills to enable teachers to prepare their students to be lifelong learners in an information-based society. Meets technology education requirement for the Preliminary Credential.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "521",
        "title": "Content Area Literacy and Learning in Multiethnic Secondary Schools",
        "description": "Prerequisite: Restricted to candidates officially admitted to the Credential Program or already possessing a Teaching Credential. Prerequisite or Corequiste: SED 511. Recommended Preparatory for Traditional Candidates: SED 525xx. Required for candidates in all Single Subject Teacher Basic Credential Programs. Focuses on strategies for teaching  reading writing academic language and study strategies to promote learning in middle-school and high-school content area classes for all students. Addresses a context for literacy learning emergent and developmental reading instruction assessment of materials the development of literacy lessons related to California subject area academic content standards and frameworks differentiated instruction and a range of literacy assessments. Completion of field-based activities is required.\n",
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "SED",
        "catalog_number": "525A",
        "title": "Methods of Teaching Art",
        "description": "Restricted to candidates officially admitted to the Credential Program. Study and development of instructional guidance in art. See SED 525 Series.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SED",
        "catalog_number": "525BL",
        "title": "Bilingual and Bicultural Teaching in Multiethnic Secondary Schools",
        "description": "Required course for all  Bilingual Authorization Program candidates. Prerequisites: SED 521 (pre Fall 2011) or SED 523 (Fall 2011 and later). Preparatory: SED 525xx. This course will examine the history policies programs and research on the effectiveness of bilingual education and bilingualism in the U.S. as well as the philosophical theoretical legal and legislative foundations of bilingual education and their effects on program design and the educational achievement of bilingual children and adolescents. Also addressed are the transferability between the primary and English language; authentic parental participation; the interrelatedness among the four domains of language (listening speaking reading and writing); and the application of different bilingual education models instructional strategies materials and skills to instructional settings. The course also will examine planning developing implementing and assessing standards-aligned content instruction in the primary and the English language with a variety of instructional and assessment strategies as well as the use of a variety of criteria to select instructional materials to assess their appropriateness and suitability for the local context and to augment resources when necessary. (Cross listed with EED 525.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SED",
        "catalog_number": "525EN",
        "title": "Methods of Teaching English",
        "description": "Required of all students enrolled in the English Credential Program. Restricted to candidates officially admitted to the Credential Program or already possessing a teaching credential. Methods course addressing strategies for teaching literature composition and language. The integrated approach for literature composition and language instruction is based on the California Model Curriculum Standards and the English/Language Arts Framework. See SED 525 Series.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SED",
        "catalog_number": "525HE",
        "title": "METH TCH H ECON",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SED",
        "catalog_number": "525MA",
        "title": "Methods of Teaching Mathematics in the Secondary School",
        "description": "Restricted to candidates officially admitted to the Credential Program or already possessing a teaching credential. Corequisites: SED 525MA and 525MAL. Preparatory: MATH 150B or instructor consent. Topics include subject matter selection and classroom instruction in arithmetic algebra geometry trigonometry discrete mathematics and calculus. See SED 525 Series.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "SED",
        "catalog_number": "525MAL",
        "title": "Methods of Teaching Mathematics in the Secondary School Lab",
        "description": "Restricted to candidates officially admitted to the Credential Program or already possessing a teaching credential. Corequisites: SED 525MA and 525MAL. Preparatory: MATH 150B or instructor consent. Topics include subject matter selection and classroom instruction in arithmetic algebra geometry trigonometry discrete mathematics and calculus. See SED 525 Series.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "SED",
        "catalog_number": "525MU",
        "title": "Methods of Teaching General Music",
        "description": "Restricted to candidates officially admitted to the Credential Program or already possessing a teaching credential. Preparatory: MUS 302 466C. Exploration of teaching trends and issues in general music. Development of instructional guidance for music. See SED 525 Series.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SED",
        "catalog_number": "525PE",
        "title": "Methods of Teaching Physical Education",
        "description": "Restricted to candidates officially admitted to the Credential Program or already possessing a teaching credential. See SED 525 Series.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SED",
        "catalog_number": "525S",
        "title": "Methods of Teaching Science in the Secondary School",
        "description": "Restricted to candidates officially admitted to the Credential Program or already possessing a teaching credential. Corequisites: SED 525S and 525SL. Objectives instructional methods curriculum and assessment in teaching science in the secondary school. Developing adapting evaluating and using strategies and materials for teaching science appropriate both to the special needs of the learners and the special characteristics of the science discipline. Objectives instructional methods and curriculum in teaching lab-based science in the secondary school. Developing adapting evaluating and using strategies and materials for teaching science labs appropriate both to the special needs of the learners and the special characteristics of the science discipline. See SED Series.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "SED",
        "catalog_number": "525SL",
        "title": "Methods of Teaching Science in the Secondary School Lab",
        "description": "Restricted to candidates officially admitted to the Credential Program or already possessing a teaching credential. Corequisites: SED 525S and 525SL. Objectives instructional methods curriculum and assessment in teaching science in the secondary school. Developing adapting evaluating and using strategies and materials for teaching science appropriate both to the special needs of the learners and the special characteristics of the science discipline. Objectives instructional methods and curriculum in teaching lab-based science in the secondary school. Developing adapting evaluating and using strategies and materials for teaching science labs appropriate both to the special needs of the learners and the special characteristics of the science discipline. See SED Series.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "SED",
        "catalog_number": "525SS",
        "title": "Methods of Teaching Social Studies",
        "description": "Restricted to candidates officially admitted to the Credential Program or already possessing a teaching credential. Objectives methods materials and assessments in the social studies curriculum in the secondary schools. See SED 525 Series.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SED",
        "catalog_number": "525WL",
        "title": "Methods of Teaching World Language",
        "description": "Restricted to candidates officially admitted to the Credential Program or already possessing a teaching credential. See SED 525 Series.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SED",
        "catalog_number": "529",
        "title": "Teaching English Learners in Multiethnic Secondary Schools",
        "description": "Required for candidates in all Single Subject Teacher Basic Credential Programs. Restricted to candidates officially admitted to the Credential Program or already possessing a teaching credential. Prerequisite: SED 511. Co-requisite: SED 521. Preparatory: SED 525xx. Addresses state and federal legal requirements related to English learners the California English Language Development (ELD) Standards school programs serving English learners language acquisition and teaching materials and strategies for English as a Second Language (ESL) and Specially Designed Academic Instruction in English (SDAIE). Also focuses on diagnostic and other assessments for English learners. Completion of field-based activities is required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SED",
        "catalog_number": "554",
        "title": "Supervised Field Experience for the Single Subject Credential",
        "description": "Prerequisites: Admission to the Single Subject Credential Program; Clearance by the Credential Office. Corequisite: SED 554S. Corequisites or Preparatory for Traditional FYI JYI and ACT Programs: EPC 420; SED 511 525xx. Additional corequisites for ACT Program only: ELPS 541A; SPED 541B. Designed as the introductory field experience for candidates pursuing the Single Subject Teaching Credential in the Traditional Accelerated Collaborative Teacher (ACT) Four-Year Integrated (FYI-English or FYI-Math) or Junior-Year Entry Integrated (JYI-English or JYI-Math) Programs. The candidate is assigned to a middle school or high school site for 1 class period plus conference time daily for a schools semester or track to complete specific activities (e.g. structured observations tutoring small groups assuming responsibility for planning teaching and pupil assessment) under the direction and guidance of a qualified on-site collaborating teacher. A designated member of the University faculty supervises the candidates assignment. During the supervised field experience sequence of SED 554 and 555 each teacher candidate has experiences teaching English language learners and participates in 2 or more subject-specific teaching assignments at middle-school and high-school levels. The candidate also meets weekly or biweekly in a required seminar led by a University faculty member that addresses student teaching issues. During this seminar the candidate completes the Preliminary Teaching Event. (Credit/No Credit only)\n",
        "units": "4",
        "class_type": "SUP"
    },
    {
        "subject": "SED",
        "catalog_number": "555",
        "title": "Supervised Practicum for the Single Subject Credential",
        "description": "Required for candidates in the Four-Year Integrated (FYI-English FYI-Math) Junior-Year Integrated (JYI-English JYI Math) Accelerated Collaborative Teacher (ACT) and Traditional Single Subject Credential Programs. Prerequisites: SED 554 554S; Clearance from the Credential Office. Corequisite: SED 555S. Corequisite or Preparatory for Traditional FYI and JYI Programs: AAS/ARMN/CHS/ELPS/PAS 417; SED 521; SPED420. Corequisites for ACT Program only: ELPS 542A; HSCI 496AD; SED 521; SPED 542B. The Supervised Practicum is designed to provide teacher candidates with a Capstone field work experience in middle school or high school classrooms. Each candidate is supervised by an on-site collaborating teacher and a University supervisor. The candidate is responsible for teaching 3 classes daily and is at the school for a 4th class period daily for observation and conferencing for a schools entire semester or track. During the supervised field experience sequence of SED 554 and 555 each teacher candidate has experiences teaching English language learners and participates in 2 or more subject-specific teaching assignments. See the Credential Office for additional details. (Credit/No Credit only)\n",
        "units": "6",
        "class_type": "SUP"
    },
    {
        "subject": "SED",
        "catalog_number": "593",
        "title": "Field Experience for Single Subject Interns",
        "description": "Prerequisites: Bachelors Degree; Admission to the Single Subject University Intern Program (SSUIP); Full-time teaching position in a public school. Corequisite: SED 593S. SED 593 is the first of 3 field experiences required in SSUIP that lead to the Single Subject or Single Subject BLCAD Emphasis Credential. This field experience is designed for the on-the-job teacher. The candidate is supervised on-site by a University coach and a support provider. This seminar is designed for the on-the-job teacher and meets for 1 hour weekly (or equivalent). (Credit/No Credit only)\n",
        "units": "2",
        "class_type": "SUP"
    },
    {
        "subject": "SED",
        "catalog_number": "599A",
        "title": "Independent Study",
        "description": "No course description.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "SED",
        "catalog_number": "600",
        "title": "Research in Secondary Education",
        "description": "Prerequisite: Admission to Secondary Education M.A. Degree Program. This course introduces key research in secondary education and provides opportunities to analyze educational research critically. Also addressed are types of research; the teacher as researcher; planning a research study; and collecting analyzing and presenting data. A requied Department Core course for M.A. Degree candidates with a Specialization in Secondary Education.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "610CI",
        "title": "ED ISSUES PUB SCH",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "610MA",
        "title": "ED ISSUES MATH",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "616",
        "title": "COMP SUP SCIENCE",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "617",
        "title": "Microcomputers in the Secondary Reading/Language Arts Curriculum",
        "description": "Prerequisite: SED 514 or instructor consent. Design development and use of computer-based resources for teaching reading writing literature and language. Internet; telecommunications; and presentation desktop publishing and other applications are explored in terms of teaching the language arts. Review and analysis of research and best practice in the use of computers in the teaching of reading and language arts.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "625E",
        "title": "THRY RES SEC ENG",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "625MA",
        "title": "Theory and Research in Teaching Secondary School Mathematics",
        "description": "Prerequisite: SED 525MA or instructor consent. Study of the present status recent developments and current trends in secondary-school mathematics curricula. The identification of concepts resulting from recent research and their organization for inclusion in the secondary-school mathematics program are considered. Consideration also is given to research studies dealing with the rationale and structure of important new approaches to mathematics teaching.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "625SC",
        "title": "Theory and Research in Teaching Secondary School Science",
        "description": "Prerequisites: SED 525SS; Major or Minor in science. Study of the present status recent developments and current trends in secondary curricula. Emphasis is given to the identification of concepts resulting from recent research and their organization for inclusion in the secondary-school science program. Consideration is given to research studies dealing with the rationale and structure of important new approaches to science teaching.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "641",
        "title": "CURRIC THRY/PRC",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "647",
        "title": "PROJECT-BASED LRN",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "671",
        "title": "Designing Computer-Based Instructional Materials",
        "description": "Prerequisite: SED 514 or instructor consent. Development of instructional materials using high-level authoring systems as a programming environment. Investigations on research findings in human perception communication learning theory and software development.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "690ET",
        "title": "THRY RSRCH EDTECH",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "699A",
        "title": "Independent Study",
        "description": "No course description.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "SED",
        "catalog_number": "610EN",
        "title": "ED ISSUES ELA",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "610SC",
        "title": "LDRSHP IN SCI ED",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "651",
        "title": "ASSESSMT THRY/PRC",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "652",
        "title": "COMP SUP CO LRNG",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SED",
        "catalog_number": "654",
        "title": "LEADRSHP MATH ED",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "657",
        "title": "CAREER & COLLEGE",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "690CI",
        "title": "ROLES SEC EDCTRS",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SED",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Preparatory: Restricted to and required of M.A. Degree candidates in the semester in which they take the Comprehensive Examination for the Degree.\n",
        "units": "3",
        "class_type": "LEC"
    }
]