[
    {
        "subject": "SPED",
        "catalog_number": "200SL",
        "title": "INTRO TO DIS STU",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SPED",
        "catalog_number": "400",
        "title": "Developmental Differences and Implications in Special Education",
        "description": "This course is designed to help teacher candidates in the area of special education gain knowledge and understanding of typical and atypical development and the implications for educating students with disabilities. Candidates will gain knowledge related to the sources of developmental diversity including both biological and environmental factors and how these factors can impact a childs development in the areas of social cognitive physical emotional and language skills. This information will be discussed within the larger context of the different theories of child development to help candidates view these factors from multiple perspectives. Throughout this discussion the emphasis will be placed on the practical implications for special education and the role of the special educator and other members of the educational planning team in promoting a positive supportive and healthy learning environment. This course also will provide special education candidates with knowledge of the legal requirements of special education as specified in the Individuals with Disabilities Education Act (IDEA) and other legislative mandates.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SPED",
        "catalog_number": "402",
        "title": "Behavioral Assessment and Positive Behavior Support",
        "description": "This course is designed to provide education specialist candidates with the skills and knowledge needed to promote and reinforce prosocial skills using positive behavior support strategies. The 3-tiered model (primary secondary and tertiary supports) to positive behavior support will serve as the organizing framework for this course. The first part of the course will focus on ways to promote positive and cooperative behaviors by using a variety of schoolwide and classroom management strategies including teaching and reinforcing expected behaviors active supervision clear communication and collaboration with team members and planned responses to challenging behavior (primary level of supports). The remainder of the course will focus on providing more intensive supports for students with more pervasive/complex behavioral and social needs (secondary and tertiary level of supports).  Relevant federal and state legislation and ethical considerations will be discussed.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "403D",
        "title": "Early Field Experience in Deaf Education",
        "description": "Prerequisite or Corequisite: SPED 400. This course is the first of 2field work practica in special education designed to provide Credential candidates field experiences in K-12 schools serving deaf and hard-of-hearing students. Students observe/participate in the instruction of deaf and hard-of-hearing students across the age ranges from preschool through high school and across the range of settings from itinerant to self-contained classes to special school and residential school placements.  Accompanying seminars link terminology issues and instructional perspectives with practice with collegial support provided to participants. 72 field work hours coincide with seminar topics.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "403MM",
        "title": "EARLY FDWK+SEM SP",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "404",
        "title": "Teaching Diverse Learners with Social-Communication Disabilities",
        "description": "including AutismThis course is designed to provide information regarding the social-communication challenges faced by diverse learners including students who are diagnosed with autism spectrum disorder (ASD). Emphasis will be placed on implications for intervention and instruction based on students learning characteristics including: (a) the roles of social interaction and communication in cognition and learning; (b) specific learning needs of students with social-communication disabilities including ASD; and (c) critical evaluation selection and implementation of interventions for students with social-communication disabilities including ASD. The teachers role in working with families and teaming with other disciplines to develop a comprehensive and interdisciplinary approach across ages and severity of these disabilities will be examined.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SPED",
        "catalog_number": "406",
        "title": "K-12 Literacy Instruction for Diverse Learners with Disabilities",
        "description": "Prerequisites: Restricted to Candidates admitted to the Education Specialist Credential Program and ITEP. This course is designed to prepare special education students to teach diverse learners with disabilities reading and language arts at the elementary and secondary levels. The course focuses on the design and delivery of comprehensive literacy programs consistent with state standards and the competencies and strengths of students with disabilities. Content specifically addresses word analysis fluency vocabulary academic language and comprehension and prepares students to pass the RICA exam. An emphasis is placed on the development and organization of differentiated instructional practices for students with disabilities based on findings from individualized assessment procedures.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SPED",
        "catalog_number": "407",
        "title": "COMM LANG LIT K12",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SPED",
        "catalog_number": "416",
        "title": "Educating Diverse Learners with Disabilities and Working With Their Families",
        "description": "Prequisites for MM Program: SPED 400 403 MM 406. Prequisite or Corequisite for MM Program: SPED 501MM. Prerequisites for MS Program: SPED 400 406. Prerequisite or Corequisite for MS Program: SPED 504MS. Prerequsites for DHH Program: SPED 400 406. This course is designed to provide information regarding the education of diverse learners with disabilities. The course provides an overview of the needs of English language learners (ELLs) with disabilities with an emphasis on understanding and accepting differences in culture ethnicity language and abilities and disabilities of individuals. Candidates are introduced to state and federal laws related to students with disabilities and diverse needs. Knowledge and practices for becoming culturally competent educators are discussed taking into account the principles of language acquisition language proficiency differences in family backgrounds and systems and how these effect learning. Finally the course addresses ways of communicating effectively and respectfully with families.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SPED",
        "catalog_number": "420",
        "title": "Improving the Learning of Students with Special Needs Through Differentiated Instruction and Collaboration",
        "description": "Prerequisite: Restricted to candidates admitted to Credential Programs in Elementary Secondary or Special Education or acceptance into the Educational Therapy Program; SPED 400 406. Prerequisite for MM Program: SPED 403MM. Prerequiste for MS Program: SPED 504MS. Prerequisite or Coreqsuite for MS Program: SPED 505MS. This course is designed for general and special education teachers to learn how to design differentiated instruction that is universally accessible to all learners and how to provide accommodations and modifications to grade-level instruction to meet students individual needs. Foundational information on disability characteristics and the potential impact on the inclusive classroom will be introduced and historical foundations of special education and the inclusive education movement will be presented. The course also focuses on developing the basic principles of positive behavior support and the communication skills needed to implement the range of collaborative service delivery options for students with disabilities students who are at-risk and those who are gifted and talented. Candidates will develop foundational knowledge and skills in research-based processes for effective instruction of students with special needs positive behavior support and collaboration with other educators administrators parents and students to improve student learning.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SPED",
        "catalog_number": "431",
        "title": "Atypical Development in Young Children with Disabilities",
        "description": "May be taken prior to admission. This course examines atypical development in young children with disabilities and the interrelationships and implications of atypical development in motor cognitive sensory language/speech and social/emotional areas. It is designed for professionals working in nursing special education physical and occupational therapy speech and language social work and child development. Emphasis is placed on etiology research and evidence-based practices. (Offered once each year.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "499X",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "500",
        "title": "Communication and Early Literacy Development of Young Children with Disabilities",
        "description": "May be taken prior to admission. This course focuses on communication strategies and early literacy development for young children with disabilities including those who are learning English as a second language. Students will learn about recommended and evidenced-based practices to assess and support these childrens early language use and communicative behaviors. They also will learn to use strategies to support young childrens participation in story book reading and develop their emerging literacy skills.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "501MM",
        "title": "Special Education Assessment of Diverse Learners with Mild/Moderate Disabilities",
        "description": "Prerequisites: SPED 400 403 MM 406 or 506MMA.  This course is designed to provide candidates with the foundation for understanding the assessment process and to prepare students to be professional educators and leaders in assessment. Candidates will focus on the educational assessment methods and procedures used in decision making and program planning for students with mild/moderate disabilities including those from culturally and/or linguistically diverse backgrounds with emphasis on administering scoring and interpreting standardized educational tests.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "502MME",
        "title": "LITERACY INTERVENTIO",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "503MME",
        "title": "MATH&CONTENT IN MME",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "504D",
        "title": "Foundations of Deaf Education",
        "description": "Prerequisite or Corequisites: SPED 400 403D. This course uses the historical context of deaf education to focus on current educational political and social trends that affect the placement and instruction of deaf/hard of hearing students. The breadth of placements and age ranges within this diverse population are critically reviewed using current research in the field. (Offered Fall semester only.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "505MS",
        "title": "Curriculum and Instruction for Diverse Learners with Moderate to Severe Disabilities",
        "description": "Prerequisites for the MS Program: SPED 400 504MS. Prerequisite or Corequisite for the MS Program: SPED 402. This course examines models of assessment curriculum and instruction appropriate for learners having moderate to severe disabilities. Students use research and contemporary best practices to evaluate modify and/or design methodology and materials for assessment curriculum development and instruction in the area of moderate to severe disabilities. Emphasis is given to assessment methodology selection of educational priorities and principles of developing and evaluating individualized integrated interventions for a wide array of diverse learners. Field work included to complete applied assignments. May be repeated twice for credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "506DHA",
        "title": "INTERN D-HH",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "506ECA",
        "title": "Early Childhood Special Education Internship Field Experience",
        "description": "Prerequisite: Must be enrolled in the Early Childhood Special Education Specialist Intern Program. SPED 506ECA: Prerequisites or Corequisities with first semester SPED 431 and 402. SPED 506ECB : Prerequisites or Corequisities with second semester SPED 532 537). SPED 506ECC: Prerequisities prior to third semester SPED 500 535 536; Corequisites with third semester SPED 520EC 538. Designed to provide ongoing support to candidates in the Early Childhood Special Education Intern Credential Program. Reflective supervision is provided through on-site visits by the instructor analysis of videos online discussions and monthly meetings. Class sessions involve discussion of teaching experiences video analysis problem-solving resource sharing and collegial support.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "506MEA",
        "title": "INTERN ME",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "506MSA",
        "title": "INTERN MS",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "511",
        "title": "ASSESS MM TO ESN",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "SPED",
        "catalog_number": "520EC",
        "title": "Assessment and Evaluation in Early Childhood Special Education",
        "description": "Prerequisite or Corequisite: SPED 431. Theory and practice of assessment and evaluation of infants toddlers and young children with special needs. Examines the uses and limitations of current assessment practices for educational decision making with this population. Includes evaluation selection and administration of assessment instruments for both the young child and his/her family and use of assessment results to develop the IFSP/IEP. Assessment for program evaluation also is considered. Open to graduate students in related disciplines (Communication Disorders and Sciences Child and Adolescent Development Psychology/Educational Psychology Physical Therapy Nursing) as well as in Special Education. (Offered once each year.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "535",
        "title": "Collaboration with Families in Early Childhood Special Education",
        "description": "Recommended and evidence-based practices for working with families of infants toddlers and preschoolers receiving early intervention and early childhood special education services. An emphasis is placed on family-centered and culturally-responsive practices that promote the familys roles in the childs development family/professional collaboration in the development of the IFSP/IEP and the family systems model in designing and implementing effective services. Interviewing and active listening techniques are included. (Offered once each year.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "536",
        "title": "Methods for Young Children with Disabilities: Motor and Adaptive Skills",
        "description": "Prerequisite or Corequisite: SPED 431. Study of atypical patterns of motor development in infants toddlers and preschool children with disabilities; and methods of assessment and intervention for fine and gross motor skills. An emphasis is placed on collaboration with families physical and occupational therapists and other service providers in assessing motor adaptive and sensory processing skills using adaptive devices specialized equipment and other modifications to support a childs active participation. (Offered once each year.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "537",
        "title": "Methods for Young Children with Multiple Disabilities: Sensory Impairments",
        "description": "Prerequisite or Corequisite: SPED 431. This course identifies strategies for working with infants toddlers and preschoolers whose multiple disabilities include vision impairments and/or hearing loss. An emphasis is placed on collaboration with families vision and hearing specialists and other related services personnel in identifying childrens functional use of vision and hearing and adapting instructional materials activities and environments to enhance learning. (Offered once each year.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "541B",
        "title": "INTRO TCH URB SCH",
        "description": null,
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "SPED",
        "catalog_number": "544CD",
        "title": "ST TCH LNG-SPC-HR",
        "description": null,
        "units": "6",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "545",
        "title": "SUPPORT PHY/MULT DIS",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "560",
        "title": "ASS/DEV LANG DHH",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "563",
        "title": "AUD+SP ENG DV/DHH",
        "description": null,
        "units": "4",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "567D",
        "title": "TEACHINGDHHSPEC",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "578",
        "title": "Field Work in ECSE: Infant/Toddler",
        "description": "Each Early Childhood Special Education candidate is assigned to a program providing early intervention services to infant/toddlers with disabilities and their families. This field work of at least 100 hours includes working with the families participating in the design and implementation of individualized plans and activities to support the childrens development in all areas ongoing data collection and participation in team meetings and other professional activities as appropriate. Supervision is provided by the cooperating/master teacher and through on-site visits by the University instructor. May also be an option for the University Certificate in Early Intervention. (Offered once each year.)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "579ACT",
        "title": "Supervised Field Work with Exceptional Learners and Seminar",
        "description": "Prerequisite: Restricted to candidates admitted to the Accelerated Collaboration Teacher (ACT) Preparation Program. Corequisites for MM Program: EED 565M or SED 525; ELPS 541A; SPED 400 404 406 501MM 541B. Other specializations should contact their advisor. Offered in the Fall semester only. This course is the first of 2 field work/seminar requirements for the ACT Program that are designed to provide teacher candidates practical hands-on experience in the classroom K-12 schools and the community. 120 hours of field work are required approximately 8 hours per week with supervision and guidance provided by the University supervisor and district coach. Teacher candidates will observe and assist teachers who serve students with disabilities from culturally and linguistically diverse backgrounds. Seminars are designed to link credential course work with classroom practices and to provide collegial support to participants.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "580ACT",
        "title": "Advanced Field Work with Exceptional Learners and Seminar",
        "description": "Prerequisite: Restricted to candidates admitted to the Accelerated Collaborative Teacher (ACT) Preparation Program. Prerequisites for MM Program:  EED 565M or SED 525; ELPS 541A; SPED 400 404 406 501MM 541B. Corequisites for MM Program: ELPS 542A SPED 402 502MM 503MM 542B. Other specializations should contact their advisor. Offered Spring semester. This course is the final field work experience and seminar for the ACT Program. Teacher candidates complete this experience with a teacher trained as a coach who serves students with disabilities from culturally and linguistically diverse backgrounds. Field work consists of 66 field work hours and a full-day 12-week student teaching assignment in which the teacher candidate gradually assumes full responsibility for the complete instructional program. The candidate is provided supervision and guidance by the district coach and University supervisor. The seminar is designed to link credential course work with classroom practices and to provide collegial support to participants.\n",
        "units": "6",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "580DHH",
        "title": "STU TCH & SEM DHH",
        "description": null,
        "units": "6",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "580EC",
        "title": "Advanced Specialist Field work in Early Childhood Special Education",
        "description": "Prerequisite: Bachelors Degree in Child and Adolescent Development or 12 units in approved Child and Adolescent Development or Early Childhood courses SPED 402 431 500 532 and 535. May be taken as a Corequisite to SPED 520EC 536 or 537 (although only one of these 3 may be taken concurrently with this course). One semester of supervised field work for Early Childhood Special Education candidates in preschool or pre-K settings. Supervision is provided by the cooperating/master teacher and through on-site visits by the University instructor and video analysis. Students meet in a seminar with the instructor to discuss their video and on-site observations and field work activities.\n",
        "units": "9",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "580MME",
        "title": "STU TCH & SEM MME",
        "description": null,
        "units": "6",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "580MS",
        "title": "Student Teaching and Seminar in Moderate/severe Disabilities",
        "description": "Prerequisites: SPED 400 402 403MS 406 416 420 504MS 505MS. This course is the final special education field work experience for students in the Moderate/Severe Education Specialist Preliminary Credential Program. Candidates complete this experience on-the-job or with a supervising teacher who serves diverse learners with moderate/severe disabilities. Student teaching consists of 1 complete semester full-day assignment during which time the candidate gradually assumes full responsibility for the complete instructional program if he or she is not on-the-job. The candidate is provided supervision and guidance by the supervising teacher or on-site support provider and a University supervisor. The seminar portion of the course meets 1 to 2 times per month with the University supervisor.\n",
        "units": "6",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "580S",
        "title": "SPED 580S ECSE/MM/MS Advanced Specialist Field work Analysis In Education of Learners with IEPS",
        "description": "Pre-requisites: Course work required for approval of SPED 580ECSE/MM/MS. Corequisite: SPED 580. This seminar meets at regularly scheduled times during the semester as a concurrent seminar with student teaching to provide professional development opportunities for analysis of the field work experience related to teaching effectiveness assessment individualized educational planning program evaluations case analysis and problem solving. Relationships with parents relationships with other professionals and issues related to assuming a professional role as a special educator are included. The seminar instructor facilitates reflective practice.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "581",
        "title": "Augmentative and Alternative Communication",
        "description": "Prerequisite: SPED 400 504MS. Techniques for assessment and intervention of alternative communication skills other than speech for students with severe disabilities. Development and use of augmentative communication devices (both light- and high-technology). Teaching the communicative partner how to make use of augmentative devices during interactions.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "595T",
        "title": "Experimental Topics Courses: Technology in Special Education",
        "description": "No course description.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "628",
        "title": "SPED INDUCTION",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "628DHH",
        "title": "INDUCT DHH",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "628EC",
        "title": "INDUCT EC",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "628MM",
        "title": "INDUCT MM",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "628MS",
        "title": "INDUCT MS",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "638",
        "title": "The Role of the Special Educator in the Twenty-First Century",
        "description": "Prerequisite: SPED 628 and/or acceptance into the Masters Program in Special Education. Prerequisite or Corequisite: 6 units of Clear Credential courses from the menu of Options or acceptance into the Masters Program in Special Education. This course is designed for special education teachers to develop advanced knowledge and skills of processes for effective collaboration consultation and communication in educational settings. The course focuses on the changing role of the special educator the effective management of caseloads and paraprofessionals the development of effective communication skills for problem solving advocacy and leadership and the challenges inherent in collaborative relationships. Candidates will learn how to build partnerships with other professionals to design instruction that is universally accessible to all learners and learn how to use technology and assistive technology to provide universal access for learners with special needs. Emphasis will be on the unique skills each specialization candidate brings to any collaborative or instructional interaction and to the added value of the special educator as an education specialist. Current research and theoretical positions in the field will be analyzed while emphasis will be placed on concrete skills for implementation. As this is the final course in the Clear Educational Specialist Program students will be expected to reflect on their professional development and instructional competencies and complete their Individualized Instructional Program.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "642",
        "title": "Students with Multiple and Sensory Impairments",
        "description": "Preparatory: SPED 400 431 508 or equivalent. Educational issues for students with intellectual disabilities who also have sensory impairments (visual and/or auditory). Information on specific visual and hearing disorders psychosocial implications of these disabilities on the developing child teaching strategies to address students with these disabilities and adaptations and accommodations. (Offered Spring semester only.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "652",
        "title": "Educating Children with Emotional Disturbance",
        "description": "Prerequisites: Preliminary Education Specialist Level I Credential; Admitted to Clear Education Specialist Credential Program and/or Special Education Masters Program. Designed to study the behavioral characteristics of children with severe emotional disorders. Problems of social control adjustment effective curriculum and teacher evaluation. (Offered Spring semester only).\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "672",
        "title": "Advanced Assessment",
        "description": "Prerequisites: SPED 620; Admission to the Special Education Masters Program or Post-M.A. Degree Certificate Program in Educational Therapy. Prerequisite or Corequisite: SPED 671. This Masters-level course is designed to examine the advanced skills educational therapists and other educators use when evaluating a student with learning differences pertaining to clinical procedures and educational diagnosis. Course work will include: (a) choosing appropriate formal and informal assessments for individuals at various age levels; (b) interpreting test data for the purpose of making an educational diagnosis; (c) interpreting test data for the purpose of developing an intervention plan; (d) synthesizing contextual information; and (e) guiding the client and family through the assessment process.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "673",
        "title": "Principles of Educational Therapy for Individuals with Exceptional Needs",
        "description": "Prerequisite:  Admission to the Masters Program or Certificate Program in Educational Therapy. This beginning course in the Educational Therapy Program provides an in-depth study of the educational therapists professional role and ethical responsibilities. Services of the educational therapist are compared to those of other professionals and the interface between educational therapy and allied professions is reviewed.  Responsibilities of the educational therapist which include gathering contextual information providing formal and informal assessments synthesizing information developing goals case-management making referrals collaborating with allied professionals assessing progress and self reflection are examined. A model of educational therapy is developed.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "679",
        "title": "Internship in Educational Therapy",
        "description": "Prerequisites: SPED 671 672 673 676; Admission to the Special Education Masters Program or Post-M.A. Degree Certificate Program in Educational Therapy. SPED 679 is the culminating experience in the Educational Therapy Program. Through a supervised internship students will work with a client on an individual and ongoing basis to practice and further develop effective clinical skills. Students will be evaluated on each stage of the internship including gathering contextual information providing formal and informal assessments synthesizing information developing goals managing cases making referrals collaborating with allied professionals assessing progress and self reflection.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "681",
        "title": "Graduate Research in Special Education",
        "description": "Prerequisites: Admission to the Masters Program with Classified status. This Master’s level course is designed to provide information regarding the process of systematically researching an educational problem and to facilitate students’ ability to interpret and evaluate the research of others in special education and related fields.  Students are exposed to various research methods from both quantitative and qualitative traditions and complete an annotated bibliography on a topic of interest within their area of specialization. tudents must earn a grade of “B” or higher to proceed in the program.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "682D",
        "title": "ADVGRADRESEARCH",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "683",
        "title": "Current Trends in Special Education",
        "description": "Prerequisite: Admission to the Masters Program with Classified status. Prerequisite or Corequisite: SPED 681 and 682. This course is an advanced study of pertinent topics related to: (a) federal state and local agencies and their role in special and rehabilitative education (b) organization of special education programs (c) the preparation of teachers of exceptional children and (d) research and demonstration projects in the education of exceptional children. Students must earn a grade of “B” or higher to proceed in the program.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "695A",
        "title": "Advanced Behavioral Support",
        "description": "(Offered Fall semester only.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisites: SPED 681 and 682 must be taken and passed with a grade ofB or higher before students may register for the culminating experience (SPED 697 or 698C). Directed Comprehensive Studies requires students to complete an examination in the form of an Action Research Project. The Project is conducted throughout the semester. Throughout the course students organize their research materials and other resources to complete a literature review and design and conduct an action research Project. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "698C",
        "title": "Thesis or Graduate Project",
        "description": "Prerequisite: Completion of all course requirements for the Masters Degree. Preparatory: Acceptance by a Departmental Thesis Committee of a Thesis on a topic in the field of special education.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "699X",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "SPED",
        "catalog_number": "504MS",
        "title": "Teaching Learners with Moderate/Severe Disabilities",
        "description": "Prerequisite: Admission to Preliminary Education Specialist Credential Program in Moderate/Severe Disabilities. This course is the first of the 4 specialization courses candidates in Moderate/Severe disabilities take and as such serves as the course that provides a strong foundation for subsequent methodology classes. Topics include definition and identification of students with moderate to severe disabilities; federal legislation pertinent to this population; educational theories guiding practice and how these theories have changed over time; appropriate assessment practices and tools and educational approaches recommended for this group of learners. Planning and adapting to meet the needs of students from diverse cultural and linguistic backgrounds is infused throughout the course. Emphasis is placed on understanding the prevailing recommended practices in the field of severe/moderate disabilities as endorsed through contemporary research.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "532",
        "title": "ECSE Curriculum and Instruction",
        "description": "May be taken prior to admission. Study of curriculum and methods for infants toddlers and preschoolers with disabilities focusing on the developmental areas of cognition play and social interaction and the CA Preschool Learning Foundations. The course includes an overview on designing environments to facilitate independent problem-solving and social interaction. (Offered once each year.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "538",
        "title": "Early Intervention Practices",
        "description": "Prerequisites or Corequisites: SPED 402 404 431 500 520EC 532 535 536 537. Corequisite: 578EC. Taken with or the semester before 578EC--Field Work in ECSE: Infant/Toddler. The course content is designed for graduate level students from relevant disciplines (e.g. early childhood special education communicative disorders child development nursing physical therapy). Students will identify their roles as members of an early intervention team serving families and their infants and toddlers with IFSPs. Course content focuses on the CA Infant/Toddler Learning and Development Foundations philosophies and recommended and evidence-based practices in the field of early intervention team models service delivery approaches and strategies to promote collaboration with families and other members of the educational team. (Offered once each year.)\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "542B",
        "title": "Meeting the Needs of all Students in Urban Schools",
        "description": "Prerequisites: Restricted to candidates admitted to the Accelerated Collaborative Teacher (ACT) Preparation Program; Successful completion of all Fall semester course work. Prerequisites or Corequisites for Multiple Subject Credential Candidates: EED 559F 565S 568ACT 575; ELPS 542A; HSCI 496TH; KIN 595PE. Prerequisites or Corequisites for Single Subject Credential Candidates: ELPS 542A; HSCI 466ADO; SED 521 555. Prerequistes or Corequisites for MM Program: ELPS 542A; SPED 402 502MM 503MM 580ACT. Other specializations should check with their advisor. Offered in Spring semester only. SPED 542B with ELPS 542A is the second of 2 Core courses in the ACT Program is designed for elementary secondary and special education teacher candidates and taught collaboratively by a team of University and school faculty. Building on the content introduced in the first Core course related to educational equity diversity and special populations topics include developing as a reflective educator who considers the learning needs of all students; creating and managing effective and healthy classroom environments in urban schools; problem solving strategies to facilitate teaching and learning; instructional modifications and accommodations for students with disabilities in general education settings issues related to diversity and multicultural education; and models of collaboration/consultation. Teacher candidates are provided activities and discussions that emphasize the links between theory and practice.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "SPED",
        "catalog_number": "561D",
        "title": "TCH READ DF PUPIL",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "565",
        "title": "FIN TCH ENG TO DF",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "566D",
        "title": "CURR/INST DF PUPL",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "610",
        "title": "PROG PLAN IN SPED",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "614A",
        "title": "PROFESSIONAL EDUC",
        "description": null,
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "SPED",
        "catalog_number": "655",
        "title": "Promising Practices and Interventions for Students  with Autism",
        "description": "Prerequisite: Admitted to Clear Education Specialist Credential Program Added Autism Authorization and/or Special Education Masters Program. Co-requisite SPED 404. The course addresses knowledge skills and abilities to become proficient in implementing evidence-based and multi-faceted methodologies and strategies necessary in teaching and engaging students with autism spectrum disorders (ASD). Classroom application of interventions and emphasis on being part of a multidisciplinary team which includes collaborating with other service providers to determine program planning and service delivery for individuals with autism.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "671",
        "title": "Advanced Study of Literacy Problems",
        "description": "Prerequisites: SPED502MM0; Admission to the Special Education Masters Program or Post-M.A. Degree Certificate Program in Educational Therapy. This course provides advanced study in the area of literacy. It is designed to examine issues related to literacy processes assessment and instructional practices research methodologies and the relationships between language literacy schooling and culture. Emphasis is placed on students struggling with reading and writing. A minimum of 12 hours of supervised clinical experience is required.  (Offered Spring semester only.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "676",
        "title": "Clinical Case Management",
        "description": "Prerequisites: SPED 673 671 672; Admission to the Special Education Masters Program or Post-M.A. Degree Certificate Program in Educational Therapy. The focus of this course is on case management.  Students will analyze contextual influences such as the school family community and culture that impact a students performance and demonstrate the ability to serve in the role of case manager (e.g. prioritizing goals responding to parent concerns understanding school demands). This course is designed to build on the knowledge and skills from foundational educational therapy course work as related to establishing and maintaining effective efficient and ethical practices.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "SPED",
        "catalog_number": "683EC",
        "title": "Current Trends in Early Childhood Special Education",
        "description": "Prerequisite: SPED 628. Advanced study of decision-making processes in early childhood special education as influenced by personal values ethics public policy law and the professional knowledge base. Consideration of issues related to policy and practice in early intervention and strategies for advocacy and systems change.\n",
        "units": "3",
        "class_type": "SEM"
    }
]