[
    {
        "subject": "ARMN",
        "catalog_number": "101",
        "title": "Elementary Armenian I",
        "description": "Prerequisite: Not open to students who have attended schools where Armenian is the language of instruction. Study of the fundamentals of Armenian, including alphabet and additional sounds, grammatical structure, reading, writing and practice in the spoken language. May not be challenged by exam. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Not open to students who have attended schools where Armenian is the language of instruction}",
        "corequisites": "{None}"
    },
    {
        "subject": "ARMN",
        "catalog_number": "102",
        "title": "Elementary Armenian II",
        "description": "Prerequisite: ARMN 101 or instructor consent. Not open to students who have attended schools where Armenian is the language of instruction. Continuation of the study of the fundamentals of Armenian. May not be challenged by exam. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{{ARMN 101} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ARMN",
        "catalog_number": "201",
        "title": "Intermediate Armenian I",
        "description": "Prerequisite: ARMN 102 or equivalent. Intensive practice in pronunciation, conversation and writing. Brief review of grammar and study of more advanced grammatical concepts. Introduction to reading of literature and study of Armenian culture.",
        "units": "3",
        "prerequisites": "{ARMN 102}",
        "corequisites": "{None}"
    },
    {
        "subject": "ARMN",
        "catalog_number": "202",
        "title": "Intermediate Armenian II",
        "description": "Prerequisite: ARMN 201 or equivalent. Extensive grammar study designed to increase students’ proficiency in writing, and to clarify and deepen their understanding of Armenian syntax. Readings and discussions of representative Armenian essays, short stories, plays and poetry. Cultural issues are an integral part of this course.",
        "units": "3",
        "prerequisites": "{ARMN 201}",
        "corequisites": "{None}"
    },
    {
        "subject": "ARMN",
        "catalog_number": "310",
        "title": "Armenian Culture",
        "description": "Prerequisite: Completion of the lower division writing requirement. Covers all aspects of the Armenian culture from ancient civilization to modern day life both in Armenia and in the diaspora. Introduces the Armenian culture, including language, literature, history (including waves of immigration to the U.S. and the genocide of 1915), religion, political parties, music, visual and performing arts, architecture, tapestry, customs, holidays and ethnic food. Daily class participation and regular written assignments are required. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ARMN",
        "catalog_number": "360",
        "title": "Changing Roles of Armenian Women",
        "description": "Prerequisites: Upper division standing; Completion of the lower division writing requirement. The course explores changing roles of Armenian women with particular emphasis on new definitions and options in the family, community and society. The course perspective is international and comparative, with significant focus on Armenia and the diaspora. Also, the course concentrates on the educational, economic and political changes that support the upward movement of women in the U.S. Students will explore available resources and organizations within Armenian communities and gain appreciation of the roles of women as agents of change. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{{Upper division standing} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ARMN",
        "catalog_number": "380",
        "title": "Contemporary Issues in Armenia and the Diaspora",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of contemporary domestic and international issues in Armenia and the Armenian diaspora, with emphasis on Armenians in America. Includes an analysis of Armenian genocide as a historical issue having contemporary relevance, and a focused examination of current-event issues such as immigration, assimilation, social and political activities of community organizations, and participation in the American democratic process. Attention also is given to the changes brought about by the influx of Eastern Armenians into established Western Armenian communities in the U.S. following the fall of the USSR and the re-emergence of an independent Armenia.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ARMN",
        "catalog_number": "417",
        "title": "Equity and Diversity in School",
        "description": "Prepares teacher candidates to examine principles of educational equity, diversity and the implementation of curriculum content and school practices for elementary/secondary students. Focuses on the history and culture of a specific ethnic experience, and a comparative analysis is made with other ethnic groups in California. Engages students to examine, critique and reflect on their personal biases regarding children of color. Not available for credit in addition to AAS 417, AFRS 417, CHS 417 or ELPS 417.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ARMN",
        "catalog_number": "440",
        "title": "Armenian American Child",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of the development of the Armenian child with particular emphasis on bicultural and bilingual issues that may influence educational progress. Culturally relevant socialization patterns of children from Armenia and the Armenian diaspora are examined. Intended for prospective teachers and students interested in human services. (Available for Section A of the Multicultural requirement for credential candidates.) Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    }
]