[
    {
        "subject": "EPC",
        "catalog_number": "314",
        "title": "Psychological Foundations, K-12",
        "description": "This course should be taken only by students not intending to enroll in a K-12 teacher preparation program. Fulfills the requirement for the CLAD program. Study of the theory and research of educational psychology to learn principles that are basic to the successful teaching of students of all ages, backgrounds and needs. These principles of educational psychology form a foundation of knowledge about teaching that is built upon in subsequent courses in teaching methods and practice. Topics include learning, motivation, development (cognitive, language, socio-emotional, physical and moral), cognition, assessment, instruction, classroom management and individual and group differences (language, ability, ethnicity, social class, gender, exceptionality and family pattern). Implications for teaching students from culturally and linguistically diverse backgrounds are considered throughout the course. During the course, students are required to spend a minimum of 10-20 hours participating and/or observing in public schools or an approved setting.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "315",
        "title": "Psychological Foundations of Learning and Teaching",
        "description": "This course should be taken only by students intending to enroll in a K-12 teacher preparation program. Study of the theory and research of educational psychology to backgrounds and needs. These principles of educational psychology form a foundation of knowledge about teaching that is built upon in subsequent courses in teaching methods and practice. Topics studied include learning, motivation, development (cognitive, language, socio-emotional, physical and moral) and their relationship to learning and instruction, cognition, assessment, classroom management and individual and group differences in learning. Implications for teaching students from culturally and linguistically diverse backgrounds, as well as students with special needs, are considered throughout the course. Students begin to develop a professional portfolio and spend a minimum of 20 hours participating and/or observing in public schools. Integration of coursework and fieldwork provides students the opportunity to complete various assignments in preparation for meeting Teacher Performance Expectations (TPE).",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "420",
        "title": "Educational Psychology of Adolescence",
        "description": "Required of candidates in the Single Subject Credential Program. Study of theory and research in educational psychology for successful teaching of adolescents. Subjects include learning, development, motivation, instruction, assessment, classroom management, individual/group differences, peer interactions, and family and community influences. Issues particularly pertinent to adolescence include identity development, self-esteem, suicide, crisis prevention and conflict resolution. Implications for teaching students from culturally and linguistically diverse backgrounds are considered throughout the course. Students are required to complete two field-based assignments–an adolescent case study and a secondary classroom learning environment analysis. Course may be offered online, in a classroom setting or both. Available for graduate credit with approval from the graduate coordinator.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "430",
        "title": "Development and Learning in Early Childhood Education",
        "description": "Examination of theoretical positions in development and learning, including relevant research and implications for educational practice in early years. Some sections of this course may offer a community-service opportunity with activities relating to concepts and theories presented. Available for graduate credit with approval from the graduate coordinator. Check the Schedule of Classes for the CS designation.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "451",
        "title": "Fundamentals of Counseling and Guidance",
        "description": "Admission restricted to seniors, PBUs and conditionally classified graduate students. Overview of several approaches to counseling in school and community settings. Understanding of case study methods in assessing individual children is included. Overall guidance programs are studied, with emphasis on counseling relationships. Available for graduate credit with approval from the graduate coordinator.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "500",
        "title": "Foundations of Elementary Teaching",
        "description": "Prerequisite: Admission to the Multiple Subject Credential Program or under Intent to Apply Status (ITA). Intent to Apply (ITA) students who are enrolled in this course are required to perform 20 hours of fieldwork observation. EPC 315 may be substituted for EPC 500 or EED 500 only if completed previously as an undergraduate student. This theory-into-practice introductory teacher education course focuses on the foundations of education and the practical applications of human learning theory and teacher effectiveness research in specific relation to elementary instruction and classroom management. Credential candidates are introduced to important theorists in educational psychology, standards-based lesson planning and instructional design, culturally relevant teaching practices, and strategies that can be employed to modify instruction to meet the diverse learning needs of the full range of learners including struggling readers, students demonstrating atypical development, English learners, and advanced learners. Each candidate develops a Classroom Management Plan describing a range of positive behavioral support strategies and methods for creating respectful, safe, organized, inclusive and caring learning environments that promote the social-emotional well-being of all students. This course requires candidates to develop a thorough understanding of how students learn and how that learning is tied directly to the candidate’s teaching. (Cross-listed with EED 500.)",
        "units": "3",
        "prerequisites": "{Admission to the Multiple Subject Credential Program or under Intent to Apply Status (ITA)}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "600",
        "title": "Educational Statistics for Research and Measurement",
        "description": "Prerequisites: Undergraduate course in basic mathematics and algebra, or permission of the instructor; Current graduate standing in the University. Introduction to basic descriptive and inferential statistics for applications to graduate courses in educational psychology, counseling, general graduate-level educational courses in tests and measurements and research. Normally a prerequisite to EPC 601–Fundamentals of Measurement and EPC 602–Principles of Educational Research, except when waived by instructor or when equivalent course has been taken.",
        "units": "3",
        "prerequisites": "{{Undergraduate course in basic mathematics and algebra, or permission of the instructor} && {Current graduate standing in the University}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "601",
        "title": "Individual and Group Assessment",
        "description": "Prerequisite: EPC 600 or equivalent. Examination of individual and group assessment instruments and their application in the evaluation of intellectual performance, personality constructs, career interest and interpersonal relations. Includes historical foundations, non-discriminatory procedures, ethical standards and social issues. Lab fee required.",
        "units": "3",
        "prerequisites": "{EPC 600}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "602",
        "title": "Research Principles",
        "description": "Prerequisite: EPC 600. Introductory course in techniques, use, presentation and understanding of research principles in education and counseling and the contributions of research to the solution of problems.",
        "units": "3",
        "prerequisites": "{EPC 600}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "603",
        "title": "Clinical Research and Program Evaluation",
        "description": "Prerequisites: EPC 600 or equivalent; Admission to a CSUN master’s degree program in Counseling. Introduces quantitative and qualitative clinical research methods, including randomized clinical trials, efficacy and effectiveness studies, program evaluation, client outcome, clinician effectiveness and evidence-based practice strategies. Emphasis placed on conducting research and evaluating outcomes with children, couples, families, diverse clients and vulnerable populations. Also covers federal, state and private foundation agendas, systems of access and channels for funding mental health research.",
        "units": "3",
        "prerequisites": "{{EPC 600} && {Admission to a CSUN master’s degree program in Counseling}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "603MFA",
        "title": "Clinical Research and Program Evaluation",
        "description": "Prerequisites: Admission to CSUN’s master’s program in Marriage and Family Therapy. Introduces quantitative and qualitative clinical research methods, including randomized clinical trials, efficacy and effectiveness studies, program evaluation, client outcome, clinician effectiveness and evidence-based practice strategies. Emphasis placed on conducting research and evaluating outcomes with children, couples, families, diverse clients and vulnerable populations. Also covers federal, state and private foundation agendas, systems of access and channels for funding mental health research.",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "603MFB",
        "title": "Introduction to Professional Writing",
        "description": "Prerequisite: Admission to CSUN’s master’s program in Marriage and Family Therapy. This course introduces students to the basic professional writing standards required for both academic and clinical writing in the field. Students will review professional voice, writing style, organization, language bias, and grammar as well as learn APA style. Students must earn a grade of “B” or better to pass the Graduate Writing Requirement for the M.S. in Marriage and Family Therapy. This course may be taken up to three (3) times as needed to pass the Graduate Writing Requirement.",
        "units": "2",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "604",
        "title": "Multi-Systemic Academic Intervention for School Psychologists",
        "description": "Prerequisite: Admission to CSUN’s Master of Science in School Psychology program. Effective teaching and instruction and evidence-based academic interventions for diverse learners, including students with disabilities and culturally and linguistically diverse students, is the focus of this course. This course will cover effective teaching and instruction; school climate; reading, math, and written language development, assessment, and intervention; and evidence-based programs. Content will include Multi-Tiered Systems of Support (MTSS) with emphasis on curriculum-based assessment in identifying, monitoring, and evaluating academic progress and outcomes.",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s Master of Science in School Psychology program}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "605",
        "title": "Advanced Psychological Foundations of Education",
        "description": "Focuses on the interaction of the learning-teaching process. Emphasis on pertinent learning theories, individual differences in capacities and development of learners, and evaluation of learning and instructional models.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "609",
        "title": "Human Development: A Lifespan Perspective",
        "description": "Prerequisite: EPC 430 or an equivalent course. This course provides a comprehensive review of human development across the lifespan, including an overview of the biological, neurological, physiological, and sociocultural factors that affect human development. Focus is placed on understanding the contextual, environmental, and systemic factors that affect human development, functioning, and behavior. Theories related to typical and non-typical personality development are discussed. This course will also focus on ethical and culturally relevant strategies for promoting resilience and optimum development and wellness across the lifespan, and the impact of socioeconomic status, ethnic diversity, and gender on human development.",
        "units": "3",
        "prerequisites": "{EPC 430}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "620",
        "title": "College Counseling and Student Services Profession",
        "description": "Examines theories and research in the field of student affairs. Introduces specialty areas, roles and functions of college counselors and student services professionals. Analyzes current problems, future trends, professional standards, legal issues and ethical concerns, as well as organizational patterns and the interactions of academic, business and student affairs areas.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "621",
        "title": "Collaborative Consultation for School Counselors",
        "description": "Prerequisite: Admission to CSUN’s Master of Science in Counseling program; Enrollment in one of the following fieldwork courses: EPC 659CC, EPC 659JC, or EPC 659KC. The course examines principles and theory-derived practices of collaborating with families in educational settings from Pre-K through high school. Considerations of family system theory, family forms, the role of culture and the ecological perspective, the impact of family on child development, child and adolescent development, a focus on special education, and student achievement will be incorporated into the course. Course teaching will emphasize consultation with teachers and other professionals regarding problems encountered with children and adolescents, with the goal of enhancing Pre-K student academic achievement.",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s Master of Science in Counseling program}",
        "corequisites": "{{EPC 659CC} || {EPC 659JC} || {EPC 659KC}}"
    },
    {
        "subject": "EPC",
        "catalog_number": "622",
        "title": "American College Student and Campus Environment",
        "description": "Examines personal characteristics and attitudes, social-cultural factors and developmental theory as they pertain to traditional and non-traditional college students. Explores student development, student service and campus ecology approaches. Surveys environmental assessment and needs analysis techniques, program planning, intervention strategies and program evaluation relevant to the college population.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "632",
        "title": "Issues, Theories and Current Practices in Early Childhood",
        "description": "Prerequisite: EPC 430. Current issues and trends in early childhood education, including examination of relationships between basic assumptions, theory and practice.",
        "units": "3",
        "prerequisites": "{EPC 430}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "634",
        "title": "Language and Concept Development in the Early School Years",
        "description": "Prerequisite: EPC 430. Study of research and current theoretical positions in language and concept development with major emphasis on the implications for learning in the school setting.",
        "units": "3",
        "prerequisites": "{EPC 430}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "635",
        "title": "Foundations of Developmental Curriculum for Early Childhood",
        "description": "Prerequisites: EPC 430 and EPC 632, or instructor consent. To be taken concurrently with experiences in the field, either teaching or fieldwork.",
        "units": "3",
        "prerequisites": "{{{EPC 430} && {EPC 632}} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "636",
        "title": "Systems and Policies in Infant-Toddler-Family Mental Health",
        "description": "Focus on the systems and policies that support optimal infant-toddler-family mental health. Students participate in researching the national, state and local legislation that influences the related child care, education and service delivery systems. This includes the exploration of private and public agencies in place to administer and/or deliver services for young children and their families. Mapping these systems of care and education, as well as constructing the professional’s role in the system, culminates in an increased knowledge and understanding of the policies that support optimal infant-toddler-family mental health. Finally, understanding the role of these systems as seen from a family’s perspective informs and supports the family’s successful navigation to obtain appropriate care and education resources for their child.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "639C",
        "title": "Fieldwork in Early Childhood",
        "description": "Prerequisites: EPC 430; Formal admittance into the master’s program in Early Childhood Education. Supervised fieldwork in a variety of early childhood and parent-child settings. Students are required to spend 20 hours in fieldwork per academic unit (e.g., 3 units requires 60 hours of fieldwork) and participate in a 2-hour weekly seminar with their fieldwork professor. Normally, students will enroll in this course for 3 units (639C) during their first semester, requiring work directly with young children. Successful completion of this course is required for students to be fully classified in the master’s program in Early Childhood Education. Additional semesters may be taken as program electives in settings approved by the course professor.",
        "units": "3",
        "prerequisites": "{{EPC 430} && {Formal admittance into the master’s program in Early Childhood Education}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "641",
        "title": "Bilingual Assessment",
        "description": "Prerequisite: Instructor permission required. Basic course is designed to understand the assessment of culturally and linguistically diverse students, primarily the bilingual student. Primary emphasis is placed on bilingual assessment, criteria for instrument selection, strategies for individual diagnosis, understanding assessment results with bilingual students, and selecting culturally and linguistically appropriate goals and recommendations in the areas of cognition, language, socio-emotional and achievement.",
        "units": "3",
        "prerequisites": "{Instructor permission required}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "642",
        "title": "Assessment and Evaluation in Early Childhood Education",
        "description": "Prerequisite: EPC 639C or consent of instructor. Theories of child assessment and program evaluation related to children from birth to age 8 are studied. Practical applications of theory, design and ethical use of assessment and evaluation are applied in a field-based case project.",
        "units": "3",
        "prerequisites": "{{EPC 639C} || {consent of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "643",
        "title": "Diversity in Counseling",
        "description": "Prerequisite: Admission to a CSUN master’s degree program in Counseling. Self-assessment of knowledge, sensitivity and attitudes toward diverse populations, including race, ethnicity, gender, age, socioeconomic status, sexual orientation, spirituality, ability and language. Examination of family structure and social patterns in California’s ethnic populations and differences across social class. Review of cross-cultural research, theories, interventions and resources. Emphasis on models of societal oppression, privilege, cross-cultural dynamics, poverty and social justice, as well as the impact of social stress and prejudice on mental health recovery. Designed for family therapists and mental health counselors in school, college and community settings.",
        "units": "3",
        "prerequisites": "{Admission to a CSUN master’s degree program in Counseling}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "643MF",
        "title": "Diversity in Family Therapy",
        "description": "Prerequisite: Admission to CSUN’s master’s program in Marriage and Family Therapy. Self-assessment of knowledge and attitudes toward diverse populations, including race, ethnicity, gender identity, age, socioeconomic status, sexual orientation, spirituality, ability and language. Examination of family structure and social patterns in California’s ethnic populations and differences across social class. Review of current research, theories, interventions and resources. Emphasis on models of societal oppression, privilege, cross-cultural dynamics, poverty, and social justice as well as the impact of social stress and prejudice on mental health.",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "648",
        "title": "Consultation with Parents, Teachers and Other Human Service Professionals",
        "description": "Prerequisite: A course in child development. Recommended: EPC 646 or EPC 647. Exploration and study of theory-derived practices regarding communication and consultation with parents and teachers with respect to problems they encounter with children. Educational and clinical applications. Issues regarding information-sharing with other professionals. Collaborating with other professionals and making referrals.",
        "units": "3",
        "prerequisites": "{{EPC 646} || {EPC 647}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "653",
        "title": "Measurement for Career, College, and School Counseling",
        "description": "Prerequisite: EPC 600 or an equivalent course. In this course, students will utilize current technology to engage in and disseminate creative, empirical, and applied research studies and program evaluations. There will be investigation of standardized group tests, with emphasis on their sources, selection, administration, scoring, evaluation and interpretation of results. Focus on diversity and its relationship to measurement will be reviewed.",
        "units": "3",
        "prerequisites": "{EPC 600}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "655",
        "title": "Seminar in Counseling Theory and Practice",
        "description": "Prerequisite: Admission to a CSUN master’s degree program in Counseling. Counseling theories and treatment planning, including psychodynamic, humanistic-existential, cognitive-behavioral, feminist and solution-focused theories, including an examination of the evidence base and history of the counseling profession. Emphasis is placed on applications with diverse populations in community, school and college settings.",
        "units": "3",
        "prerequisites": "{Admission to a CSUN master’s degree program in Counseling}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "656MF",
        "title": "Therapy with Children, Adolescents, and Their Families",
        "description": "Prerequisites: EPC 670A; Admission to CSUN’s master’s program in Marriage and Family Therapy. Therapy theories and techniques for working with children, adolescents and their families, including evidence-based treatments for common childhood disorders, assessment approaches, play and child therapy techniques, child abuse treatment, domestic violence, self-harm and suicide interventions. Also addresses resiliency, as well as Gay-Lesbian-Bisexual-Transgender-Questioning and diversity issues. Emphasis on a multi-level, systemic perspective when working with youth.",
        "units": "3",
        "prerequisites": "{{EPC 670A} && {Admission to CSUN’s master’s program in Marriage and Family Therapy}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "657A",
        "title": "Seminar in Career Counseling Theory",
        "description": "Prerequisite: EPC 451. Comprehensive review and critique of current career development and decision theories. Exploration of changing concepts of work and careers, and their implications for career planning. Focus on the relationship of career to other issues of counseling and development.",
        "units": "3",
        "prerequisites": "{EPC 451}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "657MF",
        "title": "Career Interventions in Mental Health Counseling",
        "description": "Prerequisite: Admission to CSUN’s master’s program in Marriage and Family Therapy. Prepares family therapists to assist children, teens and adults with a wide range of career issues that arise in clinical practice as well as prepare therapists for work in EAP environments. Topics covered include career counseling and development theory, diversity, harassment, and discrimination in the workplace, relationship issues in the workplace, dual career couples, unemployment and underemployment, and supported employment for the severely mentally ill. Emphasis placed on evidence-based practices and diversity issues.",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "658",
        "title": "Seminar in Group Counseling",
        "description": "Prerequisite: EPC 659A. Corequisite: EPC 658L. Preparatory: EPC 451, EPC 655, instructor consent. Theory and practice of group counseling: group work and group development in various settings. Designed to develop and increase understanding and skills related to group counseling; to stimulate interest in working with groups, to enable counseling personnel to consider appropriate uses for group counseling and to evaluate its effectiveness in demonstration and practice. Lab: Extensive practical experience in group counseling entailing supervised feedback. Theory is applied to the actual practice of group work.",
        "units": "3",
        "prerequisites": "{EPC 659A}",
        "corequisites": "{EPC 658L}"
    },
    {
        "subject": "EPC",
        "catalog_number": "658L",
        "title": "Seminar in Group Counseling Lab",
        "description": "Prerequisite: EPC 659A. Corequisite: EPC 658L. Preparatory: EPC 451, EPC 655, instructor consent. Theory and practice of group counseling: group work and group development in various settings. Designed to develop and increase understanding and skills related to group counseling; to stimulate interest in working with groups, to enable counseling personnel to consider appropriate uses for group counseling and to evaluate its effectiveness in demonstration and practice. Lab: Extensive practical experience in group counseling entailing supervised feedback. Theory is applied to the actual practice of group work.",
        "units": "1",
        "prerequisites": "{EPC 659A}",
        "corequisites": "{EPC 658}"
    },
    {
        "subject": "EPC",
        "catalog_number": "659A",
        "title": "Communication Skills in Counseling",
        "description": "Prerequisite: Admission to a CSUN master’s degree program in Counseling; Recommended Corequisite: EPC 655. Communication theory and skills, designed to help students develop greater self-knowledge and become aware of their impact on others through participation in group experiences and peer counseling. Emphasis on verbal and non-verbal cues, refinement of basic response skills and the subtleties of language and style.",
        "units": "3",
        "prerequisites": "{Admission to a CSUN master’s degree program in Counseling}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "659B",
        "title": "Practicum in Counseling",
        "description": "Prerequisites: EPC 659A; Admission to a CSUN master’s degree program in Counseling. Supervised applications of counseling skills in classroom and fieldwork settings, including peer counseling and community counseling sessions. Topics include crisis management and safety planning with suicidal or homicidal clients, child/elder abuse, domestic violence and self-injury, as well as introducing clients to counseling, professional documentation, case management and community referrals. Students must complete a minimum of 40 hours of direct services with clients.",
        "units": "3",
        "prerequisites": "{{EPC 659A} && {Admission to a CSUN master’s degree program in Counseling}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "659CC",
        "title": "Fieldwork in Counseling Services",
        "description": "Prerequisites: EPC 643, EPC 655, EPC 659A, EPC 659B. Supervised field training in an organized program for those specializing in Pupil Personnel Services at either elementary or secondary level or those in community-based counseling programs. Flexible units with consent of advisor. Normally, students enroll in EPC 659CC and EPC 659DC for two, 3-unit semesters. A third semester may be required with consultation with the advisor. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{EPC 643} && {EPC 655} && {EPC 659A} && {EPC 659B}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "659DC",
        "title": "Fieldwork in Counseling Services",
        "description": "Prerequisites: EPC 643, EPC 655, EPC 659A, EPC 659B. Supervised field training in an organized program for those specializing in Pupil Personnel Services at either elementary or secondary level or those in community-based counseling programs. Flexible units with consent of advisor. Normally, students enroll in EPC 659CC and EPC 659DC for two, 3-unit semesters. A third semester may be required with consultation with the advisor. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{EPC 643} && {EPC 655} && {EPC 659A} && {EPC 659B}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "659EC",
        "title": "Practicum in School Psychology: Resiliency, Prevention and Crisis Intervention",
        "description": "Prerequisite: Students must be enrolled in the School Psychology Program. EPC 659EC and EPC 659FC are designed to help the student learn the position of the school psychologist through supervision, discussions, presentations, and actual fieldwork experiences. Focus in the Fall will include resiliency and using a strength based focus to plan data based interventions. In the Spring, the focus will be on prevention and crisis intervention, as well as emphasizing positive student outcomes using data based interventions. The emphasis is on learning the function of a school psychologist using resiliency and prevention as a foundation to the provision of services, which will include: psycho-educational assessments, counseling, consultation, academic, social, and behavioral interventions, and crisis prevention and intervention. Emphasis is also placed on leadership skills and being culturally sensitive and responsive. Students work closely with the field and campus supervisors. Normally students enroll in EPC 659EC and 659FC for two, 3-unit semesters. A third semester may be required when competence is not met in required areas. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{Students must be enrolled in the School Psychology Program}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "659FC",
        "title": "Practicum in School Psychology: Resiliency, Prevention and Crisis Intervention",
        "description": "Prerequisite: Students must be enrolled in the School Psychology Program. EPC 659EC and EPC 659FC are designed to help the student learn the position of the school psychologist through supervision, discussions, presentations, and actual fieldwork experiences. Focus in the Fall will include resiliency and using a strength based focus to plan data based interventions. In the Spring, the focus will be on prevention and crisis intervention, as well as emphasizing positive student outcomes using data based interventions. The emphasis is on learning the function of a school psychologist using resiliency and prevention as a foundation to the provision of services, which will include: psycho-educational assessments, counseling, consultation, academic, social, and behavioral interventions, and crisis prevention and intervention. Emphasis is also placed on leadership skills and being culturally sensitive and responsive. Students work closely with the field and campus supervisors. Normally students enroll in EPC 659EC and 659FC for two, 3-unit semesters. A third semester may be required when competence is not met in required areas. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{Students must be enrolled in the School Psychology Program}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "659GC",
        "title": "Internship in School Psychology",
        "description": "Prerequisites: EPC 659EC, EPC 659FC or PSY 655C. Intensive supervised internship in a multi-cultural school for those completing the Pupil Personnel Services Credential/School Psychologist Authorization. Course objectives require vigorous application of diagnostic prescriptive and consultative skills. Students complete a total of 6 units. Actual number of units per semester is determined by instructor and student. Normally, students enroll in EPC 659GC and EPC 659HC for two, 3-unit semesters. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{EPC 659EC} || {EPC 659FC} || {PSY 655C}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "659HC",
        "title": "Internship in School Psychology",
        "description": "Prerequisites: EPC 659EC, EPC 659FC or PSY 655C. Intensive supervised internship in a multi-cultural school for those completing the Pupil Personnel Services Credential/School Psychologist Authorization. Course objectives require vigorous application of diagnostic prescriptive and consultative skills. Students complete a total of 6 units. Actual number of units per semester is determined by instructor and student. Normally, students enroll in EPC 659GC and EPC 659HC for two, 3-unit semesters. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{EPC 659EC} || {EPC 659FC} || {PSY 655C}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "659JC",
        "title": "Fieldwork in Clinical Counseling",
        "description": "Prerequisites: Admission to CSUN’s Master of Science in Counseling program; EPC 659A, EPC 659B. Intensive supervised fieldwork experience where students gain hours under an approved counseling/mental health provider and receive supervision by an approved site supervisor. In addition, students will meet weekly for a minimum of 1.5 hours of university group supervision with the practicum instructor to review their counseling work and receive instruction on related professional issues. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{Admission to CSUN’s Master of Science in Counseling program} && {EPC 659A} && {EPC 659B}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "659MFA",
        "title": "Introduction to Counseling Theory and Practice",
        "description": "Prerequisite: Admission to CSUN’s master’s program in Marriage and Family Therapy. Introduction to fundamental counseling theories and skills, with a focus on humanistic and strength-based approaches to forming a therapeutic relationship with a diverse range of clients. Experiential and group exercises to develop the personal qualities required to be an effective family therapist. This course is the first half of the first-year practicum experience in the Master of Science in Marriage and Family Therapy program; to count toward the degree, EPC 659MFA and EPC 659MFB must be taken in the same academic year. May be repeated once for credit.",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "659MFB",
        "title": "Practicum in Family Therapy",
        "description": "Prerequisites: EPC 659MFA; Admission to CSUN’s master’s program in Marriage and Family Therapy. Supervised application of therapy skills in classroom and fieldwork settings, including peer counseling and community counseling sessions. Topics include crisis management and safety planning with suicidal or homicidal clients, child/elder abuse, domestic violence, and self-injury as well as introducing clients to counseling, professional documentation, case management, and community referrals. This course is the second half of the first-year practicum experience in the Master of Science in Marriage and Family Therapy program; to count toward the degree, EPC 659MFB and EPC 659MFA must be taken in the same academic year. May be repeated once for credit.",
        "units": "3",
        "prerequisites": "{{EPC 659MFA} && {Admission to CSUN’s master’s program in Marriage and Family Therapy}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "659MFC",
        "title": "Fieldwork in Marriage and Family Therapy",
        "description": "Prerequisites: EPC 659MFB, EPC 670MFA, EPC 670MFB, EPC 671MF, EPC 672MFA, and program approval required. Supervised training at an approved field site and an introduction to clinical and licensing paperwork. Students must apply for and locate a community placement prior to enrolling. This course includes a live supervision component. This course is the first half of the second-year fieldwork experience in the Master of Science in Marriage and Family Therapy program; to count toward the degree, EPC 659MFC and EPC 659MFD must be taken in the same academic year. Course may be taken up to three times.",
        "units": "3",
        "prerequisites": "{{EPC 659MFB} && {EPC 670MFA} && {EPC 670MFB} && {EPC 671MF} && {EPC 672MFA} && {program approval required}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "659MFD",
        "title": "Fieldwork in Marriage and Family Therapy",
        "description": "Prerequisites: EPC 659MFC, EPC 670MFA, EPC 670MFB, EPC 671MF, EPC 672MFA, and program approval required. Supervised training at an approved field site. This course includes a live supervision component and covers applied skills in case conceptualization and use of theories with clients. This course is the second half of the second-year fieldwork experience in the Master of Science in Marriage and Family Therapy program; to count toward the degree, EPC 659MFD and EPC 659MFC must be taken in the same academic year. Course may be taken up to three times.",
        "units": "3",
        "prerequisites": "{{EPC 659MFC} && {EPC 670MFA} && {EPC 670MFB} && {EPC 671MF} && {EPC 672MFA} && {program approval required}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "659SPA",
        "title": "Communication Skills for School Psychologists",
        "description": "Prerequisite: Admission to CSUN’s Master of Science in School Psychology program. Communication theory and skills designed to help candidates develop greater self-knowledge, self-awareness, sensitivity to others, and skillfulness in relating to individuals and groups and become aware of their impact on effective communication and interpersonal skills on others through participation in group experiences and peer counseling. Emphasis will be on theories and conceptual models of communication and interpersonal relationships, verbal and non-verbal cues, refinement of basic response skills and the subtleties of language and style. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s Master of Science in School Psychology program}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "661",
        "title": "Multi-Systemic Behavioral Interventions",
        "description": "Provides school psychology students with comprehensive research-based information and best practices on how to assess children with behavioral disabilities and develop interventions. A multi-systemic behavioral approach to intervention is emphasized. Use of functional assessment, behavior intervention and prevention programs for students with behavioral disabilities is discussed. Additionally, students learn single-case methodology and begin learning about behavior consultation.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "663A",
        "title": "Assessment of Cognitive Abilities for Intervention",
        "description": "Prerequisites: EPC 601; SPED 610. Recommended Corequisite: EPC 659EC. History, theory and practice of individual assessment. Emphasis on cognitive-intellectual abilities testing as it relates to learning and adequate functioning. Supervised practice in test administration, interpretation of data from multiple sources and communication of results for program planning. (Limited to students accepted into the School Psychology Credential Program.)",
        "units": "3",
        "prerequisites": "{{EPC 601} && {SPED 610}}",
        "corequisites": "{EPC 659EC}"
    },
    {
        "subject": "EPC",
        "catalog_number": "663AL",
        "title": "Assessment of Cognitive Abilities for Intervention Lab",
        "description": "Prerequisites: EPC 601; SPED 610. Recommended Corequisite: EPC 659EC. History, theory and practice of individual assessment. Emphasis on cognitive-intellectual abilities testing as it relates to learning and adequate functioning. Supervised practice in test administration, interpretation of data from multiple sources and communication of results for program planning. (Limited to students accepted into the School Psychology Credential Program.)",
        "units": "2",
        "prerequisites": "{{EPC 601} && {SPED 610}}",
        "corequisites": "{EPC 659EC}"
    },
    {
        "subject": "EPC",
        "catalog_number": "663B",
        "title": "Assessment of Social Emotional Development and Adaptive Skills for Intervention",
        "description": "Prerequisite: EPC 663A/L. Recommended Corequisite: EPC 659FC. Emphasis on assessment of socio-emotional abilities, personality, adaptive and life skills related to learning and adjustment. Supervised practice in test administration, interpretation of data from multiple sources and communication of results for program planning. (Limited to students accepted into the School Psychologist Credential Program.)",
        "units": "3",
        "prerequisites": "{EPC 663A/L}",
        "corequisites": "{EPC 659FC}"
    },
    {
        "subject": "EPC",
        "catalog_number": "663BL",
        "title": "Assessment of Social Emotional Development and Adaptive Skills for Intervention Lab",
        "description": "Prerequisite: EPC 663A/L. Recommended Corequisite: EPC 659FC. Emphasis on assessment of socio-emotional abilities, personality, adaptive and life skills related to learning and adjustment. Supervised practice in test administration, interpretation of data from multiple sources and communication of results for program planning. (Limited to students accepted into the School Psychologist Credential Program.)",
        "units": "1",
        "prerequisites": "{EPC 663A/L}",
        "corequisites": "{EPC 659FC}"
    },
    {
        "subject": "EPC",
        "catalog_number": "664",
        "title": "Neuro-Developmental, Emotional and Behavior Disorders",
        "description": "The course provides a knowledge base of the etiology and characteristics of major neuro-developmental, emotional and behavior disorders in children and youth, as well as an understanding of current evidence-based interventions in the schools. Students will be introduced to the ecological factors in the development of common disorders, including biological bases, and family, school, peer, community and school influences. Information learned will be used as guidelines for identifying children in the schools who need treatment. Lab fee required.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "665",
        "title": "Individual and Group Counseling of Children in the Schools",
        "description": "Prerequisites: EPC 659A, EPC 659B. The course addresses individual and group counseling techniques to assist students with adjustment, social emotional functioning and mental health in the schools. Research and theory are aligned to best practices in wellness promotion, resiliency, crisis intervention and individual and group counseling. Application of developmental, diversity, and legal and ethical principles is stressed. Application of relevant research based theories and outcome based practice with children is emphasized.",
        "units": "3",
        "prerequisites": "{{EPC 659A} && {EPC 659B}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "667",
        "title": "Law and Ethics and Professional Practice for School Psychologists in the Schools and in Private Practice",
        "description": "Prerequisite: Admission into the School Psychology Program. Corequisite: EPC 659A. This course provides a description and discussion of current roles and functions of school psychologists as guided by the history of the profession, law and ethics in the schools and in private practice, and current and future trends.",
        "units": "3",
        "prerequisites": "{Admission into the School Psychology Program}",
        "corequisites": "{EPC 659A}"
    },
    {
        "subject": "EPC",
        "catalog_number": "668",
        "title": "Partnerships for Excellence in Early Childhood Education",
        "description": "Prerequisites: EPC 639C; Formal application to enroll in the course or permission of instructor prior to the beginning of the semester. Students meet with mentors and faculty to study, design, implement and evaluate outcomes of quality improvement consultation/collaboration in center-based early care and learning programs. Field-based experience and weekly attendance in faculty-led seminar sessions are included. Students are required to submit a course application and be approved for enrollment prior to the beginning of the semester. The course may be taken up to three times with the approval of the course instructor and/or M.A. Program Coordinator(s).",
        "units": "3",
        "prerequisites": "{{EPC 639C} && {Formal application to enroll in the course or permission of instructor prior to the beginning of the semester}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "670MFA",
        "title": "Systemic Family Therapy Theories",
        "description": "Prerequisite: Admission to CSUN’s master’s program in Marriage and Family Therapy. Introduces the epistemological foundations of systemic family therapy. Case conceptualization and treatment planning using systemic marriage and family therapy theories, including structural, strategic, experiential, intergenerational, and psychodynamic theories and related evidence-based treatments. Applications with diverse clients and the severely mentally ill are emphasized.",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "670MFB",
        "title": "Postmodern and Cognitive-Behavioral Family Therapies",
        "description": "Prerequisite: Admission to CSUN’s master’s program in Marriage and Family Therapy. Theoretical foundations, case conceptualization and treatment planning using postmodern and cognitive-behavioral marriage and family therapy theories, including solution-focused, narrative, collaborative, cognitive-behavioral, and behavioral approaches. Addresses postmodern epistemological and philosophical foundations, the associated evidence base, and applications with diverse clients.",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "670MFC",
        "title": "Psychoeducational and Process Groups in Family Therapy",
        "description": "Prerequisite: Admission to CSUN’s master’s program in Marriage and Family Therapy. Prepares students to develop and lead psychoeducational and process groups for children and adults diagnosed with a mental health issue as well as multi-family and multi-couple groups for families with members diagnosed with severe mental illness. Emphasis on evidence-based group treatments and diversity issues. Practice guidelines also covered, including confidentiality in group settings, screening members and mandated group treatment.",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "671",
        "title": "Laws, Ethics and Professional Issues in Counseling",
        "description": "Prerequisite: Admission to a CSUN master’s degree program in Counseling. This course focuses on laws, ethical decision making, professional identity, professional advocacy, mandated reporting, and licensing requirements that relate to counselors and marriage and family therapists in California. Emphasis on differing ethical standards across practice contexts, including recovery-oriented care, as well as ethical issues related to working with and advocating for diverse clients and collaborating with other professionals. The ethics codes of the American Counseling Association (ACA), the California Association of Marriage and Family Therapists (CAMFT), and the American Association for Marriage and Family Therapists (AAMFT) will be contrasted and compared.",
        "units": "3",
        "prerequisites": "{Admission to a CSUN master’s degree program in Counseling}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "671MF",
        "title": "Law, Ethics, and Professional Issues in Family Therapy",
        "description": "Prerequisite: Admission to CSUN’s master’s program in Marriage and Family Therapy. This course provides training in laws, ethical decision making, professional identity, professional advocacy, mandated reporting, and licensing requirements that relate to marriage and family therapists and counselors in California. Emphasis will be placed on differing ethical practices across contexts, including recovery-oriented public mental health, as well as ethical issues related to working with and advocating for diverse clients and collaborating with other professionals. The ethics codes of current professional organizations, including American Association for Marriage and Family Therapy (AAMFT), the California Association of Marriage and Family Therapists (CAMFT), and the American Counseling Association (ACA) will be contrasted and compared.",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "672",
        "title": "Mental Health Assessment and Diagnosis",
        "description": "Prerequisite: Admission to a CSUN master’s degree program in Counseling. Examines clinical assessment and diagnosis of adults and children manifesting mild to severe mental disorders, and includes training in the mental status examination, use of the Diagnostic and Statistical Manual of Mental Disorders, co-occurring disorders and recovery-oriented prognosis for severe mental illness. Emphasis on diversity and socioeconomic issues, as well as evidence-based treatments and best practices.",
        "units": "3",
        "prerequisites": "{Admission to a CSUN master’s degree program in Counseling}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "672MFA",
        "title": "Mental Health Assessment and Diagnosis in Family Therapy",
        "description": "Prerequisite: Admission to CSUN’s master’s program in Marriage and Family Therapy. Clinical assessment and diagnosis of adults and children manifesting mild to severe mental disorders and includes training in the mental status examination, use of the Diagnostic and Statistical Manual of Mental Disorders, co-occurring disorders, systemic perspectives on diagnosis, and recovery-oriented prognosis for severe mental illness. Emphasis on diversity and socioeconomic issues as well as evidence-based treatments and best practices.",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "672MFB",
        "title": "Neurobiology and Treatment of Trauma",
        "description": "Prerequisite: Admission to CSUN’s master’s program in Marriage and Family Therapy. This course provides students with research on the neurobiological and psychosocial impact of complex trauma among diverse populations and the link with co-occurring disorders and high-risk behaviors. Students learn and practice trauma-informed care with an emphasis on evidence-based programs. Students also gain an understanding of the importance of self-care when working with diverse populations with histories of trauma.",
        "units": "1",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "673",
        "title": "Community Mental Health",
        "description": "Prerequisite: Admission to a CSUN master’s degree program in Counseling. Examines theories and skills required in contemporary community mental health settings, including recovery-oriented treatment for severe mental illness, disaster and trauma response, services for victims of abuse and the homeless, foster care, case management, client advocacy, in-home and in-school services, bilingual client services, collaborating with other professionals, medical family therapy, and local community service resources. Provides a practical overview of public and private systems of care, and opportunities to meet with the severely mentally ill and their families.",
        "units": "3",
        "prerequisites": "{Admission to a CSUN master’s degree program in Counseling}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "673MF",
        "title": "Trauma-Informed Community Mental Health",
        "description": "Prerequisite: Admission to CSUN’s master’s program in Marriage and Family Therapy. Theories and skills required in contemporary community mental health settings, including recovery-oriented treatment for severe mental illness, disaster and trauma response, services for victims of abuse and the homeless, foster care, case management, client advocacy, in-home and in-school services, bilingual client services, collaborating with other professionals, medical family therapy, and local community service resources. Emphasis placed on trauma-informed, evidence-based practices. Provides a practical overview of public and private systems of care and opportunities to meet with the severely mentally ill and their families.",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "674MF",
        "title": "Family Development Across the Lifespan",
        "description": "Prerequisite: Admission to CSUN’s master’s program in Marriage and Family Therapy. This course enables students to use information about healthy functioning to help individuals, couples and families reach developmental milestones and effectively transition through stages of individual and family development. Topics covered include family life cycle issues, such as marriage, childbirth, child rearing, parenting, divorce, step-parenting, alternative family forms, aging, long-term care, and end of life and grief counseling. In addition, health, resiliency and wellness models and psychosocial developmental processes are covered, as well as the effects of diversity and socioeconomic issues on individual and family development. Emphasis on evidence-based practices.",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "675",
        "title": "Substance Abuse and Addictions Treatment",
        "description": "Prerequisite: Admission to a CSUN master’s degree program in Counseling. Major approaches for identifying, evaluating, diagnosing and treating persons with alcohol and substance abuse or dependency, co-occurring disorders and behavioral addictions. Topics include the effects of psychoactive drug use, theories of the etiology of addiction, systemic dynamics of alcoholic and substance abusing families, legal requirements, community resources for individual teens, adults and their families, prevention of addiction, harm reduction models, evidence-based models for couple and family treatment, recovery models, peer support models and motivational interviewing.",
        "units": "3",
        "prerequisites": "{Admission to a CSUN master’s degree program in Counseling}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "675MF",
        "title": "Substance Abuse and Addiction Treatment in Family Therapy",
        "description": "Prerequisite: Admission to CSUN’s master’s program in Marriage and Family Therapy. Major approaches for identifying, evaluating, diagnosing, and treating persons with alcohol and substance abuse or dependency, co-occurring disorders, and behavioral addictions in family therapy. Topics include the effects of psychoactive drug use; neurobiology of addiction; theories of the etiology of addiction; systemic dynamics of alcoholic and substance abusing families; legal requirements; community resources for individual teens, adults and their families; prevention of addiction; harm reduction models; evidence-based models for couple and family treatment; recovery models; peer support models; medication-assisted treatment; and motivational interviewing.",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "677MFA",
        "title": "Couples and Sex Therapy",
        "description": "Prerequisites: EPC 670MFA. Admission to CSUN’s master’s program in Marriage and Family Therapy. Advanced theories and techniques for working with couples, including evidence-based treatment, research on successful marriages and divorce, premarital counseling, gay and lesbian couples, psychosexual dysfunction, integrated sex-marital therapy, co-parenting after divorce and multicultural couples. Emphasis on assessing for violence and addressing safety issues with couples experiencing domestic violence.",
        "units": "3",
        "prerequisites": "{EPC 670MFA}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "677MFB",
        "title": "Gender and Sexuality in Marriage and Family Therapy",
        "description": "Prerequisite: Admission to CSUN’s master’s program in Marriage and Family Therapy. Examination of gender and sexuality integrating historical and cultural contexts across the lifespan. Sexuality will be considered from a biopsychosocial developmental perspective. Students will engage in critical self-assessment of knowledge, sensitivity, and attitudes about gender and sexuality as it intersects with race, ethnicity, age, socioeconomic status, sexual orientation, spirituality, ability, etc. Emphasis on systemic, postmodern, and socioculturally attuned frameworks to work with gender and sexuality issues in therapy.",
        "units": "1",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "678",
        "title": "Psychopharmacology and Neurobiological Foundations",
        "description": "Prerequisites: EPC 672; Admission to a CSUN master’s degree program in Counseling. Introduces students to the neurobiological foundations of family therapy, including an overview of sexual dysfunction, interpersonal neurobiology and effects of trauma. Covers biochemical theories of mental disorders and the various classes of psychoactive medications used to treat these disorders across the lifespan. Particular attention given to utilization patterns based on sex, socioeconomic status, ethnicity and other diversity factors. Emphasis on the role of family therapists in the assessment, referral and management of clients being treated with psychotropic medication.",
        "units": "2",
        "prerequisites": "{{EPC 672} && {Admission to a CSUN master’s degree program in Counseling}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "678MF",
        "title": "Psychopharmacology and Neurobiological Foundations in Family Therapy",
        "description": "Prerequisites: EPC 672MFA; Admission to CSUN’s master’s program in Marriage and Family Therapy. This course will introduce students to the neurobiological foundations of family therapy, including biochemical theories of mental disorders and the various classes of psychoactive medications used to treat these disorders across the lifespan. Attention will be given to utilization patterns based on sex, socioeconomic status, ethnicity and other diversity factors. The role of family therapists will be emphasized in the assessment, referral and management of clients being treated with psychotropic medication.",
        "units": "3",
        "prerequisites": "{{EPC 672MFA} && {Admission to CSUN’s master’s program in Marriage and Family Therapy}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "679MF",
        "title": "Clinical and Outcome-Based Assessment",
        "description": "Prerequisite: Admission to CSUN’s master’s program in Marriage and Family Therapy. Corequisite: EPC 659MFD or other approved concurrent fieldwork experience. Introduces students to contemporary and outcome-based assessment in marriage and family therapy. Covers commonly used assessments related to mental health diagnosis, child functioning, couple functioning, family functioning, forensics, client outcome, therapeutic alliance and therapist effectiveness. Emphasis on evidence-based practices and diversity issues. Course requires that students measure client progress and therapeutic alliance in their field settings or approved equivalent.",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{EPC 659MFD or other approved concurrent fieldwork experience}"
    },
    {
        "subject": "EPC",
        "catalog_number": "681",
        "title": "The Counselor’s Role in Special Education in PreK-16 School Settings",
        "description": "Prerequisites: SPED 400; Enrollment restricted to students in Master of Science in Counseling programs in the CSUN Department of Educational Psychology and Counseling. This course is designed to provide PreK-16 counselors with a general introduction to special education as it relates to the counselor. In this course, there will be focus on classification categories, terminology, education laws, counseling assessment, intervention services, and the role and function of the counselor on a school/college campus as part of today’s special education team.",
        "units": "3",
        "prerequisites": "{SPED 400}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "682",
        "title": "Foundations of School Counseling",
        "description": "Overview and introductory program course in school counseling, covering the history of school counseling; academic, personal/social and career development domains of school counseling; state and national standards; the mission and philosophy of the CSUN program; social justice issues, including inequity in education and achievement; model school counseling programs; and current research and trends in the field.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "683",
        "title": "Collaboration with Families in Educational Settings",
        "description": "Prerequisite: EPC 314 or EPC 430 or equivalent course or instructor consent. Principles and practices of collaborating with families in educational settings from infant- and childcare programs through high school. Considerations of attachment, family systems theory, family forms, the role of culture and the ecological perspective, the impact of family on child development and student achievement, and current research.",
        "units": "3",
        "prerequisites": "{{EPC 314} || {EPC 430} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "687",
        "title": "Career Guidance, College Selection and Technology in School Settings",
        "description": "Application of concepts and strategies for providing career/life planning and college-selection services using various aspects of technology. Focus is on the use of objective information in career counseling and college selection. Meets PPS course requirement in Career Education and Counseling.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "690MFC",
        "title": "Advanced Fieldwork and Professional Practice in Family Therapy",
        "description": "Prerequisites: EPC 659MFD; Admission to CSUN’s master’s program in Marriage and Family Therapy. This course supports students in continuing to accrue 75 or more total hours at an established fieldwork placement and prepares students to successfully enter the field upon graduation. Topics covered may include post-degree professional development, vita development, post-degree registration with the state board, post-degree internship/associate placement, license exam preparation, therapist self-care, and career development. May be taken up to four times as needed to complete the degree.",
        "units": "3",
        "prerequisites": "{{EPC 659MFD} && {Admission to CSUN’s master’s program in Marriage and Family Therapy}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "695MF",
        "title": "Seminar in Professional Writing",
        "description": "Prerequisites: Admission to CSUN’s master’s program in Marriage and Family Therapy. The MFT writing seminar course provides students with in-depth review of and support in graduate-level, technical writing skills. In the course, students learn to formulate a thesis or purpose from which to research, organize, structure and deliver ideas and to improve technical writing skills required in the field. This course can be repeated up to four (4) times for credit.",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "695S",
        "title": "Seminar In Selected Studies: Student Personnel",
        "description": "Prerequisite: Graduate standing. Special seminars in selected topics.\n",
        "units": "3",
        "prerequisites": "{Graduate standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "695WC",
        "title": "Seminar In Selected Studies: Grad Writing In Epc",
        "description": "Prerequisite: Graduate standing. Special seminars in selected topics.\n",
        "units": "3",
        "prerequisites": "{Graduate standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "696",
        "title": "Directed Graduate Research",
        "description": "Students are responsible for defining and organizing their own research problems. Reports on research are expected to be made to Department faculty.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "696MF",
        "title": "Directed Research in Family Therapy",
        "description": "Prerequisite: Admission to CSUN’s master’s program in Marriage and Family Therapy. This course provides an opportunity for marriage and family therapy graduate students to research areas of clinical and academic interest. Students conduct their own research project under the direction of department faculty. May be taken three times for credit.",
        "units": "3",
        "prerequisites": "{Admission to CSUN’s master’s program in Marriage and Family Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisite: Candidate must assemble a comprehensive exam committee prior to registration. Advanced studies of comprehensive topics. Taken during final semester of program. See Department Culminating Experience Handbook for information on how to form a committee. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{Candidate must assemble a comprehensive exam committee prior to registration}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "698C",
        "title": "Thesis/Graduate Project",
        "description": "Prerequisite: Candidate must assemble a project/thesis exam committee prior to registration. Develop a thesis or project on an advanced topic in student’s field of specialization. Typically taken during final two semesters of program. See Department Culminating Experience Handbook for information on how to form a committee. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{Candidate must assemble a project/thesis exam committee prior to registration}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "699C",
        "title": "Independent Study",
        "description": "\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]