[
    {
        "subject": "JOUR",
        "catalog_number": "100",
        "title": "Mass Communication",
        "description": "Not open to students with credit in CTVA 100. Survey and analysis of newspapers, books, magazines, radio, television, popular music, movies, advertising, public relations, the Internet and emerging technologies. Examines media history and economics, as well as their roles, rights and impact in contemporary society. Particular emphasis on media literacy, critical thinking, research and writing. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "104",
        "title": "Introduction to Journalism",
        "description": "This first-year seminar introduces the Journalism department’s traditions and expectations, as well as resources and opportunities to help students as they move through the major. Students will meet faculty, get to know campus media operations, clubs and career options and learn about the program’s writing, ethics and other academic standards. (Credit/No Credit only)",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "110",
        "title": "News Reporting I",
        "description": "Prerequisite: Grade of C or better in the lower division writing requirement. Preparatory: Keyboard, typing proficiency. Corequisite: JOUR 110L. Basic news gathering and writing. Includes interviewing, speech/meeting coverage, preparing news copy, and traditional- and electronic-information gathering as applied to news decision making. Introduces ethics as part of developing news judgment and learning the values practiced by professional journalists. 2 hours lecture, 2 hours lab.",
        "units": "2",
        "prerequisites": "{Grade of C or better in the lower division writing requirement}",
        "corequisites": "{JOUR 110L}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "110L",
        "title": "News Reporting I Lab",
        "description": "Prerequisite: Grade of C or better in the lower division writing requirement. Preparatory: Keyboard, typing proficiency. Corequisite: JOUR 110L. Basic news gathering and writing. Includes interviewing, speech/meeting coverage, preparing news copy, and traditional- and electronic-information gathering as applied to news decision making. Introduces ethics as part of developing news judgment and learning the values practiced by professional journalists. 2 hours lecture, 2 hours lab.",
        "units": "0",
        "prerequisites": "{Grade of C or better in the lower division writing requirement}",
        "corequisites": "{JOUR 110}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "210",
        "title": "News Reporting II",
        "description": "Prerequisite: Grade of C or better in JOUR 110/L. Corequisite: JOUR 210L. Continuation of news reporting, with coverage of public affairs beats, including police, courts and government. Writing primarily in print, but also in broadcast news, online news and public relations formats. Ethics emphasized. Off-campus reporting and statistical journalism included. 2 hours lecture, 2 hours lab.",
        "units": "2",
        "prerequisites": "{JOUR 110/L}",
        "corequisites": "{JOUR 210L}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "210L",
        "title": "News Reporting II Lab",
        "description": "Prerequisite: Grade of C or better in JOUR 110/L. Corequisite: JOUR 210L. Continuation of news reporting, with coverage of public affairs beats, including police, courts and government. Writing primarily in print, but also in broadcast news, online news and public relations formats. Ethics emphasized. Off-campus reporting and statistical journalism included. 2 hours lecture, 2 hours lab.",
        "units": "1",
        "prerequisites": "{JOUR 110/L}",
        "corequisites": "{JOUR 210}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "225",
        "title": "Multimedia Storytelling",
        "description": "Prerequisite: Grade of C or better in JOUR 110/L. Recommended Preparatory Courses: JOUR 100, JOUR 250. An introduction to multimedia storytelling and online news production. Techniques for gathering, reporting and producing news using digital and social media. Legal and ethical issues in digital media and other emerging journalistic practices.",
        "units": "3",
        "prerequisites": "{JOUR 110/L}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "250",
        "title": "Visual Communication",
        "description": "Survey of the most significant techniques and examples of visual communication in the mass media, including social media and the Internet, newspapers, magazines, photography, typography, graphic design, animation, television, cinema and advertising. Particular emphasis on critical thinking, visual and cultural literacy, and on the perception of visual media messages and their impact on culture and society. Illustrated lectures and activities.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "255",
        "title": "Introduction to Public Relations",
        "description": "Prerequisite: Grade of C or better in the lower division writing requirement. Practical approach to public relations, including its history, career paths, campaign planning process, theory and methods. Includes concepts of planning and executing effective strategies, integrating message design and distribution.",
        "units": "3",
        "prerequisites": "{Grade of C or better in the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "310",
        "title": "Feature Writing",
        "description": "Prerequisites: Grade of C or better in JOUR 210/L and JOUR 225. Feature reporting and long-form storytelling, including the use of digital media and digital media platforms. Analysis and application of the practice and aesthetics of narrative journalism, the techniques of in-depth reporting, and an emphasis on the newer forms of explanatory storytelling.",
        "units": "3",
        "prerequisites": "{{JOUR 210/L} && {JOUR 225}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "315",
        "title": "Broadcast Reporting",
        "description": "Prerequisites: Grade of C or better in JOUR 210/L and JOUR 225. Broadcast news writing, radio reporting and producing of live and recorded daily newscasts and other programming. Use of digital tools and emerging practices in class and in the KCSN Newsroom. 6 hours of classroom and lab activity.",
        "units": "3",
        "prerequisites": "{{JOUR 210/L} && {JOUR 225}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "325",
        "title": "Multiplatform Storytelling",
        "description": "Prerequisites: Grade of C or better in JOUR 225 and JOUR 250. Students in this advanced digital-media class will learn to produce text, audio, video and social media to create and disseminate digital stories and engage audiences across multiplatforms.",
        "units": "1",
        "prerequisites": "{{JOUR 225} && {JOUR 250}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "335",
        "title": "Writing, Producing and Editing Television News",
        "description": "Prerequisites: Grade of C or better in JOUR 315 and JOUR 325. Television news writing, editing and producing. Developing news judgment, ethics and newsroom skills. Editing and writing to video, anchoring. Students produce weekly newscasts, followed by discussion and critique. 4 hours of classroom and lab activity.",
        "units": "2",
        "prerequisites": "{{JOUR 315} && {JOUR 325}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "341",
        "title": "Writing for Public Relations",
        "description": "Prerequisites: Grade of C or better in JOUR 210/L and JOUR 255. Intensive writing instruction, integrating a variety of public relations techniques using a journalistic tone for a diverse audience.",
        "units": "3",
        "prerequisites": "{{JOUR 210/L} && {JOUR 255}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "350",
        "title": "Photojournalism",
        "description": "Prerequisite: Grade of C or better in JOUR 225; Students are required to have access to a camera and laptop. Technical, aesthetic, ethical and legal aspects of photojournalism. Emphasis on the production of narrative still images, using digital platforms for editing and dissemination.",
        "units": "3",
        "prerequisites": "{{JOUR 225} && {Students are required to have access to a camera and laptop}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "362",
        "title": "Public Relations Campaigns",
        "description": "Prerequisites: JOUR 255 and JOUR 341. Plan, design and implement a comprehensive public relations campaign, including conducting research and evaluating results.",
        "units": "3",
        "prerequisites": "{{JOUR 255} && {JOUR 341}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "365",
        "title": "News Literacy",
        "description": "Prerequisite: Completion of the lower division writing requirement. Recommended Preparatory: JOUR 100. Analysis of news and information. Development of news literacy skills to evaluate sources, bias, opinion, transparency and other attributes. First Amendment, culture of journalism, participatory media and democracy. Regular written assignments required. (Available for General Education, D1 Social Sciences.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "371",
        "title": "Gender and Media",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examines media representation of gender and sexual identity and ways in which the media culture shapes gender roles, expectations, and stereotypes. Particular emphasis on applying critical thinking, research and writing skills to analyze gendered portrayals, policies and practices in television, film, magazines, music, video games, news, advertising, and social media, and to develop strategies that empower gender equality in society. Special attention to historical and contemporary contributions and responsibilities of women media professionals. (Available for General Education, F Comparative Cultural Studies.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "372",
        "title": "Diversity and the Media",
        "description": "Prerequisite: Completion of the lower division writing requirement. Analysis of media portrayals and audience perceptions of racial, ethnic and sociopolitical groups, and the roles and responsibilities of mainstream and specialty media in a democratic society. Particular emphasis on applying critical thinking, research and writing skills to analyze media policies and practices and on developing strategies for multiculturalism. (Available for General Education, F Comparative Cultural Studies.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "374SLJ",
        "title": "Spanish-Language News Environment",
        "description": "The course is a survey of Latino-oriented and Spanish-language news media and of the news coverage of Latinos and Spanish-language communities. The course provides students with a general understanding of contemporary Spanish-speaking and Latino communities. Conducted in English.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "375",
        "title": "Engaging Diverse Communities",
        "description": "Prerequisites: JOUR 210/L and JOUR 225. Engagement and multimedia journalism skills, including in-depth reporting, social media and online surveys. Analysis of demographics, community institutions and social issues, to generate engagement with diverse communities with media. Creation of critically informed, visual representations.",
        "units": "3",
        "prerequisites": "{{JOUR 210/L} && {JOUR 225}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "390",
        "title": "Freedom of the Press",
        "description": "Prerequisite: Completion of the lower division writing requirement. Not available for those with credit in JOUR 400. Designed for non-journalism majors. Legal rights and privileges of the mass media under the Constitution. Censorship and control of the press. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "395B",
        "title": "Broadcast News Practicum",
        "description": "Prerequisites: Grade of C or better in JOUR 315 and JOUR 325. Corequisite: JOUR 395C. Radio and television news reporting and production. Emphasizes the development of professional broadcast skills necessary to work as a team under deadline pressure, and the evolution of ethical news judgment, particularly in choosing news stories and sources. 6 hours of activity per week required.",
        "units": "2",
        "prerequisites": "{{JOUR 315} && {JOUR 325}}",
        "corequisites": "{JOUR 395C}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "395C",
        "title": "Broadcast News",
        "description": "Prerequisites: Grade of C or better in JOUR 315 and JOUR 325. Corequisite: JOUR 395B. Radio and television news reporting and production. Emphasizes the development of professional broadcast skills necessary to work as a team under deadline pressure, including the evolution of ethical news judgment, particularly in choosing news stories and sources. 2 hours lecture.",
        "units": "2",
        "prerequisites": "{{JOUR 315} && {JOUR 325}}",
        "corequisites": "{JOUR 395B}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "397A",
        "title": "Newspaper Practicum",
        "description": "Prerequisite: Grade of C or better in JOUR 310 for writers and reporters and in JOUR 330 for editors. Supervised work on the department daily newspaper. Students work as writers, reporters, photographers and editors. 3 hours of activity per unit per week.",
        "units": "1",
        "prerequisites": "{{JOUR 310 for writers and reporters} && {JOUR 330 for editors}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "397B",
        "title": "News Practicum",
        "description": "Prerequisite: Grade of C or better in JOUR 310 or JOUR 350, and JOUR 325. Corequisite JOUR 397C. Advised work on the department’s student newspaper. Students create content as multimedia journalists for The Sundial digital and print editions. Emphasizes the development of professional journalism skills to work under deadline pressure and employing ethical news judgment, particularly in choosing coverage and sources. 6 hours of activity per week required.",
        "units": "2",
        "prerequisites": "{{{JOUR 310} || {JOUR 350}} && {JOUR 325}}",
        "corequisites": "{JOUR 397C}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "397C",
        "title": "News—The Sundial",
        "description": "Prerequisites: Grade of C or better in JOUR 310 or JOUR 350 and JOUR 325. Corequisite: JOUR 397B. Advised work on the department’s student newspaper. Students create content as multimedia journalists for The Sundial digital and print editions. Emphasizes the development of professional journalism skills to work under deadline pressure and employing ethical news judgment, particularly in choosing coverage and sources. 2 hours lecture.",
        "units": "2",
        "prerequisites": "{{{JOUR 310} || {JOUR 350}} && {JOUR 325}}",
        "corequisites": "{JOUR 397B}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "398B",
        "title": "Public Relations Practicum",
        "description": "Prerequisites: Grade of C or better in JOUR 255 and JOUR 341. Corequisite: JOUR 398C. Hands-on experience for students to conduct professional-level public relations activities on behalf of Agency 398’s nonprofit clients, including social media management, event planning, production of press releases along with other media materials. 6 hours of activity per week required.",
        "units": "2",
        "prerequisites": "{{JOUR 255} && {JOUR 341}}",
        "corequisites": "{JOUR 398C}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "398C",
        "title": "Public Relations—Agency 398",
        "description": "Prerequisites: Grade of C or better in JOUR 255 and JOUR 341. Corequisite: JOUR 398B. Hands-on experience for students to conduct professional-level public relations activities on behalf of Agency 398’s nonprofit clients, including social media management, event planning, production of press releases along with other media materials. 2 hours lecture.",
        "units": "2",
        "prerequisites": "{{JOUR 255} && {JOUR 341}}",
        "corequisites": "{JOUR 398B}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "400",
        "title": "Media Law and Ethics",
        "description": "Prerequisite: Upper division standing required. Not available for students with credit in JOUR 390. Examination of laws and ethics that provide the liberties, rights and responsibilities of the media and others in the digital era. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Upper division standing required}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "410",
        "title": "Investigative Reporting",
        "description": "Prerequisite: Grade of C or better in JOUR 310 or JOUR 315. Researching, reporting, writing and producing investigative stories on societal, governmental and scientific issues for print, broadcast or online media. Ethical issues, problems, traditional techniques and technological approaches to investigative journalism. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{JOUR 310} || {JOUR 315}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "415",
        "title": "Reporting for Television News",
        "description": "Prerequisites: Grade of C or better in JOUR 315 and JOUR 325. Reporting, writing, editing and producing for television news. Fundamentals of television news field reporting, writing, researching, interviewing and editing complete narrative packages. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{JOUR 315} && {JOUR 325}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "430",
        "title": "Public Affairs Journalism",
        "description": "Prerequisite: Grade of C or better in JOUR 315. Advanced journalism students report, write and produce On Point, a weekly news and public affairs multiplatform program that explores diverse current and in-depth topics and issues for a local audience. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{JOUR 315}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "440",
        "title": "Public Relations Management",
        "description": "Prerequisite: Grade of C or better in JOUR 362. One of the most important functions in public relations is the management function. Directs the management of constituents, customers, journalists and media. Includes public relations theory and analysis of historical and contemporary case studies. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{JOUR 362}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "445",
        "title": "Advanced Television News",
        "description": "Prerequisites: Grade of C or better in JOUR 415. Reporting, writing, editing, anchoring and producing television newscasts for airing on cable or television. Students produce weekly newscasts in a professional environment, followed by critique and discussion. Available for graduate credit. 6 hours of classroom and lab activity.",
        "units": "3",
        "prerequisites": "{JOUR 415}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "450",
        "title": "Advanced Photojournalism",
        "description": "Prerequisite: Grade of C or better in JOUR 350. Advanced instruction in the techniques and ethics of photojournalism. Emphasis on reporting and narrative construction for the photojournalist. Includes the production of picture stories, photo essays and the preparation of a professional portfolio. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{JOUR 350}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "455",
        "title": "Documentary Photojournalism",
        "description": "Prerequisites: Grade of C or better in JOUR 350. Production course that guides the student to a discovery and use of the principles of investigation and reporting on a subject in depth. Production of photographic images are supported by a survey of the major journalistic documentary projects in still photography. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{JOUR 350}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "460",
        "title": "Magazine Journalism",
        "description": "Prerequisite: Grade of C or better in JOUR 330. Principles, problems and techniques of magazine editing and design; production of department magazine; and nonfiction article research and writing. Available for graduate credit. 6 hours of scheduled classroom and lab activity required.",
        "units": "3",
        "prerequisites": "{JOUR 330}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "465",
        "title": "Mass Communication and Popular Culture",
        "description": "Study of the social, political and economic influences that shape popular culture and its effects on audiences. Examines media’s roles as storytellers. Particular emphasis on applying critical thinking, research and writing skills to analyze media policies and practices and on developing strategies that empower consumers in the media. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "474SLJ",
        "title": "Spanish-Language Media Writing",
        "description": "Prerequisites: Upper division level of Spanish-language; JOUR 210/L or instructor approval. The course will guide students in the methods and styles of reporting and writing in Spanish for print and broadcast. It will prepare students to take part in the Journalism Department’s media practica. Conducted in Spanish. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{{Upper division level of Spanish-language} && {JOUR 210/L}} || {instructor approval}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "478",
        "title": "International News Media",
        "description": "Study of news media systems and the influence of government, economics, culture and propaganda on international news practices. Examines the role of multinational media organizations. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "480",
        "title": "History of the American News Media",
        "description": "Study of the development and influence of the news media in the U.S. from colonial times to the present. Examines social, economic, cultural, technological and political influences on news media development. Special attention to dominant media personalities. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "491",
        "title": "Media Leadership",
        "description": "Prerequisites: Grade of C or better in JOUR 395B and JOUR 395C; or JOUR 397B and JOUR 397C; or JOUR 398B and JOUR 398C. Newsroom leadership. Students will develop, produce and disseminate content, leading teams and managing workflows between and across the department’s diverse student media platforms. Available for graduate credit. May be repeated once for credit.",
        "units": "3",
        "prerequisites": "{{JOUR 395B} && {JOUR 395C}} || {{JOUR 397B} && {JOUR 397C}} || {{JOUR 398B} && {JOUR 398C}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "494AEE",
        "title": "Internship",
        "description": "Prerequisite: Grade of C or better in JOUR 310 or JOUR 315 or JOUR 341. Supervised employment, field study or on-the-job training in contemporary news media and public relations operations. AEE and BEE must be taken together and the combination can be taken only once. Available for graduate credit. (Credit/No Credit only)",
        "units": "1",
        "prerequisites": "{{JOUR 310} || {JOUR 315} || {JOUR 341}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "495DME",
        "title": "Selected Topics In Journalism: Digital Media Entrepreneurship",
        "description": "Prerequisites: Grade ofC or better in JOUR 310 or 315. Advanced research writing and reporting of selected journalistic styles and/or subject matter. Ethical issues problems traditional techniques and technological approaches are integral segments of each selected topic. Subject content will change from semester to semester.\n",
        "units": "3",
        "prerequisites": "{{JOUR 310} || {JOUR 315}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "495LF",
        "title": "Selected Topics In Journalism: Long Form Journalism",
        "description": "Prerequisites: Grade ofC or better in JOUR 310 or 315. Advanced research writing and reporting of selected journalistic styles and/or subject matter. Ethical issues problems traditional techniques and technological approaches are integral segments of each selected topic. Subject content will change from semester to semester.\n",
        "units": "3",
        "prerequisites": "{{JOUR 310} || {JOUR 315}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "495SLT",
        "title": "Selected Topics In Journalism: Spanish Language Television",
        "description": "Prerequisites: Grade ofC or better in JOUR 310 or 315. Advanced research writing and reporting of selected journalistic styles and/or subject matter. Ethical issues problems traditional techniques and technological approaches are integral segments of each selected topic. Subject content will change from semester to semester.\n",
        "units": "3",
        "prerequisites": "{{JOUR 310} || {JOUR 315}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "498",
        "title": "Senior Project",
        "description": "Prerequisite: Graduating senior standing. Capstone course for Journalism majors, usually taken the final semester before graduation. Individual, supervised study in selected areas of students’ interest, resulting in completion of a capstone portfolio project.",
        "units": "1",
        "prerequisites": "{Graduating senior standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "585",
        "title": "Theory of Mass Communication",
        "description": "Prerequisite: Senior or graduate status. Extended analysis of the theories which inform the study of mass communication. The course focus is on contemporary theories but is grounded in a historical understanding of the development of theory in the field.",
        "units": "3",
        "prerequisites": "{Senior or graduate status}",
        "corequisites": "{None}"
    }
]