[
    {
        "subject": "POLS",
        "catalog_number": "155",
        "title": "American Political Institutions",
        "description": "Examination of the development and dynamics of American political institutions and political processes including a special emphasis on the role of minority groups. (Available for General Education, D3/D4 Constitution of the United States/State and Local Government.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "156",
        "title": "Introduction to Comparative Politics",
        "description": "Introduction to the comparative study of government and politics. Its purpose is to familiarize students with the basic themes, concepts and theoretical approaches that are used by political scientists to explain governmental institutions and political processes in different regions of the world. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "197",
        "title": "Racial and Ethnic Politics",
        "description": "Examination of the problems and politics of racial and national subgroups in America. Focuses on problems of ethnic identity, inequality and discrimination, and the impact of minority group politics on public policy. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "225",
        "title": "Elements of International Relations",
        "description": "Analysis of the basic historical, geographical, economic, ideological and strategic factors that underlie and condition conflict and cooperation among actors in the contemporary international system. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "310",
        "title": "Problems of Political Economy",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of the interaction of politics and economics in selected problem areas involving global, national and urban political-economic systems. The political role of global corporations and the political dimensions of trade, taxation and budgeting are considered. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "321",
        "title": "Comparative Political Ideologies",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examines, compares and contrasts a range of political ideologies and their interpretation and application in contemporary societies. Attention is paid to defining the role and function of ideologies in specific contemporary states. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "332",
        "title": "Politics of Latin America",
        "description": "Prerequisite: Completion of the lower division writing requirement. Introductory study of the politics of Latin America. Topics treated include dependency theory, revolution, the national security state, women in politics, theologies of liberation and redemocratization. Selected nations are used as case studies. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "347",
        "title": "The Judicial Process",
        "description": "Examination of the dynamics of the national and state judicial systems, with emphasis on the workings of the Supreme Court within American separation of powers; internal procedures of decision making; external influences on the courts; the politics of selecting judges; and relations with other political institutions.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "350",
        "title": "Great Questions in Politics",
        "description": "Prerequisite: Completion of the lower division writing requirement. Analysis of perennial political questions about power, authority, justice, equality and freedom. Materials include political and literary writings, films, case studies and legal cases. Aims throughout to relate these questions to contemporary political situations. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "355",
        "title": "American National, State and Local Governments",
        "description": "Prerequisite: Not open to students who have taken POLS 155; Completion of the lower division writing requirement. Detailed study of the structures and functions of the national government, and California state and local governments. Special attention given to the legislative and executive branches in the policy-making and administrative processes, as well as the constitutional bases for these processes. (Available for General Education, D3/D4 Constitution of the United States/State and Local Government.)",
        "units": "3",
        "prerequisites": "{{Not open to students who have taken POLS 155} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "360",
        "title": "Public Administration",
        "description": "Analysis of the executive function in governmental processes together with a survey of the principles of administrative organization, personnel management, financial administration and public relations. Problems and trends in government service as a career are discussed.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "361",
        "title": "Introduction to Public Policy",
        "description": "Introduction to public policy approaches, contexts, processes and outcomes.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "372",
        "title": "Principles and Methods of Political Science",
        "description": "Study of the history, nature and current development of research in politics.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "380",
        "title": "Los Angeles: Past, Present, Future",
        "description": "Prerequisite: Completion of the lower division writing requirement. Multidisciplinary investigation of the Los Angeles urban area–its patterns of population and resources distribution; its historical, economic, social and cultural developments; and policies models designed to cope with its problems and to develop its potential as an ethnically diverse metropolis on the Pacific Rim. Application of social science methodology. Series of faculty and guest speakers, weekly discussion sessions and field trips. (Cross-listed with HIST 380 and URBS 380.) (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "403",
        "title": "State and Local Government",
        "description": "Study of the political, administrative, and judicial systems of states, counties, cities, and special districts. Intergovernmental relations, functions, trends and current problems. Available for graduate credit. (Available for General Education, D4 California State and Local Government.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "404",
        "title": "Urban Politics",
        "description": "Study of the structures and processes that determine public priorities and programs in urban areas. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "405",
        "title": "Policy Framing and Agenda Setting",
        "description": "Preparatory: At least one upper division course in public administration or American government. The allocation of attention within government precedes actionable policy decisions, but this process is often overlooked in the study of public policy. This course examines how the images, ideas, and rhetoric attached to societal problems dictate whether government chooses to address these issues. Topics covered in the course include: biases in political agendas, the framing of societal problems, individual-level attention and decision making, and theories of agenda setting and agenda change. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "406",
        "title": "Analyzing Policy Problems",
        "description": "Prerequisite: POLS 372. Policymakers and advocates often use predictions of future policy outcomes and societal trends to identify issues government should address. This course serves as an introduction to the fundamental skills of policy analysis and to the difficult choices governments make when identifying, analyzing, and addressing policy problems. Students will develop a conceptual and practical toolkit to analyze public problems, offer policy solutions, and communicate arguments about government action. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{POLS 372}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "407",
        "title": "Policy Implementation and Program Evaluation",
        "description": "Prerequisite: POLS 372. Overview of policy implementation and program evaluation by looking at the strategies, techniques and tools used most frequently by policy makers and evaluators. Students are introduced to the major theories and applications so as to be able to use the techniques of evaluation to assess projects and programs in terms of impact, process and cost. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{POLS 372}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "410",
        "title": "Advanced Comparative Politics",
        "description": "Recommended Preparatory: POLS 156. An advanced study of comparative politics. This course focuses on major theoretical frameworks, concepts and approaches in the field. Key concepts covered include the state, democratization, modernization, political culture, social movements and underdevelopment. The course is designed to help students investigate world phenomena systematically and theoretically. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "411",
        "title": "Greek, Roman, and Medieval Political Theory",
        "description": "Analysis of the major political theories and ideologies from the sophists, Plato and Aristotle through the epicureans, cynics, stoics, Cicero, St. Augustine and Thomas Aquinas.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "412",
        "title": "Modern Western Political Theory",
        "description": "Analysis of the major political theories and ideologies from Machiavelli and the Renaissance through Hobbes, Locke, the Enlightenment, Rousseau, Burke and Marx. Regular written assignments required.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "413",
        "title": "American Political Thought",
        "description": "American political ideologies from the colonial period through the Revolution and the period of the Constitution to the end of the 19th century.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "414",
        "title": "Western Political Theory in the 20th Century",
        "description": "Study of major contemporary theories in Western Europe and the U.S. Included are such theorists as Sarte, Camus, Easton, Lasswell, Dewey, McLuhan, Marcuse and Fanon, among other existentialists, behavioralists, Marxists and structuralists.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "420A",
        "title": "International Relations of Selected Areas",
        "description": "Intensive study of the international relations and impact on the world of nations or areas of special interest that are not included in other courses. Available for graduate credit.\nCourse Title\nPOLS 420A Latin America\nPOLS 420C Eastern Europe\nPOLS 420D Middle East\nPOLS 420H Northeast Asia",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "420B",
        "title": "International Relations Of Selected Areas: Western Europe",
        "description": "Intensive study of the international relations and impact on the world of nations or areas of special interest that are not included in other courses: (A) Latin America (B) Western Europe (C) Eastern Europe (D) Middle East (E) Africa (F) South Asia (G) Southeast Asia and (H) Northeast Asia\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "420C",
        "title": "International Relations Of Selected Areas: Eastern Europe",
        "description": "Intensive study of the international relations and impact on the world of nations or areas of special interest that are not included in other courses: (A) Latin America (B) Western Europe (C) Eastern Europe (D) Middle East (E) Africa (F) South Asia (G) Southeast Asia and (H) Northeast Asia\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "420D",
        "title": "International Relations Of Selected Areas: Middle East",
        "description": "Intensive study of the international relations and impact on the world of nations or areas of special interest that are not included in other courses: (A) Latin America (B) Western Europe (C) Eastern Europe (D) Middle East (E) Africa (F) South Asia (G) Southeast Asia and (H) Northeast Asia\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "420E",
        "title": "International Relations Of Selected Areas: Africa",
        "description": "Intensive study of the international relations and impact on the world of nations or areas of special interest that are not included in other courses: (A) Latin America (B) Western Europe (C) Eastern Europe (D) Middle East (E) Africa (F) South Asia (G) Southeast Asia and (H) Northeast Asia\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "420F",
        "title": "International Relations Of Selected Areas: South Asia",
        "description": "Intensive study of the international relations and impact on the world of nations or areas of special interest that are not included in other courses: (A) Latin America (B) Western Europe (C) Eastern Europe (D) Middle East (E) Africa (F) South Asia (G) Southeast Asia and (H) Northeast Asia\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "420G",
        "title": "International Relations Of Selected Areas: Southeast Asia",
        "description": "Intensive study of the international relations and impact on the world of nations or areas of special interest that are not included in other courses: (A) Latin America (B) Western Europe (C) Eastern Europe (D) Middle East (E) Africa (F) South Asia (G) Southeast Asia and (H) Northeast Asia\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "420H",
        "title": "International Relations Of Selected Areas: Northeast Asia",
        "description": "Intensive study of the international relations and impact on the world of nations or areas of special interest that are not included in other courses: (A) Latin America (B) Western Europe (C) Eastern Europe (D) Middle East (E) Africa (F) South Asia (G) Southeast Asia and (H) Northeast Asia\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "421",
        "title": "The Politics of Development",
        "description": "Examination and critical analysis of the problems, both internal and international, of countries that are undergoing political and economic modernization. Specific issue areas covered include human rights, the global economy, women in the global workplace, poverty and world hunger, environmental degradation and militarism. Selected countries are studied to determine historical trends in specific issue areas. Extensive examination of the paths and obstacles to world peace. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "422",
        "title": "International Politics",
        "description": "Advanced study of international politics from the standpoint of theories of international politics, individual, group and state behavior; the relation between continuity, conflict and change in the international order; and an extensive examination of the paths and obstacles to world peace. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "423",
        "title": "Security Studies",
        "description": "An analysis of security issues as they affect the nation-state. The course explores the actors, institutions and decision-making processes involved in the historical and contemporary development of defense policy. Various theoretical models will be utilized to assess issues of bargaining, mediation, war prevention and grand strategy doctrines. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "426",
        "title": "International Law",
        "description": "Case studies of legal precedents affecting the regulation of the international community, together with an evaluation of the efficacy of international judicial sanctions. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "427A",
        "title": "Model United Nations",
        "description": "Prerequisite: Instructor consent. Corequisite: POLS 427AL. Begins with a general analysis of the role of the U.N. in world politics and comparative foreign policy. Particular emphasis is then placed on the foreign policy of the country to be represented and the internal and external factors on which that policy is based. Seminar format with group presentations and simulations. Course may be repeated for up to 12 units but only 6 units may count in the major.",
        "units": "3",
        "prerequisites": "{Instructor consent}",
        "corequisites": "{POLS 427AL}"
    },
    {
        "subject": "POLS",
        "catalog_number": "427AL",
        "title": "Model United Nations Lab",
        "description": "Prerequisite: Instructor consent. Corequisite: POLS 427AL. Begins with a general analysis of the role of the U.N. in world politics and comparative foreign policy. Particular emphasis is then placed on the foreign policy of the country to be represented and the internal and external factors on which that policy is based. Seminar format with group presentations and simulations. Course may be repeated for up to 12 units but only 6 units may count in the major.",
        "units": "2",
        "prerequisites": "{Instructor consent}",
        "corequisites": "{POLS 427A}"
    },
    {
        "subject": "POLS",
        "catalog_number": "428",
        "title": "International Organization",
        "description": "Analysis of the roles of various types of international organizations in contemporary world politics. Focus is on the United Nations, specialized (functional) agencies, regional organizations and non-governmental organizations such as multinational corporations, foundations and other “transnationals.” Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "429",
        "title": "United States Foreign Policy",
        "description": "Analysis of the contemporary declaratory and action policies pursued by the U.S. in the conduct of its foreign relations. Various conceptual models such as ends/means analysis, decision making and economic determinist are tested and evaluated in terms of their descriptive, analytical and predictive utility. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "432A",
        "title": "Politics of Mexico",
        "description": "Prerequisite: POLS 156 or POLS 225 or instructor’s permission. Study of the genesis and development of Mexico’s political system. Examines the different interpretations of the Mexican political system and provides the background of the development of the modern Mexican state. Special emphasis in the challenges of contemporary Mexican politics, including the rising participation of civil society, the evolution of the political institutions and processes and the political impact of globalization and neoliberalism. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{POLS 156} || {POLS 225} || {instructor permission}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "432B",
        "title": "Governments And Politics Of South America",
        "description": "General survey of the political structures of the South American states with particular emphasis on Argentina Brazil Chile and Uruguay; institutional and non-institutional means of organizing political power; and contemporary political trends within the region.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "433A",
        "title": "The Politics of Central America",
        "description": "Study of the politics of Central America emphasizing current socioeconomic and political crises and U.S. involvement in those crises. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "434A",
        "title": "Government And Politics Of South Asia",
        "description": "Study of contemporary problems political organization and governmental institutions of India Bangladesh Pakistan Afghanistan Nepal and Sri Lanka. Special attention paid to the development of nationalism and the process of modernization in the region.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "434B",
        "title": "Government And Politics Of Southeast Asia",
        "description": "Comparative analysis of political processes political change and major national problems (i.e. poverty population foreign economic penetration) in selected Southeast Asian states\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "435A",
        "title": "Government and Politics of China",
        "description": "Analysis of the Peoples Republic of China, including its ideology, revolutionary origin, party organization, central and local government, role of the military, mass participation, economic modernization, cultural policies and foreign policy. Changes from the Maoist to the post-Mao period will be emphasized. The question of Taiwan will be discussed. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "435B",
        "title": "Government And Politics Of Japan",
        "description": "Analysis of continuity and change in political economy society and culture; state institutions political power and political issues; political competition; and key national issues policies and their outcomes.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "436A",
        "title": "Government and Politics of Europe",
        "description": "Comparative analysis of recent and contemporary European politics, focusing on the political, economic and social structures that have shaped European affairs since the end of World War II. Emphasis on the role played by the modern state, the interstate system, nationalism and the world economy in shaping postwar European politics. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "438",
        "title": "Governments and Politics of the Middle East",
        "description": "Study of contemporary social and political movements, governmental institutions and politics of the Arab states, Israel and Iran. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "439A",
        "title": "Government and Politics of Sub-Saharan Africa",
        "description": "Study of the national governments, emerging political patterns and problems of new states of West and East Africa. Study includes an overview of traditional societies and the politics of cultural sub-nationalism. Major focus on contemporary nationalism, modernization and ideological developments, and on single-party, military and other political structures. Seminar format with individual presentations. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "440",
        "title": "American Political Parties and Politics",
        "description": "Study of the rise of American political parties, their structure, operation, control and political leadership. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "441",
        "title": "Interest Groups",
        "description": "Study of the tactics and aims of interest groups in their efforts to mold public opinion and to influence legislators, executives, judges and administrators. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "441A",
        "title": "Latina/o Politics",
        "description": "This course examines how Latina/os engage the U.S. political system both at the elite and the mass level. It will also examine how political science understands both intra- and inter-group politics in the context of the evolving power of Latina/os in the United States. Students will explore politicized group identity and formation, political incorporation, political participation, party affiliation, voting behavior, and issues of representation and diversity in democratic institutions. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "443",
        "title": "Congress and The Legislative Process",
        "description": "This course covers the historical origins, development, and contemporary politics of the United States Congress and, to some extent, other American legislatures (state and local). The course examines the tension between Congress’ representational and policymaking functions, the details of the lawmaking process, and the way in which the Congress interacts with other political institutions. Students will gain an understanding of the process by which ideas make their way onto the political agenda, and eventually become (or fail to become) law, with a particular focus on how recent changes in Congress affect policymaking in the 21st century. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "444",
        "title": "Elections and Voting Behavior",
        "description": "Study of the electoral process in the U.S., presented in terms of the history of elections, election and campaign techniques, and patterns of voting behavior. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "445",
        "title": "Political Behavior",
        "description": "Introduction to political behavior; the influences of culture, ideology and social structure on political life; group influences on political behavior and major factors in leadership; and psychological bases of participation in normal and extreme politics. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "446",
        "title": "The Presidency",
        "description": "The course will cover the historical origins, development, and contemporary politics of the American presidency. The course will examine the president’s place in the American constitutional framework, the historical development of the presidency, and the development of the presidential selection system. Students will learn about sources of presidential power, explanations for variation in presidential power, the organization of the modern institutionalized presidency, and the president’s relationship with other institutions. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "447A",
        "title": "Media and Politics",
        "description": "The focus of this course is a reconciliation of common perceptions of media influence on public opinion, elections and policy making with empirical evidence of media effects on these components of the political system. The term “media” will be defined through its organization and workings that includes print, broadcast and Internet sources. Students will learn to become more critical consumers of media information and contemplate the role of the media in a democracy. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "448",
        "title": "Women and Politics in the United States and the World",
        "description": "Examines feminist theories and public policies as they shape the various political possibilities and strategies for women in the U.S. and in other selected countries. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "449",
        "title": "DC Politics, Culture, and History",
        "description": "Prerequisite: Admission to and satisfactory standing in the CSUN in DC Internship Program. Students will learn about the politics, history and culture of Washington, D.C. by living in and experiencing the city through activities, walking tours and attendance at events throughout the city. Among potential activities, students will visit museums, participate in walking tours, attend congressional hearings and attend concerts. Students will share their experience in digital diaries, in seminar discussions and in papers. This course is restricted to students participating in the CSUN in DC Internship Program. Available for graduate credit.\nVisit the CSUN in DC Internship Program website for more information.",
        "units": "3",
        "prerequisites": "{Admission to and satisfactory standing in the CSUN in DC Internship Program}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "450",
        "title": "Jurisprudence",
        "description": "Critical survey of the modern schools of jurisprudence and their treatment of law and such legal concepts and problems as obligation, responsibility, punishment and the limits and purposes of law. The works of students of jurisprudence or legal philosophy are supplemented with descriptive accounts of the nature and operation of modern legal systems. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "455",
        "title": "Criminal Procedures",
        "description": "Critical examination of the law and practices of the criminal process. Emphasis on the major problems involved in pretrial procedures. These include search and seizure, self-incrimination, bail, plea bargaining and the enforcement of constitutional rights. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "457A",
        "title": "Constitutional Law I",
        "description": "General principles of federal and state constitutional law, the powers of the national government and federal-state relations. Study of the leading decisions of the U.S. Supreme Court. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "457B",
        "title": "Constitutional Law II",
        "description": "Limitations on the national government and the scope of constitutional rights and liberties. Study of the leading decisions of the U.S. Supreme Court. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "460",
        "title": "Welfare State",
        "description": "Introduction to the development of welfare policy and the evolution of the welfare state in Western industrialized nations by inquiring into the philosophical and political debates surrounding social policy and its implementation.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "461",
        "title": "Environmental Policy",
        "description": "Study and evaluation of the political process governing the making of environmental policy. Specific issues covered include energy policy, land use, air and water pollution, and hazardous and toxic waste disposal. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "462",
        "title": "Ethics in Politics and Administration",
        "description": "Examination of the various kinds of ethical problems faced by elected and non-elected government personnel. Focus is on the scope and limits of individual responsibility in the practice of politics and the management of public organizations. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "464",
        "title": "Comparative Public Policy",
        "description": "Examines why different nations formulate and implement different public policies for similar problems. Systematic and critical approach to understanding the effect of ideological orientations, political institutions and governmental processes on the public policies of modern states. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "465",
        "title": "Administrative Behavior",
        "description": "Analysis of classic theories and case studies in administrative behavior; relations of organizational structure and personality types; and survey of approaches to rationality in decision making through study of the factors influencing administrative choices. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "466",
        "title": "The Politics of Public Spending",
        "description": "Critical analysis of how government financial policies are formulated and controlled within a setting of conflicting views and interests. Examines the influence of the system of checks and balances: the effects of cooperation between chief executives, administrators, budget bureaus, legislators, pressure groups and the general public; and the impact of government spending on the private economy. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "467",
        "title": "Urban Administration",
        "description": "Analysis of public executives, including mayors, city managers and chief administrative officers, and their relationships to the structures of urban government and the public priorities and programs of urban areas. Focus includes the executive’s relationships with the formal structures, councils, civil servants, budgets, political parties, interest groups, independent agencies, the media and other levels of governments. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "471A",
        "title": "Proseminar",
        "description": "Prerequisites: POLS 372; Intended for seniors only (juniors require instructor consent). Advanced research in a subfield in political science. Available for graduate credit.\nCourse Title\nPOLS 471A American Government\nPOLS 471B Comparative Government\nPOLS 471C International Relations\nPOLS 471D Political Theory\nPOLS 471E Public Administration and Pubic Policy\nPOLS 471F Public Law",
        "units": "3",
        "prerequisites": "{{POLS 372} && {Intended for seniors only (juniors require instructor consent)}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "471B",
        "title": "Proseminar: Comparative Government",
        "description": "Prerequisites: POLS 372; Intended for seniors only (juniors require instructor consent). Advanced research in a subfield in political science. (A) American Government (B) Comparative Government (C) International Relations (D) Political Theory (E) Public Administration and Public Policy and (F) Public Law.\n",
        "units": "3",
        "prerequisites": "{{POLS 372} && {Intended for seniors only (juniors require instructor consent)}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "471C",
        "title": "Proseminar: International Relations",
        "description": "Prerequisites: POLS 372; Intended for seniors only (juniors require instructor consent). Advanced research in a subfield in political science. (A) American Government (B) Comparative Government (C) International Relations (D) Political Theory (E) Public Administration and Public Policy and (F) Public Law.\n",
        "units": "3",
        "prerequisites": "{{POLS 372} && {Intended for seniors only (juniors require instructor consent)}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "471D",
        "title": "Proseminar: Political Theory",
        "description": "Prerequisites: POLS 372; Intended for seniors only (juniors require instructor consent). Advanced research in a subfield in political science. (A) American Government (B) Comparative Government (C) International Relations (D) Political Theory (E) Public Administration and Public Policy and (F) Public Law.\n",
        "units": "3",
        "prerequisites": "{{POLS 372} && {Intended for seniors only (juniors require instructor consent)}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "471E",
        "title": "Proseminar: Public Administration And Public Policy",
        "description": "Prerequisites: POLS 372; Intended for seniors only (juniors require instructor consent). Advanced research in a subfield in political science. (A) American Government (B) Comparative Government (C) International Relations (D) Political Theory (E) Public Administration and Public Policy and (F) Public Law.\n",
        "units": "3",
        "prerequisites": "{{POLS 372} && {Intended for seniors only (juniors require instructor consent)}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "471F",
        "title": "Proseminar: Public Law",
        "description": "Prerequisites: POLS 372; Intended for seniors only (juniors require instructor consent). Advanced research in a subfield in political science. (A) American Government (B) Comparative Government (C) International Relations (D) Political Theory (E) Public Administration and Public Policy and (F) Public Law.\n",
        "units": "3",
        "prerequisites": "{{POLS 372} && {Intended for seniors only (juniors require instructor consent)}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "480",
        "title": "The Politics of Globalization",
        "description": "Prerequisite: Upper division standing. Introduction to some of the major changes that have accompanied the processes of globalization during the last 30 years, including identifying and addressing the positive and negative consequences of these changes. Discussion of different approaches to globalization; its technical and historical roots; and the economic, political, ethical and cultural consequences of globalization. The case of NAFTA and its three members—Canada, the U.S. and Mexico—serves as a case study on which the class focuses to understand how the general trends of globalization take shape in a particular region. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Upper division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "481",
        "title": "Globalization, Gender and Democratization",
        "description": "Prerequisite: Upper division standing. Concerned with three major phenomena of the modern world—globalization, democratization and feminization, as well as their interrelationships and their impacts on gender regimes (or gender relationships) in various parts of the world. Incorporates gender analysis into a critical study of the processes of globalization and democratization. Identifies a number of gender regimes in the world and explores the economic, political and interpersonal practices (including globalization) that contribute to their stability or ability to change in various institutions. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Upper division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "490CA",
        "title": "Supervised Individual Project—California Government",
        "description": "Prerequisite: Instructor consent. Individual, supervised studies in California government.(Available for General Education, D4 California State and Local Government.)",
        "units": "1",
        "prerequisites": "{Instructor consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "494I",
        "title": "Political Science Internship",
        "description": "Prerequisite: Instructor consent. Corequisite: POLS 494IA. Approximately 120 hours of supervised fieldwork required. Students complete learning contracts and submit written reports related to their internships. Students will meet as a seminar group with a faculty member during the semester. Available for graduate credit. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{Instructor consent}",
        "corequisites": "{POLS 494IA}"
    },
    {
        "subject": "POLS",
        "catalog_number": "494IA",
        "title": "Political Science Internship",
        "description": "Prerequisite: Instructor consent. Corequisite: POLS 494IA. Approximately 120 hours of supervised fieldwork required. Students complete learning contracts and submit written reports related to their internships. Students will meet as a seminar group with a faculty member during the semester. Available for graduate credit. (Credit/No Credit only)",
        "units": "2",
        "prerequisites": "{Instructor consent}",
        "corequisites": "{POLS 494IA}"
    },
    {
        "subject": "POLS",
        "catalog_number": "494J",
        "title": "Judicial Internship",
        "description": "Prerequisite: Instructor consent. Corequisite POLS 494JA. Students are assigned to a Superior Court judge to observe the inner workings of the Los Angeles County Superior Court. Through observation of trials, settlement conferences, plea bargains and preliminary hearings, students develop a familiarity with the processes of the judicial system and the issues facing the legal system. Available for graduate credit. (Credit/No Credit only)",
        "units": "1",
        "prerequisites": "{Instructor consent}",
        "corequisites": "{POLS 494JA}"
    },
    {
        "subject": "POLS",
        "catalog_number": "494JA",
        "title": "Judicial Internship",
        "description": "Prerequisite: Instructor consent. Corequisite POLS 494JA. Students are assigned to a Superior Court judge to observe the inner workings of the Los Angeles County Superior Court. Through observation of trials, settlement conferences, plea bargains and preliminary hearings, students develop a familiarity with the processes of the judicial system and the issues facing the legal system. Available for graduate credit. (Credit/No Credit only)",
        "units": "2",
        "prerequisites": "{Instructor consent}",
        "corequisites": "{POLS 494JA}"
    },
    {
        "subject": "POLS",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Prerequisite: Instructor consent. Does not carry credit for the master’s degree.",
        "units": "1",
        "prerequisites": "{Instructor consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "522A",
        "title": "Seminar in International Relations",
        "description": "Prerequisite: Classified graduate status or instructor consent. Inquiry into major contemporary theories in international relations, including treatment of the problems of theory building and testing.\nCourse Title\nPOLS 522A Theory and Methodology\nPOLS 522C International Organizations\nPOLS 522D Comparative Foreign Policies\nPOLS 522F International Relations of Selected Areas\nPOLS 522G Selected Topics",
        "units": "3",
        "prerequisites": "{{Classified graduate status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "530A",
        "title": "Seminar in Comparative Government",
        "description": "Prerequisite: Classified graduate status or instructor consent. Inquiry into major contemporary theories in comparative government relations, including treatment of the problems of theory and the study of selected areas.\nCourse Title\nPOLS 530A Democratization\nPOLS 530D Western Europe\nPOLS 530H Latin America\nPOLS 530J Selected Areas",
        "units": "3",
        "prerequisites": "{{Classified graduate status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "530D",
        "title": "Seminar In Comparative Government: Western Europe",
        "description": "Prerequisite: Classified graduate status or instructor consent. Inquiry into major contemporary theories in Comparative Government relations including treatment of the problems of theory and the study of selected areas. (A) Democratization (B) Theory and Methodology (C) Development (D) Western Europe  (E) East Central Europe (F) Middle East (G) East Asia (H) Latin America (I) Africa and (J) Selected Areas.\n",
        "units": "3",
        "prerequisites": "{{Classified graduate status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "530E",
        "title": "Seminar In Comparative Government: East Central Europe",
        "description": "Prerequisite: Classified graduate status or instructor consent. Inquiry into major contemporary theories in Comparative Government relations including treatment of the problems of theory and the study of selected areas. (A) Democratization (B) Theory and Methodology (C) Development (D) Western Europe  (E) East Central Europe (F) Middle East (G) East Asia (H) Latin America (I) Africa and (J) Selected Areas.\n",
        "units": "3",
        "prerequisites": "{{Classified graduate status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "530H",
        "title": "Seminar In Comparative Government: Latin America",
        "description": "Prerequisite: Classified graduate status or instructor consent. Inquiry into major contemporary theories in Comparative Government relations including treatment of the problems of theory and the study of selected areas. (A) Democratization (B) Theory and Methodology (C) Development (D) Western Europe  (E) East Central Europe (F) Middle East (G) East Asia (H) Latin America (I) Africa and (J) Selected Areas.\n",
        "units": "3",
        "prerequisites": "{{Classified graduate status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "530I",
        "title": "Seminar In Comparative Government: Africa",
        "description": "Prerequisite: Classified graduate status or instructor consent. Inquiry into major contemporary theories in Comparative Government relations including treatment of the problems of theory and the study of selected areas. (A) Democratization (B) Theory and Methodology (C) Development (D) Western Europe  (E) East Central Europe (F) Middle East (G) East Asia (H) Latin America (I) Africa and (J) Selected Areas.\n",
        "units": "3",
        "prerequisites": "{{Classified graduate status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "530J",
        "title": "Seminar In Comparative Government: Selected Areas",
        "description": "Prerequisite: Classified graduate status or instructor consent. Inquiry into major contemporary theories in Comparative Government relations including treatment of the problems of theory and the study of selected areas. (A) Democratization (B) Theory and Methodology (C) Development (D) Western Europe  (E) East Central Europe (F) Middle East (G) East Asia (H) Latin America (I) Africa and (J) Selected Areas.\n",
        "units": "3",
        "prerequisites": "{{Classified graduate status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "540B",
        "title": "Seminar in American Government and Politics",
        "description": "Prerequisite: Classified graduate status or instructor consent. Inquiry into major contemporary theories in American government including treatment of the problems of theory, law, institutions and political behavior.\nCourse Title\nPOLS 540B Behavior\nPOLS 540E Institutions\nPOLS 540F Policy\nPOLS 540G State and Local Government\nPOLS 540H Municipal Government\nPOLS 540J Selected Topics",
        "units": "3",
        "prerequisites": "{{Classified graduate status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "540C",
        "title": "Seminar In American Government And Politics: Parties And Interest Groups",
        "description": "Prerequisite: Classified graduate status or instructor consent. Inquiry into major contemporary theories in American government including treatment of the problems of theory law institutions and political behavior. (A) Political Thought (B) Behavior (C) Parties and Interest Groups (D) Public Law (E) Institutions (F) Policy (G) State and Local Government (H) Municipal Government (I) Media and (J) Selected Topics.\n",
        "units": "3",
        "prerequisites": "{{Classified graduate status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "540E",
        "title": "Seminar In American Government And Politics: Institutions",
        "description": "Prerequisite: Classified graduate status or instructor consent. Inquiry into major contemporary theories in American government including treatment of the problems of theory law institutions and political behavior. (A) Political Thought (B) Behavior (C) Parties and Interest Groups (D) Public Law (E) Institutions (F) Policy (G) State and Local Government (H) Municipal Government (I) Media and (J) Selected Topics.\n",
        "units": "3",
        "prerequisites": "{{Classified graduate status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "540F",
        "title": "Seminar In American Government And Politics: Policy",
        "description": "Prerequisite: Classified graduate status or instructor consent. Inquiry into major contemporary theories in American government including treatment of the problems of theory law institutions and political behavior. (A) Political Thought (B) Behavior (C) Parties and Interest Groups (D) Public Law (E) Institutions (F) Policy (G) State and Local Government (H) Municipal Government (I) Media and (J) Selected Topics.\n",
        "units": "3",
        "prerequisites": "{{Classified graduate status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "540G",
        "title": "Seminar In American Government And Politics: State And Local Government",
        "description": "Prerequisite: Classified graduate status or instructor consent. Inquiry into major contemporary theories in American government including treatment of the problems of theory law institutions and political behavior. (A) Political Thought (B) Behavior (C) Parties and Interest Groups (D) Public Law (E) Institutions (F) Policy (G) State and Local Government (H) Municipal Government (I) Media and (J) Selected Topics.\n",
        "units": "3",
        "prerequisites": "{{Classified graduate status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "540H",
        "title": "Seminar In American Government And Politics: Municipal Government",
        "description": "Prerequisite: Classified graduate status or instructor consent. Inquiry into major contemporary theories in American government including treatment of the problems of theory law institutions and political behavior. (A) Political Thought (B) Behavior (C) Parties and Interest Groups (D) Public Law (E) Institutions (F) Policy (G) State and Local Government (H) Municipal Government (I) Media and (J) Selected Topics.\n",
        "units": "3",
        "prerequisites": "{{Classified graduate status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "540J",
        "title": "Seminar In American Government And Politics: Selected Topics",
        "description": "Prerequisite: Classified graduate status or instructor consent. Inquiry into major contemporary theories in American government including treatment of the problems of theory law institutions and political behavior. (A) Political Thought (B) Behavior (C) Parties and Interest Groups (D) Public Law (E) Institutions (F) Policy (G) State and Local Government (H) Municipal Government (I) Media and (J) Selected Topics.\n",
        "units": "3",
        "prerequisites": "{{Classified graduate status} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "570",
        "title": "Seminar in Political Theory",
        "description": "Prerequisites: Open to graduate students in the social and behavioral sciences; Instructor consent for upper division students. Graduate survey seminar course in political theory. Engages students in in-depth analysis of the arguments of some of the defining figures of political theory, both ancient and contemporary.",
        "units": "3",
        "prerequisites": "{{Open to graduate students in the social and behavioral sciences} && {Instructor consent for upper division students}}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "571",
        "title": "Seminar in Methodology",
        "description": "Study of representative literature in the field of political science, with emphasis on the underlying methodological assumptions, analysis of statistical techniques employed with respect to appropriateness, evaluation of research design and application, and evaluation of validity of conclusion, with recommendations for replication or improvement.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "597",
        "title": "Directed Comprehensive Studies",
        "description": "Open by special permission to students electing to complete a comprehensive examination in partial fulfillment of the requirements for the Master of Arts degree.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "599B",
        "title": "Independent Study",
        "description": "Prerequisite: Instructor consent.\n",
        "units": "2",
        "prerequisites": "{Instructor consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "698D",
        "title": "Graduate Culminating Project",
        "description": "Prerequisite: Instructor permission required. This culminating course requires students to demonstrate their mastery of their specialization in political science. Students will revise an existing research paper that they produced in one of their graduate seminars in political science and develop it into a manuscript that could be submitted as a conference paper, journal article, or academic writing sample. This course is to be taken only in the student’s final semester.",
        "units": "3",
        "prerequisites": "{Instructor permission required}",
        "corequisites": "{None}"
    }
]