[
    {
        "subject": "AAS",
        "catalog_number": "100",
        "title": "Introduction to Asian American Studies",
        "description": "Survey of research on Asians in America, including: history, community life, language experience, arts, education, politics and economics. Emphasizes research on Americans of Chinese, Filipino, Japanese, Korean, Southeast Asian, South Asian and Pacific Island ancestry. Available for Section B of the Multicultural Requirement for Credential Candidates. Meets the Ethnic Studies requirement. (Available for General Education, F Comparative Cultural Studies.) (ES)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "113A",
        "title": "Approaches to University Writing A",
        "description": "Prerequisite: Placement in a supported GE subarea A2 Written Communication course. Corequisite: UNIV 061. Expository prose writing with a focus on both content and form. Specific emphases shall include the exercise of logical thought and clear expression, the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 113A, AFRS 113A, CAS 113A, CHS 113A, ENGL 113A, LING 113A or QS 113A. Students also are required to enroll in UNIV 061 (1 credit) or equivalent. Individual tutoring is available through the Asian American Studies Activities Center or the Learning Resource Center.",
        "units": "3",
        "prerequisites": "{Placement in a supported GE subarea A2 Written Communication course}",
        "corequisites": "{UNIV 061}"
    },
    {
        "subject": "AAS",
        "catalog_number": "113B",
        "title": "Approaches to University Writing B",
        "description": "Prerequisite: Successful completion of 113A. Corequisite: UNIV 062. Expository prose writing with a focus on both content and form. Specific emphases shall include the exercise of logical thought and clear expression, the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 113B, AFRS 113B, CAS 113B, CHS 113B, ENGL 113B, LING 113B or QS 113B. Students also are required to enroll in UNIV 062 (1 credit) or equivalent. Individual tutoring is available through the Asian American Studies Activities Center or the Learning Resource Center. (Available for General Education, Basic Skills A2 Written Communication.) (IC)",
        "units": "3",
        "prerequisites": "{AAS 113A}",
        "corequisites": "{UNIV 062}"
    },
    {
        "subject": "AAS",
        "catalog_number": "114A",
        "title": "Approaches to University Writing A",
        "description": "Prerequisite: Placement in a supported GE subarea A2 Written Communication course. Expository prose writing with a focus on both content and form. Specific emphases shall include the exercise of logical thought and clear expression, the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 114A, AFRS 114A, CAS 114A, CHS 114A, ENGL 114A or QS 114A. Individual tutoring is available through the Asian American Studies Activities Center or the Learning Resource Center.",
        "units": "3",
        "prerequisites": "{Placement in a supported GE subarea A2 Written Communication course}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "115",
        "title": "Approaches to University Writing",
        "description": "Prerequisite: Multiple Measures Placement in GE-level writing. Expository prose writing with a focus on both content and form. Specific emphases shall include the exercise of logical thought and clear expression, the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 115, AFRS 115, CAS 115, CHS 115, ENGL 115 or QS 115. Individual tutoring is available through the Asian American Studies Activities Center, Chicana/o Writing Lab, Africana Studies Lab, or Learning Resource Center. (Available for General Education, Basic Skills A2 Written Communication.) (IC)",
        "units": "3",
        "prerequisites": "{Multiple Measures Placement in GE-level writing}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "151",
        "title": "Fundamentals of Public Speaking",
        "description": "Prerequisite: Multiple Measures Placement in GE-level writing, or completion of 113A or 114A, or completion of the lower division writing requirement. This course is an introduction to public speaking and oral communications processes, with particular emphasis on issues related to Asian American Studies and Asian Pacific American communities. In addition to basic skills, students will be introduced to Asian Americans who have used oral communication as a way to address issues related to, including race, ethnicity, gender, sexuality, identity, and community. Students will be required to deliver a variety of speeches. The course will include intensive practice in public speaking, logical reasoning, and critical reasoning. Students are required to attend 15 hours of public speaking events outside of the classroom. (Cross-listed with AFRS 151, CAS 151, CHS 151, COMS 151 and QS 151.) (Available for General Education, Basic Skills A1 Oral Communication.)",
        "units": "3",
        "prerequisites": "{{Multiple Measures Placement in GE-level writing} || {{AAS 113A} || {AAS 114A}} || {completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "201",
        "title": "Race, Racism and Critical Thinking",
        "description": "Preparatory: Completion of the lower division writing requirement and GE section B4 Mathematics. Introduction to the process of critical thinking through the lens of race-based theories and selected historical and contemporary discourse of African Americans, Asian Americans, European Americans and Latinos on race relations and multiculturalism in American society. Examines contemporary social issues through the use of scholarly studies and a range of cultural texts in order to explore the effects of race and racism on the relationship between language and logic, processes and form of reasoning and practices of critical reflection. Also examines intersection of race, gender and class. (Available for General Education, Basic Skills A3 Critical Thinking.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "210",
        "title": "History of Asians in America",
        "description": "Introduction to the history of Asian Americans in the United States from the 1800s to the present. Students review the historical forces affecting immigration of the following communities: Chinese, Japanese, Filipino, Korean, South Asian, Southeast Asian and Pacific Islander. Analysis of problems resulting from limited access to the social, political and economic institutions of American society. Meets the Ethnic Studies requirement. (Available for General Education, D1 Social Sciences.) (ES)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "220",
        "title": "Survey of Asian American Literature",
        "description": "Prerequisite: Completion of the lower division writing requirement. Survey of Asian American literature from the late 19th century to the present. Introductory study of prose fiction and nonfiction, poetry and drama written by Americans of Chinese, Japanese, Korean, Filipino, Southeast Asian, South Asian and Pacific Islander ancestry. Regular writing assignments required. Meets the Ethnic Studies requirement. (Available for General Education, C2 Humanities.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "230",
        "title": "Asian Americans and the Media",
        "description": "Study of the effects of mass media on the history and development of Asians in America. Particular attention to Asian American images in film, television, the Internet and advertisements. Meets the Ethnic Studies requirement. (Available for General Education, E Lifelong Learning.) (ES)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "321",
        "title": "Asian American Fiction",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of Asian American fiction written by Americans of Chinese, Japanese, Korean, Filipino, South Asian and Southeast Asian ancestry. Regular writing assignments required. Meets the Ethnic Studies requirement. (Available for General Education, C2 Humanities.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "340",
        "title": "Asian American Women",
        "description": "Prerequisite: Completion of the lower division writing requirement. Multidisciplinary analysis of women in the diverse Asian American communities. Study of the historical, social, political and economic factors that have impacted the role and status of Asian Pacific American women in U.S. society. Regular writing assignments required. Available for Gender and Women’s Studies Minor, Ethnic Studies and Diversity. Meets the Ethnic Studies requirement. (Available for General Education, F Comparative Cultural Studies.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "345",
        "title": "Contemporary Issues in Asian American Studies",
        "description": "Prerequisite: Completion of the lower division writing requirement. Critical analysis of contemporary issues confronting Asian Americans in the U.S. Emphasis placed on social and economic issues such as immigration, education, employment, health and inter-ethnic and intra-Asian conflict. Regular writing assignments required. Available for Section B, Multicultural Requirement for Credential Candidates. Meets the Ethnic Studies requirement. (Available for General Education, F Comparative Cultural Studies.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "347",
        "title": "Asian American Politics and the Law",
        "description": "Prerequisite: Completion of the lower division writing requirement. Recommended: Prior completion of an AAS course. Advanced course on the legal and political history and contemporary struggles of Asian Americans. Overview of American political system through the examination of basic texts, including the U.S. Constitution. Examines the history and formation of Asian communities in the U.S., the evolution of their participation in the political process through the lens of immigration, citizenship policies and laws, civil rights reform laws, state laws and municipal ordinances and contemporary legal and political issues. (Available for General Education, D3/D4 Constitution of the United States/State and Local Government.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "350",
        "title": "Asian American Personality and Mental Health",
        "description": "Prerequisite: Completion of the lower division writing requirement. Analysis of psychological issues from an Asian American perspective. Specific topics include the impact of minority status on personality development, cross-cultural comparisons of Asian Americans and introduction to problems in the assessment, diagnosis and treatment of mental health problems in Asian Americans. Available for Section B of the Multicultural Requirement for Credential Candidates. (Available for General Education, D1 Social Sciences.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "355",
        "title": "Biracial and Multiracial Identity",
        "description": "Prerequisite: Completion of the lower division writing requirement. Interdisciplinarily studies the socio-historical realities, identities and political maintenance of people with multiple racial and ethnic heritages; examines the binary racial structure of the U.S., social and legal customs of racial designation and membership; focuses on multiracial populations such as Creoles, mulattos, mestizos, Black-Indians, Eurasians, Afroasians, Amerasians, etc. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "360",
        "title": "Asian American Immigration–Global Perspective",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examines Asian immigration to the U.S. from a world systems perspective. Examines immigration process and the implication of this process for contemporary interest in the Pacific Rim. Topics include origins of Asian immigration, major U.S. immigration legislation, demographic structure of contemporary Asian immigration and cross-cultural comparisons of other world groups. Regular writing assignments required. Meets the Ethnic Studies requirement. (Available for General Education, F Comparative Cultural Studies.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "361A",
        "title": "Asian American Experience of Selected Groups",
        "description": "Prerequisite: Completion of the lower division writing requirement. Intensive study of the immigration/incorporation history and experience of a specific Asian Pacific American sub-group. Each course examines the nexus between historical events and contemporary issues facing a particular Asian Pacific American community and their experiences in various sectors of U.S. society: labor, family, politics, education and cultural preservation and community formation.\nCourse Title\nAAS 361A Filipino American Experience\nAAS 361E Japanese American Experience\nFor courses on other groups, consult with the department office.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "390",
        "title": "Asian American Communities: Field Practicum",
        "description": "Prerequisite: Completion of the lower division writing requirement. Recommended Corequisite or Preparatory: Concurrent enrollment in AAS 345 or other related course. A seminar on field study, observation and participation in selected community institutions and agencies. This course will also offer a community service opportunity with activities relating to concepts and theories presented. 15 hours of supervised field experience. May be repeated once for credit. Meets the Ethnic Studies requirement. (Available for General Education, E Lifelong Learning.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{{AAS 345} || {related course}}"
    },
    {
        "subject": "AAS",
        "catalog_number": "390F",
        "title": "Asian American Communities: Field Practicum",
        "description": "Prerequisite: Completion of the lower division writing requirement. Recommended Corequisite or Preparatory: Concurrent enrollment in AAS 345 or other related course. A seminar on field study, observation and participation in selected community institutions and agencies. This course will also offer a community service opportunity with activities relating to concepts and theories presented. 15 hours of supervised field experience. May be repeated once for credit. Meets the Ethnic Studies requirement. (Available for General Education, E Lifelong Learning.) (ES)",
        "units": "1",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{{AAS 345} || {related course}}"
    },
    {
        "subject": "AAS",
        "catalog_number": "417",
        "title": "Equity and Diversity in Schools",
        "description": "Prepares teacher candidates to examine principles of educational equity, diversity and the implementation of curriculum content and school practices for elementary/secondary students. Focuses on the history and culture of a specific ethnic experience and a comparative analysis is made with other ethnic groups in California. Engages students to examine, critique and reflect on their personal biases regarding children of color. Not available for credit in addition to AFRS 417, ARMN 417, CHS 417 or ELPS 417. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "450",
        "title": "Asian American Child and the Schools",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of the development of the Asian American child with particular emphasis on bicultural and bilingual issues that may influence educational progress. Culturally relevant socialization patterns of children from Chinese, Japanese, Korean, Filipino and Southeast Asian backgrounds examined. Intended for students interested in teaching and human services. Regular writing assignments required. Available for Section A of the Multicultural Requirement for Credential Candidates.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "453",
        "title": "Asian American Families",
        "description": "Prerequisite: Completion of the lower division writing requirement. Overview of the demographic, social cultural, structural and historical aspects of Asian American families in the United States. Examines comparative family features among Asian American ethnic groups and other cultural and ethnic groups in the U.S. Parenting styles, communication styles, values, traditions and beliefs examined across ethnic backgrounds, class and immigration histories. Available for Section B of the Multicultural Requirement for Credential Candidates. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AAS",
        "catalog_number": "455",
        "title": "Asian American Sexuality",
        "description": "Preparatory: Completion of the lower division writing requirement. Explores the personal, social and political identities of Asian Americans as expressed from the lens of sexuality; interdisciplinarily examines current topics in Asian American sexuality, such as gender roles, cultural beliefs and sexual mythology, sexual practices, media images, literary representations, sexual violence and abuse, sex-related health, sex work and commodification, and sexual orientation. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]