[
    {
        "subject": "AFRS",
        "catalog_number": "100",
        "title": "Introduction to Black Studies and Culture",
        "description": "Overview of Black culture, including history, religion, social organization, politics, economics, psychology, and creative production, with a survey of the key concepts and fundamental literature in each area. The discipline of Africana Studies is also presented in terms of its origins and distinguishing theories and methods. Meets the Ethnic Studies requirement. (Available for General Education, F Comparative Cultural Studies.) (ES)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "113A",
        "title": "Approaches to University Writing A",
        "description": "Prerequisite: Placement in a supported GE subarea A2 Written Communication course. Corequisite: UNIV 061. Expository prose writing, with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 113A, AFRS 113A, CAS 113A, CHS 113A, ENGL 113A, LING 113A or QS 113A. Students also are required to enroll in UNIV 061 (1 credit) or equivalent. Individual tutoring is available through the Africana Studies Department or the Learning Resource Center.",
        "units": "3",
        "prerequisites": "Placement in a supported GE subarea A2 Written Communication course",
        "corequisites": "UNIV 061"
    },
    {
        "subject": "AFRS",
        "catalog_number": "113B",
        "title": "Approaches to University Writing B",
        "description": "Prerequisite: Successful completion of 113A. Corequisite: UNIV 062. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 113B, AFRS 113B, CAS 113B, CHS 113B, ENGL 113B, LING 113B or QS 113B. Students also are required to enroll in UNIV 062 (1 credit) or equivalent. Individual tutoring is available through the Africana Studies Department or the Learning Resource Center. (Available for General Education, Basic Skills A2 Written Communication.) (IC)",
        "units": "3",
        "prerequisites": "Successful completion of 113A",
        "corequisites": "UNIV 062"
    },
    {
        "subject": "AFRS",
        "catalog_number": "115",
        "title": "Approaches to University Writing",
        "description": "Prerequisite: Multiple Measures Placement in GE-level writing. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 115, AFRS 115, CAS 115, CHS 115, ENGL 115 or QS 115. Individual tutoring is available through the Learning Resource Center. (Available for General Education, Basic Skills A2 Written Communication.) (IC)",
        "units": "3",
        "prerequisites": "Multiple Measures Placement in GE-level writing",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "151",
        "title": "Freshman Speech Communication",
        "description": "Prerequisite: Multiple Measures Placement in GE-level writing, or completion of 113A or 114A, or completion of the lower division writing requirement. Introduction to the study of the human communication process, with emphasis on techniques of contemporary African-American rhetoric. Includes intensive practice in public speaking, logical reasoning and critical listening. (Cross-listed with AAS 151, CAS 151, CHS 151, COMS 151 and QS 151.) (Available for General Education, Basic Skills A1 Oral Communication.)",
        "units": "3",
        "prerequisites": "Multiple Measures Placement in GE-level writing, or completion of 113A or 114A, or completion of the lower division writing requirement",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "161",
        "title": "American Political Institutions: A Black Perspective",
        "description": "Examines the development and dynamics of American political institutions and political processes as they relate to the experiences of African-Americans. Meets the Ethnic Studies requirement. (Available for General Education, D3/D4 Constitution of the United States/State and Local Government.) (ES)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "165",
        "title": "Introduction to Pan Africanism",
        "description": "Strongly recommended for all AFRS majors and minors. Examines the origin and growth of the Pan African movement from the 19th century to the present time. Critical evaluation of major Pan African ideologists and practitioners. Successes and failures of the Organization of African Unity from 1963 to the present time. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "168",
        "title": "Introduction to the African Diaspora",
        "description": "Students will explore a variety of historical, theoretical, and cultural approaches to studying the African Diaspora. The assigned readings cover both the geographic and conceptual nature of the African Diaspora beginning on the African continent, moving through the Americas (North, South, and the Caribbean basin), and into Europe. It considers important issues in the construction of the African Diaspora, such as the formation of racial identities and social movements, the circulation of ideas and intellectuals, and the manner in which the intersection of race, class, gender, sexuality, location, language, and power influence how groups and individuals experience diaspora. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "171",
        "title": "Classical African Civilization",
        "description": "Surveys the various great societies of Africa, covering a period from the origin of humankind in East Africa to the great Zulu Kingdom led by Chaka in the 19th century. In addition to describing the leadership, histories and achievements of African figures like Imhotep, Zoser, Ahknaten, Muhammed and Chaka, attention is given to understanding the cultures, technologies and social organization of their respective societies. Not available for credit in addition to HIST 145. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "201",
        "title": "Economics of the African-American Community I",
        "description": "Introduction to the operations of the U.S. economy, with special emphasis on the interrelationships between producers, consumers and governmental components. Emphasizes the economic position and economic needs of the African-American community within this system. Meets the Ethnic Studies requirement. (Available for General Education, D1 Social Sciences.) (ES)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "204",
        "title": "Race and Critical Thinking",
        "description": "Prerequisite: Instructor consent. Recommended Corequisite or Preparatory: Completion of the lower division writing requirement. Introduction to the basic concepts of deductive logic as a dimension of critical reasoning and the practical usage of those concepts in discussing, analyzing and critiquing ideas on race, ethnicity, gender, sexual orientation and other relevant issues of modern society. (Available for General Education, Basic Skills A3 Critical Thinking.)",
        "units": "3",
        "prerequisites": "Instructor consent",
        "corequisites": "Completion of the lower division writing requirement"
    },
    {
        "subject": "AFRS",
        "catalog_number": "220",
        "title": "Psychological Environment of the African-American",
        "description": "Study of contemporary American society and its effects on the African-American community from the perspective of basic psychological concepts and theories. Meets the Ethnic Studies requirement. (Available for General Education, D1 Social Sciences.) (ES)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "221",
        "title": "Social Environment of the African-American",
        "description": "Study of contemporary American society and its effects on the African-American community from the perspective of basic sociological concepts and theories. Meets the Ethnic Studies requirement. (Available for General Education, D1 Social Sciences.) (ES)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "226",
        "title": "Traditional African Cultures",
        "description": "Comprehensive overview of the African societies and cultures from the earliest times to the 20th century. Case studies in ethnology, kinship and marriage, economic and political institutions, religion and philosophy, the arts and the interaction between the traditional African cultures and the non-African cultures. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "245",
        "title": "African-American Literature Since 1930",
        "description": "Introduction to major African-American authors from 1930 to the present. The work of Richard Wright, Margaret Walker, Gwendolyn Brooks, Ralph Ellison, John Killens, James Baldwin and LeRoi Jones are studied, as well as the works of writers who formed the Black Arts Movement that flourished during the 1970s. Focus on understanding the dynamics of African-American life through an analysis of the literature. Meets the Ethnic Studies requirement. (Available for General Education, C2 Humanities.) (ES)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "246",
        "title": "Introduction to African-American Drama",
        "description": "Chronological survey of the major works of representative African-American dramatists from 1925 to the present, with particular focus on their techniques, ideas and the cultural milieu in which the works were produced. Meets the Ethnic Studies requirement. (Available for General Education, C1 Arts.) (ES)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "252",
        "title": "Popular Culture and the Black World",
        "description": "This course examines popular culture as it relates to the cultural transmission, inheritance, and complex relations between African origins and the irreversible scatterings of the Black diaspora. Specifically, we will examine the role of media and the arts in enabling, facilitating, or challenging the social constructions of “Blackness” in Black popular culture. The course will survey the products of popular culture in the Black world as signifiers of larger cultural forces and realities.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "271",
        "title": "African-American History to 1865",
        "description": "Survey course examining the themes and issues in the history of the African peoples in America up to 1865. (Available for General Education, C3 American History, Institutions and Ideals.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "272",
        "title": "African-American History Since 1865",
        "description": "Survey in African-American history covering the period 1865 to the present. Includes the Reconstruction era, post-Reconstruction, the Negro Renaissance, the Civil Rights Movement, and black nationalism. Meets the Ethnic Studies requirement. (Available for General Education, C3 American History, Institutions and Ideals.) (ES)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "274",
        "title": "History of Caribbean Societies Since the 1830s",
        "description": "Historical approach to an analysis of the political, social and economic development of the Caribbean islands after the 1830s. General focus centered on post-emancipation colonialism and the development of a particular form of neo-colonialism that manifested itself after independence. Also includes an examination of the emergence of contemporary radical political movements.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "280",
        "title": "Workshop in Creative Writing for Minority Students",
        "description": "Prerequisite: Completion of the lower division writing requirement. Introductory workshop in minority creative writing. Students learn to write in the three genres–prose fiction, drama and/or poetry. In addition, students have the opportunity to meet and work with distinguished professional minority writers. Students should consult with the instructor about the semester syllabus and Minority Literature Concentration. (Cross-listed with CHS 280 and ENGL 280.) (Available for General Education, C1 Arts.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "300",
        "title": "Contemporary Issues in the African-American Community",
        "description": "Prerequisite: Completion of the lower division writing requirement. In-depth exploration of the social, political, cultural, and economic issues in the African-American community. Provides insight on the extent to which these issues affect the black individual and family in their interaction with the majority American society. Available for Section B of the Multicultural Requirement for Credential Candidates. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "301",
        "title": "Economics of the African-American Community II",
        "description": "Study of the household as a consuming unit and the firm as a producing unit, exploring factor costs, price determinatives and income distribution, with emphasis on the African-American community and its lack of control over the means of production.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "311",
        "title": "Black Psychology",
        "description": "Examination of the major theories and research by black scholars addressing the development of a black psychology. Comparisons and contrasts are made with Traditional Psychology. Pan Africanist perspective is taken (i.e., African, Caribbean, etc.).",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "320",
        "title": "African-American Personality Development",
        "description": "Prerequisites: AFRS 220 and/or an introductory course in Psychology; Completion of the lower division writing requirement. Study of the psychological manifestations of oppression of the African-American. Emphasis on the understanding and analysis of psychological stress, the assessment of this phenomenon and discussion of the solutions for the creation of a positive self-concept in African-American people. Meets the Ethnic Studies requirement. (Available for General Education, F Comparative Cultural Studies.) (ES)",
        "units": "3",
        "prerequisites": "AFRS 220 and/or an introductory course in Psychology; Completion of the lower division writing requirement",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "322",
        "title": "African-American Family",
        "description": "Prerequisite: Completion of the lower division writing requirement. Summarizes structural evaluation and role formation of the family. Presents an overview of the traditional African family and socialization process. Focuses on the impact of slavery and post-slavery institutions on the formation of the black family in America. Meets the Ethnic Studies requirement. (Available for General Education, F Comparative Cultural Studies.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "324",
        "title": "The Black Woman in Contemporary Times",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examines the social, political and psychological forces impacting the lives of black women and focuses on their expectations, opportunities, problems and goals in contemporary society. Also studies the black woman’s contribution to the family and the community. Meets the Ethnic Studies requirement. (Available for General Education, F Comparative Cultural Studies.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "325",
        "title": "The Black Man in Contemporary Times",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examines the social, political and psychological forces affecting the lives of black men and focuses on their expectations, opportunities, problems and goals in contemporary society. Studies contributions of the black male and his relationships to the family, community and American society. Meets the Ethnic Studies requirement. (Available for General Education, F Comparative Cultural Studies.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "332",
        "title": "African-American Music I",
        "description": "Historical analysis of African-American music, from its beginnings in Africa until its flowering in New Orleans.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "337",
        "title": "Black Images on the Silver Screen",
        "description": "Prerequisite: Completion of the lower division writing requirement. In-depth exploration of the history and criticism of the black image on the American screen and the social and political background from which the African-American image has developed. Emphasizes technical (how a film is composed) and critical (the meaning that can be drawn from those compositions) perspectives. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "344",
        "title": "Literature of the Caribbean and African Experience",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examines the literatures of people in Africa and the Caribbean. Establishes the theoretical, historical, cultural and imagistic framework within which that literature operates. Thematic analysis of the literatures with respect to both their comparative experiences and their specifically different backgrounds. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "345",
        "title": "African-American Autobiography",
        "description": "Analysis of the thematic patterns in autobiographies from the slave narrative through the present, focusing on the continuity of the African-American experiences from a psychological, sociological and historical point of view.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "346",
        "title": "Contemporary Black Female Writers",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of selected works by contemporary Black women writers, including Alice Walker, Toni Morrison, Ntozake Shange and Maya Angelou. Themes explored include correcting the images, movement from masking to self-revelation, male-female relationships and search for wholeness. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "350",
        "title": "Advanced Writing",
        "description": "Prerequisite: Completion of the lower division writing requirement. Advanced course emphasizing alternative strategies in expository writing skills development. Focus on such purposeful forms of discourse as reports, the research paper, critiques, the essay examination and selected forms of correspondence. Cursory review of grammar, mechanics and syntax is offered as needed. More intensive review of such basics are available on an individualized basis in the Writing Center. The course is equivalent to but not a substitute for ENGL 305 or BUS 305.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "361",
        "title": "African-American Politics",
        "description": "Prerequisite: Completion of the lower division writing requirement. Introduction to the politics of the African-American, including political socialization, voting, interest groups, political parties and the political behavior within the sub-cultural context. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "366",
        "title": "Colonialism in Africa",
        "description": "Prerequisite: Completion of the lower division writing requirement. Comprehensive overview of the motives of the European colonizers of Africa and the methods they used in their colonial pursuits. Consequences of the colonization of Africa and the slave trade. African liberation movements. Case studies of colonialism in specific regions and/or specific countries. Meets the Ethnic Studies requirement. (Available for General Education, F Comparative Cultural Studies.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "367",
        "title": "African American Social Movements",
        "description": "This course is an examination of the theory and practice of African-American social movements designed to introduce students to the various approaches and models used to study social movements and apply them to the African American experience. Theories that promulgate non-violent direct action, the use of violence and other non-systemic activity will be assessed within the context of African American movement activity. Although the focus is on the Modern Civil Rights and Black Power movements, the course also examines the early abolition and Negro Convention Movement for historical context. Contemporary grassroots activism in the African-American community and African American global initiatives, including African American involvement in the anti-apartheid movement in South Africa, will be examined. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "368",
        "title": "Politics of Hip Hop",
        "description": "Examination of African-American youth and society through the medium of Hip Hop. This course also explores the connection between the Hip Hop community and the various political, corporate and institutional actors that influence society both locally and globally. Special emphasis is placed on the impact of Hip Hop on African identity, culture and politics. Required for the AFRS Minor.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "395",
        "title": "Bilingualism in the African-American Community",
        "description": "Prerequisite: Completion of the lower division writing requirement. Explores the genesis of African-American linguistic patterns, with a focus on acquisition of Ebonics as a sociocultural linguistic phenomenon. Available for Section C of the Multicultural Requirement for Credential Candidates.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "398",
        "title": "Research Methods and Paradigms in Pan African Studies",
        "description": "Prerequisite: Upper division Standing. Introduction to paradigms, theories, and models of research on the Africana community. Emphasis will be placed on methodological, epistemological and ethical concerns related to conducting research studies on people of African descent. Other topics include sampling techniques, experimental and non-experimental designs, ethnography, and archival approaches relevant to the Africana community.",
        "units": "3",
        "prerequisites": "{Upper division Standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "417",
        "title": "Equity and Diversity in Schools",
        "description": "Prepares teacher candidates to examine principles of educational equity, diversity and the implementation of curriculum content and school practices for elementary/secondary students. Focuses on the history and culture of a specific ethnic experience and a comparative analysis made with other ethnic groups in California. Engages students to examine, critique and reflect on their personal biases regarding children of color. Not available for credit in addition to AAS 417, ARMN 417, CHS 417 or ELPS 417. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "420",
        "title": "The Black Child",
        "description": "Prerequisite: Completion of the lower division writing requirement. Exploration of African-American childhood socialization dynamics through an examination of the forces of constraint and development. Examines theories of social development and achievement. Available for Section A of the Multicultural Requirement for Credential Candidates. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "451",
        "title": "Mass Communication in the African-American Community",
        "description": "Prerequisite: Grade of “B” or better in AFRS 151 or instructor consent. Historical analysis of the role played by the mass media in the African-American community from slavery to contemporary times. Particular attention given to evaluating the African-American press.",
        "units": "3",
        "prerequisites": "{{Grade of B or better in AFRS 151} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "466B",
        "title": "Model Organization of African Unity Practicum",
        "description": "In-depth preparation of the delegation on the specific issues on an African nation to be dealt with at the OAU Conference in Washington, D.C. Seminar with group discussions, presentations and country resolutions.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AFRS",
        "catalog_number": "498",
        "title": "Proseminar in Pan African Studies",
        "description": "Primarily restricted to students majoring in Africana Studies, but open to other students with instructor consent. Capstone course for the AFRS major, usually taken during the final semester before baccalaureate graduation. Focuses on a synthesis of the information, concepts, material and methodologies provided in previous AFRS classes. Provides intensive practice in utilizing that data in theoretical analysis and other evaluative activities.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]