[
    {
        "subject": "CHS",
        "catalog_number": "100",
        "title": "Chicana/o Culture",
        "description": "Introductory study of cultural, economic, educational and political issues as they impact the Chicana/o in the U.S. Includes a study of the contributions that Chicana/os have made in these areas. Meets the Ethnic Studies requirement. (Available for General Education, F Comparative Cultural Studies.) (ES)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "101",
        "title": "Spanish for Chicanos I",
        "description": "Prerequisite: Instructor consent, subject to verification of oral skills at the beginning of the semester. Basic instruction in spoken and written formal Spanish for students who already have some comprehension of and fluency in the language. Designed for Chicano/Latino and other students from a Spanish-speaking background. Emphasis is placed on improving speaking, writing and reading in academic registers. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "5",
        "prerequisites": "{Instructor consent, subject to verification of oral skills at the beginning of the semester}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "102",
        "title": "Spanish For Chicanos Ii",
        "description": "Prerequisite: Successful completion of CHS 101 or instructor consent. Continuation of the study of spoken and written formal Spanish for students who already have comprehension of and fluency in the language. Designed for Chicano/Latino and other students from a Spanish-speaking background. Emphasis on oral expression writing and reading in academic registers. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "prerequisites": "{{CHS 101} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "111",
        "title": "The Chicana/o and the Arts",
        "description": "Survey of Chicana/o visual art, music and drama and their role in Chicana/o culture. Offers a historical approach to Chicana/o contributions in the arts. Meets the Ethnic Studies requirement. (Available for General Education, C1 Arts.) (ES)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "113A",
        "title": "Approaches to University Writing A",
        "description": "Prerequisite: Placement in a supported GE subarea A2 Written Communication course. Corequisite: UNIV 061. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 113A, AFRS 113A, CAS 113A, CHS 113A, ENGL 113A, LING 113A or QS 113A. Students also are required to enroll in UNIV 061 (1 credit) or equivalent. Individual tutoring is available through the Chicana/o Writing Lab and Learning Resource Center.",
        "units": "3",
        "prerequisites": "{Placement in a supported GE subarea A2 Written Communication course}",
        "corequisites": "{UNIV 061}"
    },
    {
        "subject": "CHS",
        "catalog_number": "113B",
        "title": "Approaches to University Writing B",
        "description": "Prerequisite: Successful completion of 113A. Corequisite: UNIV 062. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 113B, AFRS 113B, CAS 113B, CHS 113B, ENGL 113B, LING 113B or QS 113B. Students also are required to enroll in UNIV 062 (1 credit) or equivalent. Individual tutoring is available through the Chicana/o Writing Lab and Learning Resource Center. (Available for General Education, Basic Skills A2 Written Communication.) (IC)",
        "units": "3",
        "prerequisites": "{CHS 113A}",
        "corequisites": "{UNIV 062}"
    },
    {
        "subject": "CHS",
        "catalog_number": "114A",
        "title": "Approaches to University Writing A",
        "description": "Prerequisite: Placement in supported GE subarea A2 Written Communication course. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 114A, AFRS 114A, CAS 114A, CHS 114A, ENGL 114A or QS 114A. Individual tutoring is available through the Learning Resource Center.",
        "units": "3",
        "prerequisites": "{Placement in supported GE subarea A2 Written Communication course}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "114B",
        "title": "Approaches to University Writing B",
        "description": "Prerequisite: Successful completion of 114A. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 114B, AFRS 114B, CAS 114B, CHS 114B, ENGL 114B or QS 114B. Individual tutoring is available through the Learning Resource Center. (Available for General Education, Basic Skills A2 Written Communication.) (IC)",
        "units": "3",
        "prerequisites": "{CHS 114A}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "115",
        "title": "Approaches to University Writing",
        "description": "Prerequisite: Multiple Measures Placement in GE-level writing. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 115, AFRS 115, CAS 115, CHS 115, ENGL 115 or QS 115. Individual tutoring is available through the Learning Resource Center. (Available for General Education, Basic Skills A2 Written Communication.) (IC)",
        "units": "3",
        "prerequisites": "{Multiple Measures Placement in GE-level writing}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "151",
        "title": "Freshman Speech Communication",
        "description": "Prerequisite: Multiple Measures Placement in GE-level writing, or completion of 113A or 114A, or completion of the lower division writing requirement. Examination of the principles essential to effective verbal communication skills through the study and practical application of basic speech forms. Attention given to individual and group communication activities designed to improve one’s ability to organize, reason critically and listen effectively. Students are required to give speeches. (Cross-listed with AAS 151, AFRS 151, CAS 151, COMS 151 and QS 151.) (Available for General Education, Basic Skills A1 Oral Communication.)",
        "units": "3",
        "prerequisites": "{{Multiple Measures Placement in GE-level writing} || {{CHS 113A} || {CHS 114A}} || {completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "201",
        "title": "Survey of Mexican Literature in Translation",
        "description": "Preparatory: Completion of the lower division writing requirement. Comprehensive overview of the literary heritage of Mexico from pre-Colombian times to the present. Includes an analysis of its historical, technical and lyrical dimensions and its relationship with other Hispanic literature in order to develop a critical appreciation of literary art. Meets the Ethnic Studies requirement. (Available for General Education, C2 Humanities.) (ES)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "202",
        "title": "Race, Racism and Critical Thinking",
        "description": "Prerequisite: Completion of the lower division writing requirement. Introduction to the process of critical thinking through the lens of race-based theories and selected historical and contemporary discourse of African Americans, Asian Americans and Chicanos/Latinos on race relations and multiculturalism in American society. Examines contemporary social issues through the use of scholarly studies and a range of cultural texts in order to explore the effects of race and racism on the relationship between language and logic, process and forms of reasoning and practices of critical reflection. Emphasis on the Chicano/Latino racial experience in contemporary America. Examines intersection of race, gender and class. (Available for General Education, Basic Skills A3 Critical Thinking.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "214",
        "title": "Guitar Music of the Southwest and Mexico",
        "description": "Develops the fundamental skills for guitar. Incorporates the study of various regional musical styles of the Southwest and Mexico. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "215",
        "title": "Regional Music Of The Southwest And Mexico",
        "description": "Corequisite: CHS 215L. Advanced study of regional music styles of Mexico and the Southwest. In addition to the guitar attention is also given to other string instruments in each regional style. The various styles presented are practiced in class. 2 hours lecture per week; 2 hours lab per week. \n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{CHS 215L}"
    },
    {
        "subject": "CHS",
        "catalog_number": "215L",
        "title": "Regional Music Of The Southwest And Mexico Lab",
        "description": "Corequisite: CHS 215. Advanced study of regional music styles of Mexico and the Southwest. In addition to the guitar attention is also given to other string instruments in each regional style. The various styles presented are practiced in class. 2 hours lecture per week; 2 hours lab per week. \n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{CHS 215}"
    },
    {
        "subject": "CHS",
        "catalog_number": "230",
        "title": "Introduction to Research Methods in Chicana/o Studies",
        "description": "Prerequisite: Completion of the lower division writing requirement. Introduction to research methods and writing skills through class lectures and hands-on assignments requiring the use of basic information sources and tools. Focuses on the development of basic research strategies and reinforcement of appropriate writing skills necessary to a wide spectrum of research and writing assignments. Includes an introduction to information sources and search strategies relevant to Chicana/o research.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "245",
        "title": "History of the Americas",
        "description": "Comparative analysis of significant political and social events in the U.S. from colonial times to the present. Emphasis placed on the historical development of American institutions and ideals as they have been affected by regional dynamics within the U.S. and by international, socio-political and economic relationships, particularly with Latin America. (Available for General Education, C3 American History, Institutions and Ideals.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "246",
        "title": "Contemporary Issues of the Chicana",
        "description": "Using a sociological framework for understanding the contemporary experiences of Mexican American women in the U.S., focuses on the sexual division of labor in families, the workplace and community. Each section explores the variation and heterogeneity in women’s class, ethnic/racial and gender identity. Meets the Ethnic Studies requirement. (Available for General Education, F Comparative Cultural Studies.) (ES)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "260",
        "title": "Constitutional Issues and the Chicana/o",
        "description": "Study of important constitutional issues and cases that have affected the Chicano community. Examines how American political institutions, operating under the framework of the U.S. Constitution, have influenced the civil and political rights of Chicanos. (Available for General Education, D3/D4 Constitution of the United States/State and Local Government.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "261",
        "title": "Race, Racism and the Sciences",
        "description": "This course will provide a survey of different schools of thought within the natural sciences with special attention to historical and contemporary debates around race and racism. Students will learn about how intelligence testing, forced sterilization, eugenics movements, modern psychiatry, and environmental conservation have impacted Chicana/o communities from a social science interdisciplinary approach. With this interdisciplinary approach, students will read scholarly debates within the fields of the history of science, critical environmental studies, Chicana/o Studies and comparative ethnic studies. (Available for General Education, D1 Social Sciences.) (IC)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "270F",
        "title": "Field Work In Barrio Studies",
        "description": "Field study observation of selected barrio institutions and agencies conducted under supervision and after preparatory instruction to acquaint the student with the barrio. Academic Internship course. Prospective teacher candidates must participate in field experience in public school classrooms. (Available for General Education Lifelong Learning.)\n",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "270SOC",
        "title": "Fieldwork in Barrio Studies",
        "description": "Students will engage in and practice the skills, methods, and awareness necessary for social change in the barrio. The course will focus on connections between students’ life experiences, community institutions, and social justice issues in the Chicana/o/Latina/o community. Freire’s problem-posing processes, cooperative learning, grant writing, and reflection are used to deepen student’s understanding of Chicano/Latina communities. Course requires 20 hours of fieldwork in Chicano/Latina communities. Meets the Ethnic Studies requirement. (Available for General Education, E Lifelong Learning.) (ES)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "280",
        "title": "Workshop In Minority Creative Writing",
        "description": "Introductory course in minority creative writing. Students study and experiment with techniques and strategies from four genres: personal narrative prose fiction drama and poetry and then introduce these to secondary students in schools. Consult with the instructor about the semester syllabus and the minority literature concentration. Students must complete 15 hours of service learning at either a middle school a high school or an agency that serves the Chicano/a or Latino/a community. (Available for General Education Arts and Humanities.) (Crosslisted with ENGL and PAS 280.).\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "306",
        "title": "The Chicana/o in Films",
        "description": "Preparatory: Completion of the lower division requirement. Analysis of the image of the Chicana and Chicano as presented in films and documentaries. Includes historical background, content analysis and social implications of selected feature films and documentaries. Students prepare a written analysis of each film viewed. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "308D",
        "title": "Days of the Dead: Chicana/o Perspectives on Death, Spirituality and Art",
        "description": "Preparatory: Upper division standing; completion of one or more introductory courses in Chicana/o Studies, Religious Studies or Art; or by consent of the instructor. This lecture/studio course examines the concepts inspiring the Dias de los Muertos celebration from ancient Mesoamerican mythology and worldview to contemporary expressions of the Days of the Dead in the Chicana/o community. Areas of discussion also include cross-cultural perspectives on death and eschatology — an overview of cultural attitudes and religious beliefs on death, mourning rituals and the afterlife. Students also will participate in artmaking and traditional activities in preparation for Days of the Dead celebrations. 2 hours lecture, 3 hours laboratory. (Offered Fall semester.)",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "310",
        "title": "Regional Music of Mexico",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of the cultural, instrumental and musical aspects of predominant regional musical styles of Mexico from Pre-Cuauhtemoc to contemporary times. Meets the Ethnic Studies requirement. (Available for General Education, C1 Arts.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "333",
        "title": "Language and Society: Chicanas/os and Other Language Minority Children",
        "description": "Prerequisite: Completion of the lower division writing requirement. Overview of social, educational and linguistic factors that influence language development among Chicanas/os and other language minority children. Introduces students to theories and processes of first and second language acquisition and relates these to the language development and educational needs of Chicana/Latino and other immigrant children. The course emphasizes a broad understanding of first and second language acquisition processes, an applied linguistics orientation and an overview of individual and social aspects of bilingualism and the schooling experiences of Latinos and other immigrant children. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "345",
        "title": "History of the Mexican Peoples",
        "description": "Prerequisite: Completion of the lower division writing requirement. History of the development of the Mexican peoples from the beginning of Spanish colonization (1521) to the present. Analysis of the interaction between politics and economics and the factors underlying Mexico’s economic underdevelopment also presented. Meets the Ethnic Studies requirement. (Available for General Education, D1 Social Sciences.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "346",
        "title": "History of the Chicana/Mexicana",
        "description": "Prerequisite: Completion of the lower division writing requirement. Appraisal of past and contemporary socio-political and economic contributions by Mexican women and Chicanas to developments in Mexico and the U.S. Meets the Ethnic Studies requirement. (Available for General Education, D1 Social Sciences.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "350",
        "title": "Religions and Spiritualities in Chicana/o Communities",
        "description": "Prerequisite: Completion of the lower division writing requirement. Comparative historical study of Mexican Catholicism and American Protestantism and their influence on Chicanas/os in the U.S. Examination of issues involving church, religion, and politics in Chicana/o communities including analysis of theologies of liberation, faith-based community organizing, and feminist, queer, and indigenous spiritualities. Meets the Ethnic Studies requirement. (Available for General Education, C2 Humanities.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "351",
        "title": "Survey of Mexican Philosophical Thought",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of the intellectual life of Mexico from its indigenous pre-Colombian roots through the Spanish and European influences up to its own distinctive present-day perspectives and philosophical outlook. Meets the Ethnic Studies requirement. (Available for General Education, C2 Humanities.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "360",
        "title": "Political Organizations and Social Movements of the Barrio",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of the origin and development of Chicana/o organizations, such as the Mexican American Political Association (MAPA), League of United Latin American Citizens (LULAC) and La Raza Unida Party (LRUP), and their emergence of social movements emphasizing their role in the electoral process and in the development of the Chicana/o Community. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "361",
        "title": "Urbanization and the Chicana/o",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study and critical analysis of the urban Chicana/o community in the U.S. Includes theory, demography, spatial dynamics, leading economic and political issues, key institution issues, trends, and urban policy and planning. Intended for, but not limited to, prospective elementary and secondary school teachers. Available for Section B of the Multicultural Requirement for Credential Candidates. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "364",
        "title": "World Migration and the Chicana/o",
        "description": "Prerequisite: Completion of the lower division writing requirement. Explores the historical and material causes of world migration from underdeveloped countries. Compares Mexican immigration to the U.S. with those of other underdeveloped and developing nations. Meets the Ethnic Studies requirement. (Available for General Education, F Comparative Cultural Studies.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "365",
        "title": "Third World Women and the Chicana",
        "description": "Prerequisite: Completion of the lower division writing requirement. Comparison of Chicana and Third World women in the U.S. and the world community. Effects of colonialism, changes in the mode of production and liberation movements are studied within the U.S. and the Third World communities. Meets the Ethnic Studies requirement. (Available for General Education, F Comparative Cultural Studies.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "366",
        "title": "Women in Latin America",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of the political, economic, social and cultural changes that have affected women in Latin America. Regular written assignments are required. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "380",
        "title": "Chicana/o Literature",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of major Chicana/o writers. Includes an analysis of Chicano novels, short stories, theater and poetry. Students develop analytical skills through class discussions, written assignments and readings. Meets the Ethnic Studies requirement. (Available for General Education, C2 Humanities.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "381",
        "title": "Contemporary Chicana Literature",
        "description": "Prerequisite: Completion of the lower division writing requirement. Introduction to the literature produced by contemporary Chicana writers. Reading and discussion of narrative works, poetry and drama, as well as socio-historical criticism, literary theory and biography. Socio-critical and textual analysis. Regular written assignments required. Meets the Ethnic Studies requirement. (Available for General Education, C2 Humanities.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "390",
        "title": "Alternative Chicano Press",
        "description": "Prerequisite: Completion of the lower division writing requirement. Includes techniques of planning, writing, editing, designing and the publishing of an alternative newspaper. Analysis of the Chicana/o press and the role of Chicanas/os in the mass media. Meets the Ethnic Studies requirement. (Available for General Education, E Lifelong Learning.) (ES)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "401",
        "title": "Pre-Cuauhtemoc Meso-American Civilizations",
        "description": "General survey of civilized life in Mexico and Central America prior to 1519. Examines the Meso-American variant of world civilization and directs special attention to the societies of central Mexico during the 13th-16th centuries. Available for graduate credit. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "405",
        "title": "Chicanas/os and the Media",
        "description": "Analysis of the portrayal of Chicanas and Chicanos in the media, including newspapers, magazines, television, film and advertising. Examination of sources and techniques of reporting events in the barrio is also studied. Field study included and designed for the non-professional student. Available for graduate credit. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "409",
        "title": "Chicana/o Art Studio in Painting",
        "description": "Prerequisite: Introductory course in Chicana/o Studies or ART 124A. Recommended: Previous art/drawing experience. Through the medium of painting/art practice, introduction to Mexican and Chicana/o world views and aesthetics. Painting assignments provide experience working in various media, including a choice of oils, acrylic and/or watercolor, with styles/approaches to subject matter ranging from representational to expressive and abstraction. Emphasis on learning fundamental skills in painting and application of formal art elements as well as experimentation in various painting media. The class meets twice weekly for 3 hours each class, 6 hours total. Course may be repeated once. Portfolio review required. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{Introductory course in Chicana/o Studies} || {ART 124A}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "414",
        "title": "Dance of Mexico I",
        "description": "Corequisite: CHS 414L. Introduction to selected dance forms representative of diverse regions of Mexico. Emphasis on basic dance techniques, mastery of characteristic foot work, as well as a study of the historical development of dance. Available for graduate credit.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{CHS 414L}"
    },
    {
        "subject": "CHS",
        "catalog_number": "414L",
        "title": "Dance of Mexico I Lab",
        "description": "Corequisite: CHS 414L. Introduction to selected dance forms representative of diverse regions of Mexico. Emphasis on basic dance techniques, mastery of characteristic foot work, as well as a study of the historical development of dance. Available for graduate credit.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{CHS 414}"
    },
    {
        "subject": "CHS",
        "catalog_number": "415",
        "title": "Dance of Mexico II",
        "description": "Corequisite: CHS 415L. Advanced study of Mexican regional dance forms. Focuses on further investigation of the varied and complex dances and their historical background. Available for graduate credit. 1 hour lecture; 4 hours activity.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{CHS 415L}"
    },
    {
        "subject": "CHS",
        "catalog_number": "415L",
        "title": "Dance of Mexico II Lab",
        "description": "Corequisite: CHS 415L. Advanced study of Mexican regional dance forms. Focuses on further investigation of the varied and complex dances and their historical background. Available for graduate credit. 1 hour lecture; 4 hours activity.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{CHS 415}"
    },
    {
        "subject": "CHS",
        "catalog_number": "417",
        "title": "Equity and Diversity in Schools",
        "description": "Prepares teacher candidates to examine principles of educational equity, diversity and the implementation of curriculum content and school practices for elementary/secondary students. Focuses on the history and culture of a specific ethnic experience and a comparative analysis is made with other ethnic groups in California. Engages students to examine, critique and reflect on their personal biases regarding children of color. Not available for credit in addition to AAS 417, AFRS 417, ARMN 417 or ELPS 417. Available for graduate credit. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "420",
        "title": "Chicana/o in the U.S. Economy",
        "description": "Examines and studies Chicanas/os in relation to the U.S. economy. Study of the development of the capitalist state and its relationship to the U.S society. Includes analysis of labor history in the U.S with a specific emphasis on Chicano labor history. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "430",
        "title": "The Chicana/o Child",
        "description": "Review of the cognitive, affective and psychomotor development of Chicana/o and Latina/o children. Examines patterns of school adjustment and achievement of Chicana/o and Latina/o children and other language minority students. Explores the sociocultural and linguistic aspects of learning and current theoretical frameworks and standards of implementation related to programs for language-minority students. Available for Section A of the Multicultural Requirement for Credential Candidates. Available for graduate credit. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "431",
        "title": "The Chicana/o Adolescent",
        "description": "Preparatory: Completion of the lower division writing requirement. Explores patterns of selection, innovation and recreation of ethnic and gender identity and theories of adolescent formation among Chicana/o and other Latina/o adolescents. Fieldwork/observation and regular written assignments required. For prospective elementary and secondary school teachers. Available for Section A of the Multicultural Requirement for credential candidates. Available for graduate credit. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "432",
        "title": "Counseling the Chicana/o Child",
        "description": "Preparatory: Completion of the lower division writing requirement. Overview of social, cultural and educational factors that impact the psychological development of Chicana/o and other Latina/o children. Studies the nature of psychological issues associated with the immigrant and acculturation process and the role of the teacher, counselor and family in dealing with these issues. Primarily for prospective teachers and school counselors at the elementary- and secondary-school levels and is a viable option for those seeking either a teaching or counseling credential. Available for Section A of the Multicultural requirement for credential candidates. Available for graduate credit. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "433",
        "title": "Language Acquisition of the Chicana/o and ESL Speakers",
        "description": "An introduction to the study of language acquisition, specifically focusing on the linguistic factors that influence language development among Chicanas/os and other language-minority children. The course provides an introduction to the structure and function of language and to theories of first and second language acquisition. We will relate these theories to monolingual language acquisition as well as language acquisition among bilingual Chicano/Latino and other immigrant children. There also will be an emphasis on the relationship of language to ethnic identity and how this relates to second language acquisition and language development. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "434",
        "title": "Current Educational Theories of Chicana/os in the Schools",
        "description": "Prerequisite: CHS 270. Review of research on issues and problems affecting Chicano students adapting to the schools and the teacher’s response to them. Includes observation of school facilities and classroom techniques. Available for graduate credit. Academic Internship course. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{CHS 270}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "445",
        "title": "History of the Chicano",
        "description": "Prerequisite: Completion of the lower division writing requirement. History of the Mexican people in the U.S. presented in the context of American history and government. Examines American institutions and ideals as developed by the framers of the U.S. and California constitutions and how they have affected the role of the Mexican American in U.S. society. Available for graduate credit. (Available for General Education, D3/D4 Constitution of the United States/State and Local Government.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "453",
        "title": "Theory and the Chicana/o Experience",
        "description": "Study of contemporary political, social and cultural theories and their relationship to the Chicana/o experience in the U.S. Emphasis on theories developed by Chicanas and Chicanos. Questions on the role of praxis, democracy and the transformation of society are also examined. Available for graduate credit. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "460",
        "title": "Politics of the Chicana/o",
        "description": "Critical study of Chicana/o issues, organizations, political models, participation, behavior and the electoral process in the U.S. Includes an examination of race, gender and class dynamics and their relationship to Chicana/o Politics. Available for graduate credit. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "467",
        "title": "Environmental Justice and Chicana/o Communities",
        "description": "This course will provide students with the knowledge to understand how built environments, ecological degradation, water privatization and land confiscation have structured racial inequality in the 20th and 21st centuries. Students will read about the contingent relationships between race, class and economic development that have made Chicana/o, Latina/o, Asian American, African American and Native American populations vulnerable to environmental racism. Together, we will examine the core methods and theories that environmental justice advocates have employed to contest racial, class, gendered and sexual hierarchies. Available for graduate credit. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "470",
        "title": "Cultural Differences and the Chicana/o",
        "description": "Preparatory: Completion of the lower division writing requirement. Study of the processes, effects and possible causes of social and cultural differences and conflict among Chicanos. Includes a study of preventive measures and plans to ameliorate the situation. Intended primarily for elementary and secondary school teachers. Available for Section B of the Multicultural requirement for credential candidates. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "471",
        "title": "Chicano Families",
        "description": "Preparatory: Completion of the Lower Division writing requirement.Overview of demographic social cultural and historical perspectives of Chicano families in the U.S. Critiques social science stereotypes of Chicano families and contrast these with contemporary profiles of diverse family types. Family history project and other writing assignments are required. Intended for prospective elementary and secondary school teachers. Available for Section B of the Multicultural requirement for credential candidates. \n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "473",
        "title": "The Chicana/o and Social Institutions",
        "description": "Preparatory: Completion of the lower division writing requirement. Study of the interaction between the Chicano Community and the educational and social institutions of the dominant society. Topics such as institutional racism, segregation and abuse of authority are analyzed along with a focus on the Chicano community’s organized attempts to advocate for their values and interests. Intended for, but not limited to, prospective elementary and secondary teachers. Regular writing assignments are required. Available for Section B of the Multicultural requirement for credential candidates. Available for graduate credit. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "480",
        "title": "Chicana/o-Latina/o Children’s Literature in Communities",
        "description": "Preparatory: Completion of a lower division literature course or CHS 380. Critical analysis of themes and meanings of U.S.-based Chicana/o-Latina/o children’s literature using contemporary literary and cultural theory tools. Students explore and practice the use of Chicana/o-Latina/o children’s literature in school communities to promote cultural awareness and humanization among children and families. Course requires fieldwork in Chicano/Latino communities. Available for graduate credit. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "482",
        "title": "Language of the Barrio",
        "description": "Preparatory: Completion of the lower division writing requirement. Examines the origin and current features of informal spoken Spanish in the Southwestern U.S. Includes an analysis of common colloquial forms, slang, profanity and code-switching. Addresses English usage among Chicanas/os. Available for Section C of the Multicultural requirement for credential candidates. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "486A",
        "title": "Nahuatl I",
        "description": "Study of the basic structures of the Nahuatl language as it is reflected in written manuscripts. Phonology, syntax and lexicon of Classic Nahuatl is examined with the purpose of enabling the student to translate passages from primary sources. Available for graduate credit. Meets the Ethnic Studies requirement. (ES)\n*Not available for General Education credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "486B",
        "title": "Nahuatl Ii",
        "description": "Preparatory: CHS 486A.Intermediate course in Nahuatl covers more complex structures not included in the first course. Passages from classical prose and poetry are read and translated with interest directed at basic language training. Emphasis on development of the ability to read selections from various Nahuatl documents. \n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "488",
        "title": "Literature Of Borders And Globalization: The Americas",
        "description": "Recommended Preparatory: CHS 115 201 or equivalent. The idea of a dialogical literature in the countries in the American continent an idea that has influenced Latin American writers in the 20th century has also been an important concept in Chicana/o literature. This course studies the fiction poetry essays and criticism of Chicana/o and Latin American writers in the 20th and 21st century and explores literary production in the context of borders nationality colonialism globalization and cultural identity.  \n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "495C",
        "title": "Selected Topics In Chiana/o Studies",
        "description": "Prerequisite: Completion of Lower Division writing requirement. Preparatory: Senior or Graduate status or permission from instructor.In-depth study of a selected theme or issue in Chicana/o Studies. Topics will change from semester to semester and be restricted in scope and aimed at gaining depth on a particular issue. Critical writing and reading required. Offered for Credit/No Credit or letter grade and elective credit for Chicana/o Studies majors and Minors as well as other students seeking Upper Division elective credit. \n",
        "units": "3",
        "prerequisites": "{Completion of Lower Division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "495E",
        "title": "Selected Topics In Chiana/o Studies",
        "description": "Prerequisite: Completion of Lower Division writing requirement. Preparatory: Senior or Graduate status or permission from instructor.In-depth study of a selected theme or issue in Chicana/o Studies. Topics will change from semester to semester and be restricted in scope and aimed at gaining depth on a particular issue. Critical writing and reading required. Offered for Credit/No Credit or letter grade and elective credit for Chicana/o Studies majors and Minors as well as other students seeking Upper Division elective credit. \n",
        "units": "3",
        "prerequisites": "{Completion of Lower Division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "495P",
        "title": "Selected Topics In Chiana/o Studies",
        "description": "Prerequisite: Completion of Lower Division writing requirement. Preparatory: Senior or Graduate status or permission from instructor.In-depth study of a selected theme or issue in Chicana/o Studies. Topics will change from semester to semester and be restricted in scope and aimed at gaining depth on a particular issue. Critical writing and reading required. Offered for Credit/No Credit or letter grade and elective credit for Chicana/o Studies majors and Minors as well as other students seeking Upper Division elective credit. \n",
        "units": "3",
        "prerequisites": "{Completion of Lower Division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "495S",
        "title": "Selected Topics In Chiana/o Studies",
        "description": "Prerequisite: Completion of Lower Division writing requirement. Preparatory: Senior or Graduate status or permission from instructor.In-depth study of a selected theme or issue in Chicana/o Studies. Topics will change from semester to semester and be restricted in scope and aimed at gaining depth on a particular issue. Critical writing and reading required. Offered for Credit/No Credit or letter grade and elective credit for Chicana/o Studies majors and Minors as well as other students seeking Upper Division elective credit. \n",
        "units": "3",
        "prerequisites": "{Completion of Lower Division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "497",
        "title": "Senior Seminar in Chicana/o Studies",
        "description": "Prerequisite: Senior standing or instructor consent. Integrative seminar serving as a capstone to the interdepartmental major in Chicana/o Studies. Intensive study of selected topics relating to the Chicana/o and the preparation of papers by members of the class.",
        "units": "3",
        "prerequisites": "{{Senior standing} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Independent Study",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "500",
        "title": "Seminar in Chicana/o Studies",
        "description": "Prerequisite: Graduate standing. Investigation of the various disciplines that comprise Chicana/o Studies (e.g., history, literature, etc.). Study of methods and techniques of research used in the various disciplines and their application to Chicana/o Studies are included.",
        "units": "3",
        "prerequisites": "{Graduate standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "501",
        "title": "Seminar in the Social Sciences and the Chicana/o",
        "description": "Prerequisite: CHS 500. Seminar in the methods of analysis and writing of the social sciences. Review of the major works written by social scientists on the Chicana/o, with a critical evaluation of the racial, cultural and environmental models used to study the Chicana/o. Students survey and evaluate social science research as well as participate in a research design.",
        "units": "3",
        "prerequisites": "{CHS 500}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "502",
        "title": "Seminar in the Humanities and the Chicana/o",
        "description": "Prerequisite: CHS 500. Seminar in the humanities, comparing the Western European tradition with that of Meso-America. Study of theories of aesthetics and philosophies from both perspectives and their influence on current Chicana/o thought, literature and folklore. Emphasis on the various approaches to literary analysis of the different literary genres.",
        "units": "3",
        "prerequisites": "{CHS 500}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "503",
        "title": "Seminar on Chicana/o and the Arts",
        "description": "Study of the music, drama and graphic arts produced by Chicanas/os as an expression of the Chicana/o experience in the U.S. Emphasizes Chicana/o artistic expression that has its roots and inspiration in Mexican art forms, often combined with U.S. or European influences.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "504",
        "title": "Xicana Visual Art",
        "description": "Prerequisite: Graduate status or permission from instructor. The course examines the mytho-historical influences, “altar-native” spiritualities, oppositional politics, hybrid realities and complex “transforming” identities that inform Chicana visual expression/creative production and cultural activism. Visual art studied includes painting, printmaking, mixed-media, altares/nichos, muralism, photography, installation, video and other diverse forms where relevant to Chicana art.",
        "units": "3",
        "prerequisites": "{{Graduate status} || {permission from instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "505",
        "title": "Advanced Fieldwork in the Barrio",
        "description": "Advanced field study. Students are exposed to rigorous analysis of behavioral studies of the Chicano community and techniques in fieldwork.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "506",
        "title": "Studies in the Education of the Chicana/o",
        "description": "Evaluation of the American educational system. Emphasizes school organizational structure, administrative theory and application, multicultural curriculum and instruction, parent involvement and community relations. Designed to give graduate students an opportunity to explore strategies for promoting change in our educational institutions to benefit Chicana/o and other language-minority students.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "507",
        "title": "Seminar in Chicana/o Studies Research Methods",
        "description": "Prerequisite: Graduate status. This course introduces students to quantitative and qualitative methods and methodology. It provides an intensive exploration of research tools and techniques relevant to Chicano/a Studies. The course provides a basic introduction to research methods and tools. Students will complete a research proposal that will include a literature review, statement of research problem and research design.",
        "units": "3",
        "prerequisites": "{Graduate status}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "509",
        "title": "Chicanas and Feminism",
        "description": "Critical examination of the origin and development of Chicana feminism(s) from an interdisciplinary perspective and review of the ways Chicana feminist thought, visions of social justice, and the construction of knowledge may inform research.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "514",
        "title": "Performance and Identity",
        "description": "Introduction to issues of identity in popular Chicana/o performance. The course explores current theories of identity formation and uses performance methodologies to create solo and group performances that reflect contemporary issues in the Chicana/o Community.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "560",
        "title": "Seminar In Chicana/o Politics",
        "description": "Advanced comprehensive study of Chicana/o politics that includes political models issues ideologies organizations participation behavior and the electoral process. Attention given to race gender class and sexual-orientation dynamics. Applied qualitative and quantitative research is an integral part of the course. \n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "584",
        "title": "The Novel of the Mexican Revolution",
        "description": "Prerequisite: SPAN 104 or instructor consent. Study and text analysis of selected novels that describe the revolutionary struggle during the years 1910-1915 and the profound changes that the revolution produced in Mexican society. Emphasis on the novelists’ disillusion with many of the revolutionary governments. Conducted in Spanish. (Cross-listed with SPAN 484.)",
        "units": "3",
        "prerequisites": "{{SPAN 104} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "587",
        "title": "The Contemporary Mexican Novel",
        "description": "Prerequisite: SPAN 104 or instructor consent. Study of the recent trends in the Mexican novel through the reading of selected works by the best-known contemporary Mexican male and female novelists. Conducted in Spanish. (Cross-listed with SPAN 587.)",
        "units": "3",
        "prerequisites": "{{SPAN 104} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "596A",
        "title": "Selected Graduate Topics in Chicana/o Studies",
        "description": "In-depth study of a selected theme or issue in Chicana/o Studies. Topics will change from semester to semester and be restricted in scope and aimed at gaining depth on a particular issue in Chicana/o Studies.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisites: Classified graduate status; Instructor consent. Enrollment is required in the semester in which the comprehensive exam is taken.",
        "units": "3",
        "prerequisites": "{{Classified graduate status} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "698C",
        "title": "Thesis or Graduate Project",
        "description": "Prerequisite: Classified graduate status; Instructor consent. Enrollment is required in the semester in which the thesis or project is completed.",
        "units": "3",
        "prerequisites": "{{Classified graduate status} && {Instructor consent}}",
        "corequisites": "{None}"
    }
]