[
    {
        "subject": "CTVA",
        "catalog_number": "100",
        "title": "Introduction to Mass Communication Arts",
        "description": "Not open to students with credit in JOUR 100. Survey of the fields of radio, television and film as they relate to other mass media. Comparative analysis and evaluation, including historical, societal, legal and individual considerations. (Available for General Education, E Lifelong Learning.) (IC)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "210",
        "title": "Television-Film Aesthetics",
        "description": "TV and film communicative art forms. Representative films and television programs are exhibited and analyzed. (Available for General Education, C1 Arts.) (IC)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "215",
        "title": "Cult Film and Television",
        "description": "Prerequisites: Completion of the lower division writing requirement; Recommended Preparatory: CTVA 100, CTVA 210 and CTVA 220. This course will provide students with an introduction to the “cult” film and television phenomena, to include critical examinations of film and televisual aesthetics, audience reception and fandom studies. (Available for General Education, C1 Arts or C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "220",
        "title": "Foundations of Media Writing",
        "description": "Prerequisite: Completion of the lower division writing requirement. Required of all pre-majors. Basic introductory course in writing for the film and electronic media, with emphasis on preparing scripts in proper formats. Includes a writing evaluation component as part of the course requirement.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "230",
        "title": "Fundamentals of Audio Production",
        "description": "Introductory course in audio production. Training in digital production, audio console operation, use of tape recorders and microphones, tape editing, program formats and announcing. Lab with accompanying lecture, 6 hours per week.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "240",
        "title": "Fundamentals of Video Production",
        "description": "Basic introduction to all aspects of television studio production, audio and video; microphones, audio recorders, cameras, lenses, switching and lighting equipment. Principles of graphics and scenery. Lab with accompanying lecture, 6 hours per week.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "250",
        "title": "Fundamentals of Film Production",
        "description": "Prerequisite: ART 250. Introductory course in Television-Film Production. Use of film as a creative medium and art form in mass communication, using 16mm production techniques. 6 hours lab per week.",
        "units": "3",
        "prerequisites": "{ART 250}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "260",
        "title": "Introduction to Digital Filmmaking",
        "description": "This course provides an introduction to the basic techniques and aesthetics of motion picture production and editing with an emphasis on digital media. Areas of focus include developing, writing, directing, producing, shooting and editing a narrative short project in a digital format. Not available for credit to Film Production, Film Production-Provisional or Television Production majors. 6 hours per week.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "301",
        "title": "Media Research Methods",
        "description": "Prerequisites: CTVA 100, CTVA 210 and CTVA 220. This course provides an introduction to applied critical, quantitative, and qualitative media research methods, with a particular focus on developing an understanding of analyzing media content and media audiences.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210} && {CTVA 220}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "305",
        "title": "History of Television",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 100, CTVA 210, CTVA 220, and CTVA 230 or CTVA 240 or CTVA 250 or CTVA 260. Examination of the historical evolution of American terrestrial television from its inception in radio, to contemporary emergence in online streaming formats. Topics include commercial and nonprofit networks, federal regulation, sociocultural influences in programming, and advertising.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210} && {CTVA 220} && {{CTVA 230} || {CTVA 240} || {CTVA 250} || {CTVA 260}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "309",
        "title": "Film as Literature",
        "description": "Prerequisite: Completion of the lower division writing requirement. Survey of the art of the cinema in order to establish a unique visual literature with its own critical standards. Feature films of various types and from diverse sources are screened. (Available for General Education, C1 Arts.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "310",
        "title": "History of American Cinema",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 100 and CTVA 210; Lower division writing requirement. History of the development of American cinema: formats, film aesthetics, societal impact, evolution as an entertainment medium. Screening and evaluation of representative films.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210} && {Lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "315",
        "title": "New Directions in Electronic Media Systems",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 100 and CTVA 210. Examination of electronic media systems for program production and dissemination, as well as implications for producers, regulators and society as a whole.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "319",
        "title": "Criticism in Cinema and Television Arts",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 100 and CTVA 210; Lower division writing requirement. Analysis of social, cultural, literary and moral aspects of radio, television and film. Examination of media as distributors of information, propaganda and entertainment. Regular written assignments required, including the writing of critical analyses.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210} && {Lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "320",
        "title": "Writing for Film and Television",
        "description": "Prerequisite: Grade of “C” or higher in CTVA 100, CTVA 210, CTVA 220, and CTVA 240 or CTVA 250 or CTVA 260. Basic dramatic screenwriting techniques for television and film. Disciplines of plot construction, characterization and dialogue are examined.",
        "units": "3",
        "prerequisites": "[{CTVA 100} && {CTVA 210} && {CTVA 220} && {{CTVA 240} || {CTVA 250} || {CTVA 260}}]",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "327",
        "title": "Writing for Industrial Media",
        "description": "Prerequisite: CTVA 220. Theory, history and principles of writing industrial film and television programs for business, government and other organized groups.",
        "units": "3",
        "prerequisites": "{CTVA 220}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "329A",
        "title": "Program Production",
        "description": "Prerequisite: Instructor consent. CTVA 230 is required for all students working at KCSN. Principles of management, programming and production with practical application. Students must work at least 3 hours a week for 1 unit. Maximum of 6 units allowable. (Credit/No Credit only)",
        "units": "1",
        "prerequisites": "{Instructor consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "331",
        "title": "Producing the Documentary",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 100, CTVA 210, CTVA 220; Grade of “B-” or higher in CTVA 240 or CTVA 250 or CTVA 260. Intermediate course with a specialized foundation in development and producing that explores the theory and professional practice of documentary production. Lab with accompanying lecture, 6 hours per week.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210} && {CTVA 220} && {{Grade of “B-” or higher in CTVA 240} || {Grade of “B-” or higher in CTVA 250} || {Grade of “B-” or higher in CTVA 260}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "340",
        "title": "Advanced Video Production and Editing",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 100, CTVA 210, CTVA 220 and CTVA 240. Advanced course in the creative use of television studio cameras, lighting, sound, computer graphics and editing principles in television productions, including interview and dramatic formats. Both group and individual projects are structured around theory and practice. Lab with accompanying lecture, 6 hours per week.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210} && {CTVA 220} && {CTVA 240}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "341",
        "title": "Single Camera Television Production",
        "description": "Prerequisites: CTVA 331 or CTVA 340; CTVA 342 or CTVA 343 or CTVA 352 or CTVA 455. Intermediate television production using applied theories and techniques of producing and directing single-camera television. 6 hours of lecture and lab activity per week.",
        "units": "3",
        "prerequisites": "{{{CTVA 331} || {CTVA 340}} && {{CTVA 342} || {CTVA 343} || {CTVA 352} || {CTVA 455}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "342",
        "title": "Digital Cinematography",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 355 (for film production option); grade of “C” or higher in CTVA 100, CTVA 210, CTVA 220 and CTVA 240 (for television production option). Advanced course with a specialized foundation in digital cinematography. The course will explore the theory and professional practice of digital cinematography for television and film. Topics include history, theory, composition, visual design, lighting and special effects. Dual emphasis on individual creativity and production group dynamics. 3 hours lecture; 3 hours lab per week.",
        "units": "3",
        "prerequisites": "{{CTVA 355 (for film production option)} || {{CTVA 100 (for television production option)} && {CTVA 210 (for television production option)} && {CTVA 220 (for television production option)} && {CTVA 240 (for television production option)} }}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "343",
        "title": "Television Production Sound",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 100, CTVA 210, CTVA 220; Grade of “B-” or higher in CTVA 240 or CTVA 250 or CTVA 260. Intermediate course with a specialized foundation in theory and practice of gathering and mixing sound in both single-camera and multiple-camera television production. Lab with accompanying lecture, 6 hours per week.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210} && {CTVA 220} && {{Grade of “B-” or higher in CTVA 240} || {Grade of “B-” or higher in CTVA 250} || {Grade of “B-” or higher in CTVA 260}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "346",
        "title": "Episodic Television Production",
        "description": "Prerequisite: CTVA 341. Covers the development, research, production and postproduction of a short-form episodic television narrative. Requirements include a mid-term and a group creative project consisting of the production of a multi-episode narrative from conception to completion. Lab with accompanying lecture, 6 hours per week.",
        "units": "3",
        "prerequisites": "{CTVA 341}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "350",
        "title": "Film Directing",
        "description": "Prerequisites: Film Portfolio acceptance (for film production option); grade of “C” or higher in CTVA 100, CTVA 210, CTVA 220 and CTVA 250 (for screenwriting option). Examination of basic creative elements and technical approaches necessary to achieve professional excellence in film direction. 6 lab hours per week.",
        "units": "3",
        "prerequisites": "{{Film Portfolio acceptance (for film production option)} && {{CTVA 100 (for screenwriting option)} && {CTVA 210 (for screenwriting option)} && {CTVA 220 (for screenwriting option)} && {CTVA 250 (for screenwriting option)}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "351",
        "title": "Anatomy of Film Producing",
        "description": "Prerequisite: CTVA 240 or CTVA 250. Organization and management for both independent and studio film production. Basic business procedures, financing, budgeting, distribution, exhibition, legal matters, the development of entrepreneurial skills and structure, practices and current trends of the industry.",
        "units": "3",
        "prerequisites": "{{CTVA 240} || {CTVA 250}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "352",
        "title": "Nonlinear Digital Editing",
        "description": "Prerequisites: Film Portfolio acceptance (for film production option); grade of “C” or higher in CTVA 100, CTVA 210, CTVA 220 and CTVA 240 (for television production option). Overview of the theory and practice of nonlinear editing for video and film utilizing nonlinear digital editing work stations. Examines the technical and aesthetic requirements of editing through the use of professional film and video dailies. Gives the student fundamental knowledge and experience the Editor and Assistant Editor must have to run a digital editing system. 3 hours of lecture; 3 hours of lab activity per week.",
        "units": "3",
        "prerequisites": "{{Film Portfolio acceptance (for film production option)} && {{CTVA 100 (for screenwriting option)} && {CTVA 210 (for screenwriting option)} && {CTVA 220 (for screenwriting option)} && {CTVA 250 (for screenwriting option)}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "355",
        "title": "Intermediate Film Production",
        "description": "Prerequisite: Film Portfolio acceptance. Intermediate course in 16mm film production, with emphasis on story and the creative use of the motion picture camera, sound, editing and other aesthetic elements. 6 hours of lab per week.",
        "units": "3",
        "prerequisites": "{Film Portfolio acceptance}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "356",
        "title": "Advanced Film Editing",
        "description": "Prerequisite: CTVA 355. Advanced course in postproduction film technique and aesthetics, including the analysis, application and mastery of editing styles. 6 hours of lab per week.",
        "units": "3",
        "prerequisites": "{CTVA 355}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "357",
        "title": "Advanced Cinematography",
        "description": "Corequisite: CTVA 355. Advanced course in film production techniques and aesthetics, including detailed examination of film grammar as it is created in the camera, lighting technology and practice, camera technology, optics of lenses and their effect on aesthetics, principles of composition, new technologies, computerized application and special cinematic situations (e.g., infrared, underwater and macro-cine). 6 hours of lab per week.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{CTVA 355}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "358",
        "title": "Advanced Film Sound",
        "description": "Corequisite: CTVA 355 (for film production option). Prerequisite: grade of “C” or higher in CTVA 100, CTVA 210, CTVA 220 and CTVA 240 (for television production option). Advanced course in the theory and practice of sound gathering and mixing for motion picture production, including technical and aesthetic requirements. Use of various technologies and microphones. Presents the mix and postproduction sound editing. 3 hours lecture; 3 hours lab per week.",
        "units": "3",
        "prerequisites": "{{CTVA 100 (for television production option)} && {CTVA 210 (for television production option)} && {CTVA 220 (for television production option)} && {CTVA 240 (for television production option)}}",
        "corequisites": "{CTVA 355 (for film production option)}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "359",
        "title": "Postproduction Sound Design for Film and Electronic Media",
        "description": "Prerequisite: CTVA 355 or CTVA 340. Advanced course with a specialized foundation in postproduction sound recording and mixing. The course will explore the theory and professional practice of sound design for film and electronic media. Topics include history, theory, dialogue editing, sound effects, Foley, ADR and surround sound. Dual emphasis on individual creativity and production group dynamics. 3 hours lecture; 3 hours lab per week.",
        "units": "3",
        "prerequisites": "{{CTVA 355} || {CTVA 340}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "361",
        "title": "Computer Fundamentals for Multimedia",
        "description": "Prerequisite: Grade of “C” or higher in CTVA 100, CTVA 210, CTVA 220, and CTVA 230 or CTVA 240 or CTVA 250 or CTVA 260. General introduction to computers and their use in multimedia design, production, distribution and in desktop video. Covers computer fundamentals, the use of the graphic user interface, provides an overview of the use of computers in multimedia and familiarizes students with appropriate software. 6 hours per week.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210} && {CTVA 220} && {{CTVA 230} || {CTVA 240} || {CTVA 250} || {CTVA 260}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "362",
        "title": "Corporate and Instructional Media",
        "description": "Prerequisite: Grade of “C” or higher in CTVA 100, CTVA 210, CTVA 220, and CTVA 230 or CTVA 240 or CTVA 250 or CTVA 260. Study of contemporary practices in corporate, school, medical and civic media as they relate to educational, training and motivational purposes. Examination of audience needs, objectives, design and writing, production, distribution, utilization and evaluation.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210} && {CTVA 220} && {{CTVA 230} || {CTVA 240} || {CTVA 250} || {CTVA 260}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "363",
        "title": "Fundamentals of Immersive Production",
        "description": "Prerequisite: CTVA 260. This production course focuses on storytelling in 360-degree space through the creation of original stories written and produced as live action immersive media. Students will work in crews to create scripted narrative and/or documentary projects. 6 hours of lab per week.",
        "units": "3",
        "prerequisites": "{CTVA 260}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "364",
        "title": "Interactive Production",
        "description": "Prerequisites: ART 210 and CTVA 363. This production course focuses on the creation of interactive virtual reality and augmented reality storytelling experiences. Students will design and build immersive and interactive computer-generated spaces in which narrative, documentary and experimental stories are communicated. This class will also introduce interactivity, as it relates to storytelling, in the development of screenplays with multiple storylines. 6 hours of lab per week.",
        "units": "3",
        "prerequisites": "{{ART 210} && {CTVA 363}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "370",
        "title": "Immersive Audio Production",
        "description": "Recommended Preparatory: CTVA 359. Intermediate course with a specialized foundation in the theory and practice of creating, designing, implementing, testing, and outputting audio for immersive media productions. 3 hours of lecture; 3 hours of lab activity per week.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "384",
        "title": "Electronic Media Advertising",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 301, CTVA 305 and CTVA 480. Advertising as economic support for broadcast media. Audience, market surveys, network, affiliate rate structures. Impact of Radio-TV advertising on local and national economy.",
        "units": "3",
        "prerequisites": "{{CTVA 301} && {CTVA 305} && {CTVA 480}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "400",
        "title": "Media and Society",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 100 and CTVA 210. An examination of the relationship between media, culture and society with special emphasis on analyzing the function, role and responsibility of mass media in contemporary society. The course covers the social influences (e.g., economics, politics, technology, law and culture) that shape media messages and the effects of those messages on audiences.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "401",
        "title": "Mass Communications Research",
        "description": "Prerequisite: CTVA 100. Inquiry into research methodology in mass communication. Emphasis on solution of research problems in areas relating to the mass media.\n",
        "units": "3",
        "prerequisites": "{CTVA 100}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "405",
        "title": "International Broadcasting",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 301, CTVA 305 and CTVA 480. Comparative examination of broadcasting in foreign nations. Analysis of how radio and television reflect the social and political life of each country.",
        "units": "3",
        "prerequisites": "{{CTVA 301} && {CTVA 305} && {CTVA 480}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "410",
        "title": "Advanced Theory in CTVA",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 100, CTVA 210, and CTVA 319; Lower division writing requirement. This course offers an in-depth study of theories that have shaped the understanding and study of film, television, and emerging entertainment media. Beginning with early debates about cinema, we will move from classic theory to current issues and debates regarding the impact of new technologies across media. Areas of study include form and aesthetics, issues of ideology, critical race and gender theory, queer theory, and reception studies. Available for graduate credit with approval of CTVA graduate coordinator.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210} && {CTVA 319} && {Lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "412",
        "title": "Analysis of Classic Filmmakers",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 100 and CTVA 210; Lower division writing requirement. In-depth analysis of the unique personal visions and creative accomplishments of specially selected film artists, studied from the point of view of technique, visual style, content and sociological implications. Regular written assignments required. Available for graduate credit with approval of CTVA graduate coordinator.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210} && {Lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "413",
        "title": "Women as Filmmakers",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 100 and CTVA 210; Lower division writing requirement. Examination of the careers and film productions of various internationally recognized women filmmakers (e.g., directors, writer/directors, etc.), focusing on their unique contributions in content and style. Emphasis on the present-day scene with films or video from France, Germany, Italy, Australia and the U.S. Regular written assignments required. Available for graduate credit with approval of CTVA graduate coordinator.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210} && {Lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "415C",
        "title": "International Cinema: China",
        "description": "Prerequisites: Completion of the Lower Division writing requirement; CTVA 210 or 310. In-depth analysis of the creative accomplishments of the aesthetic and socioeconomic influences on the cinematic art of a single nation or geographic region other than the U.S. Specific nations or regions will vary from semester to semester. Up to two different sections of this course may be taken for credit in the following areas: (A) Australia; (B) Britain; (C) China; (D) Canada; (E) Eastern Europe; (F) France; (G) Germany; (H) Hispanic; (I) Italy; (J) Japan; and (S) Survey of a variety of countries. Regular written assignments required.\n",
        "units": "3",
        "prerequisites": "{{{CTVA 210} || {CTVA 310}} && {Lower Division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "415J",
        "title": "International Cinema: Japan",
        "description": "Prerequisites: Completion of the Lower Division writing requirement; CTVA 210 or 310. In-depth analysis of the creative accomplishments of the aesthetic and socioeconomic influences on the cinematic art of a single nation or geographic region other than the U.S. Specific nations or regions will vary from semester to semester. Up to two different sections of this course may be taken for credit in the following areas: (A) Australia; (B) Britain; (C) China; (D) Canada; (E) Eastern Europe; (F) France; (G) Germany; (H) Hispanic; (I) Italy; (J) Japan; and (S) Survey of a variety of countries. Regular written assignments required.\n",
        "units": "3",
        "prerequisites": "{{{CTVA 210} || {CTVA 310}} && {Lower Division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "415S",
        "title": "International Cinema: Survey Of A Variety Of Countries",
        "description": "Prerequisites: Completion of the Lower Division writing requirement; CTVA 210 or 310. In-depth analysis of the creative accomplishments of the aesthetic and socioeconomic influences on the cinematic art of a single nation or geographic region other than the U.S. Specific nations or regions will vary from semester to semester. Up to two different sections of this course may be taken for credit in the following areas: (A) Australia; (B) Britain; (C) China; (D) Canada; (E) Eastern Europe; (F) France; (G) Germany; (H) Hispanic; (I) Italy; (J) Japan; and (S) Survey of a variety of countries. Regular written assignments required.\n",
        "units": "3",
        "prerequisites": "{{{CTVA 210} || {CTVA 310}} && {Lower Division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "416",
        "title": "The Documentary Tradition in Film and Video",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 100 and CTVA 210. Examination of the history, functions, ethics and aesthetics of the documentary in both theatrical and television formats. Screening of works from U.S. and international sources, including those that represent the documentary purposes of observation, analysis, persuasion and aesthetic expression. Regular critical writing assignments required. Available for graduate credit with approval of CTVA graduate coordinator.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "420",
        "title": "Screenplay Adaptation",
        "description": "Prerequisite: CTVA 320. Advanced development of student skills and techniques, with emphasis on the adaptation of a published literary work. Available for graduate credit with approval of CTVA graduate coordinator.",
        "units": "3",
        "prerequisites": "{CTVA 320}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "421",
        "title": "Writing the Short Film",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 320 and instructor consent (for screenwriting option); grade of “C” or higher in CTVA 355 and instructor consent (for film production option). Must be taken prior to submission of the senior film proposal. For those who intend to write short film screenplays to be used for senior film productions. Via lectures, discussions and readings, provides dramatic principles pertinent to the writing of a short film script. Students are guided incrementally in a workshop setting through the development of several drafts of the screenplay. Final outcome is a 10-15 page, production-ready shooting script. Available for graduate credit with approval of CTVA graduate coordinator.",
        "units": "3",
        "prerequisites": "{{{CTVA 320 (for screenwriting option)} && {Instructor consent (for screenwriting option)}} || {{CTVA 355 (for film production option)} && {Instructor consent (for film production option)}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "422",
        "title": "Writing the Episodic Series",
        "description": "Prerequisites: Grades of “C” or better in CTVA 220 and CTVA 240 (for Television Production majors); grade of “C” or better in CTVA 320 (for Screenwriting majors). Corequisite: CTVA 341 (for Television Production majors). Intensive writing workshop in which students examine components of successful episodic series. Final project consists of an original, short-form pilot script and the outline for six subsequent episodes.",
        "units": "3",
        "prerequisites": "{{{CTVA 220 (for Television Production majors)} && {CTVA 240 (for Television Production majors)}} || {CTVA 320 (for Screenwriting majors)}}",
        "corequisites": "CTVA 341 (for Television Production majors)"
    },
    {
        "subject": "CTVA",
        "catalog_number": "425",
        "title": "Advanced Screenwriting",
        "description": "Prerequisite: CTVA 420. Advanced problems in writing drama, program specials. Available for graduate credit with approval of CTVA graduate coordinator.",
        "units": "3",
        "prerequisites": "{CTVA 420}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "428",
        "title": "Writing Screenplay Comedy",
        "description": "Prerequisite: CTVA 320. An examination of the theory, spectrum and structures of comedy, as well as the writing of comedy scenes and screenplays. Available for graduate credit with approval of CTVA graduate coordinator.",
        "units": "3",
        "prerequisites": "{CTVA 320}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "440",
        "title": "Theory and Techniques of TV Directing",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 100, CTVA 210, CTVA 220, CTVA 240 (for television production option); grade of “C” or higher in CTVA 320 (for screenwriting option). Theories and techniques of TV directing. Unique characteristics of video as they affect the art of directing. Screening and critique of representative TV programs.",
        "units": "3",
        "prerequisites": "{{{CTVA 100 (for television production option)} && {CTVA 210 (for television production option)} && {CTVA 220 (for television production option)} && {CTVA 240 (for television production option)}} || {CTVA 320 (for screenwriting option)}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "441",
        "title": "Directing the TV Documentary",
        "description": "Prerequisites: CTVA 331 and CTVA 341. Capstone course using applied theories and techniques of producing and directing television documentary. Lab with accompanying lecture, 6 hours per week.",
        "units": "3",
        "prerequisites": "{{CTVA 331} && {CTVA 341}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "442",
        "title": "Television Thesis Production",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 346. Capstone course using applied theories and techniques of producing and directing television comedy and drama programs. 9 hours lab per week.",
        "units": "3",
        "prerequisites": "{CTVA 346}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "452A",
        "title": "Senior Film Project I",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 355 and the following: CTVA 356 or CTVA 357, or both CTVA 358 and CTVA 359, or CTVA 455, and senior standing. Approval of instructor required. Capstone course using applied theories and techniques of film production. 6 hours per week.",
        "units": "3",
        "prerequisites": "{{CTVA 355} && {{CTVA 356} || {CTVA 357} || {{CTVA 358} && {CTVA 359}} || CTVA 455} && {senior standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "452B",
        "title": "Senior Film Project II",
        "description": "Prerequisite: CTVA 452A. Approval of instructor required. Corequisite: CTVA 453. Application of advanced theories and techniques of film postproduction through marketing and distribution phases of a finished film. 3 hours per week.",
        "units": "1",
        "prerequisites": "{CTVA 452A}",
        "corequisites": "{CTVA 453}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "453",
        "title": "Advanced Film Postproduction",
        "description": "Prerequisite: CTVA 452A. Corequisite: CTVA 452B. Application of advanced theories and techniques of film postproduction and participation in finished film productions. Approval of instructor required. 6 hours per week.",
        "units": "3",
        "prerequisites": "{CTVA 452A}",
        "corequisites": "{CTVA 452B}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "455",
        "title": "Principles of Production Management",
        "description": "Corequisites: For Television Production majors, CTVA 340; for Film Production majors, CTVA 355. This course explores the theory and practice of managing live-action media productions. Students will study the most efficient and economic ways to schedule shoots, negotiate business deals for crews, locations and technical equipment, and make day-to-day production decisions to ensure that productions proceed safely and professionally. At the end of the course, each student will have completed a script breakdown, production schedule and budget.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{{For Television Production majors, CTVA 340} || {For Film Production majors, CTVA 355}}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "461",
        "title": "Interactive Multimedia Development",
        "description": "Prerequisites: CTVA 361; Completion of the lower division writing requirement. Development, creation and integration of multimedia elements for entertainment, consumer and corporate products. Introduction to design parameters, preproduction (design documents, budgets, schedules), production, postproduction (testing plans) and implementation. Regular computer assignments required. Lab, 6 hours.",
        "units": "3",
        "prerequisites": "{{CTVA 361} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "462",
        "title": "Intermediate Immersive Production",
        "description": "Prerequisites: ART 364, CTVA 363, CTVA 364. This advanced course expands on skills and techniques specific to immersive production, both cinematic and interactive. Multiple exhibition formats and new technologies will be introduced. 6 hours of lab per week.",
        "units": "3",
        "prerequisites": "{{ART 364} && {CTVA 363} && {CTVA 364}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "463CS",
        "title": "Emerging Media Capstone",
        "description": "Prerequisite: CTVA 462. This production course focuses on service learning through collaboration with community partners to conceptualize, design and execute transmedia projects. Strong communication skills, organization, and time management will be key to successful partnerships and final portfolio ready work. Offers a community service opportunity with activities relating to concepts and theories presented.",
        "units": "3",
        "prerequisites": "{CTVA 462}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "467",
        "title": "The Management of Postproduction for Television and Film",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 100, CTVA 210, CTVA 220, and CTVA 240 or CTVA 250 or CTVA 260. Advanced course on the management processes involved in postproduction, including scheduling and budgeting, setting up and managing an edit room and planning and carrying out cost-effective on-line, sound mixing, color correction and titling sessions for accurate and on-time project delivery.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210} && {CTVA 220} && {{CTVA 240} || {CTVA 250} || {CTVA 260}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "475",
        "title": "Audience Analysis",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 100, CTVA 210, CTVA 220, and CTVA 240 or CTVA 250 or CTVA 260. Lecture/discussion of mass audiences and the techniques used to study their wants, needs, motives, attitudes, opinions and behavior. Survey of audience measurement techniques.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210} && {CTVA 220} && {{CTVA 240} || {CTVA 250} || {CTVA 260}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "480",
        "title": "Electronic Media Management",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 100, CTVA 210, CTVA 220, and CTVA 240 or CTVA 250 or CTVA 260. Study of business problems of station operations. Stress placed on case studies of stations.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210} && {CTVA 220} && {{CTVA 240} || {CTVA 250} || {CTVA 260}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "481",
        "title": "Network Practices",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 301, CTVA 305 and CTVA 480. Network as unique development in broadcasting, its role in distribution of information and the national economy.",
        "units": "3",
        "prerequisites": "{{CTVA 301} && {CTVA 305} && {CTVA 480}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "482",
        "title": "Network Program Development",
        "description": "Prerequisite: Grade of “C” or higher in CTVA 305. Theoretical and practical problems in producing current network television programs. Available for graduate credit with approval of CTVA graduate coordinator.",
        "units": "3",
        "prerequisites": "{CTVA 305}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "483",
        "title": "Emerging Media Programming and Practices",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 301, CTVA 305 and CTVA 480. The business of emerging media programming and practices as a unique development in broadcasting, its role in the distribution of television and film programming and impact on the national economy. Available for graduate credit with approval of CTVA graduate coordinator.",
        "units": "3",
        "prerequisites": "{{CTVA 301} && {CTVA 305} && {CTVA 480}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "487",
        "title": "Social Controls and Regulation of Electronic Media",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 100, CTVA 210, CTVA 220, and CTVA 240 or CTVA 250 or CTVA 260. Legal and social controls in the regulation of electronic media, including broadcasting, cable television, common carriers and communication satellites. Regulatory efforts of federal agencies, such as the FCC, and controlling influences of public interest groups and the electronic media industry itself. Available for graduate credit with approval of CTVA graduate coordinator.",
        "units": "3",
        "prerequisites": "{{CTVA 100} && {CTVA 210} && {CTVA 220} && {{CTVA 240} || {CTVA 250} || {CTVA 260}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "489",
        "title": "Strategic Media Management",
        "description": "Prerequisites: Grade of “C” or higher in CTVA 301, CTVA 305, CTVA 480 and two of the following courses: CTVA 384, CTVA 405, CTVA 467, CTVA 481 or CTVA 483. Senior capstone seminar. Integrating functional media business disciplines of management, marketing, economics, content creation and distribution, audience analysis, finance, accounting, and media law. Detailed examination of business strategies of variety of firms operating in the media industry. Executives will be guest speakers and participate in class discussions. Final project includes comprehensive live-case study of prominent media company.",
        "units": "3",
        "prerequisites": "{CTVA 301} && {CTVA 305} && {CTVA 480} && {Pick 2: CTVA 384, CTVA 405, CTVA 467, CTVA 481 or CTVA 483}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "494A",
        "title": "Internship",
        "description": "Prerequisite: CTVA majors who are seniors in good academic standing only–approval through application and instructor consent. Corequisite: CTVA 494A and CTVA 494B. Students earn 3 units by enrolling in CTVA 494A (1 unit) and CTVA 494B (2 units) concurrently. Extensive on-the-job training in specific areas of Radio, TV, or Film production or administration. Academic Internship Course. CTVA 494A and CTVA 494B may be repeated concurrently once for credit. Maximum 6 units. (Credit/No Credit only)",
        "units": "1",
        "prerequisites": "{CTVA majors who are seniors in good academic standing only–approval through application and instructor consent}",
        "corequisites": "CTVA 494A and CTVA 494B"
    },
    {
        "subject": "CTVA",
        "catalog_number": "500",
        "title": "Theory and History of Cinema and Electronic Media",
        "description": "Prerequisite: Graduate status. Survey of the history of cinema/electronic media, as well as cinema and electronic media theory and criticism, from the silent era through the 1950s.",
        "units": "3",
        "prerequisites": "{Graduate status}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "501",
        "title": "Theory And History Of Cinema And Electronic Media Ii",
        "description": "Prerequisite: CTVA 500. Survey of the history of cinema/electronic media as well as cinema and electronic media theory and criticism from the 1950s to the present.\n",
        "units": "3",
        "prerequisites": "{CTVA 500}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "505",
        "title": "Contemporary Film Analysis",
        "description": "Prerequisite: Graduate status. Exploration of screen story structure and the screenwriting tools of dramaturgy used in contemporary motion pictures to impact audiences emotionally and intellectually. Effective story outlining paradigms are investigated, and story strengths and weaknesses are analyzed. Written film analysis assignments are required.",
        "units": "3",
        "prerequisites": "{Graduate status}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "510",
        "title": "Screenplay Scene Writing",
        "description": "Prerequisite: Graduate status. Investigates the techniques and dramatic tools used to write powerful scenes for the screen. Emphasis on the creation of fully dimensional characters, use of visual elements, tempo, timing, descriptive style, and dialogue. This workshop course is product-oriented and students complete a screenplay project. May be repeated once for credit.",
        "units": "3",
        "prerequisites": "{Graduate status}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "512",
        "title": "Seminar In Cinema And Contemporary Media Theory",
        "description": "Prerequisite: CTVA 500. Seminar in specific cinema and/or electronic media theory. Includes analysis and evaluation of the works of major cinema and media theorists.\n",
        "units": "3",
        "prerequisites": "{CTVA 500}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "525",
        "title": "Seminar in Screenwriting",
        "description": "Prerequisites: CTVA 425, CTVA 501. Identification and analysis of the student writer’s creative strengths and weaknesses. Format includes exercises and original screenplay material specifically designed to strengthen narrative skills.",
        "units": "3",
        "prerequisites": "{{CTVA 425} && {CTVA 501}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "595A",
        "title": "Studies in Mass Communication",
        "description": "Prerequisite: Graduate status. Graduate studies in Cinema and Television Arts Mass Communication. Faculty members will lead a small group of students in the study of the following general areas with exact content to be determined.\nCourse Title\nCTVA 595A Advanced Research\nCTVA 595B History\nCTVA 595C Theory\nCTVA 595D Writing Episodic Television\nCTVA 595E TV Production\nCTVA 595F Film Practicum: The Business of Film and TV\nCTVA 595G Educational Media",
        "units": "3",
        "prerequisites": "{Graduate status}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "595D",
        "title": "Studies In Mass Communication: Writing Episodic Television",
        "description": "Prerequisite: Graduate Status. Graduate studies in Cinema and Television Arts Mass Communication. Faculty members will lead a small group of students in the study of the following general areas with exact content to be determined: (A) Advanced Research; (B) History; (C) Theory; (D) Writing Episodic Television; (E) TV Production; (F) Film Practicum: The Business of Film and TV; (G) Educational Media; (H) Management; and (I) International Communication.\n",
        "units": "3",
        "prerequisites": "{Graduate Status}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "595E",
        "title": "Studies In Mass Communication: Tv Production",
        "description": "Prerequisite: Graduate Status. Graduate studies in Cinema and Television Arts Mass Communication. Faculty members will lead a small group of students in the study of the following general areas with exact content to be determined: (A) Advanced Research; (B) History; (C) Theory; (D) Writing Episodic Television; (E) TV Production; (F) Film Practicum: The Business of Film and TV; (G) Educational Media; (H) Management; and (I) International Communication.\n",
        "units": "3",
        "prerequisites": "{Graduate Status}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "595F",
        "title": "Studies In Mass Communication: Film Practicum",
        "description": "Prerequisite: Graduate Status. Graduate studies in Cinema and Television Arts Mass Communication. Faculty members will lead a small group of students in the study of the following general areas with exact content to be determined: (A) Advanced Research; (B) History; (C) Theory; (D) Writing Episodic Television; (E) TV Production; (F) Film Practicum: The Business of Film and TV; (G) Educational Media; (H) Management; and (I) International Communication.\n",
        "units": "3",
        "prerequisites": "{Graduate Status}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "595G",
        "title": "Studies In Mass Communication: Educational Media",
        "description": "Prerequisite: Graduate Status. Graduate studies in Cinema and Television Arts Mass Communication. Faculty members will lead a small group of students in the study of the following general areas with exact content to be determined: (A) Advanced Research; (B) History; (C) Theory; (D) Writing Episodic Television; (E) TV Production; (F) Film Practicum: The Business of Film and TV; (G) Educational Media; (H) Management; and (I) International Communication.\n",
        "units": "3",
        "prerequisites": "{Graduate Status}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "595H",
        "title": "Studies In Mass Communication: Management",
        "description": "Prerequisite: Graduate Status. Graduate studies in Cinema and Television Arts Mass Communication. Faculty members will lead a small group of students in the study of the following general areas with exact content to be determined: (A) Advanced Research; (B) History; (C) Theory; (D) Writing Episodic Television; (E) TV Production; (F) Film Practicum: The Business of Film and TV; (G) Educational Media; (H) Management; and (I) International Communication.\n",
        "units": "3",
        "prerequisites": "{Graduate Status}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "622",
        "title": "Department Colloquium",
        "description": "Prerequisite: CTVA 500. Intensive study of contemporary issues in Screenwriting by Graduate Faculty on a rotating basis.\n",
        "units": "3",
        "prerequisites": "{CTVA 500}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "625",
        "title": "Writing the Feature-Length Screenplay",
        "description": "Prerequisites: CTVA 505, CTVA 525. In this course, screen story structure creation undertaken in CTVA 525 will be continued to the completion of a feature-length screenplay. This is a product-oriented course. May be repeated once for credit.",
        "units": "3",
        "prerequisites": "{{CTVA 505} && {CTVA 525}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "692",
        "title": "Thesis Script Preparation",
        "description": "Prerequisite: CTVA 525. Instruction in the steps of thesis publication and individual guidance in developing original story ideas into full outlines for thesis screenplays. The first act of a feature-length thesis script is also written as preparation for final thesis completion and publication in CTVA 698C. This is a product-oriented course.",
        "units": "3",
        "prerequisites": "{CTVA 525}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "694A",
        "title": "Internship",
        "description": "Prerequisite: Approval of graduate advisor. Corequisite: CTVA 694A and CTVA 694B. Students earn 3 units by enrolling in CTVA 694A (1 unit) and CTVA 694B (2 units) concurrently. Intensive on-the-job training beyond the entry level in film, television and/or allied industries. CTVA 694A and CTVA 694B may be repeated concurrently once for credit. (Credit/No Credit only)",
        "units": "1",
        "prerequisites": "{Approval of graduate advisor}",
        "corequisites": "{{CTVA 694A} && {CTVA 694B}}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "698C",
        "title": "Thesis or Graduate Project",
        "description": "Prerequisites: CTVA 501, CTVA 602; Approval of graduate advisor.",
        "units": "3",
        "prerequisites": "{{CTVA 501} && {CTVA 602} && {Approval of graduate advisor}}",
        "corequisites": "{None}"
    }
]