[
    {
        "subject": "HIST",
        "catalog_number": "110",
        "title": "World History to 1500",
        "description": "Introduction to major developments in world history from the emergence of complex societies until 1500 c.e. Examines processes of social, cultural, political and economic change throughout this period and emphasizes comparisons of and interconnections between, major world civilizations in Europe, Asia, Africa and the Americas. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "111",
        "title": "World History Since 1500",
        "description": "An introduction to the major developments in world history from 1500 to the present. The course examines the processes of social, cultural, economic and political change throughout this period and emphasizes the production of global cultures and reactions to them. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "150",
        "title": "Western Civilization to 1500",
        "description": "An introduction to the major topics, themes, literature and dreams of Western Civilization, from its ancient origins to the early modern era. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "151",
        "title": "Western Civilization Since 1500",
        "description": "An introduction to major social, political, intellectual and cultural developments in modern Western Civilization from the Renaissance to the present. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "161",
        "title": "The History of Latin America from Pre-Columbian Times to Today",
        "description": "Learn about the important historical contributions made by indigenous peoples, Africans, Europeans, and immigrants from all over the globe to the rich history of what comes to be known as Latin America. Explore the history of the Maya, Mexica, and Inca civilizations. Understand the violent encounters between indigenous peoples and Europeans; the rise of independent states; the revolutions that rocked Haiti, Mexico, and Cuba; and the most pressing issues facing Latin America today. (Available for General Education, F Comparative Cultural Studies.) (IC)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "185",
        "title": "Middle East from 600CE to the Present",
        "description": "Explore the historical development of various regions from North Africa to Southwest Asia. Examine milestones in the history of this part of the world including the emergence of Islam, Abbasid culture, the Mongol conquests, gunpowder empires, European imperialism, and the rise of modern Middle Eastern states. Understand the diversity of experiences that continue to shape these areas into the present. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "192",
        "title": "History of Modern East Asia",
        "description": "Learn about the historical roots of Chinese, Korean, and Japanese societies from the 1700s to the present. Consider the scars left by Western imperialism in the 1800s. Trace the emergence of nationalist movements. Examine Japanese imperialism in Asia and the impact of the Second World War. Explore the communist revolution in China. Discover how East Asian leaders took advantage of the Cold War and globalization to transform their economies into powerhouses. (Available for General Education, F Comparative Cultural Studies.) (IC)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "210",
        "title": "A History of the Jewish People",
        "description": "Study of the Jewish people from their beginnings in the ancient Near East to the establishment of the modern state of Israel. (Cross-listed with JS 210.) (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "270",
        "title": "The United States to 1865",
        "description": "Survey of the political and social development of the U.S. through the Civil War. (Available for General Education, C3 American History, Institutions and Ideals.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "271",
        "title": "The United States Since 1865",
        "description": "Survey of the political and social development of the U.S. since the Civil War. (Available for General Education, C3 American History, Institutions and Ideals.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "301",
        "title": "The Historian’s Craft",
        "description": "What do historians do, and how do they do it? Learn how to think, write, and research like a historian. Improve your critical thinking. Enhance your ability to analyze historical documents, construct logical and compelling arguments, and convey information to others. History majors must pass this course with a grade of “C” or better in order to graduate.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "303",
        "title": "Themes in Western Civilization Before 1500",
        "description": "Prerequisite: Completion of the lower division writing requirement. Intended to introduce upper division students to the concepts and unresolved problems that have shaped the development of Western Civilization prior to 1500. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "304",
        "title": "Themes in Western Civilization After 1500",
        "description": "Prerequisite: Completion of the lower division writing requirement. Themes in the institutional, political, socioeconomic and cultural development of Western Civilization since 1500. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "305",
        "title": "Cultural History of the United States",
        "description": "Prerequisite: Completion of the lower division writing requirement. American people’s evolving patterns of life in such areas as religion, education, art, architecture and music, reading matter, sports, travel, family life, and, in recent times, motion pictures, radio and television. Emphasis is placed on the values and implications revealed by the range and popularity of cultural choices. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "340",
        "title": "Europe and the Early Modern World",
        "description": "Europe experienced dramatic change between Columbus’s voyages and Napoleon’s wars. Around the world, meanwhile, Europeans coexisted and clashed with other peoples as they settled, enslaved, and helped build networks of exchange that became truly global. Delve into debates about witches and cannibals. Examine confrontations between colonists and Indians on the American frontier. Understand how encounters with non-European peoples shaped the thinking of important philosophers like Locke, Rousseau, and Adam Smith. Discover how modern notions of equality, liberty, property, and race sprang from the interactions of Europeans with peoples around the globe.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "341",
        "title": "Modern Europe Since the French Revolution",
        "description": "Prerequisite: Completion of the lower division writing requirement. Explore important developments in the history of Europe from the French Revolution to the present day. Investigate social and political unrest, the Industrial Revolution, imperialism, the World Wars, and the construction of the European Union. Understand the forces that have brought Europe together and torn it apart. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "342",
        "title": "The World Since 1945",
        "description": "Prerequisite: Completion of the lower division writing requirement. Explore major political, economic, social, and cultural developments from the end of the Second World War to the present. Learn about the Cold War, communism, decolonization, globalization, and major trends in science, technology, and health. Among the activities in the course, you may find yourself engaging in debates and role-playing exercises. (Available for General Education, D1 Social Sciences.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "345",
        "title": "War in History and Film",
        "description": "Movies, images, and texts have historically shaped popular support for and opposition to war, created heroic figures, reinforced ideals of gender and race, and promoted nations and nationalism. Develop a critical understanding of historical perceptions of war by analyzing film, history, and literature.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "349A",
        "title": "American Women I",
        "description": "Prerequisite: Completion of the lower division writing requirement. Explore the history of American women from indigenous societies to the first women’s movement. Examine the intersections of race, class, gender, and sexuality. See how women navigated a biased legal system. Understand the limits of citizenship in early America. (Available for General Education, F Comparative Cultural Studies.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "349B",
        "title": "Women in American History Since 1848",
        "description": "Prerequisite: Completion of the lower division writing requirement. Survey of women’s roles and status since 1848. (Available for General Education, F Comparative Cultural Studies.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "350",
        "title": "History of Women",
        "description": "Prerequisite: Completion of the lower division writing requirement. Roles and contributions of women from ancient times to the present. Special emphasis is given to the development of women’s movements from the 18th century to the present. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "357",
        "title": "History of the Holocaust",
        "description": "Learn about how and why the Nazis and their collaborators persecuted and murdered Jews and other groups they deemed inferior. Survey long-term causes such as anti-Semitism as well as short-term factors including World War I and II. Read about Hitler’s racial ideology; delve into the world of Auschwitz and the concentration camps; analyze the actions and responses of victims and bystanders; discuss attempts to bring the perpetrators to justice. (Cross-listed with JS 357.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "366",
        "title": "Popular Culture in Latin America",
        "description": "Prerequisite: Completion of the lower division writing requirement. Learn about Latin American history by exploring its music, films, food, festivals, and religion. Uncover the complexities of the region. Develop a better understanding of Latin America’s rich and diverse popular culture. (Available for General Education, E Lifelong Learning.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "369",
        "title": "Native Peoples and Cultures",
        "description": "Prerequisite: Completion of the lower division writing requirement. Challenge common American stereotypes of native peoples propagated in films and other media. Gain an understanding of the diverse cultures and experiences of native communities within the present-day borders of the United States. Explore themes of indigenous identity, historical trauma, and resilience. Examine how American Indians survived, resisted, and adapted to colonial and national forces. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "370",
        "title": "Questions in American History to the Civil War",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examine American history from early indigenous societies to the U.S. Civil War. Learn about Native American cultures, European and African migrations, and regional patterns of settlement. Understand the development of slavery, democracy, women’s rights, capitalism, and westward expansion. (Available for General Education, C3 American History, Institutions and Ideals.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "371",
        "title": "Questions in American History Since the Civil War",
        "description": "Prerequisite: Completion of the lower division writing requirement. Deepen your understanding of modern American history by delving into issues such as immigration, migration, urbanization, and suburbanization. Examine social movements and civil rights from Reconstruction to the twenty-first century. Investigate political and economic tensions in America and the rise of the U.S. as a global superpower. (Available for General Education, C3 American History, Institutions and Ideals.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "374",
        "title": "Hollywood and History",
        "description": "Explores the relationship of classic Hollywood movies to the political, social and cultural history of 20th century America. By placing each film in its historical context and examining it as a primary source, students will learn to evaluate the extent to which American movies have expressed or challenged the dominant political themes and social and cultural values of a particular historical era.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "380",
        "title": "Los Angeles: Past, Present, Future",
        "description": "Prerequisite: Completion of the lower division writing requirement. Multidisciplinary investigation of the Los Angeles urban area—its patterns of population and resources distribution; its historical, economic, social and cultural developments; and policies models designed to cope with its problems—and to develop its potential as an ethnically diverse metropolis on the Pacific Rim. Application of social science methodology. Series of faculty and guest speakers, weekly discussion sessions and field trips. (Cross-listed with POLS 380 and URBS 380.) (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "402",
        "title": "Writing Family History",
        "description": "Application of historical research techniques to the writing of ones own family history.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "409",
        "title": "History of the Jews in the Modern Era",
        "description": "A history of the Jewish people from the 17th century to the present. Principal themes include the transformation of the traditional community, the changes in Jews’ political status, the emergence of modern anti-Semitism, and ethnic and gender distinctions within Jewry. (Cross-listed with JS 409.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "410",
        "title": "The Ancient Greek World",
        "description": "Discover the history of the Greeks from Athenian democracy to the conquests of Alexander the Great and the spread of Greek culture from the Mediterranean to central Asia. Hone your critical thinking skills through encounters with Socrates, Plato, and the earliest historians Herodotus and Thucydides.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "411",
        "title": "Rome from Republic to Empire",
        "description": "Trace the history of Rome from its mythic origins, to a resilient republic, to an empire that stretched from Britain to Mesopotamia. Understand what it meant to be a citizen of Rome. Explore the tensions between rich and poor, the might of the Roman legions, and the many debates about Rome’s decline.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "415",
        "title": "The Byzantine World",
        "description": "Byzantine history and civilization, from the founding of Constantinople in 324 A.D. to the Turkish conquest in 1453.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "417",
        "title": "California for Educators",
        "description": "Prerequisite: Available to Liberal Studies, Pre-Credential and ITEP students. Examination of California, focusing on its political, social and economic growth, its settlement, its population patterns, resource exploitation and human-environment interaction. Spatial and temporal variation of these factors is emphasized. (Cross-listed with GEOG 417.)",
        "units": "3",
        "prerequisites": "{Available to Liberal Studies, Pre-Credential and ITEP students}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "420",
        "title": "Getting Medieval: Europe From the Barbarian Kingdoms to the Black Death",
        "description": "Wander through medieval kingdoms to deepen your understanding of knights and Crusades, chivalry and romance, faith and loyalty, violence and death. Encounter medieval thinkers, rulers, peasants, and pilgrims and learn about how they interpreted their expanding horizons from the early to later Middle Ages. Consider the nature of medieval beliefs; the ideal of devotion to a ruler, a lord, or a lady; and the obsession with suffering and sanctity. Better understand the marginalized voices of peasants, women, and heretics and how they threatened medieval social hierarchies.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "424",
        "title": "Medieval Middle East",
        "description": "Trace the development of Southwest Asia and North Africa from the Early Islamic period to the Mongol destruction of Baghdad in 1258. Discover how Islamicate conceptions of religion, government, and culture influenced the diverse communities of the region.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "425",
        "title": "Early Modern Middle East",
        "description": "Trace the development of Southwest Asia and North Africa from the Mongol destruction of Baghdad in 1258 to the rise and fall of the Gunpowder Empires. Explore how these empires, and the cultures that developed under their control, interacted. Discover the encounters and relationships that emerged between this important part of the world and the regions around it.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "426",
        "title": "A History of the Modern Middle East 1798-1979",
        "description": "Preparatory: HIST 185. This course will trace the development of religion, government, culture and society in the Middle East in the modern period (1798-1979 CE). This course is designed to be an investigation of different perspectives on the history of the Middle East from 1789, the date of Napoleon’s invasion of Egypt, until roughly the Iranian Revolution of 1979. The focus of this class will be on individual and collective reactions to the dramatic changes happening during this period. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "427",
        "title": "Israel’s History and Peoples",
        "description": "A history of the modern State of Israel, from the emergence of modern Jewish nationalism to the present time. The conflicts between Jews, Palestinians, and imperial and regional powers will be examined, as well as the relations between the diverse peoples that constitute Israel’s multicultural, multireligious, and multinational society. (Cross-listed with JS 427.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "428",
        "title": "History of the British Empire",
        "description": "At its height, the British Empire was the largest empire in the history of the world. Explore the causes and consequences of British imperialism from its origins in Ireland and North America to its spectacular collapse in Asia and Africa. Learn about the American Revolution from the British point of view, the growth and abolition of slavery, the opium trade, the British Raj in India, and the rise of anti-colonial leaders including Gandhi.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "429",
        "title": "History of Chocolate: Commodities in World Exchanges",
        "description": "Recommended Preparatory: HIST 301. This course explores the history of chocolate with an emphasis on the impact and meaning that cacao and chocolate have had on societies around the world from pre-Columbian times to the 20th century. Class discussions will focus on the production and consumption of cacao and chocolate as a means to uncover larger historical processes such as indigenous pre-Columbian societies, the Columbian exchange, the expansion of global capitalism, slavery, industrialization, and post-colonialism. From this survey of chocolate in history, students will gain a greater understanding of how a crop has influenced, and is influenced by myriad historical processes.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "433",
        "title": "Public History",
        "description": "Introduction to the theory, history and practice of public history (the presentation and interpretation of history for the general public). Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "434",
        "title": "European Imperialism",
        "description": "Learn about the rise and fall of European empires from the Spanish conquest of the Americas, to the British Raj in India, to human rights abuses in the Belgian Congo. Analyze European views of non-European people through art, film, and literature. Follow Captain Cook across the Pacific and trace Henry Stanley’s epic search for David Livingstone. Discuss the Scramble for Africa and the intersections of race and gender with colonial power. Discover how terrorism forced the French retreat from Algeria. Finally, explore the legacies of European imperialism by examining the lives of North African, Indian, and Caribbean immigrants in Europe today.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "435",
        "title": "Africa, Africans, and the World: From Early Humans to the Slave Trade",
        "description": "Take a journey from the origin of early African peoples to the encounters between Africans and Europeans. Discover complex understandings of the African continent: from the cradle of mankind to the early African civilizations that developed there. Examine early African cultures and religions, including African contributions to the development of Christianity and Islam. Hone your skills by investigating sources on African history from stone tools and monuments to oral narratives and written documents. Examine how the African past has been recorded, preserved, and transmitted over generations.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "436",
        "title": "Africa, Africans, and the World Since the Slave Trade",
        "description": "Most of Africa was controlled by Africans until the Scramble for Africa. Explore how Africans confronted European imperialism and how the ensuing struggle reshaped the continent. Understand how Africans responded to this challenge, as Ethiopians and Liberians, for example, maintained their independence and by contrast the Congolese and South Africans confronted economic exploitation and settler colonialism. Investigate the political systems that emerged at the end of the colonial period, the challenges and crises that independent countries have faced, and the place of Africa in today’s world.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "441",
        "title": "The Second World War",
        "description": "Discover the many ways in which the Second World War was a watershed experience in modern history. Learn about appeasement, the Nazi-Soviet Non-Aggression Pact, and German blitzkrieg tactics. Trace Japan’s bid for hegemony in Asia. Follow the war in the Pacific from Pearl Harbor to Hiroshima and Nagasaki. Examine the Holocaust and the consequences of Nazi genocidal policies. Step inside the conference room where Stalin, Roosevelt, and Churchill discussed the future of the world. Ride along with an American GI crossing the Rhine and a Soviet “night witch” female pilot bombing the German army. Consider how the war transformed the home front and gender relations, and understand how this war still shapes our world today.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "444",
        "title": "Renaissance and Reformation",
        "description": "Learn about the Italian Renaissance, the spread of European humanism, popular belief and witchcraft, the Protestant Reformation, the Wars of Religion, and the Scientific Revolution.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "445",
        "title": "Absolutism And Revolution",
        "description": "Europe in the age of colonial expansion and the rise of revolutionary doctrines through the fall of Napoleon.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "446",
        "title": "19th Century Europe",
        "description": "Investigate major transformations in European history from Napoleon to the First World War. Learn about the Industrial Revolution; the emergence of liberalism, socialism, and nationalism; the spread of imperialism; changing gender roles; and the rise of a consumer society.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "449",
        "title": "Russia to 1917",
        "description": "Learn about Russian history from the earliest settlements to the fall of the Romanov dynasty in 1917. Explore how geography, climate, and religion helped shape society. Trace the rise of Imperial Russia under Peter the Great and Catherine the Great. Discover the nineteenth century, the era of reforms, and the golden age of Russian arts and culture. Find out about the collapse of the empire during the First World War, the failure of democratic forces, and the establishment of communist rule.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "450",
        "title": "Russia Since 1917",
        "description": "Investigate the history of the Soviet Union, the first socialist state, from its revolutionary birth to its demise in 1991. Learn about what it was like to be a Soviet citizen during the dictatorship of the proletariat. Explore industrialization and collectivization under Stalin. Find out about Soviet life during the Nazi invasion. Better understand the Cold War confrontation with the United States. Debate the reasons for the collapse of communism and reflect on the role of the Soviet experiment in world history.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "452",
        "title": "Medieval and Tudor Britain",
        "description": "Consider innovations and crises from the Norman Conquest to the Tudors. Learn about the Battle of Hastings, Domesday, Magna Carta, Robin Hood, the Black Death, popular revolts, the Wars of the Roses, the witch craze, the Tudor dynasty, and the English Reformation.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "453",
        "title": "Modern Britain",
        "description": "Learn the story of how a small island kingdom became the first industrial nation and built (and lost) the largest empire in the history of the world. Delve into the world of Queen Victoria, Sherlock Holmes, Jack the Ripper, Winston Churchill, James Bond, and Harry Potter. Tour a Georgian mansion and walk the narrow cobblestone streets of the London slums. Examine Britain’s role in the First and Second World Wars; its struggles in Ireland; its ambivalent relationship with Europe; and the tensions associated with becoming a multiethnic, multicultural society.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "456",
        "title": "Modern France",
        "description": "Over the last five hundred years, France has transformed itself from a medieval kingdom into a modern state. Explore how the French Revolution and Napoleon broke radically with the past and helped usher in the modern world. Investigate how the French have struggled with issues of identity and diversity from the St. Bartholomew’s Day Massacre, through the Dreyfus Affair, to modern-day Islamophobia. Better understand how industrialization, imperialism, and war continue to shape France in the twenty-first century.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "457",
        "title": "Modern Germany",
        "description": "Learn about the development of Germany from Bismarck to the fall of the Berlin Wall. Explore the rise of Prussia and the establishment of Imperial Germany. Trace the impact of the First World War and the Treaty of Versailles. Discover the arts and culture of Weimar society that helped shape ideas of modernity. Find out how democracy failed during the Great Depression and the Nazis took over. Examine how Hitler started the Second World War, attempted to exterminate Europe’s Jews, and led his country to complete defeat. Analyze how a divided Germany became a battleground in the Cold War and since reunification has emerged as the engine of Europe.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "461",
        "title": "Latin America: The Colonial Period",
        "description": "Formation of the Spanish and Portuguese empires in Latin America tracing the development of society government and culture.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "462",
        "title": "Revolutionary Latin America",
        "description": "Explore Latin America from the Haitian to the Mexican Revolution by focusing on the region’s peoples and their experiences. Acquire a better understanding of independence, elite and popular politics, enslavement, race and nation, gender roles, the environment, and popular resistance from the 1800s to the early 1900s.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "463",
        "title": "20th Century Latin America",
        "description": "Study of Latin American history since 1914, with emphasis on the impact of modernization upon the traditional order, efforts toward inter-American understanding, and greater interaction with the contemporary world.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "465",
        "title": "Clashes and Encounters in the Caribbean",
        "description": "Discover the rich history of a region that became the heart of an emerging global capitalism. Study the expansion of the sugar economy and its dependence on enslaved Africans. Discover how modern multi-ethnic nations emerged from this colonial history by focusing on Caribbean people’s resistance to imperialism and inequality. Delve into the many ways communities experienced and responded to conquest, colonialism, revolution, independence, and democracy.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "466",
        "title": "Mexico",
        "description": "Internal development of Mexico and how it has affected hemispheric and world affairs. Special attention is devoted to Mexico’s interaction with the U.S.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "467",
        "title": "Origins and Consequences of the Mexican Revolution",
        "description": "Origin, development and consequences of the Mexican Revolution of 1910 and its domestic and international repercussions.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "468",
        "title": "Social and Intellectual History of Latin America",
        "description": "Examine the rich histories of Latin American peoples by diving into their art, literature, music, cinematography, and other artistic expressions. Develop a deep appreciation for the social and intellectual diversity of Latin America and for the historical circumstances that contributed to it.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "470",
        "title": "The United States: The Colonial Period",
        "description": "Investigate early North American history from pre-colonial times through the Seven Years’ War. Learn about indigenous lifeways before European contact and how native peoples contested and negotiated with colonial societies. Compare how European colonizers migrated to and within North America and how they built economies, societies, and political systems. Understand the creation of racial slavery and African-American identities. Examine the impact of empires and war on society.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "471",
        "title": "United States: American Revolution and Constitution",
        "description": "Delve into the Revolutionary and Early National Periods in U.S. history. Analyze the origins of the American Revolution and its colonial, imperial, and global dimensions. Learn what divided patriots and loyalists. Examine the development and consequences of the U.S. Constitution. Understand the experiences of women, indigenous peoples, and African Americans in an era of revolution.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "472",
        "title": "The United States: The Era of Expansion, 1800-1848",
        "description": "Growth of the nation from the election of Jefferson through the age of Jackson to the completion of continental expansion at the end of the Mexican War.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "473A",
        "title": "Civil War and Reconstruction",
        "description": "Better understand the origins, course, and consequences of the U.S. Civil War. Engage with important questions concerning westward expansion, economic development, slavery and abolition, political realignment, social transformation, race and racism, and historical memory.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "473B",
        "title": "The United States: 1877-1920",
        "description": "Interpretive survey of the political, cultural, diplomatic and social history of the U.S. during the Gilded Age and Progressive Era through World War I.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "474A",
        "title": "The United States: 1920-1960",
        "description": "Interpretive survey of the political, cultural, diplomatic and social history of the U.S. from the end of World War I through the election of John F. Kennedy.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "474B",
        "title": "The United States: 1960-Present",
        "description": "Interpretive survey of the political, cultural, diplomatic and social history of the recent and contemporary U.S. from the election of John F. Kennedy to the present.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "475",
        "title": "Women in Modern United States History: 1920-Present",
        "description": "Study of the roles, status and contributions of women in the U.S. from 1920 to the present.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "479B",
        "title": "U.S. Economic History Since 1865",
        "description": "Prerequisite: Graduate students must have instructor’s consent. Recommended Corequisite: ECON 300. Examines the growth and development of the U.S. economy from the end of the Civil War to the present. Among the themes to be considered are the relationship between the state and the private sector in a free market economy; the rise of big business and corporate capitalism during the Gilded Age; efforts to come to terms with the new industrial economy on the part of government, individuals and such special interest groups as farmers, labor and small business; the origins, effects and economic legacy of the Great Depression and the New Deal; the impact of the Cold War on the U.S. economy; and the social and economic impact of deindustrialization and globalization. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Graduate students must have instructor consent}",
        "corequisites": "{ECON 300}"
    },
    {
        "subject": "HIST",
        "catalog_number": "480",
        "title": "Early American Borders",
        "description": "Borders shape our daily lives and how we see the world. We tend to think of borders as rigid, but early American boundaries were fluid intercultural zones known as borderlands, where indigenous, African, and European peoples adapted, coexisted, and struggled. Better understand how borders functioned from the colonial period to the U.S.-Mexico War, and how they inform the present and affect our lives.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "481",
        "title": "Modern American Borders",
        "description": "Borders shape our daily lives and how we see the world. Investigate the increasing rigidity and militarization of American borders over the past hundred and fifty years. Explore how debates over borders, immigration, and citizenship have influenced communities within the U.S.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "485",
        "title": "Latin America’s Long Cold War",
        "description": "Latin America during the Cold War became a region for proxy wars between the United States and the Soviet Union. Examine the impact of U.S. policies and learn how Latin Americans fought for political, cultural, and economic independence. Delve into the early history of U.S. interventions in Latin America from the Monroe Doctrine (1823) to the U.S. wars of expansion in Mexico (1846) and in Cuba (1898). Better understand how this past shaped the Cold War in Latin America and continuing U.S. imperialism in the region.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "485A",
        "title": "The United States And The Indochina Wars",
        "description": "1940-1975Analysis of the wars in Vietnam Laos and Cambodia with emphasis on the U.S. involvement.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "485C",
        "title": "The United States and the War in Iraq, 2003-11",
        "description": "Analysis of the second U.S.-Iraq war, with an emphasis in U.S. involvement, from its inception and planning through the phases of invasion, occupation, insurgency, sectarian conflict, counter-insurgency, and U.S. withdrawal of forces. The experiences of soldiers and post-combat veterans will also be studied.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "486A",
        "title": "History of Los Angeles",
        "description": "Evolution of the metropolis of Los Angeles from pre-Spanish days to the present.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "488",
        "title": "California",
        "description": "The Golden State has long had a reputation as a trend-setting and diverse place. But it also has a history of conquest as well as racial and ethnic oppression. Explore the political, economic, and social growth of California from indigenous societies to the present.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "489",
        "title": "A History of the African-American People in the United States",
        "description": "Examination of basic themes and issues in the history of the African-American people in the U.S. and the relevance of those themes and issues to the patterns of today.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "490",
        "title": "Emperors, Philosophers, and Rebels: Imperial China to 1600",
        "description": "Explore how Chinese philosophers imagined a better world during the Warring States period. Study the rise of a unified Chinese empire and how a balance was struck between rulers and their subjects. Learn about China’s long history of interplay with the Eurasian steppe as merchants and missionaries crossed the silk roads, and statesmen and generals sought to fend off marauding horsemen. Examine medieval China’s technological creativity and its creation of an elite defined by merit rather than birth.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "491A",
        "title": "Making and Breaking Empires in Early Modern China",
        "description": "Learn how Manchu tribesmen on Asia’s remote northeastern borderlands conquered China and much of Central Asia and created the vast and enduring Qing Empire. Examine how the Manchus and Chinese came to a mutually beneficial accommodation and how China prospered in the 1700s. Explore the rise of the opium trade and learn about the massive internal rebellions that rocked China in the mid-1800s. Study how the Qing government and Chinese people sought to confront the challenges of imperialism and modernity.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "491B",
        "title": "Revolution and Reform in Modern China",
        "description": "In the early twentieth century, China seemed backward and immobile, unable to deal with foreign empires and their modern technologies. Examine how reformers and revolutionaries sought to transform Chinese culture, society, and government to suit the modern world. Learn about the radical transformation of China under Mao Zedong and the Chinese Communist Party that brought both positive changes and the disastrous policies of the Great Leap Forward and the Cultural Revolution. Investigate how reforms in the late 1970s launched China on a path of dramatic economic growth and social transformation and how China has emerged in the twenty-first century as a global superpower.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "493",
        "title": "Continuity and Change in Modern Japanese History",
        "description": "Learn how the Tokugawa government unified feudal Japan in 1603 and brought about an age of prosperity, stability, and cultural efflorescence. Explore how patriotic samurai, reacting to Western imperialism, led a rebellion that overthrew the government to build a modern Japan. Study Japan’s effort to dominate Asia and the destruction of its empire in the Second World War. Consider how Japan rose from the destruction of the war to become one of the world’s leading economies. Explore the global influence of Japanese culture and technology in recent decades.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "494SOC",
        "title": "Internship Program",
        "description": "Pre-professional practicum in a history-based field, open to History major and minors with 3.0 GPA.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "495SS",
        "title": "Capstone Seminar For Prospective History Teachers",
        "description": "Prerequisites: ANTH GEOG PAS POLS or SOC 396SS; Restricted to students in the Social Science Subject Matter Program. Intended as a capstone experience this seminar will expose students to the practices of historical thinking and guide them to develop the knowledge and skills needed to convey these practices to others. It is recommended that this course be taken in the last 12 units of the Social Science Subject Matter Program. Requires 10 hours of field observation in secondary social studies classrooms.\n",
        "units": "3",
        "prerequisites": "{{ANTH GEOG PAS POLS or SOC 396SS} && {Restricted to students in the Social Science Subject Matter Program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "497A",
        "title": "Proseminar",
        "description": "General principles of historical research, with application to specific areas of history and historiography. Grade of “C” or better is required to receive credit for this course.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "498A",
        "title": "Tutorial In History",
        "description": "Reading and discussion in a specific field or on a specific topic in a small group. May be repeated: 6 units maximum. Grade ofC or better is required to receive credit for this course.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "498C",
        "title": "Tutorial In History",
        "description": "Reading and discussion in a specific field or on a specific topic in a small group. May be repeated: 6 units maximum. Grade ofC or better is required to receive credit for this course.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "499C",
        "title": "Independent Study",
        "description": "Independent Study\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "505",
        "title": "Archival Theory And Methods",
        "description": "Prerequisite: Graduate standing or instructor consent. Introductory course on the essentials of archival administration. Topics include archival theory the history of archives in the U.S. the development of collecting policies techniques for preserving historical materials and arrangement and description of collections.\n",
        "units": "3",
        "prerequisites": "{{Graduate standing} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "508",
        "title": "Practicum in Archival Administration",
        "description": "Prerequisites: HIST 505; Graduate standing or instructor consent. Application of the theory of archival administration, including collection, preservation, arrangement and exhibition of historic materials. Students may complete the practicum at one of several sites, including the Urban and Old China Hands Archives at the CSUN University Library, the Ronald Reagan Presidential Library and the Natchez Mississippi Courthouse Record Project.",
        "units": "3",
        "prerequisites": "{{HIST 505} && {Graduate standing || instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "510",
        "title": "Colloquium in Greek and Hellenistic History",
        "description": "Prerequisite: Graduate standing or instructor consent. Covers historiographical writings on important developments in Greek and Hellenistic history from the Bronze Age through the Persian and Peloponnesian Wars and the trial of Socrates, and concludes with a discussion of Hellenistic Greece and the influence of Greek culture in the broader Mediterranean world.",
        "units": "3",
        "prerequisites": "{{Graduate standing} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "511",
        "title": "Colloquium in Roman History",
        "description": "Prerequisite: Graduate standing or instructor consent. Directed historiographical readings and discussion focusing on Roman history from the Republic through the fall of the Empire.",
        "units": "3",
        "prerequisites": "{{Graduate standing} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "531",
        "title": "Colloquium in Modern World History",
        "description": "Prerequisite: Graduate standing or instructor consent. Designed for students who will one day teach world history, as well as those who are interested in trans-national, trans-regional integrative history. Provides a practical and theoretical approach to world history since 1500 by exploring the vibrant and volatile debate over “The Rise of The West.” Topics include industrialization, imperialism, global trade, environmental change, military technology, migration and slavery, and the role of culture in economic development.",
        "units": "3",
        "prerequisites": "{{Graduate standing} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "541",
        "title": "Colloquium in Modern European History",
        "description": "Prerequisite: Graduate standing or instructor consent. Survey of major historiographical debates in modern European history, including the French Revolution, the Industrial Revolution, the rise of bourgeois society, nationalism, imperialism and the First and Second World Wars.",
        "units": "3",
        "prerequisites": "{{Graduate standing} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "545",
        "title": "Colloquium in the History of the Middle East",
        "description": "Prerequisite: HIST 185. Recommended Preparatory: HIST 424 and HIST 426. This course is an examination of major themes in Middle Eastern history from the Arab/Islamic conquest to the present. Possible topics include examinations of cultural, economic, intellectual, religious and social history. The course will underscore historiography and the effect of modern political debates on the history of the region. Readings will include major scholarly works and primary sources in translation.",
        "units": "3",
        "prerequisites": "{HIST 185}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "546",
        "title": "The Holocaust and Genocide for Educators",
        "description": "An overview of the Holocaust and the concept of genocide, with a focus on the analysis and evaluation of varied resources for educators, including film, photographs, literature, art, music, documents and other primary source materials. (Cross-listed with JS 546.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "548",
        "title": "History and Memory",
        "description": "Prerequisite: Graduate standing. This graduate seminar explores theory, methodology, and scholarship related to history and memory. The course considers the power of memory in shaping public interpretation and knowledge about the past and the importance of studying collective memory. The course also examines how memory is contested and reshaped. Major topics include how historical memory shapes oral history, archives, monuments, landscape, and film.",
        "units": "3",
        "prerequisites": "{Graduate standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "570",
        "title": "The American Revolution",
        "description": "This course will help students come to terms with the late 18th century imperial crisis that brought about the rise of the independent U.S. Readings and discussions will focus on the origins, progress and results of the American Revolution.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "571",
        "title": "Seminar in Colonial American History",
        "description": "This is a reading intensive seminar devoted to the history of early America, from European settlement to the American Revolution. Students will familiarize themselves with classic and cutting-edge scholarship related to major topics within the field of early American history. Different approaches and methods for doing this type of history will be discussed. And students will be encouraged to take their own informed positions on prominent debates within the field. This course will provide a strong foundation for comprehensive exams.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "572",
        "title": "Colloquium in 19th Century U.S. History",
        "description": "Prerequisite: Graduate standing or instructor consent. Examination of the major social, economic, political and cultural themes in the U.S. during the 19th century. Topics include the industrial, market and transportation revolutions; slavery; the Civil War and its aftermath; the rise of the (urban) middle class; the frontier and territorial expansion; and the cultural life of Victorian America.",
        "units": "3",
        "prerequisites": "{{Graduate standing} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "574",
        "title": "Colloquium in Recent U.S. History",
        "description": "Prerequisite: Graduate standing or instructor consent. Directed historiographical readings surveying major political, social, cultural and economic trends in the U.S. from 1932 to the present. Topics include the Great Depression, World War II, anti-communism, the origins of the Cold War, the Civil Rights movement, student unrest, Vietnam, and the Reagan years.",
        "units": "3",
        "prerequisites": "{{Graduate standing} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "585",
        "title": "Colloquium in U.S. Southern History",
        "description": "Prerequisite: Graduate standing or instructor consent. Readings in history of the American South from the colonial era through modern times, with special emphasis on issues of regional identity, class and race relations, slavery, popular culture, regional politics and the continuity of southern culture.",
        "units": "3",
        "prerequisites": "{{Graduate standing} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "586",
        "title": "Colloquium in U.S. Women and Gender History",
        "description": "Prerequisite: Graduate standing or instructor consent. Directed readings on selected topics in the history of women and gender in American society from colonial times to the present.",
        "units": "3",
        "prerequisites": "{{Graduate standing} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "594",
        "title": "History Internship Program",
        "description": "Places M.A. students in pre-professional internship positions in public, nonprofit, advocacy, and commercial institutions where they earn credit in a directed program of applied field study. Interested students should contact the History Department’s internship coordinator in advance of the semester in which the internship will be undertaken. Available to students enrolled in the History M.A. program with a minimum GPA of 3.0.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "596EG",
        "title": "Selected Topics: Enlightenment/revolution",
        "description": "No course description\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "596G",
        "title": "Selected Topics: American Borderlands",
        "description": "No course description\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "601",
        "title": "Theory and Historiography",
        "description": "Prerequisite: Classified standing. Sophisticated, graduate-level introduction to history as a discipline. Surveys the development of history as a discipline, examines the various genres of historical writing, explores issues and problems of historical interpretation, and considers the how historians use theoretical models from other disciplines to shape their work. Readings include seminal works by major historians.",
        "units": "3",
        "prerequisites": "{Classified standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "610",
        "title": "Research Seminar In Ancient Greek History",
        "description": "Prerequisite: Classified standing. Focus on ancient Greek history from Solon to Demosthenes. Topics include Athenian democracy the Persian and Peloponnesian Wars Sparta social and intellectual history Greek historians and modern historiography.\n",
        "units": "3",
        "prerequisites": "{Classified standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "612",
        "title": "Research Seminar in the Roman Empire",
        "description": "Prerequisite: Classified standing. Seminar on the Roman Empire from the Julio-Claudians to the fall of the empire in the West. Topics include social, political and intellectual history, the rise of Christianity, the transformation of the empire, theories about the fall of Rome and studies of individual historians of the period.",
        "units": "3",
        "prerequisites": "{Classified standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "620",
        "title": "Research Seminar in the Middle Ages",
        "description": "Prerequisite: Classified standing. Research seminar concentrating on selected topics in western European, Iberian, Byzantine, and/or Mediterranean history during the period between the fall of Rome and the Renaissance.",
        "units": "3",
        "prerequisites": "{Classified standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "630",
        "title": "Research Seminar in World History",
        "description": "Prerequisite: Classified standing. In addition to discussing the methodological issues involved in studying and researching world history, each student writes an original, primary source-based research paper on a topic in world history that is trans-national, regional or comparative in focus.",
        "units": "3",
        "prerequisites": "{Classified standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "640",
        "title": "Research Seminar in Early Modern European History",
        "description": "Prerequisite: Classified standing. Research seminar concentrating on selected topics in European history from the Renaissance through the Napoleonic period.",
        "units": "3",
        "prerequisites": "{Classified standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "641",
        "title": "Research Seminar in Modern European History",
        "description": "Prerequisite: Classified standing. Research seminar concentrating on selected topics in European history since the French Revolution.",
        "units": "3",
        "prerequisites": "{Classified standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "660",
        "title": "Research Seminar in Latin American History",
        "description": "Prerequisite: Classified standing. Research seminar concentrating on topics in the history of Mexico, Central and South America and the Caribbean. Students will conduct an in-depth examination employing original (primary) sources on a specific problem or issue in the history of Latin America.",
        "units": "3",
        "prerequisites": "{Classified standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "671",
        "title": "Research Seminar in Colonial American History",
        "description": "Prerequisite: Classified standing. Research seminar concentrating on selected topics in American history prior to the American Revolution.",
        "units": "3",
        "prerequisites": "{Classified standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "681",
        "title": "Research Seminar in the U.S. West",
        "description": "Prerequisite: Classified standing. Students conduct an in-depth examination employing original (primary) sources relating to a problem or issue in the history of the U.S. West.",
        "units": "3",
        "prerequisites": "{Classified standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "692A",
        "title": "Selected Topics in Research",
        "description": "Prerequisite: Classified standing. Graduate Research Seminar in Selected Topics. Students read selected scholarship on the topic indicated and write an original research paper using primary and secondary sources. Successful papers may be developed and revised in HIST 698D: Graduate Culminating Project.",
        "units": "3",
        "prerequisites": "{Classified standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "693",
        "title": "Directed Research",
        "description": "No course description\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "694",
        "title": "Practicum for Teaching Assistants",
        "description": "Prerequisite: Classified standing. Working under the close supervision of departmental faculty and assigned to a specific undergraduate History course, students gain experience in creating assignments, grading papers and exams, leading discussion and review sessions, and giving lectures. Students have the opportunity to discuss issues and problems in teaching. May be repeated once for credit.",
        "units": "3",
        "prerequisites": "{Classified standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "698",
        "title": "Thesis",
        "description": "Students may enroll after they have completed 30 units of coursework and had their formal program approved. Students work on their thesis and take the written Proficiency Exam in their second area of study. Students have a 2-year limit in which to finish their thesis from the time they enroll in this course.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "698D",
        "title": "Graduate Culminating Project",
        "description": "Prerequisites: HIST 601 and two Graduate Level History Research Seminars. This culminating graduate course requires students to demonstrate their mastery of the historian’s craft. Students will revise an existing research paper that they produced in one of their graduate research seminar classes and transform it into a piece that could be submitted as a conference paper, a scholarly writing sample, and/or an article for publication. Students will prepare a cogent twenty-minute oral presentation of their work. This course is to be taken in the student’s final semester",
        "units": "3",
        "prerequisites": "{{HIST 601} && {two Graduate Level History Research Seminars}}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "699C",
        "title": "Independent Study",
        "description": "Independent Study\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]