[
    {
        "subject": "IS",
        "catalog_number": "212",
        "title": "Information Systems for Business Users",
        "description": "Introduction of business information systems from a user perspective. This course covers information technology hardware, software, networks, security and information competency at the user level. Careers in information systems and emerging trends in the field will be covered. Students are required to complete individual assignments and projects involving hands-on problem solving with spreadsheet and information management tools. (Available for General Education, E Lifelong Learning.) (IC)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "312",
        "title": "Systems and Technologies for Managers",
        "description": "Prerequisites: ACCT 220 and a grade of “C” or higher in IS 212, or CIT 101/L and CIT 160/L. A survey of business information systems concepts including organizational information systems responses to business environments; systems enabling business strategies and business models; business processes, functional areas, and enterprise architecture/enterprise systems. Covers foundation of systems analysis, systems development and management with technology advancements such as cloud computing, data analytics, the Internet of Things, and blockchain, as well as the ever-increasing threats and demands related to cybersecurity and information privacy.",
        "units": "3",
        "prerequisites": "{{ACCT 220} && {{IS 212} || {{CIT 101/L} && {CIT 160/L}}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "335",
        "title": "Building Enterprise Architecture",
        "description": "Prerequisites: Grade of “C” or higher in COMP 110/L and Grade of “C” or higher in IS 212. A survey of cloud-based systems, platforms and infrastructure used in enterprise architecture, with an emphasis on the services that cloud providers offer. An introduction to the design, development and operation of enterprise architecture. The course will include hands-on projects using cloud-based tools.",
        "units": "2",
        "prerequisites": "{{COMP 110/L} && {IS 212}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "355",
        "title": "Application Development",
        "description": "Prerequisites: Grade of “C” or higher in COMP 110/L and Grade of “C” or higher in IS 212. Advanced application development emphasizing mobile platforms for the enterprise. Topics include: media, location services, phone sensors, networking, web services, data persistence, and cloud computing. The course will include hands-on projects using advanced application development tools.",
        "units": "3",
        "prerequisites": "{{COMP 110/L} && {IS 212}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "431",
        "title": "Systems Analysis and Design",
        "description": "Prerequisites: Grade of “C” or higher in IS 312; a grade of “C” or higher in BUS 302; a grade of “CR” in BUS 302L. This course covers the systems development life cycle. Topics include standard tools and techniques to analyze and design an information system from a structured as well as an object-oriented perspective. A Computer-Aided Software Engineering (CASE) tool is used to facilitate the study. Required class work includes a group project on developing an information system in a business case.",
        "units": "3",
        "prerequisites": "{{IS 312} && {BUS 302/L}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "435",
        "title": "Business Data Networks and Cybersecurity",
        "description": "Prerequisites: Grade of “C” or higher in IS 312; a grade of “C” or higher in BUS 302; a grade of “CR” in BUS 302L. An introduction to digital data networks and cybersecurity in a business environment. Topics include telecommunications standards and protocols, local and wide area networks, wireless networks, the Internet, and the technologies and processes of information security management. By completing a variety of hands-on assignments and projects, students will learn to apply conceptual knowledge to practice in understanding, configuring, managing, and securing business data networks.",
        "units": "3",
        "prerequisites": "{{IS 312} && {BUS 302/L}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "441",
        "title": "Database Management Systems",
        "description": "Prerequisites: Grade of “C” or higher in IS 312; a grade of “C” or higher in BUS 302; a grade of “CR” in BUS 302L. The design and implementation of computerized databases. Provides background for the selection and use of database management systems. Topics include types of available systems, functions of database administration, conceptual database design, data independence, integrity, privacy and query. The student will design and implement a database utilizing a commercial database management system.",
        "units": "3",
        "prerequisites": "{{IS 312} && {BUS 302/L}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "451",
        "title": "Enterprise Systems and Project Management",
        "description": "Prerequisites: Grade of “C” or higher in IS 431 and IS 435; a grade of “C” or higher in BUS 302; a grade of “CR” in BUS 302L. An introduction to enterprise-level cloud-based system development concepts, principles and practices. Evaluate and set up comprehensive system development projects for enterprises from services that cloud providers offer. Student teams will analyze, design and plan systems of moderate complexity, using current technologies and the appropriate project management methods in the solution.",
        "units": "3",
        "prerequisites": "{{IS 431} && {IS 435} && {BUS 302/L}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "457",
        "title": "Advanced Telecommunications and Networking",
        "description": "Prerequisites: Grade of “C” or higher in IS 431, IS 435 and IS 441; a grade of “C” or higher in BUS 302; a grade of “CR” in BUS 302L. An advanced course in telecommunications and networks emphasizing enterprise networking topics such as: network operating systems, network analysis and design, network security, virtual private networks, collaboration, wireless networks, VLAN, multiplatform integration, voice-over Internet protocol, web server strategies and storage area networks. This course will include hands-on projects involving network design and implementation.",
        "units": "3",
        "prerequisites": "{{IS 431} && {IS 435} && {IS 441} && {BUS 302/L}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "497A",
        "title": "Special Topics – Information Systems",
        "description": "Prerequisites: Grade of “C” or higher in IS 431, IS 435 and IS 441; a grade of “C” or higher in BUS 302; a grade of “CR” in BUS 302L. Innovative course of study. Topics to be specified in the Schedule of Classes. Different topics may be taken for credit.",
        "units": "3",
        "prerequisites": "{{IS 431} && {IS 435} && {IS 441} && {BUS 302/L}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "497B",
        "title": "Special Topics &#8211; Information Systems: Information Security And Assurance",
        "description": "Prerequisites: Grade ofC or higher in IS 431 435 and 441; a grade ofC or higher in BUS 302; a grade ofCR in BUS 302L; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. Innovative course of study. Topics to be specified in the Schedule of Classes. Different topics may be taken for credit.\n",
        "units": "3",
        "prerequisites": "{{IS 431} && {IS 435} && {IS 441} && {BUS 302/L} && {Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "497C",
        "title": "Special Topics &#8211; Information Systems: Ia Networking Fnd",
        "description": "Prerequisites: Grade ofC or higher in IS 431 435 and 441; a grade ofC or higher in BUS 302; a grade ofCR in BUS 302L; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. Innovative course of study. Topics to be specified in the Schedule of Classes. Different topics may be taken for credit.\n",
        "units": "3",
        "prerequisites": "{{IS 431} && {IS 435} && {IS 441} && {BUS 302/L} && {Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "498A",
        "title": "Field Assignments and Reports Information Systems",
        "description": "Prerequisites: Consent of instructor; Approval of program chair. For students capable of independent work and in need of advanced and specialized study. May be repeated for a total of 6 units.",
        "units": "1",
        "prerequisites": "{{Consent of instructor} && {Approval of program chair}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Prerequisites: Consent of instructor; Approval of program chair. For students capable of independent work and in need of advanced and specialized study. May be repeated for a total of 6 units.",
        "units": "1",
        "prerequisites": "{{Consent of instructor} && {Approval of program chair}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "499B",
        "title": "Independent Study",
        "description": "Prerequisites: Consent of instructor; Approval of Program Chair. For students capable of independent work and in need of advanced and specialized study. May be repeated for a total of 6 units. \n",
        "units": "2",
        "prerequisites": "{{Consent of instructor} && {Approval of program chair}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "530",
        "title": "Accounting Information Systems",
        "description": "Prerequisites: IS 312; ACCT 352, ACCT 460 or equivalents; Approval of department chair or designee. Provides an understanding of requirements, design and control of major business processes/accounting cycles integrated in an enterprise system. Topics include Systems Analysis and Design methodologies and techniques for Accounting Information System development, issues in control and audit of systems fraud and abuse, and controls for systems reliability.",
        "units": "3",
        "prerequisites": "{{IS 312} && {ACCT 352} && {ACCT 460} && {Approval of department chair or designee}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "531",
        "title": "Healthcare Information Systems Analysis and Design",
        "description": "Gain a well rounded understanding of requirements, design, and control of major business processes that are integral within a healthcare enterprise system. Topics include systems analysis and design methodologies and techniques for healthcare information system development, issues of privacy and confidentiality, fraud and abuse, as well as controls for systems reliability.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "551",
        "title": "Managing Projects in Healthcare Informatics",
        "description": "Students will gain a well rounded understanding of enterprise-level system development concepts, principal and practices. Students will evaluate and setup comprehensive system development projects for departments and/or enterprises. Student teams will analyze, design and plan healthcare systems of moderate complexity, using current technologies and the appropriate project management methods in the solution. Also students will gain a balanced understanding of management issues related privacy and confidentiality and learn about common system implementation pitfalls as well as benchmarks for evaluating the cost and benefits of implementing new information systems.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "599C",
        "title": "Independent Study",
        "description": "Prerequisites: Consent of instructor; Approval of Program Chair. For students capable of independent work and in need of advanced and specialized study. May be repeated for a total of 6 units. \n",
        "units": "3",
        "prerequisites": "{{Consent of instructor} && {Approval of program chair}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "628",
        "title": "Business Systems and Technology Management",
        "description": "Prerequisite: ACCT 501 or one year of undergraduate accounting. An introduction to computer-based information systems at a fairly sophisticated level. Emphasis will be on the understanding of computer concepts, computer applications in an organizational environment and the analysis and design of information systems.",
        "units": "3",
        "prerequisites": "{{ACCT 501} || {one year of undergraduate accounting}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "655",
        "title": "Information Systems Theory And Practice",
        "description": "Prerequisite: IS 628 or 630. Comprehensive coverage of current trends and management issues associated with information systems (IS) to deliver business value within organizations at local national and global levels. Topics include issues in information systems planning administration resource management and new information technology (IT) adoption to achieve the alignment between IT/IS and corporate functions.\n",
        "units": "3",
        "prerequisites": "{{IS 628} || {IS 630}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "656",
        "title": "Information Systems Audit and Control",
        "description": "Prerequisite: IS 530 or IS 628. Examines concepts, standards and frameworks associated with IS auditing. Topics include the post-Sarbanes Oxley IS audit environment, assessment of risks and controls, computer fraud, legal and ethical issues, and audit of the systems development process. Students work through audit simulations to develop IS audit expertise.",
        "units": "3",
        "prerequisites": "{{IS 530} || {IS 628}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "657",
        "title": "IS Governance and Risk Management",
        "description": "Prerequisite: IS 530 or IS 628. Provides an overview of information systems (IS) governance and information risk management. The course stresses the importance of the alignment of IS governance to business objectives and the role of IS in achievement of organizational strategy. Topics discussed include contemporary compliance initiatives; strategic IS decision making; IS performance assessment, control structure and accountability; IS project management; IS policy definition and enforcement; risk analysis and mitigation; and IS security management (i.e., security planning, policy and controls). Established frameworks and standards for IS governance and control are discussed.",
        "units": "3",
        "prerequisites": "{{IS 530} || {IS 628}}",
        "corequisites": "{None}"
    },
    {
        "subject": "IS",
        "catalog_number": "699C",
        "title": "Independent Study",
        "description": "Prerequisites: Consent of instructor; Approval of Program Chair. For students capable of independent work and in need of advanced and specialized study. May be repeated for a total of 6 units.\n",
        "units": "3",
        "prerequisites": "{{Consent of instructor} && {Approval of Program Chair}}",
        "corequisites": "{None}"
    }
]