[
    {
        "subject": "JS",
        "catalog_number": "100",
        "title": "Jewish Religion and Culture",
        "description": "This course explores Jewish religious concepts and practices, as well as Jewish culture in international contexts from the ancient period to the present. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "JS",
        "catalog_number": "151",
        "title": "Natural Environment in Judaism",
        "description": "Corequisite: RTM 151F. An examination of teachings on the natural environment found in Jewish literature and oral teachings, with an emphasis on values and practices related to respect for natural life and environmental conservation. Arranged wilderness field trips are required.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{RTM 151F}"
    },
    {
        "subject": "JS",
        "catalog_number": "210",
        "title": "History of the Jewish People",
        "description": "Study of the Jewish people from their beginning in the ancient Near East to the establishment of the modern state of Israel. (Cross-listed with HIST 210.) (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "JS",
        "catalog_number": "300",
        "title": "Ancient and Medieval Jewish Arts and Literature",
        "description": "Prerequisite: Completion of the lower division writing requirement. This class explores how ancient and medieval Jews expressed themselves in literature, art and architecture, law, music, philosophy and science. It also explores how distinctive Jewish genres, styles and creative processes are related to similar expressions in non-Jewish cultures. Regular written assignments are required. (Available for General Education, C1 Arts or C2 Humanities.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "JS",
        "catalog_number": "306",
        "title": "Sociology of Jewish Families and Communities",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: SOC 150. This course uses the perspectives and tools of sociology to explore how different cultural and social structures affect Jewish families and communities throughout the Jewish diaspora. (Cross-listed with SOC 306.) (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "JS",
        "catalog_number": "318",
        "title": "Applied Jewish Ethics",
        "description": "Prerequisite: Completion of the lower division writing requirement. Applies Jewish teachings to contemporary social problems. Case studies may involve wealth and work, sexuality, food, war, the environment, and other topics. Students apply appropriate social scientific methods to collect data, analyze, evaluate, explain, and/or solve problems in social relations and human behavior. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "JS",
        "catalog_number": "330",
        "title": "Women in the Jewish Experience",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examines a minority culture–women in Jewish communities from antiquity to the present. Course perspective is international, with significant focus on Mediterranean, West Asian and African Jewish societies. Contemporary topics such as sexuality, creative ritual, Israeli/Palestinian politics, and body image also are discussed. (Cross-listed with GWS 330.) (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "JS",
        "catalog_number": "335",
        "title": "Jewish Identity in the U.S.",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: SOC 150. This course is a social-scientific study of American Jewish religious and ethnic identity. It focuses on the social institutions and processes involved in Jewish identity, and compares the experience of Jews with other religious, ethnic, and cultural groups in the U.S. (Cross-listed with SOC 335.) (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "JS",
        "catalog_number": "357",
        "title": "History of the Holocaust",
        "description": "Learn about how and why the Nazis and their collaborators persecuted and murdered Jews and other groups they deemed inferior. Survey long-term causes such as anti-Semitism as well as short-term factors including World War I and II. Read about Hitler’s racial ideology; delve into the world of Auschwitz and the concentration camps; analyze the actions and responses of victims and bystanders; discuss attempts to bring the perpetrators to justice. (Cross-listed with HIST 357.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "JS",
        "catalog_number": "390CS",
        "title": "Nonprofit Internship in the Jewish Community",
        "description": "Prerequisites: Instructor consent; Completion of the lower division writing requirement. Work experience in Jewish schools, synagogues, social welfare or political organizations. Faculty supervisor assists students in obtaining appropriate work placements. Work experience is complemented by academic study and written assignments. Offers a community service opportunity with service learning activities relating to concepts and theories presented. Requires 100 hours of community-based fieldwork. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{{Instructor consent} && {Completion of the lower division writing requirement}}",
        "corequisites": "{None}"
    },
    {
        "subject": "JS",
        "catalog_number": "409",
        "title": "History of the Jews in the Modern Era",
        "description": "A history of the Jewish people from the 17th century to the present. Principal themes include the transformation of the traditional community, the changes in Jews’ political status, the emergence of modern antisemitism, and ethnic and gender distinctions within Jewry. (Cross-listed with HIST 409.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "JS",
        "catalog_number": "427",
        "title": "Israel’s History and Peoples",
        "description": "A history of the modern State of Israel, from the emergence of modern Jewish nationalism to the present time. The conflicts between Jews, Palestinians, and imperial and regional powers will be examined, as well as the relations between the diverse peoples that constitute Israel’s multicultural, multireligious, and multinational society. (Cross-listed with HIST 427.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "JS",
        "catalog_number": "546",
        "title": "The Holocaust and Genocide for Educators",
        "description": "An overview of the Holocaust and the concept of genocide, with a focus on the analysis and evaluation of varied resources for educators, including film, photographs, literature, art, music, documents and other primary source materials. (Cross-listed with HIST 546.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]