[
    {
        "subject": "LING",
        "catalog_number": "113A",
        "title": "Approaches to University Writing A",
        "description": "Prerequisite: Placement in a supported GE subarea A2 Written Communication course. Corequisite: UNIV 061. Expository prose writing with a focus on both content and form designed with international non-native speakers of English in mind. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies, and the appropriate gathering and utilization of evidence. Includes ESL instruction on diction, syntax, and grammar, as well as the conventions of English prose style. Students receive credit for only one course chosen from AAS 113A, AFRS 113A, CAS 113A, CHS 113A, ENGL 113A, LING 113A or QS 113A. Students also are required to enroll in UNIV 061 (1 credit) or equivalent. Individual tutoring is available through the Learning Resource Center.",
        "units": "3",
        "prerequisites": "{Placement in a supported GE subarea A2 Written Communication course}",
        "corequisites": "{UNIV 061}"
    },
    {
        "subject": "LING",
        "catalog_number": "113B",
        "title": "Approaches to University Writing B",
        "description": "Prerequisite: Successful completion of 113A. Corequisite: UNIV 062. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies, and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for one course chosen from AAS 113B, AFRS 113B, CAS 113B, CHS 113B, ENGL 113B, LING 113B and QS 113B. Students also are required to enroll in UNIV 062 (1 credit) or equivalent. Individual tutoring is available through the Learning Resource Center. (Available for General Education, Basic Skills A2 Written Communication.) (IC)",
        "units": "3",
        "prerequisites": "{ENGL 113A}",
        "corequisites": "{UNIV 062}"
    },
    {
        "subject": "LING",
        "catalog_number": "200",
        "title": "(How) Language Matters",
        "description": "This course draws heavily from current issues in society to highlight the role of language. It explores strategies used to construct and reflect our identities (as skaters, rappers, school girls, nerds, etc.), to form new meanings and to accommodate popular new technologies (e.g., texting). This course also examines personal and societal perceptions and attitudes toward the language use and competence of others. Students will undertake a challenging, collaborative, hands-on analysis to appreciate (how) language matters. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "230",
        "title": "Forbidden Language: Swearing and Taboo Language",
        "description": "Study of the meaning, role, and use of forbidden language in English and other languages, including understanding the many types (swearing, obscenity, taboo, etc.), its grammar and where it is processed in the brain, how these words have changed over time, societal attitudes towards those who use it, comparing its use in other cultures and languages, and some of the legal issues surrounding its use. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "240",
        "title": "Language and Music",
        "description": "This course explores language and music, and their co-occurrence in human societies and cultures. Is it a mere coincidence or is there an underlying reason? Is our innate ability to develop language related to how we create and experience music? Is our brain “wired” for both music and language? Are they related to each other in the brain? Do they share an evolutionary history in the human species? We will address these questions by defining language and music, exploring their structural similarities and differences, and surveying the global diversity in musical and linguistic expression. (Available for General Education, C1 Arts.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "250",
        "title": "Language(s) in California",
        "description": "What are the languages of California? Who speaks them? What can discovering and examining the range of indigenous, diasporic and emerging languages in California tell us about our own relationships to language and languages, individually and collectively? This course looks at these questions, investigating, through its survey of California’s languages, some fundamental linguistic and sociolinguistic ideas about language and languages. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "300",
        "title": "Approaches to Linguistic Analysis",
        "description": "This course provides a comprehensive, in-depth and data-driven introduction to the questions that are raised in the major subfields of linguistics and to the prevailing scientific approaches that are applied to answer those questions. Students will learn foundational concepts of the field and learn to analyze linguistic data. Students also will learn how to describe language data and how to present linguistic arguments clearly, following the conventions that are customary in the field.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "303",
        "title": "Human Language: Defining Our Biological Identity",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course addresses two areas at once: the nature of human language and how linguistics and its practitioners study it. It provides students with opportunities to systematically examine and analyze aspects of human language, of which–as we all are–they have been largely unaware. From learning, applying, and questioning the methodologies underlying these analyses, students develop critical insight regarding the framework and mechanisms of scientific study, as they look at the subfields of linguistic inquiry that crucially engage with these. Importantly, students will come away not only with knowledge from the science of language but also with an appreciation of the central role of scientific inquiry, and developing skills for recognizing and formulating fruitful questions. (Available for General Education, B5 Scientific Inquiry and Quantitative Reasoning.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "309",
        "title": "Language and Social Interaction",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course explores a range of topics related to the study of language and social interaction in both casual and professional settings (such as clinical settings, 911 call centers, news interviews, classrooms). It examines how language affects our social lives and how social organization affects our use of language. The topics include different theoretical perspectives and research approaches to the study of language in social interaction, issues regarding language and situational identity, as well as language learning in social interaction. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "310",
        "title": "Forensic Linguistics: Language and the Law",
        "description": "Prerequisite: Completion of the lower division writing requirement. Determining what a written text or spoken utterance exactly conveys is nowhere more important than in the area of the law where subtle differences in wording can have drastic consequences in people’s lives. This course examines how language is used and interpreted in legal settings by applying insights from the linguistic fields of semantics, pragmatics, discourse analysis and sociolinguistics. The course has lifelong relevance for every citizen, since we can expect to sign contracts, receive a jury summons or engage in many other ways with the law and legal documents. The course emphasizes active student participation and an explicit connection between theory and practice. Students will be expected to apply their acquired knowledge to practical and—wherever possible—current societal issues. (Available for General Education, B5 Scientific Inquiry and Quantitative Reasoning or E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "325",
        "title": "Language, Gender, and Identity",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course studies language as a major factor in our formation of our self-identity and our conceptualization of ourselves and others as male or female. It provides a comprehensive introduction from a linguistic perspective to issues of language, gender, identity and power. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "330",
        "title": "Fundamentals for TESL",
        "description": "Introduces students to the fundamentals of TESL (Teaching English as a Second Language). Students will explore the skills and conditions involved in successful second and foreign language learning. Students will use this knowledge to understand the foundations related to second and foreign language instruction, specifically for adults in Intensive English Programs, adult schools, community colleges and abroad.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "402",
        "title": "Phonetics and Phonology",
        "description": "Preparatory: ANTH 310, COMS 420 or ENGL 301. Study of the physical and acoustical properties of sound in a variety of natural languages, as well as phonological analysis and rule formation in phonological systems. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "403",
        "title": "Introduction to Morphology",
        "description": "Preparatory: LING 300 or equivalent. This morphology course introduces students to the range of questions that the field of linguistics asks about speakers’ knowledge of word structure and to the methods that linguists use both to respond to such questions and develop additional ones. Students will become acquainted with central insights from the field and learn how this knowledge relates to phonology and to syntax but is nevertheless specific to morphology. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "404",
        "title": "Syntax",
        "description": "Preparatory: LING 300. LING 404 takes students into the field of syntactic inquiry, learning about the tools used to develop representations of what speakers of a language know about the structural relationships among the meaning-bearing elements in their language, and about how such representations are evaluated, in pursuit of the representations telling us the most about human language itself. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "407",
        "title": "Language Varieties",
        "description": "Preparatory: ANTH 310 COM S 420 or ENGL 301. Introduction to the study of language variation. Theoretical aspects of phonological syntactic and semantic variation will be considered in their geographical and social context.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "408",
        "title": "Semantics and Pragmatics",
        "description": "Preparatory: ANTH 310, COMS 420 or ENGL 301. Linguistic study of meaning and context of discourse and the relationship of such study to grammar. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "411",
        "title": "Introduction to Historical Linguistics",
        "description": "Preparatory: LING 300 or equivalent. LING 411 investigates the ways languages emerge and evolve. The course looks at gradual changes in vocabulary (lexicon), sounds (phonetics and phonology—hence, spelling), and grammar (morphology and syntax). Topics include the comparative method, the genealogical and typological classification of languages, language universals and the historical development of entirely “new” language varieties and language families. Much attention is devoted to how Present-day Englishes have developed from Old Anglo Saxon. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "417",
        "title": "Language Development and Acquisition",
        "description": "Preparatory: Upper division standing; Introduction to the study of language. Required for both ITEP and Linguistics/TESL students and addresses topics linked to language arts and (T)ESL methods courses for students preparing to teach. Introduces students to the study of language development and acquisition, including such topics as approaches to the development of children’s grammars, the development of communicative competence, definitions of bilingualism and multilingualism, relationships between language development and learning to read, issues particular to the multilingual nature of California, and issues related to exceptional language development. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "427",
        "title": "Languages in Contact",
        "description": "Preparatory: ANTH 310, COMS 420 or ENGL 301. This course examines various effects of language contact–the occurrence of lexical and grammatical borrowing, such as borrowings between English and Spanish; the emergence of pidgins, creoles and mixed languages; and the process of language attrition or death in the context of a dominant language. The course also addresses the ways in which speakers in multilingual speech communities navigate between the languages that they speak and the language-planning efforts of multilingual communities that are aimed at controlling which language (variety) is used/taught in which setting, such as the use of ASL versus signed English. Much of this course focuses on issues of special relevance to multilingual speech communities in the U.S. and on language contact effects between English and such languages as Armenian, Spanish, Russian and Korean. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "441",
        "title": "Sociolinguistics",
        "description": "Preparatory: ANTH 310, COMS 420 or ENGL 301. Language in society. Examines linguistic behavior patterns as determined by such factors as age, gender, class, ethnicity, sexual orientation, region and social context. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "447",
        "title": "Bilingualism in the U.S.",
        "description": "Preparatory: ENGL 301. Upper division course dealing with concepts and controversies regarding bilingualism in the U.S. Students will gain an understanding of bilingual language acquisition (e.g., when children acquire more than one language in the home or at school); bilingual language phenomena such as code-switching, linguistic borrowing, transfer, and interlanguage, and the controversies surrounding bilingualism in the U.S. education system and in society. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "455",
        "title": "Computational Linguistics",
        "description": "Prerequisite: Upper division standing. This is an intensive seminar on computational data processing in linguistics. While computers have no minds of their own, researchers are increasingly able to harness computational methods to understand natural language, which is often ‘messy’ and unpredictable. The focus of this course is the creation of working computer code that can help us answer questions about language by accessing resources from basic corpora (e.g., structured narratives like fables or news stories) to social media. No specialized knowledge of computer science is necessary. The skills learned in this class will be useful for undertaking research in linguistics and the social sciences, as well as for performing data analytics on text corpora. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Upper division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Preparatory: Consent of instructor and Linguistics/TESL department chair.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "500",
        "title": "Seminar in Phonetics",
        "description": "Prerequisite: LING 402. This course focuses on articulatory phonetics. In depth study of current issues in the articulatory and physical properties of sounds in natural languages; typology of sound inventories in world languages; perception, transcription, and production of sounds.",
        "units": "3",
        "prerequisites": "{LING 402}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "501",
        "title": "Seminar in Phonology",
        "description": "Prerequisite: LING 402 or equivalent. Current issues in phonological theory.",
        "units": "3",
        "prerequisites": "{LING 402}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "502",
        "title": "Seminar in Research on Second Language Acquisition",
        "description": "Prerequisites: LING 402, LING 404 or LING 417, or CHS 433. Critical historical examination of research on second-language acquisition. Study of analytical approaches, such as contrastive analysis, error analysis, performance analysis and discourse analysis, showing how different approaches reflect changing conceptions of language and the nature of language learners.",
        "units": "3",
        "prerequisites": "{Parse error: Refer to class description.}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "503",
        "title": "Seminar in Cognitive Linguistics",
        "description": "Prerequisites: An introduction to linguistics and LING 402, LING 404, LING 408, LING 441. Examination of recent theoretical developments in linguistics from the general perspective of cognitive science. Focus on three major areas: cognitive grammar, semantics and pragmatic dimensions of linguistic categorization, as well as the interface of cognition, experience and grammar in natural discourse.",
        "units": "3",
        "prerequisites": "{{LING 402} && {LING 404} && {LING 408} && {LING 441}}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "505",
        "title": "Seminar in Discourse Analysis",
        "description": "Prerequisite: LING 407, LING 408 or LING 441. Seminar in the theoretical and methodological aspects of discourse analysis in a linguistic perspective.",
        "units": "3",
        "prerequisites": "{{LING 407} || {LING 408} || {LING 441}}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "506",
        "title": "Foundational Concepts of Phonetics and Phonology",
        "description": "This course introduces graduate students in Linguistics and TESL to key concepts from the fields of phonetics and phonology. The phonetics component of the course focuses on the articulatory description and classification of speech sounds and provides practice in using the International Phonetic Alphabet. The phonology component of the course examines speech sounds as linguistic units that are organized in a grammatical system. Students learn to recognize patterns in the distribution of sounds in data sets from various languages and gain insight into the nature of the sound systems of human languages and its correlation with native and non-native speech perception and production.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "510",
        "title": "Foundational Concepts in Linguistics",
        "description": "This course introduces graduate students in Linguistics and TESL to the central questions and findings that guide linguistic research in phonetics and phonology, morphology, syntax, semantics and pragmatics, discourse analysis, sociolinguistics and historical linguistics. This data rich and research focused course emphasizes analysis, reasoning, and argumentation in the context of these subfields of linguistics and supplies students with foundational knowledge for their continued studies in Linguistics and TESL.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "515",
        "title": "Survey of Applied Linguistics",
        "description": "Preparatory: Introduction to linguistics. An introduction to multiple definitions of the field of applied linguistics and insight into the ways that scholars identify and define the concerns of the discipline. Included in the course will be an introductory survey of several specific areas of study that fall under the heading of Applied Linguistics.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "517",
        "title": "Foundational Concepts of Language Development and Acquisition",
        "description": "This course introduces graduate students in Linguistics and TESL to key findings from the fields of first and second language acquisition. Topics include the acquisition and processing of phonology, morphology, syntax, and discourse and the parallels and differences between first and subsequent language acquisition. The course emphasizes a critical analysis of diverging frameworks and models in conjunction with language data.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "520",
        "title": "Issues in ESL Reading and Writing",
        "description": "Preparatory or Recommended Corequisite: LING 502. Provides students with a foundation for understanding the processes of reading and writing–as well as the relationships between them–as they are experienced by adult second-language learners. Topics in the area of reading include skills and strategies that contribute to the second language learner’s ability to read and to comprehend a variety of texts, and curricular design. Topics in writing include aspects of the composing process specific to second language students, the design of curriculum and assignments, and the effects of various types of responses to student writing.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{LING 502}"
    },
    {
        "subject": "LING",
        "catalog_number": "521",
        "title": "Issues in ESL Listening and Speaking",
        "description": "Preparatory or Recommended Corequisite: LING 502. Provides students with a foundation for understanding the processes of listening and speaking as these are experienced by adult second-language learners. While the course focuses on the academic environment, it includes an examination of skills necessary for learners to comprehend a variety of speakers in a range of spoken discourse types, covering both transactional and interactional situations. Also, factors that contribute to effective participation in conversations, including fluency and pronunciation, and cultural and universal rules of discourse are examined, bringing the areas of speaking and listening together in the context of curricular design.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{LING 502}"
    },
    {
        "subject": "LING",
        "catalog_number": "525",
        "title": "English Structures for ESL/EFL Teaching",
        "description": "Prerequisites: ANTH 310 or COMS 420 or ENGL 301; LING 404. Provides a systematic description of the structures and usages of English grammar from the perspective of someone learning English as an additional language. Students focus on ways that such material may most effectively be presented to non-native speakers of English.",
        "units": "3",
        "prerequisites": "{{{ANTH 310} || {COMS 420} || {ENGL 301}} && {LING 404}}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "530",
        "title": "Introduction to TESL",
        "description": "This course prepares students for coursework offered in the M.A. degree in TESL program and for careers in the TESL field. Students will learn the goals of an M.A. TESL student—acquire practical planning skills, examine the history of second and foreign language teaching, develop a basic knowledge of second language acquisition, use research tools in the library, acquire skill in observing and analyzing ESL classes, and become familiar with how to become a professional in ESL and TESL.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "541",
        "title": "Seminar in Sociolinguistics",
        "description": "This course is a graduate seminar on sociolinguistics with a focus on language variation description, theory, method and application. The course will examine regional, social, ethnic and gender varieties. The class will study reports of research focusing on everyday social interaction as well as on larger scale patterns of social dialect variation. The course will also provide opportunities to train in sociolinguistics fieldwork and research methods, with an emphasis on quantitative analysis. Students will practice those skills by carrying out empirical research.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "555",
        "title": "TESL Classroom Practices in Postsecondary Academic Settings",
        "description": "Prerequisites: SED 529 or EED 570; 6 units from LING 520, LING 521 or LING 525. This course is designed to provide students knowledge of issues related to the teaching of English as a second language (ESL) to non-native speakers of English in postsecondary academic settings and also to provide students an opportunity to gain teaching experience through supervised practicum training. The focus will be either on concerns of teaching in intensive programs or in community college settings.",
        "units": "3",
        "prerequisites": "{{{SED 529} || {EED 570}} && {6 units from LING 520, LING 521 or LING 525}}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "566",
        "title": "Research Methods for Linguistics",
        "description": "General Track—Prerequisite or Corequisite: LING 417 or consent of the instructor. Recommended Preparatory: LING 402 and LING 404. TESL Track—Prerequisites or Corequisites: LING 417 and LING 530 or consent of the instructor. Recommended Preparatory: LING 402 and LING 404. An introduction to research in linguistics, including quantitative, qualitative and mixed methods research. Data collection and analysis are covered, along with methods for writing research reports.",
        "units": "3",
        "prerequisites": "{{LING 417} || {consent of the instructor}}",
        "corequisites": "{{LING 417} || {consent of the instructor}}"
    },
    {
        "subject": "LING",
        "catalog_number": "568",
        "title": "TESL Testing and Assessment",
        "description": "This course is intended for students interested in exploring and practicing educational assessment and pursuing a career in TESL. In this course, students not only learn about assessment practices, but more specifically they become aware of the types of pre-, post- and in-class language assessment required to run an effective English language class and/or program. Students will become aware of the various assessment tools available to them, review criteria used to choose effective exams and practice techniques to design or select sound language tests to suit their needs and teaching circumstances.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "578",
        "title": "English for Specific Purposes",
        "description": "Prerequisite: LING 300 or equivalent. This course examines current research, theories, practices, and instructional approaches to teaching English for Specific Purposes(ESP). Students will receive an introduction to ESP and its various sub-branches-English for Academic Purposes (EAP), English for Occupational Purposes (EOP), and English for Professional Purposes (EPP). This course prepares students to teach ESP in a variety of contexts specifically, business, healthcare, law enforcement and hospitality. This course will explore various research tools for investigating specialist discourse such as ethnography, genre analysis, corpus analysis and discourse analysis. Students will learn to conduct a needs analysis of ESP populations. Students will design curricula and evaluate a variety of assessment tools currently used to measure the learning outcomes of second language learners in ESP settings. This course will also focus on intercultural dynamics that impact learning outcomes within ESP contexts.",
        "units": "3",
        "prerequisites": "{LING 300}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "604",
        "title": "Acoustic and Instrumental Phonetics",
        "description": "Prerequisite: LING 402. This course focuses on acoustic phonetics. In depth empirical and theoretical study of the acoustic properties of speech production, perception, and audition. In addition, students will develop expertise in the use of laboratory equipment and instrumentation in the analysis of experimental phonetic data.",
        "units": "3",
        "prerequisites": "{LING 402}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "610",
        "title": "Seminar in Syntax",
        "description": "Prerequisite: LING 404. In-depth study of current approaches to syntactic analysis.",
        "units": "3",
        "prerequisites": "{LING 404}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisite: Consent of Linguistics/TESL department chair. Enrollment required in the semester that the comprehensive examination is taken.",
        "units": "3",
        "prerequisites": "{Consent of Linguistics/TESL department chair}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "698C",
        "title": "Thesis",
        "description": "Prerequisite: Consent of Linguistics/TESL department chair.",
        "units": "3",
        "prerequisites": "{Consent of Linguistics/TESL department chair}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "698D",
        "title": "Graduate Project",
        "description": "This course serves as the culminating experience for students in the Linguistics and TESL M.A. programs. The focus of the course is on the development of a professional graduate project (a graduate project), which will demonstrate each student’s accomplishments and mastery of the relevant area (TESL or Linguistics). While the requirements for the graduate project vary depending on area, students in this course will develop skills for professional presentation and will demonstrate an advanced level of proficiency in relation to research, pedagogy (where appropriate), and writing skills. The course will culminate with student presentations that will be open to all students and attended by faculty members from the department.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]