[
    {
        "subject": "MKT",
        "catalog_number": "304",
        "title": "Marketing Management",
        "description": "Prerequisites: For non-business majors (including non-business majors with a Marketing minor): either (1) ECON 160 and a college-level statistics course; or (2) ECON 160 and BUS 104. For business majors, BUS 302 and BUS 302L are co/prerequisites. All Marketing majors must attain a grade of “C” or higher in MKT 304. MKT 304 is an introductory course in marketing management. Topics include researching and evaluating domestic and global marketing environments and customer behavior to identify opportunities and challenges; grouping customers according to meaningful criteria; serving select markets with effective and socially responsible strategies in product management and branding, new product development, pricing, integrated marketing communications, digital marketing, and channels of distribution; and careers in marketing.",
        "units": "3",
        "prerequisites": "{Parse error: Refer to class description}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "346",
        "title": "Marketing Research",
        "description": "Prerequisites: MKT 304 (Marketing majors must attain a grade of “C” or higher); a college-level statistics course; or consent of instructor. BUS 302 and BUS 302L are prerequisites for Business majors. Use of scientific methods in the formulation and solution of marketing management problems. Emphasis is on the use of marketing research as an adjunct to marketing strategy and policy formulation and on extensive application of statistical techniques and decision-theory concepts to primary and secondary data collection and interpretation.",
        "units": "3",
        "prerequisites": "{{{MKT 304} && {a college-level statistics course}} || {consent of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "348",
        "title": "Consumer Behavior",
        "description": "Prerequisite: MKT 304 (Marketing majors must attain a grade of “C” or higher) or consent of instructor. BUS 302 and BUS 302L are prerequisites for Business majors. Comprehensive study of behavioral models and concepts to help understand, evaluate and predict consumer behavior in terms of marketing implications. Determinants of consumer behavior are explored to gain understanding of the complex forces as they affect the marketplace. Emphasis is upon understanding the processes that influence the acquisition, consumption and disposition of private and public sector goods and services.",
        "units": "3",
        "prerequisites": "{{MKT 304} || {consent of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "350",
        "title": "Consumer Information in the Digital Age",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course will help students understand the changing nature of consumer information with the emergence of non-traditional online marketing. Students will be guided through the history and guiding principles of collecting, disseminating and utilizing consumer information and how marketing has utilized consumer information. Such information has value to a variety of decision makers and regulatory agencies. Resources provided in the course allow students to explore the issues arising from the use of consumer information by firms, government and other consumers. (Available for General Education, D1 Social Sciences.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "356",
        "title": "Marketing Metrics and Insights",
        "description": "Prerequisites: MKT 304 (Marketing majors must attain a grade of “C” or higher); or consent of instructor; BUS 302 and BUS 302L are prerequisites for Business majors. This course covers analytics using practical applications and focuses on developing actionable insights. It provides a broad overview of key analytic strategies, concepts, issues, challenges and tools to interpret, review and critique current marketing strategies employed. Metrics and key performance indicators are analyzed to determine the best ways to enhance effectiveness of blogs, marketing campaigns, SEO, SEM, emails, and emerging social, mobile and video data using quantitative and qualitative competitive tools.",
        "units": "3",
        "prerequisites": "{{{MKT 304} || {consent of instructor}} && {BUS 302/L}}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "440",
        "title": "Integrated Marketing Communications",
        "description": "Prerequisite: MKT 304 (Marketing majors must attain a grade of “C” or higher). BUS 302 and BUS 302L are prerequisites for Business majors. Overview of marketing communications, including advertising and sales promotion. Behavioral, legal, economic and institutional aspects, as well as decision models applied to selected areas of promotion.",
        "units": "3",
        "prerequisites": "{MKT 304}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "441",
        "title": "Sales Management",
        "description": "Prerequisite: MKT 304 (Marketing majors must attain a grade of “C” or higher) or consent of instructor. BUS 302 and BUS 302L are prerequisites for Business majors. Activities and organization of the sales department. Methods employed by sales managers in selecting, training and supervising salespeople; selling methods, materials and campaigns; distribution channels and territories; pricing, budgets, controls and sales research. Lectures, cases, discussions and guest speakers.",
        "units": "3",
        "prerequisites": "{{MKT 304} || {consent of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "442",
        "title": "Business to Business Marketing",
        "description": "Prerequisite: MKT 304 (Marketing majors must attain a grade of “C” or higher) or consent of instructor. BUS 302 and BUS 302L are prerequisites for Business majors. Analysis of the marketing structure for industrial products, including raw materials, installations, operating supplies, accessory equipment and fabricating materials. Buying motives and buying habits for industrial goods, major trade channels, research, pricing, advertising and legal aspects. The purchasing function. Buying by governmental agencies. Governmental regulation. (Cross-listed with SCM 442.)",
        "units": "3",
        "prerequisites": "{{MKT 304} || {consent of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "443",
        "title": "Retail Management",
        "description": "Prerequisite: MKT 304 (Marketing majors must attain a grade of “C” or higher) or consent of instructor. BUS 302 and BUS 302L are prerequisites for Business majors. Retailing methods from the standpoint of the owner and manager. Buying planned stocks, inventory control, markup, accounting for stock control, pricing, style merchandising and advertising. Emphasis on problems of retail management, including departmentation, personnel control, supervisory training, store layout and store location.",
        "units": "3",
        "prerequisites": "{{MKT 304} || {consent of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "445",
        "title": "International Marketing Management",
        "description": "Prerequisites: MKT 304 (Marketing majors must attain a grade of “C” or higher); senior standing. BUS 302 and BUS 302L are prerequisites for Business majors. Study of international marketing conditions and constant changes. Topics include foreign market research; trade promotion; political, legal, economic and cultural environments; product and service adaptability; and multinational competition.",
        "units": "3",
        "prerequisites": "{{MKT 304} && {senior standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "447",
        "title": "Logistics and Transportation Management",
        "description": "Prerequisite: MKT 304 (Marketing majors must attain a grade of “C” or higher). BUS 302 and BUS 302L are prerequisites for Business majors. Introduction to the management of firms that market transportation services; the managerial implications of the legal, economic and social environment. (Cross-listed with SCM 447.)",
        "units": "3",
        "prerequisites": "{MKT 304}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "448",
        "title": "Digital Marketing",
        "description": "Prerequisite: MKT 304 (Marketing majors must attain a grade of “C” or higher) or consent of instructor. BUS 302 and BUS 302L are prerequisites for Business majors. Introduces the student to the principles of Internet marketing. Focuses on the use of Internet technologies as they have come to be used for the marketing, selling and distribution of goods and services. The course makes use of lectures, readings, cases, guest speakers and student projects.",
        "units": "3",
        "prerequisites": "{{MKT 304} || {consent of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "449",
        "title": "Marketing Management Seminar",
        "description": "Prerequisites: MKT 304 (Marketing majors must attain a grade of “C” or higher); either MKT 346 or MKT 348; Second semester senior standing. BUS 302 and BUS 302L are prerequisites for Business majors. Major in business or economics. Advanced case approach to marketing management decisions. Emphasis on developing marketing in response to variations in the competitive economic environment.",
        "units": "3",
        "prerequisites": "{{MKT 304} && {{MKT 346} || {MKT 348}} && {Second semester senior standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "459",
        "title": "Social Media Marketing",
        "description": "Prerequisite: MKT 304 (Marketing majors must attain a grade of “C” or higher). BUS 302 and BUS 302L are prerequisites for Business majors. This course focuses on the use of online social media as a marketing tool to reach consumers and the strategic use of digital media and platforms for professional purposes. Students will learn how to use a variety of tools on the Internet to conduct research, develop online marketing campaigns and increase the competitive advantage of marketing strategies. These techniques will help students engage consumers and assess the results of social media strategies in a rapidly changing environment.",
        "units": "3",
        "prerequisites": "{MKT 304}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "498A",
        "title": "Internship",
        "description": "Prerequisites: BUS 302, BUS 302L and MKT 304 for Business majors (Marketing majors must attain a grade of “C” or higher in MKT 304). Corequisite: MKT 498B. MKT 498A helps interns apply and integrate marketing principles, marketplace evaluation skills, and tactical expertise from their academic studies during their internship experience. (Credit/No Credit only)",
        "units": "1",
        "prerequisites": "{{BUS 302/L} && {MKT 304}}",
        "corequisites": "{MKT 498B}"
    },
    {
        "subject": "MKT",
        "catalog_number": "499A",
        "title": "Independent Study—Marketing",
        "description": "Prerequisites: Consent of department chair and consent of an instructor to act as sponsor; MKT 304 (Marketing majors must attain a grade of “C” or higher). BUS 302 and BUS 302L are prerequisites for Business majors. In order to do an Independent Study assignment in the College of Business and Economics, students must have at least a 3.0 overall GPA, a 3.0 or higher GPA in all major courses and a 3.0 or higher GPA in option courses. Students who do not meet these requirements will not receive credit for MKT 499. Admission is based on evidence of ability to pursue Independent Study in-depth and on approval of a project submitted at the time of registration. Regular progress meetings and reports are required throughout the semester. Completion of the project is required before credit may be received. Enrollment in Independent Study is not allowed for the purpose of substitution for an existing course. A maximum of 6 units of Independent Study (MKT 499) may be earned in the College of Business and Economics. Further, a maximum of 12 units may be earned by combining Field Assignments and Reports (MKT 498) and Independent Study (MKT 499).",
        "units": "1",
        "prerequisites": "{{Consent of department chair and consent of an instructor to act as sponsor} && {MKT 304}}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "640",
        "title": "Marketing Management",
        "description": "Prerequisites: ECON 500; GBUS 600; SOM 591 or equivalent. This course emphasizes the ability to evaluate and create customer-centric marketing management strategies including segmentation, target market selection, developing a value proposition, and building/defending brand equity, within the context of a competitive, dynamic and multi-dimensional global environment. Students make complex decisions regarding the integration of product, pricing, channel and communication strategies to provide value consistent with a brand identity. Students engage in active learning through case studies, simulations and/or client-based projects.",
        "units": "3",
        "prerequisites": "{{ECON 500} && {GBUS 600} && {SOM 591}}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "641",
        "title": "Seminar In International Marketing",
        "description": "Prerequisite: MKT 640. Case studies in global marketing. International market assessment methods of market entry international market segmentation and development global sourcing and distribution policy; global pricing product and communications policy. Analysis of published cases and development of an original research project. \n",
        "units": "3",
        "prerequisites": "{MKT 640}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "642",
        "title": "Seminar In Marketing Communications And Market Stimulation",
        "description": "Prerequisite: MKT 640. Methods of research and theory in market stimulation and mass communication. Particular emphasis on attitude change and the factors affecting the processing of information. \n",
        "units": "3",
        "prerequisites": "{MKT 640}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "644",
        "title": "Seminar in Consumer Behavior",
        "description": "Prerequisite: MKT 640. Study of recent contributions from the behavioral sciences that provide insight into consumer motivation and consumption behavior. Emphasis is on psychological and sociological models and current research from the literature.",
        "units": "3",
        "prerequisites": "{MKT 640}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "647",
        "title": "Marketing Research Seminar",
        "description": "Prerequisites: MKT 640; SOM 591 or equivalent. The application of marketing research techniques to business problems. Emphasis is on research design, questionnaire development, data collection techniques and univariate and multivariate statistics.",
        "units": "3",
        "prerequisites": "{{MKT 640} && {SOM 591}}",
        "corequisites": "{None}"
    },
    {
        "subject": "MKT",
        "catalog_number": "699",
        "title": "Independent Study—Marketing",
        "description": "Prerequisites: Permission of graduate advisor and department chair. Only those graduate students who have a current 3.0 or higher GPA may register in a 600-level Independent Study course. No more than 6 units of Independent Study may be taken in any one department, and no more than 6 units may be taken in the College without prior approval of the dean.",
        "units": "3",
        "prerequisites": "{Permission of graduate advisor and department chair}",
        "corequisites": "{None}"
    }
]