[
    {
        "subject": "RS",
        "catalog_number": "100",
        "title": "Introduction to Religious Studies",
        "description": "Study of the elements of religion and selected contemporary religious issues. Examines such subjects as myth and ritual, the sacred and profane, dreams and theophanies, priests and prophets, science and religion, history and religion, and the possibility of religious faith today. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "101",
        "title": "The Bible",
        "description": "Survey of the basic content and major themes of the Hebrew Bible (Old Testament), New Testament and Apocryphal writings. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "150",
        "title": "World Religions",
        "description": "Study of selected major world religions, with emphasis on tribal religions and the historic international faiths of Asia and the Near East. Investigates rituals, ethics, institutional structures and the cultural ethos of religions, as well as their myths, doctrines and sacred texts. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "204",
        "title": "Religion, Logic and the Media",
        "description": "This course introduces and guides students in the practical use of the basic concepts of deductive logic as a dimension of critical reasoning. Using these concepts, students will discuss, analyze and critique statements that appear in the media (in the U.S. and elsewhere) that have been expressed by religious people and by the media itself. (Available for General Education, Basic Skills A3 Critical Thinking.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "240",
        "title": "Approaches to the History of Religions",
        "description": "An investigation of major and selected religions around the world using social-scientific tools such as history, sociology and anthropology. Students learn why various religions change over time and how they interact with their particular social and cultural environments. Examples are taken from ancient and modern religions, major and tribal religions, including new religious cults. (Available for General Education, D1 Social Sciences.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "255",
        "title": "American Political Institutions and Religion",
        "description": "Examination of the development of U.S. and California political ideals, institutions and processes. The course focuses on the religious elements within political ideals, religious freedom, the relation between religion and state, and the role of religion in the public forum, including both politics and public education. (Available for General Education, D3/D4 Constitution of the United States/State and Local Government.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "256",
        "title": "American Religious History and Ideals",
        "description": "Introduction to the historical development of the United States through a focus on ways that both religious and nonreligious agendas have shaped American institutions and ideals. (Available for General Education, C3 American History, Institutions and Ideals.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "304",
        "title": "Women and Religion",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examination of religious views of women in oral and literary cultures, focusing on the roles, symbols and concepts of women within an international and historical framework. Also addresses women’s own perspectives on religion, as reflected in historical sources and in contemporary theology and religious life. (Available for General Education, C2 Humanities.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "306",
        "title": "American Religious Diversity",
        "description": "Prerequisite: Completion of the lower division writing requirement. Survey of the religion of groups in America who are marginal to or outside of the historically dominant mainstream Protestant and civil religion ethos. (Available for General Education, F Comparative Cultural Studies.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "307",
        "title": "Religion in America",
        "description": "Prerequisite: Completion of the lower division writing requirement. The study of the influence of religious traditions on the formation of American culture and the modification of religious traditions by the American context. Also addresses major American religious thinkers and movements, and religion’s role in shaping American thought, literature and ethos. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "308",
        "title": "Native American Religions",
        "description": "Seeks to understand the religions of Native Americans in their respective tribal contexts. Inquires to what extent a common religious outlook existed among the cultures occupying what is presently the U.S.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "310",
        "title": "Religion and Literature",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of literature to discover to what extent a religious tradition or the lack of one influences an author’s understanding of human existence. Writers who reflect religious traditions, as well as those who are informed by humanism or atheism, are read and interpreted. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "311",
        "title": "Religion and Film",
        "description": "Examines how film artists address the major religious issues of our time, including the nature of reality, sources of transcendence, the nature of good and evil in the self and society, and the possibilities of renewal and hope.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "325",
        "title": "New Testament",
        "description": "Study of the New Testament and its religious thought in context.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "327",
        "title": "Teachings of Jesus",
        "description": "Literary and social analysis of the teachings of Jesus.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "345",
        "title": "Christianity",
        "description": "Eastern Orthodox, Roman Catholic, Protestant and non-traditional forms of Christianity compared and contrasted with one another in their historical and social contexts.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "346",
        "title": "Sufism",
        "description": "A historical and critical study of emergence and development of the mystical tradition of Islam Sufism with particular attention to literary and artistic works that are informed by Sufism as well as the relevance of Sufism to the modern world.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "355",
        "title": "Mysticism",
        "description": "Study of mysticism as a distinct religious phenomenon and a major category of religious experience. To understand its character, it may be studied either within the great Western religious traditions (Judaism, Islam, Christianity) or cross-culturally.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "356",
        "title": "Contemporary Religious Thought",
        "description": "Study of selected major writings in religious thought, with the aim of analyzing representative modern approaches to such questions as God and the world, faith and self-understanding, and belief and social consciousness. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "361",
        "title": "Contemporary Ethical Issues",
        "description": "Prerequisite: Completion of the lower division writing requirement. Emphasizes the development of skills in critical thinking through analysis of such contemporary ethical issues as abortion, euthanasia, genetic engineering, sexual behavior, racism, gender bias, punishment, animal rights, the environment and the relationships between religion and morality. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "365",
        "title": "Islam",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of the varieties of Islamic civilization in their social contexts. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "366",
        "title": "Science and Religion",
        "description": "Prerequisite: Completion of the lower division writing requirement. The course is divided into three main sections. In section one, we consider some fundamental theoretical foundations that characterize the fields of science and religion, and then how they compare as means of knowing the world. Students learn and evaluate historical and contemporary depictions of the relationship between science and religion. In section two, we evaluate contemporary debates about the relationship between science and religion based on what we learned in section one. In section three, we consider the contributions of scientific research to enriching our understanding of religious thought and experiences and vice-versa. By the end of the course, students gain a better understanding of the histories and nature of religion and science. Through exposure to different ways of characterizing the relationship between religion and science, they begin to challenge popular accounts that depict them in constant conflict. Students also gain an appreciation for the ways in which scientific enquiry enriches our understanding of how and why religion operates in the natural world. By constructing critical and informed responses to contemporary issues, students develop skills for recognizing and formulating questions designed to evoke insight. (Available for General Education, B5 Scientific Inquiry and Quantitative Reasoning.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "367",
        "title": "The Psychology of Religion",
        "description": "What role does the human mind play in belief? Is religion a product of nature, nurture, or both? Why is religion so common around the world? If religion is natural, is it true or false? This course tackles questions such as these, attempting to understand the reasons why humans around the world and throughout history are drawn to religion.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "370",
        "title": "Religion and Ecology",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course examines how religious beliefs and practices contribute to humans’ protection, utilization and/or damage of the natural world. Students explore the resources for environmental sustainability within at least two world religious and in new “green” theologies, nature mysticism and radical environmentalism. Particular attention will be paid to land and food ethics, and issues of gender, race, and class. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "378",
        "title": "American Jewish Experience",
        "description": "Prerequisite: Completion of the lower division writing requirement. Seeks to describe the experience of the Jewish religion-ethnic community in America with reference to its own historic background and development, and the relationship of the community to the general American culture and to other particular subcultures or ethnic groups. Emphasizes distinctive Jewish values and customs, and evaluates their contribution to American culture. Studies contrasts between religious and secular understandings of Jewishness, between different strands of Jewish immigration, and between Jewish experience in different regions of the U.S. (Available for General Education, F Comparative Cultural Studies.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "380",
        "title": "Asian Religions: Communal Traditions and Transitions",
        "description": "Prerequisite: Completion of the lower division writing requirement. Explores Asian religions by comparing human and divine religious figures cross-culturally. Comparison of the figures from the various cultures provides a method to understand the nature of humanity and divinity in Asia. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "385",
        "title": "Hinduism",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of the religious life of India from the Indus Valley civilizations to the modern period. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "390",
        "title": "Buddhism",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of the fundamental concepts in Theravada and Mahayana Buddhism (e.g., nirvana, enlightenment, karma, dharma). Examines the historic development of these concepts in their various Asian cultural and geographic settings. (Available for General Education, F Comparative Cultural Studies.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "395",
        "title": "Theory and Method in Religious Studies",
        "description": "Examines modern attempts to study religion objectively from the Western Enlightenment to the present, exploring and criticizing theories and methods from anthropology, sociology, feminist hermeneutics, evolutionary psychology and the history of religions.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "437",
        "title": "Pauline Letters",
        "description": "Literary and social scientific analysis of the Pauline Letters.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "497B",
        "title": "Proseminar In Religious Studies",
        "description": "Reading and discussion in a specific field or on a specific topic in a small group. May be repeated for credit.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]