[
    {
        "subject": "RUSS",
        "catalog_number": "101",
        "title": "Elementary Russian I",
        "description": "Not open to students who have attended schools where Russian was the language of instruction. Study of the fundamentals of Russian grammatical structures, reading, practice in the spoken language. May not be challenged. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "4",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RUSS",
        "catalog_number": "102",
        "title": "Elementary Russian II",
        "description": "Prerequisite: Completion of RUSS 101 or equivalent. Not open to students who have attended schools where Russian was the language of instruction. Continuation of the study of the fundamentals of Russian grammatical structures, reading, practice in the spoken language. May not be challenged. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{RUSS 101}",
        "corequisites": "{None}"
    },
    {
        "subject": "RUSS",
        "catalog_number": "200",
        "title": "Beginning Russian Conversation",
        "description": "Prerequisite: RUSS 102 or instructor consent. Not open to students who have attended schools where Russian was the language of instruction. Designed to develop the aural-oral skills of students of Russian, and to improve their fluency in spoken Russian. May not be challenged. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{{RUSS 102} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "RUSS",
        "catalog_number": "201",
        "title": "Intermediate Russian",
        "description": "Prerequisite: Completion of RUSS 102. Brief review of grammar and study of more advanced grammatical concepts. Introduction to the reading of literature. May not be challenged if principal schooling has been in Russian. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{RUSS 102}",
        "corequisites": "{None}"
    },
    {
        "subject": "RUSS",
        "catalog_number": "202",
        "title": "Intermediate Russian Reading",
        "description": "Prerequisite: RUSS 102. Continuation of study of fundamentals and introduction to Russian literature. May not be challenged if principal schooling has been in Russian. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{RUSS 102}",
        "corequisites": "{None}"
    },
    {
        "subject": "RUSS",
        "catalog_number": "310",
        "title": "Composition and Conversation I",
        "description": "Prerequisite: Completion of lower division courses or instructor consent. Development of active use of oral and written Russian.",
        "units": "3",
        "prerequisites": "{{Completion of lower division courses} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "RUSS",
        "catalog_number": "380",
        "title": "Russian Civilization",
        "description": "Prerequisite: Completion of the lower division writing requirement or instructor consent. Study of the background of the salient features and institutions of contemporary Russian society.",
        "units": "3",
        "prerequisites": "{{Completion of the lower division writing requirement} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "RUSS",
        "catalog_number": "390",
        "title": "Russian Folklore: Slavic Myths and Traditions",
        "description": "Prerequisite: Instructor consent. Epic ballads of early Russia, fairytale and folk tale, modern ballads and folk songs, folklore, with emphasis on the role of the folk element in Russian literature, art, and music.",
        "units": "3",
        "prerequisites": "{Instructor consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "RUSS",
        "catalog_number": "407",
        "title": "Russian for Business, Travel, and Recreation",
        "description": "Study of the fundamentals of Russian business culture in the areas of commerce, travel, and recreation focused on linguistic, cultural, and historical aspects.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]