[
    {
        "subject": "SPED",
        "catalog_number": "200SL",
        "title": "Introduction to Disability Studies Lab",
        "description": "This course provides students with an overview of the disability studies field. Students gain introductory knowledge about disability as a social, cultural, historical and political phenomenon. Drawing from interdisciplinary scholarship and multiple perspectives of people with disabilities, students are exposed to varying disability definitions, cultural meanings and representations, social justice and human rights issues, and current bioethical debates related to disability. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "400",
        "title": "Developmental Differences and Implications in Special Education",
        "description": "This course is designed to help teacher candidates in the area of special education gain knowledge and understanding of typical and atypical development and the implications for educating students with disabilities. Candidates will gain knowledge related to the sources of developmental diversity, including both biological and environmental factors and how these factors can impact a child’s development in the areas of social, cognitive, physical, emotional and language skills. This information will be discussed within the larger context of the different theories of child development to help candidates view these factors from multiple perspectives. Throughout this discussion, the emphasis will be placed on the practical implications for special education and the role of the special educator and other members of the educational planning team in promoting a positive, supportive and healthy learning environment. This course also will provide special education candidates with knowledge of the legal requirements of special education as specified in the Individuals with Disabilities Education Act (IDEA) and other legislative mandates. This course may be taken prior to admission to the Credential Program. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "402",
        "title": "Promoting and Supporting a Positive and Inclusive School Climate",
        "description": "This course is designed to provide education specialist candidates with the skills and knowledge needed to promote and reinforce prosocial skills using positive behavior support strategies. The three-tiered model (primary, secondary and tertiary supports) to positive behavior support will serve as the organizing framework for this course. Additionally, concepts around (a) trauma informed practices, (b) social-emotional learning, (c) restorative justice, and (d) culturally responsive teaching are immersed throughout the course. The first half of the course focuses on ways to promote positive and cooperative behaviors using a variety of schoolwide and classroom strategies, including teaching and reinforcing expected behaviors, active supervision, collaboration with team members, and planned responses to challenging behavior (primary level of supports). The remainder of the course focuses on providing more intensive supports for students with more pervasive/complex behavioral and social-emotional support needs (secondary and tertiary level of supports). Relevant federal and state legislation and ethical considerations are discussed. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "403D",
        "title": "Early Field Experience in Deaf Education",
        "description": "Prerequisite: Admission to the Preliminary Education Specialist Credential Program. Corequisite: SPED 400. This course is the first of two fieldwork practica in special education designed to provide credential candidates field experiences in K-12 schools serving deaf and hard-of-hearing students. Students observe/participate in the instruction of deaf and hard-of-hearing students across the age ranges from preschool through high school and across the range of settings from itinerant to self-contained classes to special school and residential school placements. Accompanying seminars link terminology, issues and instructional perspectives with practice, with collegial support provided to participants. At least 200 fieldwork hours that includes purposeful, planned interactions, guided observations and initial student teaching (e.g., co-planning and co-teaching, or guided teaching) is provided to candidates in general education and special education settings. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Admission to the Preliminary Education Specialist Credential Program}",
        "corequisites": "{SPED 400}"
    },
    {
        "subject": "SPED",
        "catalog_number": "403MME",
        "title": "Early Field Experience/Seminar in Special Education",
        "description": "Prerequisites: Restricted to candidates admitted to the Preliminary Education Specialist Credential Program, ITEP, or the Dual Preliminary Single Subject/Education Specialist Credential Program. Prerequisites for Preliminary Education Specialist Credential Program: SPED 400, SPED 511. Pre/corequisites for the Preliminary Education Specialist Credential Program: SPED 420. Pre/corequisites for Dual Preliminary Single Subject/Education Specialist Program: EPC 420, SED 521, SED 525XX, SPED 420, SPED 511. This course is the first of two supervised field experiences for students in the Mild to Moderate and Extensive Support Needs (MME) Programs. SPED 403MME is designed to provide credential candidates practical hands-on experience in K-12 schools. Accompanying seminars link coursework with practice and provide collegial support to participants. The seminar meets on a regular basis throughout the semester with the university supervisor. Fieldwork hours consist of 12 hours per week in a classroom setting with support from an on-site mentor teacher.",
        "units": "3",
        "prerequisites": "{Restricted to candidates admitted to the Preliminary Education Specialist Credential Program, ITEP, or the Dual Preliminary Single Subject/Education Specialist Credential Program}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "404",
        "title": "Teaching Diverse Learners with Social-Communication Disabilities, Including Autism",
        "description": "This course is designed to provide information regarding the social-communication challenges faced by diverse learners, including students who are diagnosed with autism spectrum disorder (ASD). Emphasis will be placed on implications for intervention and instruction based on students’ learning characteristics, including: (a) the roles of social interaction and communication in cognition and learning; (b) specific learning needs of students with social-communication disabilities, including ASD; and (c) critical evaluation, selection and implementation of interventions for students with social-communication disabilities, including ASD. The teacher’s role in working with families and teaming with other disciplines to develop a comprehensive and interdisciplinary approach across ages and severity of these disabilities will be examined. This course may be taken prior to admission to the Credential Program. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "406",
        "title": "K-12 Literacy Instruction for Diverse Learners with Disabilities",
        "description": "Prerequisites: Restricted to candidates admitted to the Education Specialist Credential Program, ITEP, and Educational Therapy programs. This course is designed to prepare special education students to teach diverse learners with disabilities reading and language arts at the elementary and secondary levels. The course focuses on the design and delivery of comprehensive literacy programs consistent with state standards and the competencies and strengths of students with disabilities. Content specifically addresses word analysis, fluency, vocabulary, academic language and comprehension, and prepares students to pass the RICA exam. An emphasis is placed on the development and organization of differentiated instructional practices for students with disabilities, based on findings from individualized assessment procedures. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Restricted to candidates admitted to the Education Specialist Credential Program, ITEP, and Educational Therapy programs}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "407",
        "title": "Communication, Language, and Early Literacy Development for K-12 Students with Disabilities",
        "description": "This course focuses on the role of a special education teacher in fostering communication, language and early literacy development for students with disabilities, with mild to extensive support needs, including those who are emergent bilingual or multilingual. Students will learn about recommended and evidence based practices to assess and support students’ early language use and communicative behaviors as well as strategies to promote early and emergent literacy skills.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "416",
        "title": "Educating Diverse Learners with Disabilities and Working with Their Families",
        "description": "Prerequisites: Restricted to candidates admitted to the Preliminary Education Specialist Credential Program, ITEP, or the Dual Preliminary Single Subject/Education Specialist Credential Program. Prerequisites for Preliminary Education Specialist Credential Program: SPED 400 or SPED 541B, and SPED 407. Prerequisites for Dual Preliminary Single Subject/Education Specialist Program: EPC 420 and SPED 407. This course is designed to provide information regarding the education of diverse learners with disabilities. The course provides an overview of the needs of English language learners (ELLs) with disabilities with an emphasis on understanding and accepting differences in culture, ethnicity, language and abilities and disabilities of individuals. Candidates are introduced to state and federal laws related to students with disabilities and diverse needs. Knowledge and practices for becoming culturally competent educators are discussed, taking into account the principles of language acquisition, language proficiency, differences in family backgrounds and systems, and how these affect learning. Finally, the course addresses ways of communicating effectively and respectfully with families.",
        "units": "3",
        "prerequisites": "{Restricted to candidates admitted to the Preliminary Education Specialist Credential Program, ITEP, or the Dual Preliminary Single Subject/Education Specialist Credential Program}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "420",
        "title": "Designing Equitable Learning Through Universal Design",
        "description": "Prerequisites: Acceptance into the Preliminary Multiple Subject, Single Subject, Education Specialist, Dual Preliminary Single Subject/Education Specialist Credential programs or Educational Therapy certificate program. This course, designed for general and special education teacher candidates, emphasizes practical approaches to the design and implementation of equitable and responsive differentiated instruction for all learners. Foundational information on the rationales, impacts, and core components of inclusive education and collaborative special education service delivery will be introduced. The course also focuses on developing the communication skills needed to effectively partner with families and to collaboratively implement multi-tiered academic, behavior, and social-emotional systems of support.",
        "units": "2",
        "prerequisites": "{Acceptance into the Preliminary Multiple Subject, Single Subject, Education Specialist, Dual Preliminary Single Subject/Education Specialist Credential programs or Educational Therapy certificate program}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "431",
        "title": "Atypical Development in Young Children with Disabilities",
        "description": "May be taken prior to admission. This course examines atypical development in young children with disabilities and the interrelationships and implications of atypical development in motor, cognitive, sensory, language/speech and social/emotional areas. It is designed for professionals working in nursing, special education, physical and occupational therapy, speech and language, social work and child development. Emphasis is placed on etiology, research and evidence-based practices. Available for graduate credit. (Offered once each year.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "499X",
        "title": "Independent Study",
        "description": "Independent Study",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "500",
        "title": "Communication and Early Literacy Development of Young Children with Disabilities",
        "description": "May be taken prior to admission. This course focuses on communication strategies and early literacy development for young children with disabilities, including those who are learning English as a second language. Students will learn about recommended and evidence-based practices to assess and support these children’s early language use and communicative behaviors. They also will learn to use strategies to support young children’s participation in story book reading and develop their emerging literacy skills.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "501MM",
        "title": "Special Education Assessment of Diverse Learners with Mild/Moderate Disabilities",
        "description": "Prerequisites: SPED 400, SPED 406, and either SPED 403MME or SPED 506MMA or admission to the Educational Therapy Programs with pre/corequisites SPED 400 and SPED 406. Prerequisites for the Dual Single Subject/Education Specialist Program: EPC 420, SED 521. Pre/corequisite for Dual Single Subject/Education Specialist Program: SPED 403MME. This course is designed to provide candidates with the foundation for understanding the assessment process and to prepare students to be professional educators and leaders in assessment. Candidates will focus on the educational assessment methods and procedures used in decision making and program planning for students with mild/moderate disabilities, including those from culturally and/or linguistically diverse backgrounds, with emphasis on administering, scoring and interpreting standardized educational tests. Evidence based practices in assessment will be used throughout the collection of data and the interpretation of that data.",
        "units": "3",
        "prerequisites": "{{SPED 400} && {SPED 406} && {{SPED 403MME} || {SPED 506MMA} || {admission to the Educational Therapy Programs with pre/corequisites SPED 400 and SPED 406}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "502MME",
        "title": "Literacy Intervention for Diverse K-12 Students with Mild to Extensive Support Needs",
        "description": "Restricted to candidates admitted to the Preliminary Education Specialist Credential Program, ITEP or the Dual Preliminary Single Subject/Education Specialist Program. Prerequisites for ITEP and Preliminary Education Specialist Credential Program: SPED 400 or SPED 541B, SPED 406; Prerequisites for Dual Single Subject/Preliminary Education Specialist Program: EPC 420, SED 521. This course develops understanding of reading processes and the reading and written language problems of students with mild to extensive support needs. Emphasis is given to informal diagnostic assessment procedures and the application of instructional techniques to remediate identified areas of need. Evidence-based high leverage approaches to supporting the development of individualized interventions in writing, phonemic awareness, word decoding, fluency, vocabulary knowledge and reading comprehension are critically examined and applied. Students will engage in collaboration with a co-teacher to plan, instruct, and assess a child with significant reading challenges in the clinical setting, and participate in consistent collaboration with the families of clinic students.",
        "units": "3",
        "prerequisites": "{{{SPED 400} || {SPED 541B}} && {SPED 406} && {Prerequisites for Dual Single Subject/Preliminary Education Specialist Program: EPC 420, SED 521}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "503MME",
        "title": "Curriculum and Instruction for Diverse Learners with Mild to Extensive Support Needs",
        "description": "Restricted to candidates admitted to the Preliminary Education Specialist Credential Program, the Dual Preliminary Single Subject/Education Specialist Credential Program, the ITEP program, or the Master of Arts (M.A.) degree in Educational Therapy. Prerequisites for ITEP and Preliminary Education Specialist Credential Program: SPED 420 or SPED 541B, SPED 511, and EED 472, or EED 565M, or SED 525XX. Pre/co requisites for Dual Preliminary Single Subject/Education Specialist Credential Program: SPED 420, SPED 511, and SED 525XX. This course examines evidence-based models of curriculum and instruction across several core content areas (e.g., math, science, social studies, and language arts). Candidates demonstrate the ability to design universally designed lessons using the components of Universal Design for Learning (UDL) and create individualized curricular and instructional supports to meet the needs of learners with extensive to mild support needs. Emphasis is given to using assessment findings to guide instructional decisions. Finally, candidates demonstrate the ability to apply direct instruction and/or systematic instructional strategies when teaching new skills, tasks, and concepts.",
        "units": "3",
        "prerequisites": "{Parse error: refer to class description}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "504D",
        "title": "Foundations of Deaf Education",
        "description": "Prerequisites or Corequisites: SPED 400, SPED 403D. This course uses the historical context of deaf education to focus on current educational, political and social trends that affect the placement and instruction of deaf/hard of hearing students. The breadth of placements and age ranges within this diverse population are critically reviewed using current research in the field. (Offered Fall semester.)",
        "units": "3",
        "prerequisites": "{{SPED 400} && {SPED 403D}}",
        "corequisites": "{{SPED 400} && {SPED 403D}}"
    },
    {
        "subject": "SPED",
        "catalog_number": "504MS",
        "title": "Teaching Learners with Moderate/Severe Disabilities",
        "description": "Prerequisite: Admission to Preliminary Education Specialist Credential Program in Moderate/Severe Disabilities. This course is the first of the four specialization courses candidates in Moderate/Severe disabilities take and as such, serves as the course that provides a strong foundation for subsequent methodology classes. Topics include definition and identification of students with moderate to severe disabilities; federal legislation pertinent to this population; educational theories guiding practice and how these theories have changed over time; appropriate assessment practices and tools and educational approaches recommended for this group of learners. Planning and adapting to meet the needs of students from diverse cultural and linguistic backgrounds is infused throughout the course. Emphasis is placed on understanding the prevailing recommended practices in the field of severe/moderate disabilities as endorsed through contemporary research.",
        "units": "3",
        "prerequisites": "{Admission to Preliminary Education Specialist Credential Program in Moderate/Severe Disabilities}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "505MS",
        "title": "Curriculum and Instruction for Diverse Learners with Moderate to Severe Disabilities",
        "description": "Prerequisites: SPED 400, SPED 504MS. This course examines models of assessment, curriculum and instruction appropriate for learners having moderate to severe disabilities. Candidates gather and analyze assessment data to identify individual student strengths and areas of needs. Candidates evaluate research to identify evidence-based instructional practices appropriate for this group of learners with an emphasis on teaching math, literacy and other academic skills. Candidates use this knowledge to modify curriculum with an emphasis on differentiated instruction to meet the unique needs of this diverse population. Candidates develop goals and objectives that are aligned with the Common Core and Alternate Achievement Standards. Authentic assessment, systematic instruction and access to the core curriculum are emphasized in this course. Candidates are required to engage in fieldwork in order to complete applied assignments. Course may be repeated twice for credit.",
        "units": "3",
        "prerequisites": "{{SPED 400} && {SPED 504MS}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "506ECA",
        "title": "Early Childhood Special Education Internship Field Experience",
        "description": "Prerequisite: Must be enrolled in the Early Childhood Special Education Specialist Intern Program. SPED 506ECA: Prerequisites or Corequisities with first semester SPED 431 and 402. SPED 506ECB : Prerequisites or Corequisities with second semester SPED 532 537). SPED 506ECC: Prerequisities prior to third semester SPED 500 535 536; Corequisites with third semester SPED 520EC 538. Designed to provide ongoing support to candidates in the Early Childhood Special Education Intern Credential Program. Reflective supervision is provided through on-site visits by the instructor analysis of videos online discussions and monthly meetings. Class sessions involve discussion of teaching experiences video analysis problem-solving resource sharing and collegial support.\n",
        "units": "3",
        "prerequisites": "{Parse error: refer to class description}",
        "corequisites": "{Parse error: refer to class description}"
    },
    {
        "subject": "SPED",
        "catalog_number": "511",
        "title": "Assessing Diverse Learners with Mild to Extensive Support Needs",
        "description": "Prerequisite: Restricted to candidates admitted to the Preliminary Education Specialist Credential Program, Dual Preliminary Single Subject/Education Specialist Credential Program, ITEP, or the Master of Arts degree in Educational Therapy. This course is designed to provide candidates with the foundation for understanding the assessment process for learners with a range of support needs. Candidates will focus on the educational assessment methods and procedures used in decision making and program planning for students with mild to extensive support needs including those from culturally and/or linguistically diverse backgrounds. Candidates will learn how to implement and analyze findings using standardized and authentic assessments across content areas.",
        "units": "3",
        "prerequisites": "{Restricted to candidates admitted to the Preliminary Education Specialist Credential Program, Dual Preliminary Single Subject/Education Specialist Credential Program, ITEP, or the Master of Arts degree in Educational Therapy}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "520EC",
        "title": "Assessment and Evaluation in Early Childhood Special Education",
        "description": "Prerequisite or Corequisite: SPED 431. Theory and practice of assessment and evaluation of infants, toddlers and young children with special needs. Examines the uses and limitations of current assessment practices for educational decision making with this population. Includes evaluation, selection and administration of assessment instruments for both young children and their families and use of assessment results to develop the IFSP/IEP. Assessment for program evaluation also is considered. Open to graduate students in related disciplines (Communication Disorders and Sciences, Child and Adolescent Development, Psychology/Educational Psychology, Physical Therapy, Nursing) as well as in Special Education. (Offered once each year.)",
        "units": "3",
        "prerequisites": "{SPED 431}",
        "corequisites": "{SPED 431}"
    },
    {
        "subject": "SPED",
        "catalog_number": "532",
        "title": "ECSE Curriculum and Instruction",
        "description": "This course may be taken prior to admission to the Preliminary Education Specialist Credential Program. The purpose of this course is to provide individuals with knowledge of program models, instructional methods, and curriculum in early childhood special education from preschool through kindergarten. Primary emphasis will be placed on tiered instruction, developmentally appropriate practices, and embedded instruction in preschool to kindergarten settings. Information pertaining to designing environments, technology use, and positive behavior support will also be discussed. This course serves to prepare exemplary, reflective practitioners to serve a global community.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "535",
        "title": "Collaboration with Families in Early Childhood Special Education",
        "description": "Prerequisite: Restricted to candidates admitted to the Education Specialist Credential program in Early Childhood Special Education or admission to the Special Education master’s degree program. Recommended and evidence-based practices for working with families of infants, toddlers, and preschoolers receiving early intervention and early childhood special education services. An emphasis is placed on family-centered and culturally-responsive practices that promote the family’s roles in the child’s development and the family systems model in designing and implementing effective services. Interviewing and active listening techniques are included. (Offered once each year).",
        "units": "3",
        "prerequisites": "{Restricted to candidates admitted to the Education Specialist Credential program in Early Childhood Special Education or admission to the Special Education master’s degree program}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "536",
        "title": "Methods for Young Children with Disabilities: Motor and Adaptive Skills",
        "description": "Prerequisite or Corequisite: SPED 431. Study of atypical patterns of motor development in infants, toddlers and preschool children with disabilities; and methods of assessment and intervention for fine and gross motor skills. An emphasis is placed on collaboration with families, physical and occupational therapists and other service providers in assessing motor, adaptive and sensory processing skills, using adaptive devices, specialized equipment and other modifications to support a child’s active participation. (Offered once each year.)",
        "units": "3",
        "prerequisites": "{SPED 431}",
        "corequisites": "{SPED 431}"
    },
    {
        "subject": "SPED",
        "catalog_number": "537",
        "title": "Methods for Young Children with Multiple Disabilities: Sensory Impairments",
        "description": "Prerequisite or Corequisite: SPED 431. This course identifies strategies for working with infants, toddlers and preschoolers whose multiple disabilities include vision impairments and/or hearing loss. An emphasis is placed on collaboration with families, vision and hearing specialists and other related services personnel in identifying children’s functional use of vision and hearing and adapting instructional materials, activities and environments to enhance learning. (Offered once each year.)",
        "units": "3",
        "prerequisites": "{SPED 431}",
        "corequisites": "{SPED 431}"
    },
    {
        "subject": "SPED",
        "catalog_number": "538",
        "title": "Early Intervention Practices",
        "description": "Prerequisites or Corequisites: SPED 402, SPED 404, SPED 500, SPED 520EC, SPED 532, SPED 535, SPED 536, SPED 537. Corequisites: SPED 578 or taken the semester immediately before SPED 578. The purpose of this course is to provide students with knowledge and skills to support the growth, development, and learning of infants and toddlers with Individualized Family Service Plans (IFSPs). Course content focuses on philosophies and recommended and evidence-based practices in the field of early intervention, developmentally appropriate practices, team models, service delivery approaches, transitions to different learning settings, and strategies to promote collaboration with families and other members of the educational team. Modeling and coaching strategies with families will also be discussed and practiced.",
        "units": "2",
        "prerequisites": "{{SPED 402} && {SPED 404} && {SPED 500} && {SPED 520EC} && {SPED 532} && {SPED 535} && {SPED 536} && {SPED 537}}",
        "corequisites": "{{SPED 402} && {SPED 404} && {SPED 500} && {SPED 520EC} && {SPED 532} && {SPED 535} && {SPED 536} && {SPED 537}}"
    },
    {
        "subject": "SPED",
        "catalog_number": "541B",
        "title": "Getting Started–Introduction to Teaching in Urban Schools",
        "description": "Prerequisites: Restricted to candidates admitted to the Accelerated Collaborative Teacher (ACT) Residency Program. Corequisites: Multiple Subject Credential Candidates: ELPS 541A; EPC 500 or EED 500; EED 515, EED 520, EED 565M, EED 577, EED 559C, EED 567ACT. Single Subject Credential Candidates: ELPS 541A; EPC 420; SED 511, SED 514, SED 525XX, SED 554/S. Special Education Credential Candidates in MME: ELPS 541A; SPED 402, SPED 406, SPED 407, SPED 511, SPED 579ACT; EED 565M or SED 525XX. This course is the first of two core courses in the ACT Program for elementary, secondary, and special education teacher candidates. Taught collaboratively by a team of university and school faculty, the course is an introduction to teaching and learning in the context of K-12 urban schools, with an emphasis on educational equity, diversity, and special populations. Topics include an introduction to the roles and responsibilities of a professional educator; teachers’ and students’ backgrounds and how they impact teaching and learning in urban schools; knowledge of relevant federal and state legislation for students with disabilities; differentiated instruction that is universally accessible to all learners; accommodations and modifications to grade-level instruction in order to meet students’ individual needs, and collaboration with school professionals and families. Teacher candidates are provided activities and discussions that emphasize the links between theory and practice. (Offered in Fall semester only.)",
        "units": "1",
        "prerequisites": "{Restricted to candidates admitted to the Accelerated Collaborative Teacher (ACT) Residency Program}",
        "corequisites": "{Multiple Subject Credential Candidates: ELPS 541A; EPC 500 or EED 500; EED 515, EED 520, EED 565M, EED 577, EED 559C, EED 567ACT}"
    },
    {
        "subject": "SPED",
        "catalog_number": "542B",
        "title": "Meeting the Needs of All Students in Urban Schools",
        "description": "Prerequisites: Restricted to candidates admitted to the Accelerated Collaborative Teacher (ACT) Residency Program; Successful completion of all Fall semester coursework. Corequisites: Multiple Subject Credential Candidates: ELPS 542A; EED 559F, EED 565S, EED 568ACT, EED 575; HSCI 465ELM; KIN 595PE. Single Subject Credential Candidates: ELPS 542A; HSCI 466ADO; SED 521, SED 529, SED 555, SED 555S. Special Education Credential Candidates in MME: ELPS 542A; SPED 416, SPED 502MME, SPED 503MME, SPED 545, SPED 580ACT. This course is the second of two core courses in the ACT Program designed for elementary, secondary, and special education teacher candidates and taught collaboratively by a team of university and school faculty. Building on the content introduced in the first core course related to educational equity, restorative justice practices, diversity and special populations, topics include developing as a reflective educator who considers the learning needs of all students; creating and managing effective and healthy classroom environments in urban schools; problem solving strategies to facilitate teaching and learning; instructional modifications and accommodations for students with disabilities in general education settings, issues related to diversity and multicultural education; and models of collaboration/consultation. Teacher candidates are provided activities and discussions that emphasize the links between theory and practice. (Offered in Spring semester only.)",
        "units": "1",
        "prerequisites": "{{Restricted to candidates admitted to the Accelerated Collaborative Teacher (ACT) Residency Program} && {Successful completion of all Fall semester coursework}}",
        "corequisites": "{Multiple Subject Credential Candidates: ELPS 542A; EED 559F, EED 565S, EED 568ACT, EED 575; HSCI 465ELM; KIN 595PE}"
    },
    {
        "subject": "SPED",
        "catalog_number": "544CD",
        "title": "Student Teaching in Language, Speech and Hearing and Audiology",
        "description": "Prerequisites: CD 465, CD 566, CD 567 and the approval of the Department of Communication Disorders and Sciences. The student will spend a minimum of 135 hours on a K-12 school site under the supervision of a master teacher who is a speech language pathologist with a state license and Certification of Clinical Competency from the American Speech Language Hearing Association (ASHA). In addition, all candidates will be supervised by a University faculty coordinator from the Department of Communication Disorders and Sciences. The student will assume the planning and teaching responsibilities of the professional language pathologist on the assigned days.",
        "units": "6",
        "prerequisites": "{{CD 465} && {CD 566} && {CD 567} && {approval of the Department of Communication Disorders and Sciences}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "545",
        "title": "Support Strategies for Learners with Physical and Multiple Disabilities",
        "description": "Prerequisites: Restricted to candidates admitted to the Preliminary Education Specialist Credential Program or the Dual Preliminary Single Subject/Education Specialist in Mild/Moderate and Extensive Support Needs. Prerequisites for Preliminary Education Specialist Credential Program: SPED 400 or SPED 541B. Prerequisites for Dual Preliminary Single Subject/Education Specialist in Mild/Moderate and Extensive Support Needs: EPC 420. This course includes a study of common physical impairments and their impact on development and learning. Topics include (a) assessment and intervention strategies; (b) transdisciplinary approach to service delivery, including collaboration with families, general education teachers, and related service staff; (c) techniques on physical positioning, lifting, and carrying procedures; (d) infusion of high and low technology to facilitate access, and (e) strategies to adapt and accommodate school-age children and youth grades K-12 having physical and multiple disabilities. Issues related to healthcare will also be addressed.",
        "units": "3",
        "prerequisites": "{Restricted to candidates admitted to the Preliminary Education Specialist Credential Program or the Dual Preliminary Single Subject/Education Specialist in Mild/Moderate and Extensive Support Needs}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "560",
        "title": "Development and Assessment of Language in Deaf and Hard of Hearing Students",
        "description": "Prerequisites or Corequisites: SPED 403D, SPED 416, SPED 504D. This course addresses optimal communication environments for language acquisition and contrasts features of and communication strategies used by deaf parents and hearing parents with deaf children. General theoretical framework of language acquisition is covered, as well as strategies to assess and promote the basic interpersonal communication skills (BICS) and cognitive academic language proficiency (CALP) of deaf and hard-of-hearing children.",
        "units": "3",
        "prerequisites": "{{SPED 403D} && {SPED 416} && {SPED 504D}}",
        "corequisites": "{{SPED 403D} && {SPED 416} && {SPED 504D}}"
    },
    {
        "subject": "SPED",
        "catalog_number": "561D",
        "title": "Teaching Reading to Deaf and Hard of Hearing Students",
        "description": "Prerequisites or Corequisites: SPED 406, SPED 560. Corequisite: SPED 565. This course is a systematic examination of principles, assessment and instruction of reading deaf and hard-of-hearing pupils. This course addresses the development of emergent literacy skills of young children and actual reading abilities. This course focuses on reading skills development, vocabulary acquisition, development of concepts through reading, and language assimilation through reading. Selection and use of appropriate instructional resources to develop reading skills also are covered.",
        "units": "3",
        "prerequisites": "{{SPED 406} && {SPED 560}}",
        "corequisites": "{{SPED 406} && {SPED 560}}"
    },
    {
        "subject": "SPED",
        "catalog_number": "563",
        "title": "Audiology and Spoken English Development for Teachers of Deaf and Hard of Hearing Students",
        "description": "Prerequisites or Corequisites: SPED 416, SPED 504D, SPED 560. This course is an examination of audiological and speech theory and practice pertinent to the teaching of deaf and hard-of-hearing students, with an emphasis on bilingual methods, procedures and materials used in teaching speech, speech reading and auditory training. Students will acquire knowledge and skills related to early intervention and the impact of Newborn Hearing Screenings, working with families, and the early use of assistive listening devices, including cochlear implants. Current research and directions in listening technology will be reviewed.",
        "units": "4",
        "prerequisites": "{{SPED 416} && {SPED 504D} && {SPED 560}}",
        "corequisites": "{{SPED 416} && {SPED 504D} && {SPED 560}}"
    },
    {
        "subject": "SPED",
        "catalog_number": "565",
        "title": "Teaching Written English to Deaf and Hard of Hearing Students",
        "description": "Prerequisites or Corequisites: SPED 406, SPED 560. Corequisite: SPED 561D. This course is a systematic examination of various systems and methods that have been used to teach written English to deaf and hard-of-hearing students. Exploration of the facilitative role of ASL fluency on the subsequent acquisition of written English skills will be addressed. Strategies and activities are presented and practiced for assessing and developing the written English skills of deaf and hard-of-hearing students.",
        "units": "3",
        "prerequisites": "{{SPED 406} && {SPED 560}}",
        "corequisites": "{{SPED 406} && {SPED 560}}"
    },
    {
        "subject": "SPED",
        "catalog_number": "566D",
        "title": "Curriculum and Instruction for Deaf and Hard of Hearing Students",
        "description": "Prerequisites or Corequisites: SPED 402, SPED 504D, SPED 560. This course examines assessment, curriculum and instruction appropriate for deaf and hard-of-hearing students across the age range. Candidates use research and contemporary theoretical orientations to evaluate, modify and/or design instructional materials for assessment, curriculum development and instruction in content areas. Emphasis is given to developing knowledge and skills in ASL/English bilingual instruction.",
        "units": "3",
        "prerequisites": "{{SPED 402} && {SPED 504D} && {SPED 560}}",
        "corequisites": "{{SPED 402} && {SPED 504D} && {SPED 560}}"
    },
    {
        "subject": "SPED",
        "catalog_number": "567D",
        "title": "Teaching Deaf and Hard of Hearing Students with Special Needs",
        "description": "Prerequisites or Corequisites: SPED 402, SPED 504D, SPED 560. Deaf students with special needs have unique learning and behavioral characteristics that present many challenges to their teachers. This course will address characteristics, placement, modification of curriculum, instructional methods and educational materials to meet these students’ special learning and behavioral needs. Emphasis will be on establishing programs that are meaningful to the students and provide an arena in which they can be successful. (Offered Spring semester.)",
        "units": "3",
        "prerequisites": "{{SPED 402} && {SPED 504D} && {SPED 560}}",
        "corequisites": "{{SPED 402} && {SPED 504D} && {SPED 560}}"
    },
    {
        "subject": "SPED",
        "catalog_number": "578",
        "title": "Fieldwork in ECSE: Infant/Toddler",
        "description": "Each Early Childhood Special Education candidate is assigned to a program providing early intervention services to infant/toddlers with disabilities and their families. This fieldwork of at least 100 hours includes working with the families, participating in the design and implementation of individualized plans and activities to support the children’s development in all areas, ongoing data collection and participation in team meetings and other professional activities as appropriate. Supervision is provided by the cooperating/master teacher and through on-site visits by the University instructor. May also be an option for the University Certificate in Early Intervention. (Offered once each year.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "579ACT",
        "title": "Supervised Fieldwork/Seminar Mild/Moderate and Extensive Support Needs",
        "description": "Prerequisites: Restricted to candidates admitted to the Accelerated Collaborative Teacher (ACT) Residency Program. Prerequisites or Corequisites: ELPS 541A; SPED 402, SPED 406, SPED 407, SPED 511, SPED 541B; EED 565M or SED 525XX. This course is the first of two supervised field experiences and seminars for residents in the ACT Mild/Moderate and Extensive Support Needs Programs. SPED 579ACT is designed to provide residents practical hands-on experience in K-12 culturally and linguistically diverse schools. Accompanying seminars link coursework with practice and provide collegial support to participants. The seminar meets on selected weeks during the semester with the university supervisor. Fieldwork hours consist of 12 hours per week in a classroom setting with support from an on-site mentor teacher. (Offered Fall semester only.)",
        "units": "3",
        "prerequisites": "{Parse error: refer to class description}",
        "corequisites": "{Parse error: refer to class description}"
    },
    {
        "subject": "SPED",
        "catalog_number": "580ACT",
        "title": "Advanced Fieldwork/Student Teaching and Seminar in Mild/Moderate and Extensive Support Needs",
        "description": "Prerequisites: Restricted to candidates admitted to the Accelerated Collaborative Teacher (ACT) Residency Program. Successful completion of all Fall semester coursework. Prerequisite or Corequisites: ELPS 542A; SPED 416, SPED 502MME, SPED 503MME, SPED 542B, SPED 545. This is the final special education field experience for residents in the ACT Mild/Moderate and Extensive Support Needs Education Specialist Preliminary Credential Programs. Residents complete this experience with a mentor or mentor teachers who serve students with mild to extensive support needs from culturally and linguistically diverse backgrounds. Fieldwork, prior to student teaching, consists of 12 hours per week for 8 weeks (96 hours). Student teaching consists of a full day 13-week assignment in which the resident gradually assumes responsibility for the entire instructional program. The resident is provided supervision and guidance by the mentor teacher and university supervisor. The seminar meets on selected weeks during the semester and is designed to support residents in reflecting on their student teaching experience and completing assignments. Seminars link coursework with practice and provide collegial support to residents. A grade of “B” or better required to pass SPED 580ACT.",
        "units": "6",
        "prerequisites": "{Parse error: refer to class description}",
        "corequisites": "{Parse error: refer to class description}"
    },
    {
        "subject": "SPED",
        "catalog_number": "580EC",
        "title": "Advanced Specialist Fieldwork and Seminar in Early Childhood Special Education",
        "description": "Prerequisites: Bachelor’s degree in Child and Adolescent Development or 12 units in approved Child and Adolescent Development or Early Childhood courses, SPED 402, SPED 431, SPED 500, SPED 532, and SPED 535. May be taken as a corequisite to SPED 520EC, SPED 536, or SPED 537 (although only one of these three may be taken concurrently with this course). Early Childhood Special Education candidates complete one semester of supervised fieldwork in a preschool, pre-Kindergarten, Transitional Kindergarten, or Kindergarten setting. Supervision is provided by the cooperating/master teacher and through on-site visits by the University instructor and video analysis. Students meet in a seminar with the instructor to discuss their video and on-site observations, and fieldwork activities. A grade of “B” or better is required to pass SPED 580EC.",
        "units": "9",
        "prerequisites": "{Parse error: refer to class description}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "580MME",
        "title": "Student Teaching and Seminar in Mild/Moderate and Extensive Support Needs",
        "description": "Restricted to candidates admitted to the Preliminary Education Specialist Credential Program, ITEP, or the Dual Preliminary Single Subject/Education Specialist Program. Prerequisites for Preliminary Education Specialist Credential: SPED 400, SPED 403MME, SPED 406, SPED 407, SPED 420, SPED 503MME, SPED 511. Prerequisites for Dual Preliminary Single Subject/Education Specialist Credential Program: EPC 420; SED 521, SED 525XX, SED 554/S; SPED 403MME, SPED 407, SPED 420, SPED 503MME, SPED 511. Pre/Corequisites for Preliminary Education Specialist Credential: SPED 402, SPED 416, SPED 502MME, SPED 545; EED 472 or EED 565M or SED 525XX. Only one of these courses, however, may be taken concurrently with SPED 580MME. Corequisites for Preliminary Dual Single Subject/Education Specialist Credential Program: AAS 417/AFRS 417/ARMN 417/CHS 417/ELPS 417; HSCI 466ADO; SPED 402, SPED 416, SPED 502MME, SPED 545. This is the final special education field experience for students in the Mild to Moderate and Extensive Support Needs Education (MME) Preliminary Specialist Credential Program. Teacher candidates complete this experience with a mentor teacher or mentor teachers who serve students with mild to extensive support needs from culturally and linguistically diverse backgrounds. Student teaching consists of one complete semester (full day assignment) in which the teacher candidate gradually assumes full responsibility for the instructional program. The candidate is provided supervision and guidance by the mentor teacher, and university supervisor. The seminar portion of the course meets on selected weeks during the semester and is designed to support the students in reflecting on their student teaching experience and completing assignments. Seminars link coursework with practice and provide collegial support to participants. A grade of “B” or better required to pass SPED 580MME.",
        "units": "6",
        "prerequisites": "{Parse error: refer to class description}",
        "corequisites": "{Parse error: refer to class description}"
    },
    {
        "subject": "SPED",
        "catalog_number": "580MS",
        "title": "Student Teaching and Seminar in Moderate/Severe Disabilities",
        "description": "Prerequisites: SPED 400, SPED 402, SPED 403MME, SPED 406, SPED 416, SPED 420, SPED 504MS, SPED 505MS. This course is the final special education fieldwork experience for students in the Moderate/Severe Education Specialist Preliminary Credential Program. Candidates complete this experience on-the-job or with a supervising teacher who serves diverse learners with moderate/severe disabilities. Student teaching consists of one complete semester, full-day assignment during which time the candidates gradually assume full responsibility for the complete instructional program if they are not on the job. The candidates are provided supervision and guidance by the supervising teacher or on-site support provider and a University supervisor. The seminar portion of the course meets one to two times per month with the University supervisor.",
        "units": "6",
        "prerequisites": "{{SPED 400} && {SPED 402} && {SPED 403MME} && {SPED 406} && {SPED 416} && {SPED 420} && {SPED 504MS} && {SPED 505MS}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "580S",
        "title": "Advanced Specialist Fieldwork Analysis in Education of Learners with IEPS",
        "description": "Prerequisites: Coursework required for approval of SPED 580ECSE/SPED 580MM/SPED 580MS. Corequisite: SPED 580. This seminar meets at regularly scheduled times during the semester as a concurrent seminar with student teaching to provide professional development opportunities for analysis of the fieldwork experience related to teaching effectiveness, assessment, individualized educational planning, program evaluations, case analysis and problem solving. Relationships with parents, relationships with other professionals, and issues related to assuming a professional role as a special educator are included. The seminar instructor facilitates reflective practice.",
        "units": "3",
        "prerequisites": "{Coursework required for approval of SPED 580ECSE/SPED 580MM/SPED 580MS}",
        "corequisites": "{SPED 580}"
    },
    {
        "subject": "SPED",
        "catalog_number": "581",
        "title": "Augmentative and Alternative Communication",
        "description": "Prerequisites: SPED 400, SPED 504MS. Techniques for assessment and intervention of alternative communication skills other than speech for students with severe disabilities. Development and use of augmentative communication devices (both light- and high-technology). Teaching the communicative partner how to make use of augmentative devices during interactions.",
        "units": "3",
        "prerequisites": "{{SPED 400} && {SPED 504MS}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "595T",
        "title": "Experimental Topics Courses: Technology In Special Education",
        "description": "No course description.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "610",
        "title": "Program Planning in Special Education",
        "description": "Preparatory: Graduate standing. Regulations, current theory, research findings and model programs are considered and their implications are applied to the selection of appropriate assessment methods, curricular and instructional approaches, and multidisciplinary approaches for educating exceptional pupils.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "614A",
        "title": "Learning About Myself as a Professional Educator",
        "description": "Prerequisites: SPED 628DHH, SPED 628EC, SPED 628MM or SPED 628MS; Admission into the Teacher Induction Education Specialist Credential Program; Employed as a special education teacher in the area in which the candidate is authorized (EC, DHH, MM or MS). This one-unit class continues candidates’ professional growth through participation in mentoring activities and an online community of learning. Candidates will use the Individual Learning Plan (ILP) developed in SPED 628 as an ongoing resource for reflection and to develop systems for supporting student learning as described in the California Standards for the Teaching Profession (CSTPs).",
        "units": "1",
        "prerequisites": "{Parse error: refer to class description}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "628",
        "title": "Induction and the Individualized Learning Plan in Deaf and Hard of Hearing",
        "description": "Prerequisites: A Preliminary Education Specialist Credential in Deaf and Hard of Hearing (DHH); Admission to the Teacher Induction Education Specialist Credential program; Verification of employment as a special education teacher in the area for which the candidate is authorized (DHH). SPED 628DHH is taken the first semester of the program. This course is designed to facilitate beginning teachers’ transition from teacher preparation to induction. In collaboration with the university instructor and the onsite mentor, the candidate develops an Individualized Learning Plan (ILP) which consists of professional development goals with a plan on how to meet these goals. A major focus of the induction program is for candidates to receive support to facilitate and encourage professional growth. As such, candidates will receive a minimum of 1 hour per week of support throughout the life of the program through individual meetings, classroom observations, discussion boards, and course assignments.",
        "units": "3",
        "prerequisites": "{Parse error: refer to class description}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "628DHH",
        "title": "Induction and the Individualized Learning Plan in Deaf and Hard of Hearing",
        "description": "Prerequisites: A Preliminary Education Specialist Credential in Deaf and Hard of Hearing (DHH); Admission to the Teacher Induction Education Specialist Credential program; Verification of employment as a special education teacher in the area for which the candidate is authorized (DHH). SPED 628DHH is taken the first semester of the program. This course is designed to facilitate beginning teachers’ transition from teacher preparation to induction. In collaboration with the university instructor and the onsite mentor, the candidate develops an Individualized Learning Plan (ILP) which consists of professional development goals with a plan on how to meet these goals. A major focus of the induction program is for candidates to receive support to facilitate and encourage professional growth. As such, candidates will receive a minimum of 1 hour per week of support throughout the life of the program through individual meetings, classroom observations, discussion boards, and course assignments.",
        "units": "3",
        "prerequisites": "{Parse error: refer to class description}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "628EC",
        "title": "Induction and the Individualized Learning Plan in Early Childhood Special Education",
        "description": "Prerequisites: A Preliminary Education Specialist Credential in Early Childhood Special Education (EC); Admission to the Teacher Induction Education Specialist Credential program; Verification of employment as a special education teacher in the area for which the candidate is authorized (EC). SPED 628EC is taken the first semester of the program. This course is designed to facilitate beginning teachers’ transition from teacher preparation to induction. In collaboration with the university instructor and the onsite mentor, the candidate develops an Individualized Learning Plan (ILP) which consists of professional development goals with a plan on how to meet these goals. A major focus of the induction program is for candidates to receive support to facilitate and encourage professional growth. As such, candidates will receive a minimum of 1 hour per week of support throughout the life of the program through individual meetings, classroom observations, discussion boards, and course assignments.",
        "units": "3",
        "prerequisites": "{Parse error: refer to class description}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "628MM",
        "title": "Induction and the Individualized Learning Plan in Mild/Moderate Disabilities",
        "description": "Prerequisites: A Preliminary Education Specialist Credential in Mild/Moderate Disabilities (MM); Admission to the Teacher Induction Education Specialist Credential program; Verification of employment as a special education teacher in the area for which the candidate is authorized (MM). SPED 628MM is taken the first semester of the program. This course is designed to facilitate beginning teachers’ transition from teacher preparation to induction. In collaboration with the university instructor and the onsite mentor, the candidate develops an Individualized Learning Plan (ILP) which consists of professional development goals with a plan on how to meet these goals. A major focus of the induction program is for candidates to receive support to facilitate and encourage professional growth. As such, candidates will receive a minimum of 1 hour per week of support throughout the life of the program through individual meetings, classroom observations, discussion boards, and course assignments",
        "units": "3",
        "prerequisites": "{Parse error: refer to class description}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "628MS",
        "title": "Induction and the Individualized Learning Plan in Moderate/Severe Disabilities",
        "description": "Prerequisites: A Preliminary Education Specialist Credential in Moderate/Severe Disabilities (MS); Admission to the Teacher Induction Education Specialist Credential program; Verification of employment as a special education teacher in the area for which the candidate is authorized (MS). SPED 628MS is taken the first semester of the program. This course is designed to facilitate beginning teachers’ transition from teacher preparation to induction. In collaboration with the university instructor and the onsite mentor, the candidate develops an Individualized Learning Plan (ILP) which consists of professional development goals with a plan on how to meet these goals. A major focus of the induction program is for candidates to receive support to facilitate and encourage professional growth. As such, candidates will receive a minimum of 1 hour per week of support throughout the life of the program through individual meetings, classroom observations, discussion boards, and course assignments.",
        "units": "3",
        "prerequisites": "{Parse error: refer to class description}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "638",
        "title": "Developing Special Educators as Agents of Change",
        "description": "Prerequisites: Acceptance into the Teacher Induction Specialist Credential Program or the M.A. in Special Education; SPED 614A; SPED 614B; SPED 628DHH, SPED 628EC, SPED 628MM or SPED 628MS; and verification of employment as a Special Education teacher in ECSE, DHH, MM or MS. This is the final course in the Teacher Induction Education Specialist Program. Students will strengthen their professional and instructional competencies across the California Standards for the Teaching Profession (CTSP) culminating in a professional development project. The course focuses on the special educator as an agent of change through scholarship, leadership, and advocacy. Current research and theoretical positions in the field will be analyzed.",
        "units": "2",
        "prerequisites": "{Parse error: refer to class description}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "642",
        "title": "Students with Multiple and Sensory Impairments",
        "description": "Preparatory: SPED 400, SPED 431, SPED 508 or equivalent. Educational issues for students with intellectual disabilities who also have sensory impairments (visual and/or auditory). Information on specific visual and hearing disorders, psychosocial implications of these disabilities on the developing child, teaching strategies to address students with these disabilities, and adaptations and accommodations. (Offered Spring semester only.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "652",
        "title": "Educating Children With Emotional Disturbance",
        "description": "Prerequisites: Preliminary Education Specialist Level I Credential; Admitted to Clear Education Specialist Credential Program and/or Special Education Masters Program. Designed to study the behavioral characteristics of children with severe emotional disorders. Problems of social control adjustment effective curriculum and teacher evaluation. (Offered Spring semester only).\n",
        "units": "3",
        "prerequisites": "{{Preliminary Education Specialist Level I Credential} && {Admitted to Clear Education Specialist Credential Program and/or Special Education Masters Program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "655",
        "title": "Promising Practices and Interventions for Students with Autism",
        "description": "Prerequisite: Admitted to Clear Education Specialist Credential Program, Added Autism Authorization and/or Special Education master’s program. Corequisite SPED 404. The course addresses knowledge, skills and abilities to become proficient in implementing evidence-based and multi-faceted methodologies and strategies necessary in teaching and engaging students with autism spectrum disorders (ASD). Classroom application of interventions and emphasis on being part of a multidisciplinary team, which includes collaborating with other service providers to determine program planning and service delivery for individuals with autism.",
        "units": "3",
        "prerequisites": "{{Admitted to Clear Education Specialist Credential Program} && {Added Autism Authorization and/or Special Education master’s program}}",
        "corequisites": "{SPED 404}"
    },
    {
        "subject": "SPED",
        "catalog_number": "671",
        "title": "Advanced Study of Literacy Problems",
        "description": "Prerequisites: Admission to the Special Education master’s program and prerequisite SPED 502MM; or admission to Educational Therapy programs with prerequisites SPED 400, SPED 406, SPED 501MM, SPED 503MM, SPED 672 and SPED 673; or admission to the Reading Certificate and Reading/Language Arts Specialist Credential program with prerequisites EED 625A/L or EED 625B/L and EED 595A. This course provides advanced study in the area of literacy. It is designed to examine issues related to literacy processes, assessment and instructional practices, research methodologies and the relationships between language, literacy, schooling and culture. Emphasis is placed on students struggling with reading and writing. A minimum of 12 hours of supervised clinical experience is required.",
        "units": "3",
        "prerequisites": "{Parse error: refer to class description}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "672",
        "title": "Advanced Assessment",
        "description": "Prerequisites: Admission to the Clear Education Specialist Credential Program or the Special Education master’s program and prerequisite SPED 501MM; or admission to Educational Therapy programs with prerequisites SPED 400, SPED 406, SPED 501MM, SPED 503, and pre/corequisite SPED 673. This master’s-level course is designed to examine the advanced skills educational therapists and other educators use when evaluating a student with learning differences pertaining to clinical procedures and educational diagnosis. Coursework will include: (a) choosing appropriate formal and informal assessments for individuals at various age levels; (b) interpreting test data for the purpose of making an educational diagnosis; (c) interpreting test data for the purpose of developing an intervention plan; (d) synthesizing contextual information; and (e) guiding the client and family through the assessment process.",
        "units": "2",
        "prerequisites": "{Parse error: refer to class description}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "673",
        "title": "Principles of Educational Therapy for Individuals with Exceptional Needs",
        "description": "Prerequisites: Admission to Educational Therapy programs, SPED 400, SPED 406, SPED 501MM and SPED 503MM. This beginning course in the Educational Therapy program provides an in-depth study of the educational therapist’s professional role and ethical responsibilities. Services of the educational therapist are compared to those of other professionals, and the interface between educational therapy and allied professions is reviewed. Responsibilities of the educational therapist, which include gathering contextual information, providing formal and informal assessments, synthesizing information, developing goals, case-management, making referrals, collaborating with allied professionals, assessing progress and self reflection are examined. A model of educational therapy is developed.",
        "units": "3",
        "prerequisites": "{{Admission to Educational Therapy programs} && {SPED 400} && {SPED 406} && {SPED 501MM} && {SPED 503MM}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "676",
        "title": "Clinical Case Management",
        "description": "Prerequisites: Admission to Educational Therapy programs, SPED 400, SPED 406, SPED 501MM, SPED 503MM, SPED 672 and SPED 673. Pre/Corequisite: SPED 671.The focus of this course is on case management. Students will analyze contextual influences, such as the school, family, community and culture that impact a student’s performance, and demonstrate the ability to serve in the role of case manager (e.g., prioritizing goals, responding to parent concerns, understanding school demands). This course is designed to build on the knowledge and skills from foundational educational therapy coursework as related to establishing and maintaining effective, efficient and ethical practices.",
        "units": "3",
        "prerequisites": "{{Admission to Educational Therapy programs} && {SPED 400} && {SPED 406} && {SPED 501MM} && {SPED 503MM} && {SPED 672} && {SPED 673}}",
        "corequisites": "{SPED 671}"
    },
    {
        "subject": "SPED",
        "catalog_number": "679",
        "title": "Internship in Educational Therapy",
        "description": "Prerequisites: Admission to Educational Therapy programs; SPED 671, SPED 672, SPED 673 and SPED 676. SPED 679 is the culminating experience in the Educational Therapy program. Through a supervised internship, students will work with a client on an individual and ongoing basis to practice and further develop effective clinical skills. Students will be evaluated on each stage of the internship, including gathering contextual information, providing formal and informal assessments, synthesizing information, developing goals, managing cases, making referrals, collaborating with allied professionals, assessing progress and self-reflection.",
        "units": "3",
        "prerequisites": "{{Admission to Educational Therapy programs} && {SPED 671} && {SPED 672} && {SPED 673} && {SPED 676}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "681",
        "title": "Graduate Research in Special Education",
        "description": "Prerequisite: Admission to the master’s program with classified status. This master’s level course is designed to provide information regarding the process of systematically researching an educational problem and to facilitate students’ ability to interpret and evaluate the research of others in special education and related fields. Students are exposed to various research methods from both quantitative and qualitative traditions, and complete an annotated bibliography on a topic of interest within their area of specialization. Students must earn a grade of “B” or higher to proceed in the program.",
        "units": "3",
        "prerequisites": "{Admission to the master’s program with classified status}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "682D",
        "title": "Advanced Graduate Research in Special Education",
        "description": "Prerequisite: Admission to the master’s program with classified status. Prerequisite or Corequisite: SPED 681. This course provides an advanced educational experience for candidates in master’s degree programs in Special Education. It is designed as an opportunity for students to outline and research a topic of interest related to special education as related to their own practices and in conjunction with support and guidance provided through mentoring. Students meet in seminar to discuss issues related to action research and the development of literature review writing skills. A passing grade in this course is a “B” or higher.",
        "units": "3",
        "prerequisites": "{Admission to the master’s program with classified status}",
        "corequisites": "SPED 681"
    },
    {
        "subject": "SPED",
        "catalog_number": "683",
        "title": "Current Trends in Special Education",
        "description": "Prerequisite: Admission to the master’s program with classified status. Prerequisite or Corequisite: SPED 681. This course is a guided advanced study of pertinent topics related to (a) federal, state, and local agencies and their role in special and rehabilitative education, (b) organization of special education programs, (c) the preparation of teachers of exceptional children, and (d) research and demonstration projects in the education of exceptional children. Candidates will apply this information in an integrated fashion to a critical problem in their own practice. This course is a key component of the master’s program in Special Education.",
        "units": "3",
        "prerequisites": "{Admission to the master’s program with classified status}",
        "corequisites": "SPED 681"
    },
    {
        "subject": "SPED",
        "catalog_number": "683EC",
        "title": "Current Trends in Early Childhood Special Education",
        "description": "Prerequisites: SPED 628 and admission to the Clear Education Specialist Credential Program, or admission to the master’s in Special Education. Advanced study of decision-making processes in early childhood special education, as influenced by personal values, ethics, public policy, law and the professional knowledge base. Consideration of issues related to policy and practice in early intervention and strategies for advocacy and systems change.",
        "units": "3",
        "prerequisites": "{Parse error: refer to class description}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "695A",
        "title": "Advanced Behavioral Support",
        "description": "(Offered Fall semester.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisites: SPED 681 and SPED 682 must be taken and passed with a grade of “B” or higher before students may register for the culminating experience (SPED 697 or SPED 698C). Directed Comprehensive Studies requires students to complete an examination in the form of an Action Research Project. The project is conducted throughout the semester. Throughout the course, students organize their research materials and other resources to complete a literature review and design and conduct an action research project. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{Admission to the master’s program with classified status}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "698C",
        "title": "Thesis or Graduate Project",
        "description": "Prerequisite: Completion of all course requirements for the master’s degree. Preparatory: Acceptance by a departmental thesis committee of a thesis on a topic in the field of special education.",
        "units": "3",
        "prerequisites": "{Completion of all course requirements for the master’s degree}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "699X",
        "title": "Independent Study",
        "description": "Independent study projects are designed in collaboration with a faculty member in Special Education.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]