[
    {
        "subject": "SWRK",
        "catalog_number": "501",
        "title": "Human Behavior and Social Environment I",
        "description": "Prerequisites: Graduate admission; Acceptance to the MSW program. This is the first of two human behavior and the social environment courses that provide understanding of human behavior and social environmental relationships from an ecological perspective. This course focuses on child development from pre-birth to maturity. Child development is a complex interplay between the emerging child and their primary caregiver, the caregiver’s intimate relationships, the extended family, and the family’s relationships to larger social systems. This class examines the transactions between family members in three primary arenas–the intimate relationships within the family; daycare/school; and within urban communities. Students will understand the impact of risks and resiliency in human development. Additionally, the family’s systems of interdependence with political, social, cultural, economic and natural environments are explored.",
        "units": "3",
        "prerequisites": "{{Graduate admission} && {Acceptance to the MSW program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "502",
        "title": "Human Behavior and Social Environment II",
        "description": "Prerequisites: SWRK 501; Graduate admission; Acceptance to the MSW program. This is the second of two human behavior and the social environment courses that provide understanding of human behavior and social environmental relationships from an ecological perspective. It focuses on the developmental dynamics of larger social systems, specifically groups, organizations, and communities, and their influence on individuals and families within urban communities. The systems’ interdependence with political, social, cultural, and economic and natural environments is explored. The content emphasizes intersectionality, inclusive identities, and social justice in relation to social systems.",
        "units": "3",
        "prerequisites": "{{SWRK 501} && {Graduate admission} && {Acceptance to the MSW program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "503",
        "title": "Psychosocial Assessment and Diagnostic Formulation",
        "description": "Prerequisite: Acceptance to the MSW program. Social workers are often required to practice within multidisciplinary teams of professionals. This course teaches students to conduct a comprehensive psychosocial assessment of individuals and families which emphasizes anti-oppressive, socially just practice. Students critique assessment and diagnostic tools including the Diagnostic and Statistical Manual of Mental Disorders and the International Classification of Diseases. Students learn to utilize the diagnostic tools in a critically conscious, culturally congruent manner. Students completing the course will demonstrate competency in writing and orally presenting a psychosocial assessment.",
        "units": "3",
        "prerequisites": "{Acceptance to the MSW program}",
        "corequisites": "{None}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "510",
        "title": "Generalist Social Work Theory and Practice I",
        "description": "Prerequisites: Graduate standing; Acceptance to the MSW program. This introductory course is designed to provide students with an overview of the basic knowledge and skills essential to generalist social work practice. Attention is given to the diverse needs of multi-cultural, multi-ethnic and multi-national populations; the nature and application of social work values and ethical principles; the theoretical framework of helping methods; advocacy for social justice; critically conscious engagement, assessment, planning, intervention and evaluation; and the importance of self-reflection. Key themes and concepts include interviewing, engagement, relationship building, and assessment as they relate to trauma informed, strengths-based, anti-oppressive, socially just practice in urban communities. Emphasis is on understanding how intersectionality, power, and privilege affect individuals, couples, families, and small groups in urban communities. Personal and professional values are discussed, along with the use of self, and the importance of evaluation, research, and ethics.",
        "units": "3",
        "prerequisites": "{{Graduate standing} && {Acceptance to the MSW program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "520",
        "title": "Social Work Practice in Multicultural Contexts",
        "description": "Prerequisites: Graduate standing; Acceptance to the MSW program. This course is designed to assist graduate social work students in understanding and applying a cultural humility, intersectionality-based lens in order to increase critical consciousness in micro, mezzo, and macro levels of practice with local, national, and transnational communities. Students have the opportunity to critically examine and develop ideas to counter issues including, but not limited to settler colonialism, coloniality, imperialism, slavery, cishetero-patriarchy, white supremacy, sexism, capitalism/classism, heterosexism, transgender oppression, religious oppression, ableism, audism, ageism/adultism, racism, and sanism. Students practice ongoing self-reflective learning to identify, make visible, and be responsive to power, privilege, and social location.",
        "units": "3",
        "prerequisites": "{{Graduate standing} && {Acceptance to the MSW program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "521",
        "title": "Generalist Social Work Theory and Practice II",
        "description": "Prerequisites: Graduate standing; Acceptance to the MSW program. This course is designed to help students understand systemic inner-workings of groups, communities, organizations, and institutions from a macro and social-justice lens. The course approaches these issues from an intersectional, collaborative, and strengths-based perspective. It provides an opportunity to examine selected macro models of practice, and learn about the social, economic, and political constructs of society and how they influence service delivery at the community and organizational level.",
        "units": "3",
        "prerequisites": "{{Graduate standing} && {Acceptance to the MSW program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "522",
        "title": "Generalist Field Education I and Placement",
        "description": "Prerequisite: Acceptance to the MSW program. Corequisite: SWRK 522P. Foundations of Field Education and Placement I and II are designed to empower the student to apply knowledge, skills, and ethics learned in social work coursework during their field practicum experience. The chief purpose of the first year of field (522/P in Fall and 523/P in Spring) is to develop generalist social work practice skills that are applicable in a wide variety of practice settings. Students are assigned to a social service agency during the first semester and attend a field seminar designed to help integrate classroom learning and field experience. The courses focus on social work with urban communities and emphasize anti-oppressive, socially just practice.\nThe field seminars adopt an intersectional, trauma-informed collaborative perspective that embrace a strengths-based inclusive identity. Discussions related to the student’s field practicum experiences help the student to reinforce material that they have learned in their practice class and other coursework, as well as their professional development in the areas of use of self, boundaries, professional communication, and management of legal and ethical issues. This is accomplished through various group discussion topics, suggested readings, role-plays, and course assignments which are the core of the field practicum component.\nThe field courses combine a seminar and practicum component. Students will receive one unified grade for both sections (i.e., 522 and 522P or 523 and 523P) each semester.",
        "units": "2",
        "prerequisites": "{Acceptance to the MSW program}",
        "corequisites": "{SWRK 522P}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "522P",
        "title": "Generalist Field Education I and Placement",
        "description": "Prerequisite: Acceptance to the MSW program. Corequisite: SWRK 522P. Foundations of Field Education and Placement I and II are designed to empower the student to apply knowledge, skills, and ethics learned in social work coursework during their field practicum experience. The chief purpose of the first year of field (522/P in Fall and 523/P in Spring) is to develop generalist social work practice skills that are applicable in a wide variety of practice settings. Students are assigned to a social service agency during the first semester and attend a field seminar designed to help integrate classroom learning and field experience. The courses focus on social work with urban communities and emphasize anti-oppressive, socially just practice.\nThe field seminars adopt an intersectional, trauma-informed collaborative perspective that embrace a strengths-based inclusive identity. Discussions related to the student’s field practicum experiences help the student to reinforce material that they have learned in their practice class and other coursework, as well as their professional development in the areas of use of self, boundaries, professional communication, and management of legal and ethical issues. This is accomplished through various group discussion topics, suggested readings, role-plays, and course assignments which are the core of the field practicum component.\nThe field courses combine a seminar and practicum component. Students will receive one unified grade for both sections (i.e., 522 and 522P or 523 and 523P) each semester.",
        "units": "1",
        "prerequisites": "{Acceptance to the MSW program}",
        "corequisites": "{SWRK 522P}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "523",
        "title": "Generalist Field Education II and Placement",
        "description": "Prerequisite: SWRK 522/P. Corequisite: SWRK 523P. Generalist Field Education and Placement I and II are designed to empower the students to apply knowledge, skills, and ethics learned in social work coursework during their field practicum experience. The chief purpose of the first year of fieldwork (522/P in Fall and 523/P in Spring) is to develop generalist social work practice skills that are applicable in a wide variety of practice settings. Students are assigned to a social service agency during the first semester and attend a field seminar designed to help integrate classroom learning and field experience. The courses focus on social work with urban communities and emphasize anti-oppressive, socially just practice.\nThe field seminars adopt an intersectional, trauma-informed collaborative perspective that embrace a strengths-based inclusive identity. Discussions related to the student’s field practicum experiences help the students to reinforce material that they have learned in their practice class and other coursework, as well as their professional development in the areas of use of self, boundaries, professional communication, and management of legal and ethical issues. This is accomplished through various group discussion topics, suggested readings, role-plays, and course assignments which are the core of the field practicum component.\nThe field courses combine a seminar and practicum component. Students will receive one unified grade for both sections (i.e., 522 and 522P or 523 and 523P) each semester.",
        "units": "3",
        "prerequisites": "{SWRK 522/P}",
        "corequisites": "{SWRK 523P}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "525",
        "title": "Social Welfare Policy and Services",
        "description": "Prerequisites: Graduate standing; Acceptance to the MSW program. This course examines economic, historical, political, intellectual, sociocultural, ideological and other such factors shaping social welfare, economic policy, programs and services. The course uses various analytical frameworks for studying social welfare policy, programs, and services, with a focus on intersectionality, power, and privilege. The course examines the roles of policymakers, the processes of social change and the roles of social workers and community members as facilitators of positive social change. Emphasis is placed on effects of social and economic policy on the well-being of impoverished and oppressed people in urban settings.",
        "units": "3",
        "prerequisites": "{{Graduate standing} && {Acceptance to the MSW program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "535",
        "title": "Social Work Research Methods I",
        "description": "Prerequisites: Graduate standing; Acceptance to the MSW program. This foundation course introduces students to research methods useful for social work practice, enabling students to become critical consumers of science-based information. Students are exposed to social work research through the lens of intersectionality, power, and privilege to promote the well-being of individuals, families, and communities in urban settings.\nStudents participate in a range of social work research activities including: (a) the importance of research in practice decisions; (b) quantitative and qualitative research questions and appropriate designs; (c) review of literature with emphasis on published outcome studies and professional reports; (d) conceptualization and operationalization of variables; (e) measurement including use of standardized tools; (f) data collection strategies; (g) analysis of quantitative and qualitative data; and (h) establishing cause and effect. The students gain an understanding of how research can facilitate and inform practice decisions and on-going evaluation of one’s practice.",
        "units": "3",
        "prerequisites": "{{Graduate standing} && {Acceptance to the MSW program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "601",
        "title": "Advanced Social Work Practice with Urban Families I",
        "description": "Prerequisite: Second year standing; acceptance in the advanced year. This course emphasizes theories, concepts, and skills of social work practice with urban families. The central content of the course is the application of advanced practice skills to prepare professional social workers to be anti-oppressive, socially just agents of change who promote well-being by working with diverse urban communities. Attention is given to practice with special populations who face the social and personal problems of urban community life. Family practice methods are a major focus of the course. This advanced year course concentrates on what is unique about various individuals, couples, and families and how to deal with these unique issues.",
        "units": "3",
        "prerequisites": "{{Second year standing} && {acceptance in the advanced year}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "602",
        "title": "Advanced Social Work Practice with Urban Families II",
        "description": "Prerequisites: SWRK 601; Second year standing. This course advances students’ generalist practice knowledge and skills as anti-oppressive, socially just agents of change who work with diverse urban communities. Utilizing a strengths-based, inclusive practice model and the person-in-environment perspective, students are taught engagement, assessment, intervention, practice evaluation, and termination skills. Evidence-based and shared-decision practice models are explored.",
        "units": "3",
        "prerequisites": "{{SWRK 601} && {Second year standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "621",
        "title": "Advanced Social Work Practice in Urban Communities",
        "description": "Prerequisite: SWRK 521. Recommended Preparatory: First year (Generalist) courses. This course is designed to help students understand and apply mezzo/macro social work interventions in urban community settings that benefit families, groups, organizations and institutions. Building upon the material in SWRK 521, this advanced generalist course provides an opportunity to explore and apply selected advanced social work mezzo/macro practice skills including engagement, assessment, intervention strategies, planning, program development, and evaluation. Students engage in professional self-reflection and analysis of individual and organizational leadership and administration within social service organizations. Students are challenged to apply a variety of critical and theoretical frameworks, including intersectionality, cultural humility, and strengths-based trauma-informed lenses.",
        "units": "3",
        "prerequisites": "{SWRK 521}",
        "corequisites": "{None}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "622",
        "title": "Specialist Field Education with Urban Communities I and Placement",
        "description": "Prerequisites: Second year standing, SWRK 523/P. Corequisite: SWRK 622P. Specialist Field Education I and II are the advanced concentration field practicum courses. In the advanced field practicum, students continue to build upon the knowledge and skills gained during the foundation year. The course provides field education related to the advanced concentration curriculum, which focuses on social work with urban families. The course focuses on social work with urban communities and emphasizes anti-oppressive, socially just practice.\nThe field seminar utilizes an intersectional, trauma-informed collaborative perspective that embraces a strengths-based inclusive identity. Discussions related to the student’s field practicum experiences help the student to reinforce material that they have learned in their practice class and other coursework, as well as their professional development in the areas of use of self, boundaries, professional communication, and management of legal and ethical issues. This is accomplished through various group discussion topics, suggested readings, role-plays, and course assignments which are the core of the field practicum component. Refer to the Field Manual for additional information.",
        "units": "4",
        "prerequisites": "{{Second year standing} && {SWRK 523/P}}",
        "corequisites": "{SWRK 622P}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "622P",
        "title": "Specialist Field Education with Urban Communities I and Placement",
        "description": "Prerequisites: Second year standing, SWRK 523/P. Corequisite: SWRK 622P. Specialist Field Education I and II are the advanced concentration field practicum courses. In the advanced field practicum, students continue to build upon the knowledge and skills gained during the foundation year. The course provides field education related to the advanced concentration curriculum, which focuses on social work with urban families. The course focuses on social work with urban communities and emphasizes anti-oppressive, socially just practice.\nThe field seminar utilizes an intersectional, trauma-informed collaborative perspective that embraces a strengths-based inclusive identity. Discussions related to the student’s field practicum experiences help the student to reinforce material that they have learned in their practice class and other coursework, as well as their professional development in the areas of use of self, boundaries, professional communication, and management of legal and ethical issues. This is accomplished through various group discussion topics, suggested readings, role-plays, and course assignments which are the core of the field practicum component. Refer to the Field Manual for additional information.",
        "units": "1",
        "prerequisites": "{{Second year standing} && {SWRK 523/P}}",
        "corequisites": "{SWRK 622P}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "623",
        "title": "Specialist Field Education with Urban Communities II and Placement",
        "description": "Prerequisites: Second year standing; SWRK 622/P. Corequisite: SWRK 623P. Specialist Field Education I and II are the advanced concentration field practicum courses. In the specialized field practicum, students continue to build upon the knowledge and skills gained during the foundation year. The courses provide field education related to the advanced concentration curriculum, which focuses on social work with urban families. The courses focus on social work with urban communities and emphasize anti-oppressive, socially just practice.\nThe field seminar utilizes an intersectional, trauma-informed collaborative perspective that embraces a strengths-based inclusive identity. Discussions related to the student’s field practicum experiences help the student to reinforce material that they have learned in their practice class and other coursework, as well as their professional development in the areas of use of self, boundaries, professional communication, and management of legal and ethical issues. This is accomplished through various group discussion topics, suggested readings, role-plays, and course assignments which are the core of the field practicum component. Refer to the Field Manual for additional information.",
        "units": "3",
        "prerequisites": "{{Second year standing} && {SWRK 622/P}}",
        "corequisites": "{SWRK 623P}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "623P",
        "title": "Specialist Field Education with Urban Communities II and Placement",
        "description": "Prerequisites: Second year standing; SWRK 622/P. Corequisite: SWRK 623P. Specialist Field Education I and II are the advanced concentration field practicum courses. In the specialized field practicum, students continue to build upon the knowledge and skills gained during the foundation year. The courses provide field education related to the advanced concentration curriculum, which focuses on social work with urban families. The courses focus on social work with urban communities and emphasize anti-oppressive, socially just practice.\nThe field seminar utilizes an intersectional, trauma-informed collaborative perspective that embraces a strengths-based inclusive identity. Discussions related to the student’s field practicum experiences help the student to reinforce material that they have learned in their practice class and other coursework, as well as their professional development in the areas of use of self, boundaries, professional communication, and management of legal and ethical issues. This is accomplished through various group discussion topics, suggested readings, role-plays, and course assignments which are the core of the field practicum component. Refer to the Field Manual for additional information.",
        "units": "1",
        "prerequisites": "{{Second year standing} && {SWRK 622/P}}",
        "corequisites": "{SWRK 623P}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "630",
        "title": "Family Crisis, Trauma and Grief",
        "description": "Prerequisite: Second year standing; acceptance in the advanced year. This course examines the complexities of trauma(s) experienced by individuals, families and communities in urban settings. Students examine the impact that various forms of trauma have on the developmental trajectory of individuals, families and communities. Students develop an understanding of trauma-informed care and its application to larger systems, as well as issues of social justice. Issues of power and privilege and intersectionality are examined in relationship to cultural factors that support the process of recovery.",
        "units": "3",
        "prerequisites": "{{Second year standing} && {acceptance in the advanced year}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "635",
        "title": "Social Work Research Methods II",
        "description": "Prerequisites: Second year standing; SWRK 535. This course advances students’ knowledge and application of research methods. Students will apply an intersectionality, power, and privilege lens to a range of social work research activities, including: (a) ethics in research and skills to prepare a human subjects protocol; (b) developing quantitative and qualitative research questions and skills to select appropriate designs; (c) review of literature and the skills to organize, write and cite published outcome studies, professional reports; and, (d) program evaluation and skills such as the logic model. Students gain an understanding of how research can facilitate and inform practice decisions with individuals, families, and urban communities to address social, political, and systemic change.",
        "units": "3",
        "prerequisites": "{{Second year standing} && {SWRK 535}}",
        "corequisites": "{None}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "645",
        "title": "Urban Social Policy and Advocacy",
        "description": "Prerequisite: Second year standing. This course is designed to help students gain knowledge and skills of policy practice, specifically social justice advocacy. Incorporating an intersectional and critical analysis of historical and current issues related to power and privilege, students learn to create and implement effective justice-based advocacy projects to promote change. Students develop strategies for team building, engaging community stakeholders, organizing, planning, facilitating, and evaluating a targeted advocacy effort consistent with the social work responsibility to challenge social injustice while engaging in social and political action.",
        "units": "3",
        "prerequisites": "{Second year standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "650A",
        "title": "Selected Topics in Social Work",
        "description": "Prerequisite: Second year standing. In-depth study of a selected theme or issue in social work. Topics offered may change from semester to semester. Critical writing and reading is required.\nCourse Title\nSWRK 650A Child Welfare Services\nSWRK 650B Addictions\nSWRK 650C Mental Health Wellness and Recovery\nSWRK 650F Suicide Prevention\nSWRK 650M Group Therapy\nSWRK 650O Healthcare Settings\nSWRK 650P Family Therapy\nSWRK 650U International Social Work: Issues and Challenges\nSWRK 650V Integrative Healthcare",
        "units": "3",
        "prerequisites": "{Second year standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "698",
        "title": "Graduate Project",
        "description": "Prerequisite: SWRK 635. The MSW graduate program culminates in an individual, or collaborative of two, research projects reflecting the students interests and needs as developers and critical consumers of science-based information to inform practice decisions. The Graduate Project requires students to collect, analyze and report direct observations; and write a research paper that includes an introduction, method, results, and discussion chapters. The paper must conform to Graduate Studies requirements and APA publication guidelines. Students will also present a poster in an open community-invited forum. The Graduate Project may include an alternative research project, such as a documentary, program evaluation, policy analysis, or grant. Students are exposed to social work research through the lens of intersectionality, power, and privilege to promote the well-being of individuals, families and communities in urban settings.",
        "units": "3",
        "prerequisites": "{SWRK 635}",
        "corequisites": "{None}"
    }
]