{
    "course-sets": {
        "required": [
            "&",
            "ACCT 220",
            "ACCT 230",
            "BLAW 280",
            "ECON 160",
            "ECON 161",
            "ENGL 205",
            "IS 212",
            "MATH 103",
            "SOM 120",
            "BUS 302",
            "BUS 302L",
            "BUS 497A",
            "FIN 303",
            "MGT 360",
            "MKT 304",
            "SOM 306",
            "BANA 320",
            "BANA 410",
            "BANA 420",
            "IS 312",
            "SOM 307",
            [
                "|1",
                "BLAW 368",
                "BLAW 372",
                "ENGL 306",
                "PHIL 305"
            ],
            {
                "no-intersection": [
                    "&",
                    [
                        "BANA 310",
                        "BANA 430",
                        "BANA 440"
                    ],
                    [
                        "BANA 310",
                        "BANA 430",
                        "BANA 440",
                        "IS 441 ",
                        "MKT 356",
                        "SOM 485"
                    ]
                ]
            }
        ]
    },
    "link-to-major": "https://catalog.csun.edu/academics/som/programs/bs-business-administration-iii/business-analytics/",
    "name": "B.S., Business Administration: Business Analytics",
    "prog-reqq-blob": [
        "Program Requirements",
        "To enter the BSBA program with an option in Business Analytics, students must complete SOM 120 or MATH 140 with a grade of C or higher.",
        "Business Majors",
        "A Business major is any student majoring in Accountancy; Information Systems; or Business Administration with an option in either Business Analytics, Business Law, Financial Analysis, Financial Planning, Global Supply Chain Management, Management, Marketing, Real Estate, Risk Management and Insurance, or Systems and Operations Management. The following are impacted majors with additional admission requirements: the B.S. in Accountancy and the B.S. in Business Administration with options in Financial Analysis, Financial Planning, and Risk Management and Insurance. All Business majors share 27 units of common lower division core courses and 19 units of common upper division core courses.",
        "Double Major Requirements",
        "Students seeking a double major in the David Nazarian College of Business and Economics must have at least a 3.0 overall GPA and be able to complete both majors within a maximum of 140 units.",
        "Transfer Course Requirements",
        "Students should be aware that no grade lower than a C will be accepted on transfer from another institution to satisfy department or David Nazarian College of Business and Economics requirements.",
        "Residency Requirement",
        "At least 50 percent of the business and economics course credit units and 50 percent of the specialized major credit units required for the Bachelor of Science degrees in Accountancy, Business Administration, or Information Systems and the Bachelor of Arts degree in Economics must be completed in residence at CSUN.",
        "Course Requirements",
        "Check course descriptions for prerequisite courses. Prerequisites must be completed prior to enrolling in the course.",
        "1. Common Lower Division Business Core (27-28 units)",
        "ACCT 220 Introduction to Financial Accounting (3)",
        "ACCT 230 Introduction to Managerial Accounting (3)",
        "BLAW 280 Business Law I (3)",
        "ECON 160 Principles of Microeconomics (3)",
        "ECON 161 Principles of Macroeconomics (3)",
        "ENGL 205 Business Communication in Its Rhetorical Contexts (3)",
        "IS 212 Information Systems for Business Users (3)",
        "MATH 103 Mathematical Methods for Business (3)*",
        "SOM 120 Basic Business Statistics (3)**",
        "*MATH 103 or a higher-level mathematics course (e.g., Calculus: MATH 150A or MATH 255A) must be completed with a grade of C or better.",
        "**The 4-unit MATH 140 course also satisfies this requirement. Either of them must be completed with a grade of C or better. MATH 140 is cross-listed with MATH 140BUS, MATH 140SCI and MATH 141/L.",
        "2. Common Upper Division Business Core (19 units)",
        "BUS 302 The Gateway Experience (3)",
        "BUS 302L The Gateway Experience Laboratory (1)",
        "BUS 497A or BUS 497B Capstone (3)",
        "FIN 303 Financial Management (3)",
        "MGT 360 Management and Organizational Behavior (3)",
        "MKT 304 Marketing Management (3)",
        "SOM 306 Operations Management (3)",
        "3. Upper Division Required Courses for the Option in Business Analytics (15 units)",
        "BANA 320 Predictive Analytics for Business (3)",
        "BANA 410 Machine Learning for Business (3)",
        "BANA 420 Prescriptive Analytics for Business (3)",
        "IS 312 Systems and Technologies for Managers (3)",
        "SOM 307 Data Analysis and Modeling for Business (3)***",
        "***Students must complete SOM 307 with a grade of C or higher.",
        "4. Communication Course (3 units)",
        "Select 3 units from the following:",
        "BLAW 368 Law, Business and Ethics (3)",
        "BLAW 372 Ethical and Legal Aspects of Managing Technology (3)",
        "ENGL 306 Report Writing (3)",
        "PHIL 305 Business Ethics and Public Policy (3)",
        "5. Additional Courses (6 units)",
        "Select 6 additional units from the following (at least 3 units from the BANA courses):",
        "BANA 310 Data Visualization for Business (3)",
        "BANA 430 Text Mining and Analytics for Business (3)",
        "BANA 440 Supply Chain Analytics (3)",
        "IS 441 Database Management Systems (3)",
        "MKT 356 Marketing Metrics and Insights (3)",
        "SOM 485 Decision Support Systems (3)",
        "6. General Education (48 units)",
        "Undergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.",
        "15 units are satisfied by the following courses in the major: MATH 103 satisfies Basic Skills B4 Mathematics/Quantitative Reasoning; FIN 303 satisfies B5 Scientific Inquiry and Quantitative Reasoning; ECON 160 and ECON 161 satisfy D1 Social Sciences; and IS 212 satisfies E Lifelong Learning and fulfills the Information Competence requirement.",
        "Total Units in the Major/Option: 70-71",
        "General Education Units: 33",
        "Additional Units: 16-17",
        "Total Units Required for the B.S. Degree: 120"
    ]
}