[
    {
        "subject": "AAS",
        "catalog_number": "440",
        "title": "Urbanization and Asian American Communities",
        "description": "Preparatory: Completion of the Lower Division writing requirements and AAS 100. Examination of the development of Asian American communities in the U.S. from 1850 to present. Particular attention to the impact of Asian American communities on the economic social cultural and political development of urban Southern California and on the relationship between Asian American communities and other ethnic communities. \n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "AE",
        "catalog_number": "486B",
        "title": "Senior Design in Aerospace Engineering II",
        "description": "Prerequisite: AE 486A. Continuation of AE 486A. Students carry out the group design project initiated in AE 486A. Influence of technical legal ethical and regulatory constraints are considered. Computer-aided engineering design methods are utilized. Two 3-hour labs per week.\n",
        "units": "2",
        "prerequisites": "{AE 486A}",
        "corequisites": "{None}"
    },
    {
        "subject": "AE",
        "catalog_number": "572",
        "title": "Rocket Propulsion",
        "description": "Prerequisites: ME 370 and 390 or equivalent background. Flight environment. Mission propulsive requirements staging and optimization. Chemical rockets. Thrust chamber design nozzle design propellant storage and pressurization systems. Liquid propellant combustion and expansion; Monopropellant systems. Solid propellant grain design.Combustion instabilities. Multiple phase reacting nozzle flow. Ram/rocket hybrid engines. Energy limited vs. power limited systems. Introduction to electrical rocket propulsion.\n",
        "units": "3",
        "prerequisites": "{{ME 370} && {ME 390}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ANTH",
        "catalog_number": "698C",
        "title": "Thesis or Graduate Project",
        "description": "Thesis or Graduate Project\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "124B",
        "title": "Drawing I",
        "description": "Prerequisite: ART 124A. Basic drawing experiences dealing with the human figure. Emphasis on form structure proportions gesture and systems of perspective and space. 5 hours per week. \n",
        "units": "2",
        "prerequisites": "{ART 124A}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "363B",
        "title": "Animation II",
        "description": "Intermediate animation emphasizing concept development in preparation for a 3-D computer or 2-D animation project. Includes research story development character design timing studies scenic design and storyboards. Work culminates in a process book and animatic. 5 hours lab. \n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "BIOL",
        "catalog_number": "492K",
        "title": "Field Studies in Biology: Flowering Plant Systematics",
        "description": "The 400-level courses are available for graduate credit. Course fee.  One unit each 3 hours per week or equivalent:  492B. Marine Biology (Corequisite: BIOL 421/L)  492C. Microbial Ecology (Corequisite: BIOL 419/L)  492G. Ecological Modeling (Corequisite: BIOL 424/L)  492H. Principles of Ecology (Corequisite: BIOL 427/L)  492J. Non-flowering Plants (Corequisite: BIOL 409/L)  492K. Flowering Plant Systematics (Corequisite: BIOL 406/L)  492M Mammalogy (Corequisite: BIOL 415/L)   492N. Plant Ecology (Corequisite: BIOL 407/L)  492P. Deserts (Corequisite: BIOL 426/L)  492W Wildlife Ecology and Management (Corequisite: BIOL 428/L)  Two units each 6 hours per week or equivalent:  492F. Field Ecology (Corequisite: BIOL 423)  492R. Tropical Botany (Corequisite: BIOL 506/L)  492S. Tropical Ecology and Conservation (Corequisite: BIOL 507/L)  492T. Tropical Vertebrates (Corequisite: BIOL 508/L) \n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "BIOL",
        "catalog_number": "492W",
        "title": "Field Studies in Biology: Wildlife Ecology and Management",
        "description": "The 400-level courses are available for graduate credit. Course fee.  One unit each 3 hours per week or equivalent:  492B. Marine Biology (Corequisite: BIOL 421/L)  492C. Microbial Ecology (Corequisite: BIOL 419/L)  492G. Ecological Modeling (Corequisite: BIOL 424/L)  492H. Principles of Ecology (Corequisite: BIOL 427/L)  492J. Non-flowering Plants (Corequisite: BIOL 409/L)  492K. Flowering Plant Systematics (Corequisite: BIOL 406/L)  492M Mammalogy (Corequisite: BIOL 415/L)   492N. Plant Ecology (Corequisite: BIOL 407/L)  492P. Deserts (Corequisite: BIOL 426/L)  492W Wildlife Ecology and Management (Corequisite: BIOL 428/L)  Two units each 6 hours per week or equivalent:  492F. Field Ecology (Corequisite: BIOL 423)  492R. Tropical Botany (Corequisite: BIOL 506/L)  492S. Tropical Ecology and Conservation (Corequisite: BIOL 507/L)  492T. Tropical Vertebrates (Corequisite: BIOL 508/L) \n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "BIOL",
        "catalog_number": "497EEC",
        "title": "Supervised Off-Campus Experiential Education",
        "description": "Not for graduate credit toward M.S. Degree in Biology. Student work experiences that are planned organized and evaluated by faculty in cooperation with organizations other than the Universitys academic departments. No remuneration for this work may be received in addition to academic credit. Academic/Internship course. (Credit/No Credit only)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CAS",
        "catalog_number": "270F",
        "title": "Fieldwork in Central American Communities",
        "description": "Preparatory CAS 100 or 102. Field study in a selected Central American community. By reflecting on their work experience students learn how the needs of the community can best be met and how the well- being of the community is impacted by its relationships to state and local governments community organizations and private institutions. Faculty supervisor assists students in obtaining appropriate work placements. Field study to be conducted under supervision and after preparatory instruction to acquaint students with field learning techniques. (Available for General Education Lifelong Learning.)\n",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHEM",
        "catalog_number": "499B",
        "title": "Independent Study",
        "description": "See Independent Study under courses of study. \n",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHEM",
        "catalog_number": "696B",
        "title": "Directed Graduate Research",
        "description": "Prerequisites: Classified status; Consent of a faculty member who will serve as thesis advisor. Program of research conducted under the direction of the thesis advisor in an area of interest to the student. May be repeated but no more than 7 units are allowed toward the M.S. degree. \n",
        "units": "2",
        "prerequisites": "{{Classified status} && {Consent of a faculty member who will serve as thesis advisor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CHS",
        "catalog_number": "480F",
        "title": "Chicana/o-Latina/o Children’s Literature in Communities",
        "description": "Preparatory: Completion of a Lower Division literature course or CHS 380.Critical analysis of themes and meanings of U.S.-based Chicana/o-Latina/o childrens literature using contemporary literary and cultural theory tools. Students explore and practice the use of Chicana/o-Latina/o childrens literature in school communities to promote cultural awareness and humanization among children and families. Course requires field work in Chicano/Latino communities.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "329B",
        "title": "Program Production",
        "description": "Prerequisite: Instructor consent. CTVA 230 is required for all students working at KCSN. Principles of management programming and production with practical application. Students must work at least 3 hours a week for 1 unit. Maximum of 6 units allowable. (Credit/No Credit only)\n",
        "units": "2",
        "prerequisites": "{Instructor consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "494B",
        "title": "Internship",
        "description": "Prerequisite: CTVA major and minor -- approval through application and instructor consent. Extensive on-the-job training in specific areas of Radio TV or Film production or administration. Maximum 6 units. Academic Internship Course. (Credit/No Credit only)\n",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "494C",
        "title": "Internship",
        "description": "Prerequisite: CTVA major and minor -- approval through application and instructor consent. Extensive on-the-job training in specific areas of Radio TV or Film production or administration. Maximum 6 units. Academic Internship Course. (Credit/No Credit only)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CTVA",
        "catalog_number": "694B",
        "title": "Internship",
        "description": "Prerequisites: CTVA 602; Approval of Graduate Advisor. Intensive on-the-job training beyond the entry level in radio television and allied industries.\n",
        "units": "2",
        "prerequisites": "{{CTVA 602} && {Approval of Graduate Advisor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECE",
        "catalog_number": "610",
        "title": "Fault Analysis in Power Systems",
        "description": "Prerequisite: ECE 410/L or instructor Consent. Study of impedance and admittance models network calculations and symmetrical faults using Zbus (impedance matrix) symmetrical components and sequence networks. Unsymmetrical faults using symmetrical components also are covered. The power-flow problem is analyzed and explained in detail using methods including Newton-Raphson and DC-power flow. The effects of distributed generation (DG) in short circuit analysis are discussed. A project is assigned in which students select a topic related to the course perform bibliographical research write a report and make presentations about their findings. Tools used include Matlab and PSPICE.\n",
        "units": "3",
        "prerequisites": "{{ECE 410/L} || {Instructor Consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECE",
        "catalog_number": "642",
        "title": "RF Electronics Design",
        "description": "Prerequisite: Instructor consent. Design of RF amplifiers and tuners is emphasized. Covered are AM/FM RF amplifiers AM/FM tuners and AM/FM detectors. Radar applications are considered: TV circuits including UHF/VHF tuners video amplifiers sync. vertical and horizontal circuits. Automatic control circuits also are covered. Phase lock loop techniques are introduced with emphasis on RF applications including frequency synthesis techniques using digital approaches.\n",
        "units": "3",
        "prerequisites": "{Instructor consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECE",
        "catalog_number": "666",
        "title": "Fiber-Optic Communications",
        "description": "Prerequisite: ECE 460. Mode theory waveguide equations and fiber modes calculations. Optical signal dispersion and degradation. Optical sources photo detectors modulation/demodulation techniques and optical system receiver performance. Power and rise-time link budget analysis.\n",
        "units": "3",
        "prerequisites": "{ECE 460}",
        "corequisites": "{None}"
    },
    {
        "subject": "ECE",
        "catalog_number": "681",
        "title": "Nonlinear Control Systems",
        "description": "Prerequisite: ECE 480. This course studies methods for modeling analysis and design of nonlinear dynamical systems with applications in control. The materials include analysis of nonlinear systems by means of describing functions and phase-plane diagrams; stability studies by means of the first and second methods of Lyapunov Popovs Methods and La Salles Theorem and system design methods including Lyapunov based design feedback linearization sliding mode control and adaptive control.\n",
        "units": "3",
        "prerequisites": "{ECE 480}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "477B",
        "title": "Literacy Instruction and English Language Development for Diverse Learners",
        "description": "Prerequisite: EED 477A; Admission to the Integreated Teacher Education Program. Corequisites: EED 578A 579A. This is the second of two courses designed to prepare credential candidates to teach reading/language arts and ELD (English Language Development) in multicultural/multilingual settings at the elementary-school level. Specifically this course emphasizes instructional approaches for literacy development with regard to: a) second language learners of English; and b) language arts/writing methods within the context of a balanced literacy program. Students will prepare language arts teaching units develop on-going programs of assessment design early intervention strategies and integrate the language arts in all areas of the curriculum. 20 hours of directed observation/participation in the public schools is required This course is to be taken after EED 477A and concurrently with the first semester of EED 578A -- Student Teaching.\n",
        "units": "3",
        "prerequisites": "{EED 477A}",
        "corequisites": "{{EED 578A} && {EED 579A}}"
    },
    {
        "subject": "EED",
        "catalog_number": "578D",
        "title": "Student Teaching II",
        "description": "Recommended Prerequisites: Admission to Multiple Subject Credential Program; Admission to student teaching. Corequisite: EED 480 and 579D. The field experience takes place in a participating public elementary school and provides opportunities for the credential candidate to work under the daily direction and guidance of a qualified supervising elementary teacher who exemplifies best practices in teaching all students including English language learners and students with disabilities. A University faculty member supervises the field work assignment. In this assignment the candidate gradually assumes full responsibility for the complete instructional program. A minimum of 250 hours is required for this course.\n",
        "units": "6",
        "prerequisites": "{None}",
        "corequisites": "{{EED 480} && {EED 579D}}"
    },
    {
        "subject": "EED",
        "catalog_number": "579D",
        "title": "Student Teaching Seminar",
        "description": "Prerequisites: Admission to Multiple Subject Credential program; admission to student teaching. Corequisite: EED 578D.  This course is a 1 unit student teaching seminar in the Multiple Subject Credential program. The seminar provides opportunities for candidates to reflect upon and analyze field work experiences. Student teachers learn to 1) assess their needs 2) gather data 3) analyze results 4) problem solve 5) modify teaching practices 6) determine implications of their experience for future instruction and 7) reflect upon their teaching practice.(Credit/No Credit Only).\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{EED 578D}"
    },
    {
        "subject": "EED",
        "catalog_number": "670",
        "title": "Research Applications in ESL Instruction",
        "description": "Prerequisites: EED 570 or equivalent; 610 or equivalent or instructor consent. Designed to prepare teachers to analyze plan and evaluate ESL instruction in a bilingual or multilingual setting at the elementary-school level. Emphasis given to the analysis and development of materials and methods for teaching and assessment. Students will evaluate and synthesize current research related to issues concerning second language acquisition by elementary school students.\n",
        "units": "3",
        "prerequisites": "{{EED 570} && {{EED 610} || {Instructor Consent}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "735",
        "title": "Law and Policy in Postsecondary Education",
        "description": "Prerequisites: Admission to doctoral program in Educational Leadership (Community College cohort only.) This course covers general principles of American school law with particular emphasis on California statutes and community-college regulations. It includes review of the major federal state and local laws and regulations and an analysis of significant court decisions having implications for public postsecondary education.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{None}"
    },
    {
        "subject": "ELPS",
        "catalog_number": "765",
        "title": "Field Based Inquiry II",
        "description": "Prerequisite: Admission to the Doctoral Program in Educational Leadership; Successful completion of Field Based Inquiry I. (P12 cohort only.) Doctoral students complete their field-based inquiry related to organizational change efforts to improve student achievement and present their findings in a seminar session.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "698D",
        "title": "Graduate Project",
        "description": "This course is one of the available choices for the culminating experience in the English Department M.A. Program. In significantly revising existing written work students will practice the tools of research used in the field of English Studies. While students in the Literature and the Rhetoric and Composition Theory Options will focus on revising and developing a previously written essay students in the Creative Writing Option will write a critical introduction to a revised portfolio of their creative work. Additionally students will gain experience with professional conferences presentations and productions. Note: Students in the Creative Writing Option are required to enroll concurrently in a creative writing workshop within their primary genre at the 400- 500- or 600-level.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "659KC",
        "title": "Fieldwork in Clinical Counseling",
        "description": "Prerequisites: EPC 620 659A/B. Intensive supervised field work experience in an organized program for those specializing in college counseling and student services. Students are required to develop a comprehensive learning plan and spend at least 2 hours per week in individual and/or group supervision. Actual number of units per semester is determined by instructor and student. Normally students will enroll in EPC 659JC/659KC for two 3-unit semester. (Credit/No Credit only)\n",
        "units": "3",
        "prerequisites": "{{EPC 620} && {EPC 659A/B}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "670A",
        "title": "Systemic Family Therapy Theories and Their Evidence Base",
        "description": "Prerequisite: Admission to a CSUN Masters Degree Program in Counseling. Case conceptualization and treatment planning using systemic marriage and family therapy/counseling theories including structural strategic experiential and intergenerational theories. Addresses the associated evidence base common factors research and epistemological foundations of systemic theories. Applications with diverse clients children and the severely mentally ill are emphasized.\n",
        "units": "3",
        "prerequisites": "{Admission to a CSUN Masters Degree Program in Counseling}",
        "corequisites": "{None}"
    },
    {
        "subject": "EPC",
        "catalog_number": "689",
        "title": "Leadership in School Counseling",
        "description": "Prerequisites: EPC 682 659A/B. Overview of the knowledge and skills required for effective leadership in schools by school counselors with an emphasis on organizing implementing managing and evaluating comprehensive school guidance and counseling programs. Topics include leadership theory and principles; current research in educational leadership leadership skills education reform movements strategic planning school climate and culture school-based management and collaborative decision making; school counseling management systems; and team building.\n",
        "units": "3",
        "prerequisites": "{{EPC 682} && {EPC 659A/B}}",
        "corequisites": "{None}"
    },
    {
        "subject": "FCS",
        "catalog_number": "491B",
        "title": "Family and Consumer Sciences Projects",
        "description": "Prerequisites: Instructor consent. Individual supervised projects involving utilization of the facilities and personnel of the Child and Family Studies Laboratory.\n",
        "units": "2",
        "prerequisites": "{Instructor consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "FCS",
        "catalog_number": "696C",
        "title": "Directed Graduate Research",
        "description": "Prerequisites: Classified graduate standing; Approval of advisor. Investigation of a significant individual research problem.\n",
        "units": "3",
        "prerequisites": "{{Classified graduate standing} && {Approval of advisor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "GEOG",
        "catalog_number": "103",
        "title": "Weather",
        "description": "Study of atmospheric processes. (Available for General Education Natural Sciences.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "GEOG",
        "catalog_number": "107",
        "title": "People, Places, and Landscapes",
        "description": "Examines the patterns and processes of human occupance of the Earth with a focus on the U.S. Topics such as population agriculture language religion ethnicity politics and economics are covered using the tools methods and perspective of the geographer. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "GEOG",
        "catalog_number": "206L",
        "title": "Introduction to Geographical Information Science and Lab",
        "description": "Corequisite: GEOG 206. Introduction to fundamental concepts of geographical information science. Course will cover technical and context knowledge for basic spatial analysis including data gathering analysis and display through digital methods. Geographic Information Systems (GIS) will be used to explore spatial questions about environmental and social issues. Lab demonstrates these principles through hands-on experience with the dominant GIS software ArcGIS. Students also will be exposed to other online GIS software applications. 2 hours lecture 3 hours lab (Available for General Education Lifelong Learning.) (IC).\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{GEOG 206}"
    },
    {
        "subject": "GEOG",
        "catalog_number": "301",
        "title": "Cultural Geography",
        "description": "Prerequisites: Lower Division course in the social sciences; Completion of the Lower Division writing requirement. Study of the literature traditions and theories dealing with the human-environment relationship and an analysis of the approaches used by cultural geographers to elucidate the nature of this relationship. Major themes are the cultural landscape cultural ecology and environmental perception. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOG",
        "catalog_number": "306L",
        "title": "Intermediate Geographical Information Science and Lab",
        "description": "Prerequisite: Geog 206/L or instructor consent. Corequisite: GEOG 306.  Intermediate course on theories and application of geographical information science. Course will cover fundamental concepts of database management spatial analysis and data creation. Geographic Information Systems (GIS) will be used to discover spatial relationships among environmental and social phenomena. Labs will provide an introduction to spatial data structures and raster-based applications of GIS. Labs offer hands-on experience with the dominant GIS software ArcGIS. 2 hour lecture 2 hours lab.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOG",
        "catalog_number": "316",
        "title": "Environmental Geography",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Recommended Preparatory or Corequisite: GEOG 316L. Introduction to the principles of environmental geography with special emphasis on the connections between human activities and the physical (natural) environment. Emphasis will be placed on identifying the historical and contemporary impact of humans on the natural environment. Students using this course to satisfy a General Education requirement in the Natural Sciences may satisfy the corresponding lab requirement by completing GEOG 316L. 3 hours lecture.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOG",
        "catalog_number": "321",
        "title": "United States",
        "description": "Prerequisites: Lower Division course in the social sciences; Completion of the Lower Division writing requirement. Regional and cultural geography of the U.S. emphasizing human-environment interaction and the evolution of contemporary geographical patterns of population distribution resource exploitation transportation and agricultural and industrial production. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOG",
        "catalog_number": "324",
        "title": "China",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Geographical analysis of the peoples and culture of China emphasizing features important to an understanding of Chinas cultural and regional diversity and contemporary problems. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOG",
        "catalog_number": "365L",
        "title": "Geomorphology Lab",
        "description": "Prerequisites: GEOG 101 or GEOL 101; Completion of the Lower Division writing requirement. Corequisite: GEOG 365. Analytical and descriptive study of physical processes responsible for development and evolution of Earths surface features. Aspects of local geomorphology will be observed on field trips. 3 hours lecture 2 hours field activity. (Available for General Education Natural Sciences.) (IC)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOG",
        "catalog_number": "406L",
        "title": "Advanced Geographical Information Science and Lab",
        "description": "Prerequisite: GEOG 306 or permission of instructor. Corequisite: GEOG 406. Course will cover advanced topics in geographical information science. Students will investigate geographic data structures advanced concepts in database design algorithms for spatial data analysis web-based mapping applications customized applications and implementation and management issues associated with Geographic Information Systems (GIS). Lab will demonstrate these issues through the use of ArcGIS software. 2 hours lecture 2 hours lab.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOG",
        "catalog_number": "408EL",
        "title": "GIS Automation and Customization and Lab",
        "description": "Prerequisite: Geography 306/L or permission of instructor. This course exposes students to GIS automation using industry standard programming systems. Basic programming concepts and methodologies for customizing and/or extending the available functions in ArcGIS are introduced. Available for graduate credit. One hour lecture four hours laboratory.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOG",
        "catalog_number": "482",
        "title": "Population, Migration, and the Environment",
        "description": "Prerequisite: Lower Division course in Geography. Geographical analysis and study of the distribution composition migration and growth of world population.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOG",
        "catalog_number": "494",
        "title": "Internship",
        "description": "Prerequisite: GEOG major with senior standing. Upon prior approval of the Internship Coordinator a student may earn 3 units of credit in the major for professional service as a geographer in a public agency or private organization. No more than 3 units may be applied to the major. Academic Internship course.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOG",
        "catalog_number": "499C",
        "title": "Independent Study",
        "description": "Independent Study\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "GEOG",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisite: GEOG 696. Focused readings followed by Comprehensive Exams under the direction of the students Committee. Only one enrollment permitted.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOG",
        "catalog_number": "699A",
        "title": "Independent Study",
        "description": "Prerequisite: Consent of instructor Graduate Coordinator and Department Chair. Maximum of 3 units may be applied to the students Program and only to the elective requirement in the Option 1 Program.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOG",
        "catalog_number": "699C",
        "title": "Independent Study",
        "description": "Prerequisite: Consent of instructor Graduate Coordinator and Department Chair. Maximum of 3 units may be applied to the students Program and only to the elective requirement in the Option 1 Program.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOL",
        "catalog_number": "102",
        "title": "Geology of Planet Earth Lab",
        "description": "Recommended Corequisite or Preparatory: GEOL 100 or 101. Identification of rocks and minerals. Introduction to topographic maps and how they are used to interpret geologic processes and geologic history. Interpretation of geologic maps and data relating to earthquakes and plate tectonics. Satisfies the lab requirement in Natural Sciences of General Education provided either GEOL 100 or 101 is completed. 3 horus lab field trips.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOL",
        "catalog_number": "107",
        "title": "Geology Goes Hollywood",
        "description": "Corequisite: GEOL 107L. This online lecture and laboratory combination explores how Earth science issues that impact society are depicted in film and television and how these depictions influence the viewers perceptions of Earth science. Students will learn fundamental concepts of Earth science and how to evaluate the appropriateness and accuracy of Earth science portrayed in fictional and documentary film and television. (Available for General Education Natural Sciences fulfills lecture and lab credit.)\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOL",
        "catalog_number": "110",
        "title": "The Fossil Record of Ancient Life on Earth",
        "description": "Introduction to the dynamic study of the Earths evolution including changes in its crust oceans atmosphere and climate and how these changes woven into the fabric of geologic time affected major groups of plants and animals including dinosaurs and humans. Students using this course to satisfy a General Education requirement Natural Sciences may satisfy the corresponding lab requirement by completing GEOL 112.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "GEOL",
        "catalog_number": "122",
        "title": "The World Ocean",
        "description": "Introduction to the oceans. Evolution of the ocean basins their environment and resources. Aspects of biological chemical geological and physical oceanography. Students using this course to satisfy a General Education requirement may satisfy the corresponding lab requirement by completing GEOL 123. 3 hours lecture field trips.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "GEOL",
        "catalog_number": "301",
        "title": "Environmental Geology Lab",
        "description": "Recommended Corequisite or Preparatory: GEOL 300. Introduction to geologic materials and processes as they are applicable to the human environment. Included are practical exercises on rocks minerals geologic maps and water mineral and energy resources. Earthquake volcanic landslide and flood hazard evaluations are also performed. 3 hours lab field trips. May be used to satisfy the lab requirement in the Natural Sciences of General Education provided GEOL 300 also is completed.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOL",
        "catalog_number": "310",
        "title": "Advanced Structural Geology and Lab",
        "description": "Corequisite GEOL 310L. Recommended Corequisite or Preparatory: GEOL 307. Study of rock deformational processes and resulting structures in the Earths crust. Lab work emphasizes the use of graphic methods to assist in the geometric and kinematic interpretation of rock structures. 3 hours lecture 3 hours lab.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOL",
        "catalog_number": "406LRS",
        "title": "Liberal Studies Science Experience Capstone",
        "description": "Prerequisites: BIOL 100 101 or 102; PHSC 170; GEOL 106LRS or GEOG 106LRS. This laboratory course serves as a culminating science experience for Liberal Studies majors in the pre-credential and ITEP Options. An interdisciplinary blend of biology physics chemistry and Earth and space sciences from Lower Division courses will be integrated into the course as various topics are explored through the broad lens of Earth science. Hands-on investigations will include topics linked to California K-6 State Science Standards such as the nature of science astronomy and the solar system solar energy and meteorology the water cycle fossils and the evolution of life rocks and minerals natural resources plate tectonics and Earths structure earthquakes and volcanic eruptions and geomorphology. 3 hours lab.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOL",
        "catalog_number": "498",
        "title": "Senior Thesis",
        "description": "Prerequisites: GEOL 497; Instructor consent. Following approval by the Thesis Advisor of a written proposal the student completes an original research project in consultation with the faculty advisor. Upon completion of the research the student will submit the written thesis to the Advisor and give an oral presentation to the Department of Geological Sciences.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GEOL",
        "catalog_number": "499C",
        "title": "Independent Study",
        "description": "See Independent Study under Courses of Study. Cannot be used for General Education credit.Graduate CoursesGEOL 500. Environmental Geology Seminar (3)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "GEOL",
        "catalog_number": "510",
        "title": "Advanced Topics in Paleontology",
        "description": "Preparatory: GEOL 341 351 508. Seminars in various topics in Invertebrate Paleontology such as biostratigraphy paleoecology functional morphology etc. May be repeated for credit as topic changes. 3 hours seminar.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "GEOL",
        "catalog_number": "698C",
        "title": "Thesis or Graduate Project",
        "description": "No course description\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "GEOL",
        "catalog_number": "699C",
        "title": "Independent Study",
        "description": "See Independent Study under Courses of Study. Cannot be used for General Education credit.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "GWS",
        "catalog_number": "110",
        "title": "Women, Work, and Family",
        "description": "Work and FamilyFocuses on historical and contemporary relationship between home and community work and the marketplace within which women perform. Examines the differences in experience of work and family as these are shaped by race class gender and sexuality. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "GWS",
        "catalog_number": "230",
        "title": "Women and Entertainment",
        "description": "Preparatory: GWS 100. Women and Entertainment is a broad introductory examination of women’s experience and interface with the entertainment arena including but not limited to film music and other popular cultural sites of knowledge production from a uniquely feminist lens that focuses on the intersectionality of gender race class and sexuality. The course explores women’s roles in entertainment as producers participants as well as consumers of various media. This course will be offered for G.E. credit in Arts and Humanities.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "GWS",
        "catalog_number": "301",
        "title": "Feminist Theories",
        "description": "Prerequisite: GWS 100 or 110 or 300 or instructor consent. This required course for Gender and Women Studies majors and minors concentrates on the multitude of feminist theories from the early feminist theories to the more contemporary and complex theories by a diversity of theorists within the U.S. and globally.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GWS",
        "catalog_number": "305CS",
        "title": "Gender and Women’s Studies Community Service",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Students work in a variety of community settings -- educational political and/or social service agencies -- to apply theoretical understanding of gender and womens studies to practical and concrete community situations that affect womens daily lives. Includes regular class meetings. Offers a community service opportunity with activities relating to concepts and theories presented. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GWS",
        "catalog_number": "370",
        "title": "Women and Violence",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. This course focuses on dimensions of violence women experience in the U.S. and internationally. It provides an overview of sexual violence including rape in intimate partnerships childhood sexual assault sexual harassment sex trafficking and violence against women under foreign occupation. Varied feminist scholarship around 3 broad areas will be covered: Sexual Violence Against Women; Physical Violence Against Women; and Perpetrators of Violence Against Women. The course includes an examination of case studies that illumine domestic abuse judicial abuse and war rape among others. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "GWS",
        "catalog_number": "430",
        "title": "Global Sexualities",
        "description": "Neoliberal globalization is as fundamental to understanding contemporary discourses of sexuality as sexuality is key to understanding global issues. The course will foreground a wide range of theoretical perspectives of feminist queer and globalization theories that help students understand how the emergence of sexuality as an intellectual and social arena is concurrent with specific characteristics of the globalization process and how the new theories of sexuality advance and challenge the feminist agenda for global social and gender justice.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "110",
        "title": "World History to 1500",
        "description": "Introduction to major developments in world history from the emergence of complex societies until 1500 c.e. Examines processes of social cultural political and economic change throughout this period and emphasizes comparisons of and interconnections between major world civilizations in Europe Asia Africa and the Americas. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "150",
        "title": "Western Civilization to 1500",
        "description": "Roots of modern civilization in the West as revealed by a study of significant cultures and societies of the past from the earliest times to 1500. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "161",
        "title": "The History of Latin America from Pre-Columbian Times to Today",
        "description": "Study of certain aspects of the culture and society of Latin America and analysis of the relation of those aspects to the contemporary scene. (Available for General Education Comparative Cultural Studies.) (IC)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "270",
        "title": "The United States to 1865",
        "description": "Survey of the political and social development of the U.S. through the Civil War. (Meets Title 5 requirement in American History Institutions and Ideals.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "304",
        "title": "Themes in Western Civilization After 1500",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Themes in the institutional political socio-economic and cultural development of Western Civilization since 1500. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HIST",
        "catalog_number": "342",
        "title": "The World Since 1945",
        "description": "This course examines the Cold War and its international aftermath decolonization revolutionary movements national development across a variety of cases and trends in the global economy. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "350",
        "title": "History of Women",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Roles and contributions of women from ancient times to the present. Special emphasis is given to the development of womens movements from the 18th century to the present. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HIST",
        "catalog_number": "351",
        "title": "History of Sexual Behavior",
        "description": "Historical study of sexual behavior from ancient times to the present.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "370",
        "title": "Questions in American History to the Civil War",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Exploration of the political cultural and social themes of U.S. history prior to the Civil War with emphasis given to examining conflicting ideas about such issues as the dynamics of colonial settlement the origins of the Revolution the ratification of the U.S. Constitution the development of liberal capitalism the nature of the American democratic political system the impact of slavery and the causes of the Civil War. (Meets Title 5 requirement in American History Institutions and Ideals.) (IC)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HIST",
        "catalog_number": "380",
        "title": "Los Angeles: Past, Present, Future",
        "description": "Multidisciplinary investigation of the Los Angeles urban area -- its patterns of population and resources distribution; its historical economic social and cultural developments; and policies models designed to cope with its problems -- and to develop its potential as an ethnically diverse metropolis on the Pacific Rim. Application of social science methodology. Series of faculty and guest speakers weekly discussion sessions and field trips. (Available for General Education Social Sciences.) (Cross listed with POLS and URBS 380.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "420",
        "title": "Getting Medieval: Europe From the Barbarian Kingdoms to the Black Death",
        "description": "Political and institutional history of Europe in the Middle Ages. (Credit may not be received for both 420 and 320.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "441",
        "title": "The Second World War",
        "description": "Study of World War II as a watershed experience in modern history with coverage of the European and Pacific theatres of war diplomatic strategies and the impact of the war on the domestic scene.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "456",
        "title": "Modern France",
        "description": "Review of French social cultural economic military and political history from the fall of Napoleon to end of the Cold War. Examines in detail the social turmoil caused by Frances many revolutions and major wars during the period. Special emphasis on the effect of class and social conflict on its modern history.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "466",
        "title": "Mexico",
        "description": "Internal development of Mexico and how it has affected hemispheric and world affairs. Special attention is devoted to Mexicos interaction with the U.S.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "494SOC",
        "title": "Internship Program",
        "description": "Pre-professional practicum in a history-based field open to History major and minors with 3.0 GPA.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HIST",
        "catalog_number": "563",
        "title": "Colloquium in Latin American Political",
        "description": "Institutional and Military HistoryPrerequisite: Graduate standing or instructor consent. Examines the historical evolution of the political and institutional structure in Mexico Central and South America and the Caribbean. By the end of the semester students have achieved an understanding of the political development of the Latin American states within a broad social and economic context. Emphasis on critical reading in-depth class discussions and the ability to present written analyses of the covered material. Major themes may include colonial institutions caudillismo oligarchic regimes U.S. interventions revolution and reform populism armed forces in politics dictatorships and return to democracy and political neo-liberalism.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HIST",
        "catalog_number": "601",
        "title": "Theory and Historiography",
        "description": "Prerequisite: Classified standing. Sophisticated graduate-level introduction to history as a discipline. Surveys the development of history as a discipline examines the various genres of historical writing explores issues and problems of historical interpretation and considers the how historians use theoretical models from other disciplines to shape their work. Readings include seminal works by major historians.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HIST",
        "catalog_number": "698D",
        "title": "Graduate Culminating Project",
        "description": "Prerequisites: HIST 601 and two Graduate Level History Research Seminars. This culminating graduate course requires students to demonstrate their mastery of the historians craft. Students will revise an existing research paper that they produced in one of their graduate research seminar classes and transform it into a piece that could be submitted as a conference paper a scholarly writing sample and/or an article for publication. Students will prepare a cogent twenty-minute oral presentation of their work. This course is to be taken in the students final semester\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "132",
        "title": "History of Preventive Medicine and Public Health",
        "description": "Historical development of the disease processes concepts and the institutions concerned with public health. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "182",
        "title": "Medical Imaging Sciences II",
        "description": "Prerequisites: HSCI 181 280 285 Physics 376 or ARRT Certification. Corequisite: HSCI 281. Study of imaging modalities and equipment utilized in radiology. Includes a progressive series of exercises involving radiation protection procedures problem-solving techniques and quality assurance programs to be used during clinical education. Considers the manipulation and use of body section radiography phototiming image intensification and stereoscopic equipment. (Offered Spring semester.)\n",
        "units": "4",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "281",
        "title": "Radiological Sciences: Clinical Education II",
        "description": "Prerequisites: HSCI 181 280 285 Physics 376 or ARRT Certification. Corequisite: HSCI 182 286 385. Clinical participation in the radiology department of an affiliated hospital. Includes patient positioning manipulation of exposure factors film analysis and methods of patient care. (Offered spring semester)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "286",
        "title": "Radiographic Anatomy and Positioning II",
        "description": "Prerequisites: HSCI 181 280 285 Physics 376 or ARRT Certification.  Corequisite:  HSCI 281. Methodologies and elements of pediatric radiology in depth including positioning of the skull facial bones paranasal sinuses mastoids and intraoral and extraoral radiography. Continuation of advanced technical film analysis.\n",
        "units": "5",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "312",
        "title": "Introduction to Health Administration",
        "description": "Prerequisites-MATH 102 or 103 SOC 150 PSY 150.  Fundamentals of health administration including role integration between health administrators health professionals and allied health personnel.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "314",
        "title": "Organization and Delivery of Health Services",
        "description": "Examines how the behavior and interaction of health system components consumers and the diverse interest groups in our nation impact the distribution and availability of health-care resources impede or increase access to care change or create health entitlements like Medicare and Medi-Cal and change provider reimbursement mechanisms. U.S. California and Los Angeles County public and private health systems are overviewed as are systems of health delivery in other nations.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "335",
        "title": "Holistic Health",
        "description": "Critical examination of the holistic health model and selected holistic techniques.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "337",
        "title": "Nutrition and Health",
        "description": "Preparatory: Completion of the Lower Division writing requirement. Fundamentals of nutrition emphasizing practices and problems related to consumer and health. Credit not allowed for both HSCI 337 and FCS 207. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "390",
        "title": "Biostatistics and Lab",
        "description": "Corequisite: HSCI 390L. Prepatory: MATH 102 or 103 or 105 or 140. Principles theory and practice of statistical analysis in health as they apply to health planning epidemiological research and experimental research. 3 hours lecture 2 hours lab.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "391",
        "title": "Computer Application in Health Sciences",
        "description": "Introduction to computer technology including legal and ethical considerations and its application to health education health research health administration and clinical health practice. Class time is proportioned between lecture-discussion and hands-on computer practice.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "413",
        "title": "Leadership and Direction in the Administration of Health Services",
        "description": "Prerequisite: HSCI 412. Lecture discussion demonstrations and case analyses. Introduction to the basic principles of leadership and direction for students interested in supervision and management of health programs.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "415",
        "title": "Health Information Systems",
        "description": "Preparatory: HSCI 412. Introduces the health-care information systems required in the health-care industry and develops an understanding of the scope and applications of these systems. Both clinical and administration information systems in the health-care industry are covered. Discusses strategic and tactical information management needs of health-care executives.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "419",
        "title": "Hospital Administration",
        "description": "Prerequisites: HSCI 312 412. Introduction to the administration organization and evaluation of hospital services and the role of the hospital in the community health system. Topics include governance financing medical staff relations and other current topics.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "425",
        "title": "Financial Planning and Reimbursement in Healthcare",
        "description": "Prerequisites: ACCT 220 or equivalent; HSCI 312 412. Consideration of the highly specialized application of financial planning principles and reimbursement procedures in health organizations including government regulations and legal restraints.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "433",
        "title": "Counseling of Health Problems",
        "description": "Consideration of concepts and techniques of counseling and guidance as they apply directly to the reduction of specific health problems.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "435",
        "title": "Health Science for Children and Youth",
        "description": "Examination of biological and environmental factors influencing health of children and youth and means of solving selected health problems including cardiopulmonary resuscitation. (Available for General Education Lifelong Learning -- Credential candidates only.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "437",
        "title": "Effective Strategies and Methods for Public Health Practice",
        "description": "Undergraduate seminar. Techniques of developing selected strategies for making health decisions.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "439",
        "title": "Community Health Action",
        "description": "Basic concepts and techniques of community health action as applied to the initiation and enhancement of community health and health-related services.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "442",
        "title": "Health, Culture, and Diversity",
        "description": "Culture and DiversityAn in-depth analysis of how culture impacts individual and community health.  Includes an exploration of how social determinants of health affect health disparities.  Effective evidence-based health education strategies are presented as ways to address racial and ethnic health disparities.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "466ADO",
        "title": "Health Issues of the Adolescent",
        "description": "An introduction to the current health concerns of adolescents in the secondary-school setting. Emphasis is placed on the role of the teacher in working with students who have special health needs and conditions and measures that enhance successful learning. Topics include attention to teacher observation skills mandated health screening and immunizations parent referral and follow-up procedures and the contribution of school personnel to a Coordinated School Health Program. This course is restricted to students in the College of Education Credential Program and is required for the Single Subject Credential.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "485",
        "title": "Principles of MRI",
        "description": "Prerequisites: HSCI 283 380 384 480 482 or ARRT Certification. Corequisite: HSCI 284. Principles of Magnetic Resonance Imaging (MRI) provides the Radiologic Technology student with a basic understanding of the applied physics imaging techniques and imaged anatomy/pathology used in clinical magnetic resonance imaging. Clinical applications and processes that highlight the course content are conducted at the affiliated medical centers. (Offered Spring semester.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "486B",
        "title": "Seminar: Advances in Radiologic Imaging II",
        "description": "Prerequisites:  HSCI 283 380 384 480 482  or ARRT Certification. Corequisite: HSCI 284. Research of diagnostic interventional or therapeutic processes being developed or used in radiologic imaging for the purpose of improving the health and/or well-being of the patient population. Students work under the guidance of the instructor to research an approved topic and to develop a scientific paper display or project. Students participate in seminar discussions on current research present their research findings and demonstrate outstanding professional communication teaching and critical-thinking skills.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "488",
        "title": "Epidemiology",
        "description": "Preparatory: HSCI 390. Nature transmission prevention and control of disease from a public-health approach. Historical background current problems and trends in disease control.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "531",
        "title": "Program Planning and Evaluation",
        "description": "Preparatory: Graduate standing as a Conditional or Classified student in the MPH Program. Graduate students not in the Program may enroll with permission of course instructor. In-depth study of the conceptual/theoretical and practice-based methodologies of community health education program planning and evaluation.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "537",
        "title": "Principles of Communication in Public Health",
        "description": "Analysis development and utilization of media communication in Health Education.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "539",
        "title": "Current Issues in Public Health",
        "description": "Theory principles and research applicable to health education. Investigation of problems of social economic cultural and educational origin as they apply to sound health education programs. (Offered Fall semester.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "588",
        "title": "Epidemiology of Infectious Diseases",
        "description": "Prerequisites: HSCI 390 488. Critical review of infectious diseases their transmission control prevention and significance in the past present and future.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "614",
        "title": "Health Administration: Financial Analysis and Management",
        "description": "Prerequisites: Accounting course; Classified graduate status in Health Administration. Theory analysis and application of techniques of fiscal management in selected health-care systems.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "619",
        "title": "Third Party Payer Impact on Health Delivery",
        "description": "Prerequisite: Classified graduate status in Health Administration. Examines how third-party pay mechanisms including traditional indemnity insurance/fee-for-service Medicare and Medicaid prospective payment systems various managed care models and other forms impact provider and consumer behavior and risk management. Other items include Workers Compensation disability insurance and liability insurance for the healing arts professions self-insured employers and ERISA and the impact of these mechanisms on access to care quality and consumer/provider economic incentives.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "625",
        "title": "Integrative Seminar in Health Administration",
        "description": "Prerequisite: Permission of instructor. Last semester of course work. Integrative seminar. Students apply the knowledge and analytic skills obtained from health administration courses to the solution of organization and system-wide problems in health care.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "HSCI",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "(Credit/No Credit only)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "HUM",
        "catalog_number": "101",
        "title": "Forms and Ideas in Humanities",
        "description": "Prerequisite: EPT score of 151 or higher or completion of the Lower Division writing requirement. Introductory course provides instruction in the interdisciplinary analysis and interpretation of meaning in art music and literature and in the understanding of philosophical ideas in their own right and as they influence styles and themes in works of art. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "IS",
        "catalog_number": "312",
        "title": "Systems and Technologies for Managers",
        "description": "Prerequisite: ACCT 220. A survey of information systems concepts including information technology business information systems and information system development and management. Preparation of group and individual projects involving hands-on learning of database management systems decision support software and web page design and publishing. Practice in the use of a formal problem-solving process that includes five tasks. Presentation of results in written and/or oral form. \n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "IS",
        "catalog_number": "431",
        "title": "Systems Analysis and Design",
        "description": "Prerequisites: Grade ofC or higher in IS 312; a grade ofC or higher in BUS 302; a grade ofCR n BUS 302L; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. This course covers the systems development life cycle. Topics include standard tools and techniques to analyze and design an information system from a structured as well as an object-oriented perspective. A Computer-Aided Software Engineering (CASE) tool is used to facilitate the study. Required class work includes a group project on developing an information system in a business case.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "IS",
        "catalog_number": "441",
        "title": "Database Management Systems",
        "description": "Prerequisite: Grade ofC or higher in IS 312; a grade ofC or higher in BUS 302; a grade ofCR in BUS 302L; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. The design and implementation of computerized databases. Provides background for the selection and use of database management systems. Topics include types of available systems functions of database administration conceptual database design data independence integrity privacy and query. The student will design and implement a database utilizing a commercial database management system.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "IS",
        "catalog_number": "457",
        "title": "Advanced Telecommunications and Networking",
        "description": "Prerequisites: Grade ofC or higher in IS 431 435 and 441; a grade ofC or higher in BUS 302; a grade ofCR in BUS 302L; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. An advanced course in telecommunications and networks emphasizing enterprise networking topics such as: network operating systems network analysis and design network security virtual private networks collaboration wireless networks VLAN multi-platform integration voice-over internet protocol web server strategies and storage area networks. This course will include hands-on projects involving network design and implementation.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ITAL",
        "catalog_number": "101",
        "title": "Elementary Italian I",
        "description": "Prerequisite: Not open to students who have attended schools where Italian was the language of instruction. Study of the fundamentals of Italian including grammatical structures reading and practice in the spoken language. May not be challenged. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "JAPN",
        "catalog_number": "102",
        "title": "Elementary Japanese II",
        "description": "Prerequisite: JAPN 101 or equivalent. Not open to students with oral proficiency or who have attended schools where Japanese was the language of instruction. Continuation of the study of the fundamentals of Japanese including grammatical structure reading and practice in the spoken language. May not be challenged. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "4",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "JAPN",
        "catalog_number": "205",
        "title": "Kanji III",
        "description": "Prerequisite: JAPN 201 or equivalent. Can be taken concurrently with JAPN 202. Students learn to read and write 750 kanji and learn to use them in context. The course will provide students with the opportunity to further their study of Japanese language and culture and to increase functional language competence. Reading comprehension and writing skills will be targeted with the use of readings compositions and exercises including web-based programs and reading materials. The course will include formal study of language structure although not as the central focus of the course content. The course will be particularly helpful to students planning on learning as many kanji as possible and eventually all the 1950Kanji for Common Use. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "100",
        "title": "Mass Communication",
        "description": "Not open to students with credit in CTVA 100. Survey and analysis of newspapers books magazines radio television popular music movies advertising public relations the Internet and emerging technologies. Examines media history and economics as well as their roles rights and impact in contemporary society. Particular emphasis on media literacy critical thinking research and writing. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "250",
        "title": "Visual Communication",
        "description": "Survey of the most significant techniques and examples of visual communication as employed by the mass media including newspapers magazines television and advertising. Discussion and demonstration of the tools used in analyzing visual communication. Illustrated letures and experiences.\n",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "310",
        "title": "Feature Writing",
        "description": "Reporting and Ethics IIIPrerequisite: Grade ofC or better in JOUR 210 or its equivalent. Reporting in-depth on social and political issues. Analysis and application of both classic and newer forms of explanatory storytelling with an emphasis on ethics. Feature and human interest writing. Using the Internet as a reporting tool.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "325",
        "title": "Multiplatform Storytelling",
        "description": "Prerequisite: Grade ofC or better in JOUR 110 or its equivalent. Shooting and editing of video for television news stories. Coverage and editing of interviews speeches news conferences hard news and features. Operation of cameras and editing equipment. 2 hours of classroom and lab activity.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "350",
        "title": "Photojournalism",
        "description": "Prerequisite: Grade ofC or better in ART 250; Students are required to have their own cameras. Instruction in the production of black-and-white images for publication and in picture editing. Emphasis on the techniques and ethics involved in working with single images. 6 hours of classroom and lab activity.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "371",
        "title": "Gender and Media",
        "description": "Men and MediaPrerequisite: Completion of Lower Division writing requirement. Analysis of portrayals of women and men in the mass media and how media shape gender roles expectations and stereotypes. Special attention to historical and contemporary contributions and responsibilities of women media professionals. Particular emphasis on applying critical thinking research and writing skills to analyze media policies and practices and on developing strategies that empower gender equality. (Available for General Education Comparative Cultural Studies.) (IC)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "410",
        "title": "Investigative Reporting",
        "description": "Prerequisites: Grade ofC or better in JOUR 310 or 315. Researching reporting writing and producing investigative stories on societal governmental and scientific issues for print broadcast or online media. Ethical issues problems traditional techniques and technological approaches to investigative journalism.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "445",
        "title": "Advanced Television News",
        "description": "Prerequisites: Grade ofC or better in JOUR 335 and 415. Reporting writing editing anchoring and producing television newscasts for airing on cable or television. Students produce weekly newscasts in a professional environment followed by critique and discussion. 6 hours of classroom and lab activity.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "JOUR",
        "catalog_number": "494AEE",
        "title": "Internship",
        "description": "Prerequisite: Grade ofC or better in JOUR 315 or 330 or 335 or 341.Supervised employment and field study on newspaper and magazines in public relations or in radio and television news. (Credit/No Credit only)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "JS",
        "catalog_number": "390CS",
        "title": "Service Learning in the Jewish Community",
        "description": "Prerequisite: Instructor consent. Preparatory: Completion of Lower Division writing requirement. Work experience in Jewish schools synagogues social welfare or political organizations. Faculty supervisor assists students in obtaining appropriate work placements. Work experience is complemented by academic study and written assignments offers a community service opportunity with service learning activities relating to concepts and theories presented. Requires 100 hours of community-based field work. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "117",
        "title": "Adapted Aquatic Exercise",
        "description": "Prerequisite: Medical release with doctors approval. Provides an aquatic exercise program designed for students with physical disabilities. Students develop strength flexibility cardiovascular endurance posture balance and improved ambulation through the application of adapted and therapeutic aquatic exercise. Concepts of water safety physics of aquatic activity and specific movement skills are addressed. Course may be repeated for credit. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "120",
        "title": "Arts Immersion: Dance and Lab",
        "description": "Prerequisite: Restricted to students in ITEP Freshman Option. Corequisite: KIN 120L. Introductory course in study of dance as an art form. Concepts of dance are explored as a means of personal expression. Students engage in creative dance activities and multicultural and international dance forms. Students extend and integrate their knowledge of dance to all the visual and performing arts. 1 hour lecture 2 hours lab per week.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "125A",
        "title": "Fitness for Life",
        "description": "Introductory course offering a wide variety of conditioning activities (i.e. general aerobics jogging weight training stretching) designed to increase the individuals understanding of conditioning principles and level of fitness necessary for participation in sports or other conditioning activity courses. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "KIN",
        "catalog_number": "128",
        "title": "Fitness Walking",
        "description": "Introduction to the performance of fitness walking as a lifelong activity that maintains and enhances well-being. Develop proficiency and increased knowledge about fitness walking as well as understand and implement a physical fitness program that features walking as a primary activity. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "KIN",
        "catalog_number": "130A",
        "title": "Karate I",
        "description": "Development of skill in basic techniques of Japanese karate including self defense and an examination of karate history philosophy and traditions. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "KIN",
        "catalog_number": "132A",
        "title": "Aikido",
        "description": "Study of the techniques and philosophy of Aikido a Japanese martial art. Focus on control techniques and is based on a blending of movement and intention so that what appears as a combative situation can be resolved without conflict. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "KIN",
        "catalog_number": "135A",
        "title": "Aerobic Dance I",
        "description": "Exercises designed specifically for improving cardiovascular function and physical fitness through the mode of dynamic rhythmic dance movements. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "KIN",
        "catalog_number": "139A",
        "title": "Ballet I",
        "description": "Development of proficiency in basic ballet skills and development of understanding and appreciation for ballet as an art form. (Available for General Education Arts and Humanities.)\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "KIN",
        "catalog_number": "141A",
        "title": "Jazz Dance I",
        "description": "Development of proficiency in jazz dance techniques skill and development of an understanding and appreciation of jazz dance as an art form.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "KIN",
        "catalog_number": "142A",
        "title": "Dance, Latin America I",
        "description": "Latin America IDevelopment of proficiency in Latin American folk dance skills in choreography and in performance of group dances based upon the traditional forms. Introduction to historical background of music.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "KIN",
        "catalog_number": "147",
        "title": "Pilates",
        "description": "An introduction to the Pilates method -- a mind-body movement program designed to stretch strengthen and balance the body. Exercises focus on postural symmetry breath control abdominal strength spine pelvis and shoulder stabilization muscular flexibility joint mobility and strengthening through the complete range of motion of all joints. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "KIN",
        "catalog_number": "149",
        "title": "Yoga",
        "description": "Philosophy and basic techniques of yoga. Through asanas (postures) stretches and deep breathing flexibility and strength are developed and all systems of the body are revitalized. Deep breathing relaxation and meditation techniques enhance overall health and improve ability to handle stress. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "KIN",
        "catalog_number": "152A",
        "title": "Soccer I",
        "description": "Designed to practice performance techniques analyze strategies and promote team play and sportsmanship in soccer. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "KIN",
        "catalog_number": "177A",
        "title": "Swimming for Non-swimmers",
        "description": "Introduction for the non-swimmer which includes fundamental skills for basic swimming strokes safety and survival techniques. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "KIN",
        "catalog_number": "179A",
        "title": "Swimming Conditioning",
        "description": "Survey of various training methods and development of physical fitness utilizing aquatic activity. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "KIN",
        "catalog_number": "195A",
        "title": "Volleyball I",
        "description": "Development of proficiency in volleyball skills including background rules and strategy. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "KIN",
        "catalog_number": "236",
        "title": "Introduction to Choreography Lab",
        "description": "Prerequisite: Instructor consent. Principles of dance composition -- movement sources rhythmic spatial and dynamic techniques of organization and thematic development. Composition of solo and small group dances. (Available for General Education Arts and Humanities.)\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "242",
        "title": "Movement Forms: Basic Dance",
        "description": "Introduction for the major student to the study of stylized dance (social ethnic ballet jazz) as a human movement form. Serves as a base for continued study of the knowledge and applications of kinesiology.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "KIN",
        "catalog_number": "271",
        "title": "Fundamental Movement, Gymnastics and Rhythms and Lab",
        "description": "Prerequisite: KIN 200 or 240. An introductory course in the fundamental movement patterns appropriate for the developing child in elementary physical education. This course is designed to develop competency in these fundamental movement patterns. Students will develop competency in knowledge and understanding of ways in which motor skills can be organized into developmentally appropriate progressions in a variety of movement settings including educational games gymnastics rhythms and dance. Systematic observations of children during field experiences will be provided.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "272",
        "title": "Non-traditional Games and Activities and Lab",
        "description": "Prerequisite: KIN 200 or 240. Recommended Prepatory: KIN 201/L. Students will be introduced to a variety of non-traditional games and activities that include team challenges problem-solving activities and cooperative games. Students will actively explore the impact of non-traditional games and activities for the K-12 setting.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "300",
        "title": "Foundations and Analysis of Human Movement",
        "description": "Prerequisites: BIOL 211 212. Examination of anatomical and neuromechanical concepts relevant to human movement analysis and muscular control of movement. Application of functional anatomy to fundamental movements and select movement forms in exercise sport and dance emphasizing movement analysis across the lifespan and across a full range of abilities.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "305",
        "title": "Historical and Philosophical Bases of Kinesiology",
        "description": "Prerequisite: KIN 200 or 240. Survey of the historical and philosophical bases of kinesiology.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "310",
        "title": "Visualization and Sport",
        "description": "Examination of approaches for helping athletes understand develop and/or refine visual skills mental skills and strategies essential for maximizing athletic performance.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "KIN",
        "catalog_number": "311L",
        "title": "Adapted Therapeutic Exercise Principles and Applications and Lab",
        "description": "Prerequisite: KIN 201/L or 241. Corequisite: KIN 311. Lecture and laboratory courses designed to introduce principles and applications in adapted therapeutic exercise. Lab: Hands-on experiences in working with individuals with various physical disabilities are provided under clinical supervision at the Center of Achievement.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "313L",
        "title": "Adapted and Therapeutic Aquatic Exercise and Lab",
        "description": "Prerequisite: KIN 201/L or 241. Corequisite: KIN 313. Lecture and lab courses designed to introduce a theoretical overview of the benefits of adapted and therapeutic aquatic exercise for individuals with physical limitations. Lab: Hands-on experiences in working with individuals with various physical disabilities are provided under clinical supervision at the Center of Achievement.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "314L",
        "title": "Creative Dance for Children and Lab",
        "description": "Corequisite: KIN 314. Study of the elements of time space and energy as related to childrens dance as an art form. Principles techniques and exploration of directions of teaching dance to children. 2 hours lecture 2 hours lab.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "315L",
        "title": "Analysis and Application of Multi-Cultural Dance Forms for Children and Adolescents and Lab",
        "description": "Prerequisites: KIN 201/L 242. Corequisite 315. Analysis of basic to intermediate skills of multi-cultural dance including ballroom contra ethnic round and square. Students develop performance analysis skills and the ability to plan and conduct instructional activities in multi-cultural dance.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "337L",
        "title": "Prevention and Care of Athletic Injuries and Lab",
        "description": "Prerequisites: BIOL 211 212. Corequisite: KIN 337. An introductory course to the field of athletic training. The history of the athletic training profession the role of the athletic trainer as part of the sports medicine team pharmacology nutrition emergency management risk management and injury assessment domains will be introduced. Lab: Injury-prevention principles and techniques for the application of protective taping/bracing stretching therapeutic exercise and testing and environmental conditions/illnesses.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "345L",
        "title": "Biomechanics and Lab",
        "description": "Prerequisite: KIN 300. Corequisite: KIN 345. Analysis of the ways in which anatomical makeup and mechanical laws govern the mechanics of human motion. Lab experiments designed to provide practical demonstration of mechanical laws and structured learning of qualitative and quantitative procedures for analyzing human motion.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "346L",
        "title": "Physiology of Exercise and Lab",
        "description": "Prerequisite: BIOL 281; KIN 201/L or 241. Corequisite: KIN 346. Effects of physical activity on the human physiological processes and of the physiological aspects of skill endurance fatigue training and other phenomena related to physical performance.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "371",
        "title": "Physical Education Content Development for Children and Lab",
        "description": "Prerequisite: KIN 271/L. Not available for credit to students who have completed KIN 470/L. Content methodology materials and equipment central to the planning implementation and evaluation of developmental physical activity programs for children. Lab provides observation active participation and practical experiences in activity programs for children with emphasis on elementary-school physical education.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "380L",
        "title": "Perspectives of Dance and Lab",
        "description": "Corequisite: KIN 380. History aesthetics performance forms musical forms cultural and racial heritages and contemporary directions of dance in education and art. Dance is examined as a performing art ritual social/recreational activity and subject for scholarly investigation and analysis. Students participate in dance techniques related to content presented in the classroom. (Available for General Education Arts and Humanities.)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "405",
        "title": "Ethics and Kinesiology",
        "description": "Prerequisite: KIN 305.  This course examines how basic ethical theories relate to problems in kinesiology.  It provides critical analysis of ethical dilemmas in contemporary sport.  It also emphasizes the understanding of ethical frameworks and the application of these frameworks to ethical problems arising in other contexts related to kinesiology professions.(Available for graduate credit)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "407",
        "title": "Sport, Culture and Society",
        "description": "Culture and SocietyPrerequisite: KIN 306. Study of the role meaning and use of American sports from colonial times to the present. Examination of the effects of forces that influence sports in this society and the status of international sports including the role of U.S. factors affecting sport at the international level and future directions.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "409",
        "title": "Advanced Sport Psychology",
        "description": "Prerequisites: Score of 8 or better on Upper Division Writing Proficiency Exam; Not available to students who have taken PSY 409. Recommended Preparatory: KIN 306 and/or PSY 150. Addresses the evolution of sport psychology as a science including the psychological variables associated with successful performance in sport and physical activity settings. Available for graduate credit with consent of students graduate advisor. KIN Majors receive Upper Division elective credit toward KIN Degree in Options that allow electives. (Cross listed with PSY 409.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "415",
        "title": "Medical Aspects of Sport and Related Injuries",
        "description": "Prerequisite: KIN 345. Review of selected medical aspects of sport taught by guest medical experts from community hospitals and private practice.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "417L",
        "title": "Theoretical and Technical Aspects of Resistance Training Laboratory",
        "description": "Prerequisites: KIN 345/L 346/L. Corequisite: KIN 417. A hands-on lab in which students will perform various resistance-training techniques that will pertain to muscular strength and endurance conditioning physiology of strength conditioning muscular strength testing and evaluation and organization/administration of strength-training programs. Students who complete this course are prepared to sit for the Certified Strength and Conditioning Specialist Examination.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "420",
        "title": "Coaching Competitive Sports",
        "description": "Prerequisite: Upper Division standing. Psychological sociological and philosophical perspectives of coaching are examined as these relate to motivation discipline and interpersonal relations in competitive sports programs.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "428",
        "title": "Aesthetics of Human Movement",
        "description": "Prerequisite: KIN 305.  Examines historical and contemporary physical activity movement forms (such as sport dance and exercise) and the human body as aesthetic expressions and culturally symbolic representations.(Available for graduate credit)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "445",
        "title": "Advanced Biomechanics",
        "description": "Prerequisites: KIN 345 with a grade ofC- or better; MATH 104 or 105. Evaluation and interpretation of motor skill performance on the basis of applied mechanics.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "446L",
        "title": "Research in Exercise Physiology and Lab",
        "description": "Prerequisite: KIN 346 with a grade ofC- or better. Corequisite: KIN 446. Explores advanced theory of exercise physiology as well as concepts and techniques of research. Lab experience provides competency in the application of biomedical instrumentation to exercise physiology research.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "451L",
        "title": "Adapted Aquatic Therapeutic Exercise: Assessment, Evaluation and Program Design Lab",
        "description": "Evaluation and Program Design LabCorequisite: KIN 451. Recommended Preparatory: KIN 311/L 313/L. This course is designed to introduce intermediate/advanced knowledge in adapted aquatic therapeutic exercise. Assessment and evaluation processes to be learned include observations screenings and various measurement instruments for the purpose of designing exercise programs for individuals and groups with special needs.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "470",
        "title": "Physical Education for Children and Lab",
        "description": "Corequisite: KIN 470L. Not available for credit for Kinesiology majors. Focuses on the growing/moving/learning elementary-age child and on purposes content procedures materials and equipment central to elementary school physical education. Lab: Observation and lab experience in elementary school physical education.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KIN",
        "catalog_number": "476",
        "title": "Musculoskeletal Biomechanics and Injury",
        "description": "Prerequisite: KIN 345 or instructor consent. Anatomical physiological and mechanical characteristics of human musculoskeletal tissues and their responses to mechanical loading. Detailed examination of injury mechanisms and their mechanical correlates.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "KOR",
        "catalog_number": "102",
        "title": "Elementary Korean II",
        "description": "Preparatory: Instructor consent. Study of the fundamentals of Korean including alphabet and additional sounds grammatical structure reading writing and practice in the spoken language. May not be challenged. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "4",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "402",
        "title": "Phonetics and Phonology",
        "description": "Preparatory: ANTH 310 COM S 420 or ENGL 301. Study of the physical and acoustical properties of sound in a variety of natural languages as well as phonological analysis and rule formation in phonological systems.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "417",
        "title": "Language Development and Acquisition",
        "description": "Preparatory: Upper Division standing; Introduction to the study of language. Required for both ITEP and Linguistics/TESL students and addresses topics linked to language arts and (T)ESL methods courses for students preparing to teach. Introduces students to the study of language development and acquisition including such topics as approaches to the development of childrens grammars the development of communicative competence definitions of bilingualism and multilingualism relationships between language development and learning to read issues particular to the multilingual nature of California and issues related to exceptional language development.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "LING",
        "catalog_number": "505",
        "title": "Seminar in Discourse Analysis",
        "description": "Prerequisite: LING 407 408 or 441. Seminar in the theoretical and methodological aspects of discourse analysis in a linguistic perspective.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "LING",
        "catalog_number": "520",
        "title": "Issues in ESL Reading and Writing",
        "description": "Preparatory or Recommended Corequisite: LING 502. Provides students with a foundation for understanding the processes of reading and writing -- as well as the relationships between them -- as they are experienced by adult second-language learners. Topics in the area of reading include skills and strategies that contribute to the second language learners ability to read and to comprehend a variety of texts and curricular design. Topics in writing include aspects of the composing process specific to second language students the design of curriculum and assignments and the effects of various types of responses to student writing.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "LING",
        "catalog_number": "566",
        "title": "Research Methods for Linguistics",
        "description": "General Track Prerequisite or Corequisites: LING 417 or consent of the instructor. Recommended preparatory: LING 402 and 404. TESL Track: Prerequisites or Corequisites: LING 417 530 or consent of the instructor. Recommended Preparatory: LING 402 and 404. An introduction to research in linguistics including quantitative qualitative and mixed methods research. Data collection and analysis are covered along with methods for writing research reports.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "102L",
        "title": "Pre-Calculus I Lab",
        "description": "Prerequisite: Required  for all Conditionally prepared students  enrolled in MATH 102. All students in MATH 102 are encouraged to enroll in this course. This is a Credit/No Credit hybrid enrichment laboratory for students in  MATH 102. This course  will include a self-paced modular online component. 2 hours lab per week. (Credit/No Credit only)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "103L",
        "title": "Mathematics for Business Laboratory",
        "description": "Prerequisite: Passing score on the ELM Exam. This self-paced module-based laboratory is designed to give students additional exposure to the applications of college algebra to business and economics beyond what can be done in lecture. The additional hands-on problem-solving skills learned in this class enhance the lecture experience and strengthen the skills necessary for success in MATH 103 and subsequent courses in business majors. The lab environment allows students to both work at their own pace and receive small-group instruction with the laboratory instructor on all modules. Students with an MPT Part I score below 24 may enroll in MATH 103 only if they enroll in this course. 2 hours lab per week. (Credit/No Credit only)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "105L",
        "title": "Pre-Calculus II Lab",
        "description": "Prerequisite: Required  for all conditionally prepared students  enrolled in MATH 105. All students in MATH 105 are encouraged to enroll in this course. This is a NC/CR hybrid enrichment laboratory for students  in MATH 105. This course  will include a self-paced modular online component. 3 hours lab per week. (Credit/No Credit only)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "131",
        "title": "Mathematical Ideas",
        "description": "Prerequisites: Passing score on or exemption from the ELM Exam or credit in MATH 093. General Education course intended to acquaint the student with basic mathematical ideas. (Available for General Education Basic Skills Mathematics.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "150AL",
        "title": "Calculus I Laboratory",
        "description": "Prerequisite: Required for all Conditionally prepared students enrolled in MATH 150A or 255A. All students in MATH 150A and 255A are encouraged to enroll in this course. This is a Credit/No Credit hybrid enrichment laboratory for students in MATH 150A and 255A. This course will include a self-paced, modular online component. 3 hours lab per week. (Credit/No Credit only)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "150BL",
        "title": "Calculus II Laboratory",
        "description": "Prerequisite: Required  for all Conditionally prepared students enrolled in MATH 150B or 255B. All students in MATH 150B and 255B are encouraged to enroll in this course. This is a Credit/No Credit hybrid enrichment laboratory for students in MATH 150B and 255B. This course will include a self-paced modular online component. 3 hours lab per week. (Credit/No Credit only)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "255A",
        "title": "Calculus for the Life Sciences I",
        "description": "Prerequisites: Listed in Table 1. Students who are Conditionally prepared must have credit for or concurrently enroll in MATH 150AL. Knowledge of trigonometry is assumed. First semester of a short course in calculus. Topics in calculus of functions of one variable including techniques of differentiation applications to graphing extreme problems and an introduction to integration. Not open for credit to students who have successfully completed MATH 150A. (Available for General Education Basic Skills Mathematics.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "255B",
        "title": "Calculus for the Life Sciences II",
        "description": "Prerequisites: Listed in Table 1. Students who are Conditionally prepared must have credit for or concurrently enroll in MATH 150BL. Techniques of integration series applications functions of several variables and partial differentiation. Not open for credit to students who have successfully completed MATH 150AB.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "262",
        "title": "Introduction to Linear Algebra",
        "description": "Prerequisite: MATH 150B. Systems of linear equations matrices determinants eigenvalues vector spaces and linear transformations as well as introduction to inner products on Rn and spectral theorem for symmetric matrices.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "310",
        "title": "Basic Concepts of Geometry",
        "description": "Probability and StatisticsPrerequisites: Passing score on or exemption from the ELM Exam or credit in MATH 093 and completion of MATH 210 with a grade ofC or better. Articulated course from another college equivalent to MATH 210 may only satisfy the course prerequisite for MATH 310. Students passing such a course with aC or better will still need to fulfill the ELM Exam requirement. Second course for students intending to teach in elementary or junior high school. Geometry as a system; congruence and similarity through construction with straightedge and compass; transformational geometry; the nature of measurement precision and accuracy; basic principles of probability and statistics. Not available for credit toward the Major or Minor in Mathematics.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "320",
        "title": "Foundations of Higher Mathematics",
        "description": "Prerequisite: MATH 150B. The goal of this course is to help students transition from a primarily computational mode of doing mathematics to a more conceptual mode. The emphasis will be on proofs which are taught in the context of elementary number theory combinatorics and analysis; the language of sets relations order equivalence classes functions and cardinality is introduced. Students are expected to write large numbers of proofs and communicate mathematical ideas clearly.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "331",
        "title": "Mathematical Explorations",
        "description": "Prerequisites: Passing Score on the ELM Exam; Completion of the Lower Division writing requirement; Upper Division standing. A course designed to give students an appreciation of the diversity of mathematics and the spirit in which it is employed in various applications. The character and origin of key topics from different branches of mathematics are explored. The contributions of various cultures to the field are studied along with the use of mathematical models for physical problems. The development is conceptual rather than axiomatic and includes several supervised reading and writing assignments. One significant writing assignment is required. Strongly recommended for prospective teachers in all fields. (Available for General Education Basic Skills Mathematics.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "341",
        "title": "Applied Statistics I",
        "description": "Prerequisite: MATH 150B. Introduction to the practice of statistics emphasizing the role of probability. Includes basic probability discrete and continuous probability distributions expectation and variance sample surveys and experiments displaying and summarizing data sampling distributions central limit theorem inference for proportions chi-square test and least squares regression. Mathematics majors who are not in the Secondary Teaching Option may not receive credit for both MATH 340 and 341.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "360",
        "title": "Abstract Algebra I",
        "description": "Prerequisites: MATH 262 320. Survey course in abstract algebra. Introduction to groups rings fields and vector spaces.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "382",
        "title": "Introduction to Scientific Computing and Lab",
        "description": "Corequisite: MATH 262. This course gives students an introduction to basic numerical techniques and to programming using some of the common software packages used in mathematics. Students apply these techniques in projects from different branches of mathematics.(This course does not replace a rigorous course in numerical analysis.) 2 hours lecture 2 hours lab.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "391",
        "title": "Field Experience in the Mathematics of the Public Schools",
        "description": "Prerequisites: Multiple Subject Candidates\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "462",
        "title": "Advanced Linear Algebra",
        "description": "Prerequisites: MATH 262 320. Finite dimensional vector spaces linear transformations matrix polynomials canonical forms.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "481A",
        "title": "Numerical Analysis",
        "description": "Prerequisites: COMP 106/L or 110/L; MATH 262. Techniques of applied mathematics solution of equations interpolation numerical integration and numerical solution of differential equations.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "483",
        "title": "Mathematical Modeling",
        "description": "Prerequisites: MATH 340; 351. Applications of mathematical techniques to solve selected problems in ecology biology economics finance social sciences life sciences physical sciences and engineering. Models discussed include deterministic stochastic optimization static and dynamic ones. Emphasis is placed on the initial phase of building mathematical models and the final phase of interpreting the solutions in terms of real-life applications.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "493",
        "title": "Undergraduate Seminar in Mathematics",
        "description": "Prerequisite: Junior standing in the major. Students will study current topics in mathematical and/or statistical literature and will prepare written summaries and give oral presentations to the class. Students will be active participants in all seminars by asking questions and providing written critiques and summaries of the presentations of other students.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "See Independent Study under courses of study.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "MATH",
        "catalog_number": "499C",
        "title": "Independent Study",
        "description": "See Independent Study under courses of study.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "MATH",
        "catalog_number": "540",
        "title": "Regression Analysis",
        "description": "Prerequisite: MATH 440A. General linear model in matrix form simple and multiple regression analysis transformations variable selection multicollinearity analysis of variance robust regression logistic regression principal components and factor analysis. Statistical software utilized.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "552",
        "title": "Real Analysis",
        "description": "Prerequisite: MATH 501. Introduction to measure theory and Lebesgue integration and their application to probability theory. Monotone and dominated convergence theorems Fubinis theorem Fourier analysis and Banach spaces.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "581",
        "title": "Numerical Methods for Linear Systems",
        "description": "Prerequisite: MATH 462. Methods for solving large linear problems and eigenvalue problems are presented at an advanced level. Direct methods such as LU factorization Cholesky factorization and the Least Squares method and Iterative methods such as the Jacobi Gauss-Seidel SOR and conjugate Gradient methods are discussed in detail. Eigenvalue problems are solved via power iteration the QR method and the Jacobi method.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MATH",
        "catalog_number": "625",
        "title": "Advanced Mathematical Modeling",
        "description": "Selected problems in ecology biology economics finance social sciences life sciences physical sciences and engineering are used to develop advanced techniques of mathematical modeling.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "MATH",
        "catalog_number": "697A",
        "title": "Directed Comprehensive Studies",
        "description": "No course description.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "MATH",
        "catalog_number": "698B",
        "title": "Thesis or Graduate Project",
        "description": "No course description.\n",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "MATH",
        "catalog_number": "699B",
        "title": "Independent Study",
        "description": "See Independent Study under courses of study.\n",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "MCOM",
        "catalog_number": "630",
        "title": "Seminar in Analysis of Media Performance",
        "description": "Prerequisite: MCOM 600. Extended application of research and evaluation techniques as used in mass communication research to describe the quality of news media performance.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MCOM",
        "catalog_number": "696",
        "title": "Directed Graduate Research",
        "description": "No course description\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "MCOM",
        "catalog_number": "698C",
        "title": "Thesis or Graduate Project",
        "description": "Prerequisites: MCOM 690; Approval of sponsor.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "101L",
        "title": "Introduction to Mechanical Engineering and Lab",
        "description": "Prerequisite: MATH 102 104 105 150A or 150B or a passing score on the Math Placement Test (MPT) that satisfies prerequisites for MATH 150A or MATH 255A. Corequisite: ME 101. Freshman orientation course introducing the Mechanical Engineering Program the profession and the University.Tools of the trade -- the internet word processing spreadsheets power point computer-aided design basic lab measurement instruments commercial component catalogs and numerically controlled machine tools to support prototype fabrication -- are introduced in the context of engineering practice. Fundamental engineering analysis/design is explored through simple examples covering all aspects of mechanical engineering. 1 hour lecture 3 hours lab per week. (Available for General Education Lifelong Learning for ME majors.)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "186L",
        "title": "Computer-Aided Design and Lab",
        "description": "Prerequisites: ME 101/L; MATH 102 104 105 150A or 150B or a passing score on the Math Placement Test (MPT) that satisfies prerequisites for MATH 150A or MATH 255A. Corequisite: ME 186. Introduction to concepts in engineering graphics and their implementation with computer-aided design (CAD) parametric modeling tools. Creation of sketches parts assemblies and engineering drawings. Application to group project including oral and written reports. 1 hour lecture 3 hours of lab per week.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "280",
        "title": "Differential Equations for Mechanical Engineers",
        "description": "Prerequisite: Math 150B. Recommended preparatory course: Math 250. Introduction to differential equations used in engineering applications. Engineering analysis of physical systems described by differential equations: pendulums mass-spring damper R-L-C circuits vibrations beam bending heat transfer and hydrodynamics. Exploration of solution techniques including undetermined coefficients power series and Laplace Transform. Determination of initial/boundary conditions. Linear algebra and solution of systems of differential equations. Introduction to partial differential equations and separation of variables. Not available to students with credit for Math 280 or ECE 280.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "309",
        "title": "Numerical Analysis of Engineering Systems",
        "description": "Prerequisites: MATH 150B; ME 209 or COMP 106/L or ECE 206/L or CE 280/L. Features engineering problems which require the use of algorithms and numerical analysis to obtain a solution. Modern tools such as spreadsheets with imbedded high level-languages are used for analysis and code development. Program documentation that requires extensive use of computer-based technical writing skills with graphical presentations. Cross section of problems are selected from various branches of engineering. Two 3-hour labs per week.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "335",
        "title": "Mechanical Measurements and Lab",
        "description": "Prerequisite: PHYS 220B. Corequisite: ME 335L. Measurement of temperature pressure flow rate force and motion. Statistical methods for analysis of uncertainty and experiment design. Use of data acquisition software for data collection and storage. Analysis of dynamic response of instruments. Written and oral presentations of experimental results. 1 hour lecture one 3-hour lab per week.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "370",
        "title": "Thermodynamics",
        "description": "Prerequisites: MATH 250; PHYS 220A/L. Fundamental theories and engineering applications of thermodynamics with emphasis of First and Second Laws of Thermodynamics. Thermodynamic properties of solids liquids gases and mixtures. Work-producing and work-absorbing systems. Applications to design.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "386",
        "title": "Computer-Aided Analysis and Design and Lab",
        "description": "Prerequisite: ME 286. Corequisite: ME 330 386L. This course addresses the use of finite element analysis (FEA) tools for effective and efficient design of mechanical elements. A commercial general purpose FEA software application is used for the solution of non-trivial problems. Emphasis will be placed on the selection of suitable FEA models and interpretation and critical evaluation of the results. The integration of the use of FEA tools in a well-organized design process also is emphasized. Lecture material is complemented by laboratory case studies and a design project.  2 hours lecture 3 hours lab per week.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "390",
        "title": "Fluid Mechanics",
        "description": "Prerequisites: MATH 250; PHYS 220A/L. Fundamental equations of fluid mechanics are derived and applied to engineering problems with emphasis on understanding the physical principles involved. Basic developments are applied to compressible as well as incompressible fluids. Selective exploration of the state of the art of experimental knowledge in major areas of applications. Applications to design.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "434",
        "title": "Geometric Dimensioning and Tolerancing",
        "description": "Prerequisite: ME 330. Fundamental principles of geometric dimensioning and tolerancing (GD&amp;T) and their applications in computer aided mechanical design. Interpretation of fits limits and tolerances. Thorough analysis of coordinate and positional tolerancing. Gaging techniques material conditions and current standards examined. Design project required. Available for graduate credit. 3 hours lecture per week.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "435L",
        "title": "Mechatronics and Lab",
        "description": "Prerequisite: ECE 240/L. Corequisite: ME 435. Recommended corequisite: ME 335 or ECE 320. Machine and process control applications data acquisition systems sensors and transducers actuating devices hardware controllers transducer signal processing and conditioning. 2 hours lecture one 3-hour lab each week. (Cross listed with ECE 435/L)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "484",
        "title": "Control of Mechanical Systems and Lab",
        "description": "Prerequisite: ME 384. Corequisite 484L. Classical feedback control theory emphasizing mechanical systems. Time domain frequency domain stability criteria and system sensitivity techniques. Introduction to design compensation and methods. Digital computer simulation of translational and rotational mechanical hydraulic and pneumatic systems. Control system design projects. 2 hours lecture one 3-hour lab per week.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "485",
        "title": "Introduction to Environmental Engineering",
        "description": "Prerequisite: ME 370. Application of concepts of mass and energy balances to environmental problems as a basis for analyzing and understanding the multimedia aspect of environmental engineering. Introduction of principles of air-pollution control and global-climate change water and wastewater treatment groundwater contamination hazardous waste risk assessment and resource recovery. Qualitative and quantitative analysis of sources of pollutants and treatment and reduction processes. Description of pertinent environmental legislations.  A semester-long team design project is assigned.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "486B",
        "title": "Senior Design in Mechanical Engineering II",
        "description": "Prerequisite: ME 486A. Continuation and realization of the design project initiated in ME 486A. Project culminates in a final written report and oral presentation. Two 3-hour labs per week.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "493",
        "title": "Hydraulics",
        "description": "Prerequisite: ME 390. Fundamental principles of incompressible fluid flow and their applications to pipe flow open channel flow and the performance of hydraulic turbomachines. Flow in pipe systems ranging from simple series systems to complex branched networks. Uniform flows gradually varying flows rapid transitions and hydraulic jumps in open channels. Performance of radial mixed-flow and axial flow centrifugal pumps and turbines and of impulse turbines.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "515",
        "title": "Dynamics of Machines",
        "description": "Prerequisite: ME 415. Recommended Corequisite: ME 501A. Forces motion and inertia in machines. Analysis of linkages cams rotor dynamics reciprocal and rotational balancing whirl modes and orbits and signature analysis of machine elements. Computer simulation of machinery dynamics including the inverse dynamics.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "575",
        "title": "Applied Heat and Mass Transfer",
        "description": "Prerequisite: ME 375 or equivalent. Continuation of ME 375 with emphasis on the convective modes of heat and mass transfer. Heat exchangers evaporation boiling condensation high speed flows and combined processes are considered with application to design.\n",
        "units": "4",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "675A",
        "title": "Conductive and Radiative Heat Transfer",
        "description": "Prerequisite: ME 375. Theory and applications of the conductive and radiative modes of heat transfer. Analytical and numerical methods for single- and multi-dimensional steady state and transient conduction. Numerical and analytical techniques as applied to radiative exchanges between diffuse and specular surfaces and transfer through absorbing-transmitting media.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "ME",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisite: Classified status in the MSME program. Registration is by permission number only through the ME Graduate Coordinator.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MGT",
        "catalog_number": "370",
        "title": "Management Skills Development",
        "description": "Prerequisite: Grade ofC or higher in MGT 360. BUS 302/L is a prerequisite for Business majors. A presentation of major concepts of the behavioral sciences that apply to the management of organizations. Focus is on understanding factors and developing skills that affect the behavior and ultimately the performance of individuals and groups within organizations.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MGT",
        "catalog_number": "450",
        "title": "Organization Change and Development",
        "description": "Prerequisites: Grade ofC or higher in MGT 360; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L is a prerequisite for Business majors. Examines current practices in the application of behavioral science knowledge to organization change issues. Focus is on the dynamics of change as well as current diagnostic techniques and intervention strategies.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MGT",
        "catalog_number": "456",
        "title": "Negotiation and Conflict Management",
        "description": "Prerequisites: Grade ofC or higher in MGT 360; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L is a prerequisite for Business majors. Primary objective of this course is to introduce students to current theories and processes for negotiation and conflict management as practiced in a variety of settings. The course also builds students\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MGT",
        "catalog_number": "460",
        "title": "Strategic Human Resource Management",
        "description": "Prerequisites: Grade ofC or higher in MGT 360; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L is a prerequisite for Business majors. Examination of the formulation and implementation of human resource policy at the strategic level. Emphasis is placed on how human resource functions can integrate with the overall strategy of the firm to make the firm more competitive.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MGT",
        "catalog_number": "468",
        "title": "Crisis Management",
        "description": "Prerequisites: Grade of C or higher in MGT 360; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L is a prerequisite for Business majors. The aim of this course is to help students understand how and why crises occur in organisations and what can be done to manage them better. Specifically the course aims to educate students so that they are able to prepare for and respond to crisis their organization may experience. Students will learn the concepts models frameworks and tools of Crisis Management (CM) and apply them in various cases and exercises. More importantly students will develop a comprehensive and integrated CM framework.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MGT",
        "catalog_number": "499C",
        "title": "Independent Study",
        "description": "Prerequisites: Consent of Department Chair and consent of an instructor to act as sponsor; Grade ofC or higher in MGT 360; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L is a prerequisite for Business majors. In order to do an Independent Study assignment in the College of Business and Economics a student must have at least a 3.0 overall GPA a 3.0 or higher GPA in all major courses and a 3.0 or higher GPA in his/her option courses. A student who does not meet these grade point requirements will not receive credit for any MGT 499 that he/she may take. Admission is based on evidence of ability to pursue Independent Study in-depth and on approval of a project submitted at the time of registration. Regular progress meetings and reports are required throughout the semester. Completion of the project is required before credit may be received. Enrollment in Independent Study is not allowed for the purpose of substitution for an existing course. A maximum of 6 units of Independent Study (MGT 499) may be earned in the College of Business and Economics. Further a maximum of 12 units may be earned by combining Internship (MGT 498) and Independent Study (MGT 499).\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MGT",
        "catalog_number": "693",
        "title": "Strategic Management",
        "description": "Prerequisite: Taken during last year of course work for MBA students. An integrative seminar dealing with broad business policy problems via the case method. There will be definition and analysis of internal and external factors affecting the development of the objectives and policies of the firm. The course stresses the interrelationships of major functional areas and the pervasive adjustments that may result from changes in a specific policy. Students are expected to use their personal experience and apply the analytical tools obtained from specialized courses in the solution of organization-wide problems. Emphasis is placed on case study methodology. \n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MKT",
        "catalog_number": "348",
        "title": "Consumer Behavior",
        "description": "Prerequisite: MKT 304 (Marketing majors must attain a grade ofC or higher) or consent of instructor. BUS 302/L are prerequisites for Business majors. Comprehensive study of behavioral models and concepts to help understand evaluate and predict consumer behavior in terms of marketing implications. Determinants of consumer behavior are explored to gain understanding of the complex forces as they affect the marketplace. Emphasis is upon understanding the processes that influence the acquisition consumption and disposition of private and public sector goods and services.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MKT",
        "catalog_number": "356",
        "title": "Marketing Metrics and Insights",
        "description": "Prerequisites: MKT 304 (Marketing majors must attain a grade of “C” or higher); BUS 302/L are prerequisites for Business majors. This course covers analytics using practical applications and focuses on developing actionable insights. It provides a broad overview of key analytic strategies concepts issues challenges and tools to interpret review and critique current marketing strategies employed. Metrics and key performance indicators are analyzed to determine the best ways to enhance effectiveness of blogs marketing campaigns SEO SEM emails and emerging social mobile and video data using quantitative and qualitative competitive tools.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MKT",
        "catalog_number": "441",
        "title": "Sales Management",
        "description": "Prerequisites: MKT 304 (Marketing majors must attain a grade ofC or higher) or consent of instructor; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L are prerequisites for Business majors. Activities and organization of the sales department. Methods employed by sales managers in selecting training and supervising salespeople; selling methods materials and campaigns; distribution channels and territories; pricing budgets controls and sales research. Lectures cases discussions and guest speakers.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MKT",
        "catalog_number": "443",
        "title": "Retail Management",
        "description": "Prerequisites: MKT 304 (Marketing majors must attain a grade ofC or higher) or consent of instructor; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L are prerequisites for Business majors. Retailing methods from the standpoint of the owner and manager. Buying planned stocks inventory control markup accounting for stock control pricing style merchandising and advertising. Emphasis on problems of retail management including departmentation personnel control supervisory training store layout and store location.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MKT",
        "catalog_number": "448",
        "title": "Digital Marketing",
        "description": "Prerequisites: MKT 304 (Marketing majors must attain a grade ofC or higher) or consent of instructor; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L are prerequisites for Business majors. Introduces the student to the principles of internet marketing. Focuses on the use of internet technologies as they have come to be used for the marketing selling and distribution of goods and services. The course makes use of lectures readings cases guest speakers and student projects.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MKT",
        "catalog_number": "459",
        "title": "Social Media Marketing",
        "description": "Prerequisites: MKT 304 (Marketing majors must attain a grade of “C” or higher); MKT 448; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher BUS 302/L are prerequisites for Business majors. This course focuses on the use of online social media as a marketing tool to reach consumers and the strategic use of digital media and platforms for professional purposes. Students will learn how to use a variety of tools on the Internet to conduct research develop online marketing campaigns and increase the competitive advantage of marketing strategies. These techniques will help students engage consumers and assess the results of social media strategies in a rapidly changing environment.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MKT",
        "catalog_number": "498B",
        "title": "Marketing Internship",
        "description": "Prerequisite: Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L and MKT 304 (Marketing majors must attain a grade ofC or higher) are prerequisites for Business majors. Individual study pertaining to present or future career. Consultation with instructor to determine program that includes field assignments and reports. A maximum of 12 units may be earned by combining Field Assignments and Reports (MKT 498) and Independent Study (MKT 499). An Academic Internship course. (Credit/No Credit only)\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "220L",
        "title": "Construction Materials Lab",
        "description": "Prerequisite: PHYS 100A/L. Corequisite: MSE 220. Introduction to basic construction materials and their properties including concrete masonry metals woods and thermal materials. Introduction to finishes equipment and specialty items. Not available for credit toward an Engineering Degree. 2 hours lecture-discussion 3 hours technical activity-lab per week.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "227L",
        "title": "Engineering Materials Lab",
        "description": "Prerequisite: MATH 150A. Preparatory: CHEM 101/L; MSE 227; PHYS 220A/L. Introductory lab course in engineering materials and their properties. Includes experiments in mechanical properties heat treatment metallography corrosion properties and X-ray diffraction. Course culminates in a special project in which students identify design and perform an experiment of their choosing. One 3-hour lab per week. (Design units: 0.25)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "248L",
        "title": "Engineering CAD and Graphics and Lab",
        "description": "Prerequisite: MATH 250. Corequisite: MSE 248. Development of concepts and skills in engineering graphics and computer-aided design (CAD). Reading interpretation and preparation of working drawings; dimensioning and tolerances; and interpretation of blueprints. Orthographic and isometric representations; auxiliary and sectional views. 3-dimensional solid modeling. Application of CAD graphics in the design and development of an assembly. 2 hours lecture-discussion 3 hours lab per week. (Design units: 1.0) (May be used in General Education Lifelong Learning if required by students major.)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "303",
        "title": "Innovation, Invention and Technology",
        "description": "Invention and TechnologyPrerequisite: Completion of Lower Division writing requirement. Exploration of the history processes methods and creators of technological innovations and inventions. Global contributions creator diversity and technological failures are addressed. Critical assessments of technological innovation and invention. Not available for credit toward an Engineering Degree. (Available for General Education Lifelong Learning.) (IC)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "362",
        "title": "Engineering Statistical Applications",
        "description": "Prerequisites: CE 240; MATH 250. Development and application of probabilistic and statistical methods for selected classes of engineering design and analysis problems. Applications to product and structural design engineering experiments and processes and the reliability of engineering systems.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "406",
        "title": "Engineering Cost Analysis",
        "description": "Recommended Preparatory: MSE 304 362. Principles of cost analysis and estimating for the evaluation of engineering design and production with emphasis on evaluating innovations and inventions. Case studies and practical application experiences. Available for graduate credit.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "MSE",
        "catalog_number": "410",
        "title": "Production Systems Modeling and Lab",
        "description": "Prerequisite: Instructor consent. Corequisite: MSE 410L. Design and analysis of production systems. Fixed flexible and programmable automation. Modeling and simulation of alternative production systems in conjunction with the systems-design process. 2 hours lecture-discussion 3 hours lab per week. Available for graduate credit. (Design units: 2.5)\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "412",
        "title": "Manufacturing Process and Lab",
        "description": "Prerequisites: MSE 227/L 248/L; CE 240. Corequisite: MSE 412L. Manufacturing processes for cost-effective high-quality production. Consideration of technical capabilities and limitations of alternative methods. Includes forming removal casting joining heat treating molding finishing and coating. Course project required. Laboratory experiments include heat treating deep drawing powder metallurgy casting injection molding fabricating composites friction coefficients analysis and milled surface evaluation. 2 hours lecture-recitation 3 hours lab per week. Available for graduate credit. (Design units: 1.5)\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "488BCS",
        "title": "MSEM Senior Design II",
        "description": "Prerequisite: MSE 488A. Continuation of MSE 488A. Includes a community service opportunity with activities relating to concepts and theories presented. MSE 488A and 488BCS must be completed during the same academic year. 6 hours of lab per week. Not available for Graduate Degree Program credit. Offered Spring semester. (Design units: 2.0)\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "504",
        "title": "Engineering Management",
        "description": "Prerequisite: Instructor consent. Principles and applications for effective management of technology projects people budgets and schedules. Organizing and motivating people and controlling activities. Managing research development design marketing and production functions in engineering and technology. Ethical considerations in engineering and technology management. (Design units: 0.5)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "507",
        "title": "Lean Manufacturing Systems",
        "description": "Prerequisite: MSE 407 or instructor consent. Concepts and principles of lean manufacturing systems. Methods and tools for application to manufacturing systems improvement. Practices and projects for effective design and implementation of lean manufacturing operation production control and quality systems.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "536",
        "title": "Introduction to Advanced Biomaterials",
        "description": "Prerequisite: Instructor consent. The interaction between the human body environment and synthetic materials including materials for medical implants and for dental restoration and appliances is explored. Tissue engineering biosensing imaging and drug delivery interact directly with biomaterials. Consideration of new technologies that dependon overcoming present material limits and improving material/biological environment interactions.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "550",
        "title": "Thin Film Technology",
        "description": "Prerequisite: Instructor consent. The basic processes for the deposition of films and coatings. Physical vapor deposition (PVD); evaporation sputtering and ion plating chemical vapor deposition (CVD) and plasma-assisted chemical vapor deposition (PACVD); electrodeposition and electroless plating. Thermal spraying plasma spraying and detonation gun technologies. The scientific background basic processes as well as relationships and applications of each process will be discussed. (Design units: 0.5)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "602",
        "title": "Entrepreneurship and Innovation for Engineering Professionals",
        "description": "Prerequisites: MSE 504 and 608C or equivalent. Starting organizing and managing engineering and technology research design and production. Technology and innovation; technological strategy and forecasting; technical entrepreneurship; evolving organizations; capitalization; and intellectual property.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "611",
        "title": "Robotics and Programmable Automation",
        "description": "Prerequisite: Instructor consent. Recommended Preparatory: MSE 511/L. Introduction to the design of programmable automation with robotic applications. Concepts principles and applications of programmable automation in manufacturing environments. Methods tools practices and projects for design and implementation of programmable automation systems.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "614",
        "title": "Intelligent Manufacturing",
        "description": "Prerequisite: Instructor consent. Software and methodologies for integrating intelligence into manufacturing such as artificial intelligence and expert systems fuzzy logic agent software case-based reasoning feature-recognition intelligent maintenance and monitoring. Methods of capturing expertise and knowledge for developing intelligent systems. Development of knowledge-based systems. Understanding examples of intelligent manufacturing available in industry.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "618",
        "title": "Six Sigma Quality Engineering",
        "description": "Prerequisite: MSE 601 or instructor consent. Overview and evolution of continuous improvement methodologies. Comparison of product-related and process-related Six Sigma methodologies. Integration of operating philosophies applied statistics and project management in continuous improvement deployment. Phases of Six Sigma methodology and application of computing technologies to quality engineering projects. Advanced topics in Six Sigma continuous improvement design.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "690",
        "title": "Materials Engineering Research Practicum",
        "description": "Prerequisite: Instructor consent. Applications of advanced materials and processes engineering laboratory research techniques and methodologies to studies of current interest such as nanotechnology MEMS sensors smart materials microelectronics optoelectronics bio-materials and environmentally-assisted cracking of advanced materials.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MSE",
        "catalog_number": "697MGT",
        "title": "Engineering Management Directed Comprehensive Studies",
        "description": "Preparatory: Classified status in M.S. Engineering Management; Satisfactory completion of at least 27 semester units in formal program of study; Supervising faculty advisor and Graduate Coordinator permission. Preparation for and completion of written comprehensive case studies culminating experience requirement for the Master of Science in Engineering Management Degree. (Credit/No Credit only)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "MUS",
        "catalog_number": "105",
        "title": "Understanding Music",
        "description": "History of Western music traditions examining musical style and structure relationships with other art forms and aspects of their roles in Western culture. Lecture listening discussion and outside concert attendance. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "MUS",
        "catalog_number": "107",
        "title": "Music Today",
        "description": "Survey of music in our society including selected material from rock jazz pop folk traditional show film and art styles as well as the impact of technology on todays musical life. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "MUS",
        "catalog_number": "112L",
        "title": "Musicianship II and Lab",
        "description": "Preparatory: MUS 111/L. Corequisite: MUS 112. Development of basic skills in music making including ear training sight singing conducting exercises melodic and rhythmic dictation and fundamental terminology. 1 hour lecture 2 hours lab.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MUS",
        "catalog_number": "120L",
        "title": "Arts Immersion: Music and Lab",
        "description": "Prerequisite: Restricted to students in the ITEP-Freshman Option Program. Introduction to the study of music based on the Visual and Performing Arts Framework for California Public Schools. Concepts of music are explored through materials and skills appropriate for use in elementary classrooms. Music fundamentals are applied through the development of skills in singing and playing basic classroom instruments. Students will apply and integrate knowledge of music as an art form with the other arts domains (theatre visual art and dance) as well as the 4 strands of the Visual and Performing Arts Framework. 1 hour lecture 2 hours lab per week.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MUS",
        "catalog_number": "170",
        "title": "University Chorus",
        "description": "Study of musical styles and rehearsal techniques through the performance of choral literature. For majors and non-majors. 3 hours per week.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "MUS",
        "catalog_number": "179A",
        "title": "Symphonic Wind Ensemble",
        "description": "Preparatory: Audition. Study and performance of musical literature written for winds and percussion with stylistic and historical emphasis. 3 hours per week.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "MUS",
        "catalog_number": "179B",
        "title": "Symphonic Wind Ensemble",
        "description": "Preparatory: Audition. Study and performance of musical literature written for winds and percussion with stylistic and historical emphasis. 4 hours weekly. Minimum of 2 hours per week rehearsal outside of class is required.\n",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "MUS",
        "catalog_number": "181B",
        "title": "Jazz Ensemble",
        "description": "Preparatory: Audition. Rehearsal and performance of literature written for large jazz ensemble. 4 hours per week. Minimum of 2 hours per week rehearsal outside of class is required.\n",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "MUS",
        "catalog_number": "189",
        "title": "Jazz Combo",
        "description": "Preparatory: Audition. Small jazz groups of 3 to 7 players performing repertoire commonly associated with the jazz idiom. Emphasis on improvisational skills.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "MUS",
        "catalog_number": "191L",
        "title": "Fundamentals of Music Technology and Lab",
        "description": "Preparatory: MUS 111/L or equivalent. Corequisite: MUS 191. Introduction to uses concepts techniques and terminology of computing through music applications. Experience with current hardware and software for music notation sequencing synthesis and music performance and practice. Consideration of ethical aesthetic economic and social problems in technology applications. (Available for Music majors as General Education Lifelong Learning.)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MUS",
        "catalog_number": "210B",
        "title": "Keyboard Musicianship IV",
        "description": "Preparatory to A: MUS 110B. Preparatory to B: MUS 210A. 3rd and 4th semester group piano instruction. Continued development of skills introduced in MUS 110B. Special emphasis on performance and interpretation of piano compositions in various styles. Basic skill development in choral and instrumental score reading sight-reading accompaniments and developing improvisations in 2- and 3-part forms. 2 hours lab per week. Music Education Majors take MUS 233 instead of 210B.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "MUS",
        "catalog_number": "212",
        "title": "Musicianship IV and Lab",
        "description": "Corequisite: MUS 214. Preparatory: MUS 211/L. Development of basic skills in music making including ear training; sight singing; melodic rhythmic and harmonic dictation; conducting exercises; and fundamental terminology. 1 hour lecture 2 hours lab.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MUS",
        "catalog_number": "214",
        "title": "Harmony II",
        "description": "Corequisite: MUS 212/L. Preparatory: MUS 213. Chromatic harmony modulation keyboard and instrumental styles.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "MUS",
        "catalog_number": "221",
        "title": "Song Writing",
        "description": "Preparatory: MUS 211/L 213. Analysis of representative hit song literature for principles of structure and content. Development of application skills through assignments.\n",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "NURS",
        "catalog_number": "426",
        "title": "Nursing Systems Issues and Ethics",
        "description": "Preparatory: All 300-level Nursing courses. Deals with issues arising within the community the health-care systems and the profession of nursing that influence self-care agency and the development of nursing systems. Discusses ethical aspects of providing therapeutic self-care. Regular written assignments required.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "NURS",
        "catalog_number": "428L",
        "title": "Community and Population Health Nursing and Lab",
        "description": "Prerequisites: All 300-level Nursing courses; HSCI 488; NURS 426. Corequisite: NURS 428. Theory and multicultural society. Study of self-care agency and therapeutic self-care needs of individuals families the community and society. Regular written assignments required. Clinical experience in community health agencies under the leadership of nursing faculty. Credit given only if a passing grade is earned. 3 hours lecture 6 hours lab per week.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PERS",
        "catalog_number": "102",
        "title": "Elementary Persian II",
        "description": "Prerequisite: PERS 101 or instructor consent. Continuation of the fundamentals of Persian including grammatical structure reading writing and practice of the spoken language. Discussion of Persian history and culture is integrated into the lessons. May not be challenged. (Available for General Education Comparative Culture Studies.)\n",
        "units": "4",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "150",
        "title": "Introduction to Philosophical Thought",
        "description": "Prerequisite: EPT score of 151 or higher or credit in Developmental Writing 098 or completion of GE Analytical Reading/Expository Writing. Introduction to philosophy emphasizing the concepts of knowledge reality and mind with attention to such topics as skepticism dogmatism common sense materialism mind-body dualism the existence of God and free will. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "170",
        "title": "Philosophy and Popular Culture",
        "description": "In this course students will examine philosophical themes within popular culture and will use philosophy to investigate how they relate to popular culture.  (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "202",
        "title": "Modern Philosophy",
        "description": "Prerequisite: EPT score of 151 or higher or credit in Developmental Writing 098 or completion of GE Analytical Reading/Expository Writing. Critical examination of topics in modern philosophic thought selected from the writings of such figures as Descartes Spinoza Locke Leibniz Berkeley Hume and Kant. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "343",
        "title": "Indian Philosophy",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Survey of Indian philosophy from the Vedic period to the modern era with attention to relationships between Indias philosophies history and culture. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "350",
        "title": "Epistemology",
        "description": "Prerequisites: Completion of the Lower Division writing requirement; 3 units of Philosophy. An investigation into ways of acquiring knowledge and into traditional epistemological problems. Attention will be given to major positions such as empiricism and rationalism foundationalism and coherentism and skepticism and to theories of knowledge such as reliabilism and contextualism. The course also will include regular sessions on philosophical writing and methodology. Regular written assignments will be required.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "446",
        "title": "Advanced Social and Political Philosophy",
        "description": "Prerequisites: 6 units of Philosophy including PHIL 360 or 365. An advanced analysis and evaluation of selected topics in social and political philosophy such as the nature of justice equality liberty political rights and the law.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PHIL",
        "catalog_number": "497",
        "title": "Senior Research Seminar",
        "description": "Preparatory: Senior standing; At least 21 units in Philosophy courses. Extended research project on a topic of the students choice. Collaborative learning is required. Team projects are encouraged. Focus is on formulating a thesis and pursuing appropriate means of developing it in a research project. Class meetings focus on research methodologies and on students discussion of their projects.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHYS",
        "catalog_number": "100A",
        "title": "General Physics I",
        "description": "Prerequisite: MATH 103 or 104 or 105 or a score on the Mathematics Placement Test (MPT) sufficient for entry into MATH 255A. Introductory course in physics. Topics covered include mechanics heat and sound. (Students using this course to satisfy the Natural Sciences requirement in General Education may satisfy the corresponding lab requirement by completing course PHYS 100AL.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PHYS",
        "catalog_number": "100B",
        "title": "General Physics II",
        "description": "Prerequisite: PHYS 100A. Continuation of PHYS 100A. Topics covered include electricity and magnetism light and modern physics. (Students using this course to satisfy the Natural Sciences requirement in General Education may satisfy the corresponding lab requirement by completing course PHYS 100BL.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PHYS",
        "catalog_number": "220A",
        "title": "Mechanics",
        "description": "Prerequisite: Chemistry and Biochemistry Majors: MATH 150A or 255A. Recommended Corequisite or Preparatory: Chemistry and Biochemistry Majors: MATH 150B or 255B. Dynamics and statics of particles and rigid bodies harmonic vibrations and fluid mechanics. (Students using this course to satisfy the Natural Sciences requirement in General Education may satisfy the corresponding lab requirement by completing course PHYS 220AL.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PHYS",
        "catalog_number": "220B",
        "title": "Electricity and Magnetism",
        "description": "Prerequisites: PHYS 220A. For Chemistry and Biochemistry Majors: MATH 150B or 255. Recommended Corequisite or Preparatory: MATH 250. Electric and magnetic fields circuit theory and electromagnetic induction. (Students using this course to satisfy the Natural Sciences requirement in General Education may satisfy the corresponding lab requirement by completing course PHYS 220BL.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PHYS",
        "catalog_number": "225",
        "title": "Physics I",
        "description": "Prerequisite: MATH 150A. Recommended Corequisite or Preparatory: MATH 150B. First course of a sequence intended primarily for physical science majors. Calculus-based course on mechanics fluids waves and acoustics.\n",
        "units": "4",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PHYS",
        "catalog_number": "227L",
        "title": "Physics III Lab",
        "description": "Recommended Corequisite or Preparatory: PHYS 227. 3 hours per week.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PHYS",
        "catalog_number": "305L",
        "title": "Physics of Music Laboratory",
        "description": "Corequisite: PHYS 305. Preparatory: Completion of the Lower Division writing requirement. This course is currently taught entirely and only online. History and development of the science of sound and music physical concepts necessary for the study of wave motion mechanics of the construction of sound and musical tones and basic physical principles involved in the production of sound in instruments and the human voice including studies of the production of language. A good understanding of the composition of sounds and musical tones is obtained without detailed mathematics through experiments carried out in the home or other locations using the students computer with installed software. A final project is required. (Available for General Education Natural Sciences.) (IC)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PHYS",
        "catalog_number": "366",
        "title": "Experimental Physics II",
        "description": "Preparatory: MATH 250 262 280; PHYS 227/L. Advanced experimental techniques in physics with topics including optics nuclear physics thin-film characteristics microwaves data acquisition via computer interface computer simulations solar observations and other topics chosen by the instructor. Students are trained in advanced experimental techniques and complete 2 experimental modules for 2 units of credit. 6 hours per week.\n",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHYS",
        "catalog_number": "402",
        "title": "Analytical Mechanics II",
        "description": "Preparatory: MATH 262; PHYS 301. Noninertial reference frames rigid body motion coupled oscillations nonlinear mechanics scattering vibrating string and Fourier analysis. Available for graduate credit\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHYS",
        "catalog_number": "420",
        "title": "Modern Optics",
        "description": "Preparatory: PHYS 311 375. Propagation of electromagnetic waves. Geometrical optics. Physical optics including refraction reflection interference diffraction and polarization. Atomic spectroscopy. Lasers. Available for graduate credit.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHYS",
        "catalog_number": "489",
        "title": "Mathematical Methods in Physics II",
        "description": "Prerequisite: PHYS 389 or graduate standing; Preparatory: MATH 380 PHYS 375 (may be taken concurrently). Topics include complex variables ordinary and partial differential equations special functions and boundary value problems with physical applications. Available for graduate credit.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PHYS",
        "catalog_number": "498",
        "title": "Undergraduate Thesis",
        "description": "Preparatory: Admission to Honors Program in Physics.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHYS",
        "catalog_number": "630",
        "title": "Statistical Physics",
        "description": "Preparatory: PHYS 431 451 600. Theoretical foundations of thermodynamics and statistical mechanics for equilibrium and non-equilibrium systems. Applications to Bose and Fermi assemblies real gases liquids solids solutions phase transitions and chemical reactions.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHYS",
        "catalog_number": "696A",
        "title": "Directed Graduate Research",
        "description": "No course description.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHYS",
        "catalog_number": "696C",
        "title": "Directed Graduate Research",
        "description": "No course description.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHYS",
        "catalog_number": "698F",
        "title": "Thesis",
        "description": "Preparatory: Classified graduate status; Permission of the Department; Instructors consent to serve as Thesis Advisor. Dissertation of a specialized advanced topic in physics such as a critical evaluation and extension of an existing theoretical treatment the construction and use of advanced research apparatus or an original theoretical analysis.\n",
        "units": "6",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "PHYS",
        "catalog_number": "699C",
        "title": "Independent Study",
        "description": "Preparatory: At least 1 graduate course in Physics; Instructor consent. Investigation of a special topic in physics with emphasis on advanced theoretical or experimental skills. See Independent Study under Courses of Study.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "225",
        "title": "Elements of International Relations",
        "description": "Analysis of the basic historical geographical economic ideological and strategic factors that underlie and condition conflict and cooperation among actors in the contemporary international system. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "321",
        "title": "Comparative Political Ideologies",
        "description": "Examines compares and contrasts a range of political ideologies and their interpretation and application in contemporary societies. Attention is paid to defining the role and function of ideologies in specific contemporary states. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "347",
        "title": "The Judicial Process",
        "description": "Examination of the dynamics of the national and state judicial systems with emphasis on the workings of the Supreme Court within American separation of powers; internal procedures of decision making; external influences on the courts; the politics of selecting judges; and relations with other political institutions.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "355",
        "title": "American National, State and Local Governments",
        "description": "State and Local GovernmentsPrerequisite: Not open to students who have taken POLS 155. Detailed study of the structures and functions of the national government and California state and local governments. Special attention given to the legislative and executive branches in the policy-making and administrative processes as well as the constitutional bases for these processes. (Satisfies the Title 5 United States Constitution requirement and the California state and local governments requirement.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "POLS",
        "catalog_number": "361",
        "title": "Introduction to Public Policy",
        "description": "Introduction to public policy approaches contexts processes and outcomes.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "403",
        "title": "State and Local Government",
        "description": "Study of the political administrative and judicial systems of states counties cities and special districts. Intergovernmental relations functions trends and current problems. (Satisfies the Title 5 California state and local government requirement.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "406",
        "title": "Analyzing Policy Problems",
        "description": "Prerequisite: POLS 372. Systematic and critical approach to designing public policies. Integrates theory and social science techniques so students may apply the methods models and tools of policy analysis to particular cases and problems that confront policy makers.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "POLS",
        "catalog_number": "412",
        "title": "Modern Western Political Theory",
        "description": "Analysis of the major political theories and ideologies from Machiavelli and the Renaissance through Hobbes Locke the Enlightenment Rousseau Burke and Marx. Regular written assignments required.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "427A",
        "title": "Model United Nations and Lab",
        "description": "Corequisite: POLS 427AL. Begins with a general analysis of the role of the U.N. in world politics and comparative foreign policy. Particular emphasis is then placed on the foreign policy of the country to be represented and the internal and external factors on which that policy is based. Seminar format with group presentations and simulations. May not be repeated. (Offered Fall semester.)1 hour seminar 4 hours involving group presentations and simulations.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "POLS",
        "catalog_number": "429",
        "title": "United States Foreign Policy",
        "description": "Analysis of the contemporary declaratory and action policies pursued by the U.S. in the conduct of its foreign relations. Various conceptual models such as ends/means analysis decision making and economic determinist are tested and evaluated in terms of their descriptive analytical and predictive utility.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "441",
        "title": "Interest Groups",
        "description": "Study of the tactics and aims of interest groups in their efforts to  mold public opinion and to influence legislators executives judges and administrators.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "445",
        "title": "Political Behavior",
        "description": "Introduction to political behavior; the influences of culture ideology and social structure on political life; group influences on political behavior and major factors in leadership; and psychological bases of participation in normal and extreme politics.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "450",
        "title": "Jurisprudence",
        "description": "Critical survey of the modern schools of jurisprudence and their treatment of law and such legal concepts and problems as obligation responsibility punishment and the limits and purposes of law. The works of students of jurisprudence or legal philosophy are supplemented with descriptive accounts of the nature and operation of modern legal systems.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "457A",
        "title": "Constitutional Law I",
        "description": "General principles of federal and state constitutional law the powers of the national government and federal-state relations. Study of the leading decisions of the U.S. Supreme Court.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "461",
        "title": "Environmental Policy",
        "description": "Study and evaluation of the political process governing the making of environmental policy. Specific issues covered include energy  policy land use air and water pollution and hazardous and  toxic waste disposal.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "POLS",
        "catalog_number": "471A",
        "title": "Proseminar",
        "description": "Prerequisites: POLS 372; Intended for seniors only (juniors require instructor consent). Advanced research in a subfield in political science. (A) American Government (B) Comparative Government (C) International Relations (D) Political Theory (E) Public Administration and Public Policy and (F) Public Law.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "POLS",
        "catalog_number": "471E",
        "title": "Proseminar: Public Administration and Public Policy",
        "description": "Prerequisites: POLS 372; Intended for seniors only (juniors require instructor consent). Advanced research in a subfield in political science. (A) American Government (B) Comparative Government (C) International Relations (D) Political Theory (E) Public Administration and Public Policy and (F) Public Law.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "POLS",
        "catalog_number": "480",
        "title": "The Politics of Globalization",
        "description": "Prerequisite: Upper Division standing. Introduction to some of the major changes that have accompanied the processes of globalization during the last 30 years including identifying and addressing the positive and negative consequences of these changes. Discussion of different approaches to globalization; its technical and historical roots; and the economic political ethical and cultural consequences of globalization. The case of NAFTA and its 3 members\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "POLS",
        "catalog_number": "494J",
        "title": "Judicial Internship",
        "description": "Prerequisite: Instructor consent. Students are assigned to a Superior Court judge to observe the inner workings of the Los Angeles  County Superior Court. Through observation of trials settlement conferences plea bargains and preliminary hearings students develop a familiarity with the processes of the judicial system and the issues  facing the legal system.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "POLS",
        "catalog_number": "599C",
        "title": "Independent Study",
        "description": "Prerequisite: Instructor consent.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "150",
        "title": "Introduction to Psychology",
        "description": "Designed to give students an understanding and appreciation of the scientific approach to human behavior thought and action and to provide the basic conceptual framework for studying the cognitive emotional and social aspects of human activity. Students are required to spend approximately 2.5 hours during the term in research-related activities. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "PSY",
        "catalog_number": "312",
        "title": "Psychological Aspects of Parenthood",
        "description": "Prerequisites: PSY 150; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. Analysis of motivations and skills necessary for parenthood and the effect of various parental attitudes and practices on the development of the self. Historical presentation of changes in parenting styles cross-cultural views of parental practices and current information on the results of deviations in parental care. Examination of alternate family styles\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "320",
        "title": "Statistical Methods in Psychological Research and Lab",
        "description": "Prerequisites: PSY 150 MATH 140 or equivalent. Corequisite: PSY 320L. Recommended Preparatory: PSY 301. Analysis of statistical decision-making procedures used in psychological research. Lab: Considers problem-solving techniques and computational methods needed to analyze data obtained in psychological experiments. 3 hours lecture-discussion 2 hours lab per week.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "321",
        "title": "Research Methods in Psychology and Lab",
        "description": "Prerequisites: PSY 320/L; Completion of Lower Division writing requirement. Corequisite: PSY 321L. Recommended Preparatory: PSY 301. Study of principles and techniques used to design and evaluate psychological research using simple and advanced research designs. Lab: Includes use of various research methods in psychology research projects. 2 hours lecture-discussion 3 hours lab per week.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "327",
        "title": "Infancy and Early Childhood",
        "description": "Prerequisites: PSY 150; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. Relevant aspects of physical social cognitive and emotional change are highlighted as part of human development from conception to early childhood (8 years). Emphasis on study of the underlying processes and influences on human development. Cultural contexts of development key changes continuity and individual differences are examined. Includes evaluation of selected theories contemporary issues and practical applications. This course fulfills the 300-level Developmental Psychology Cluster requirement for Psychology Majors. (Cross listed with CADV 327.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "351",
        "title": "Behavioral Psychology and Therapy",
        "description": "Prerequisites: PSY 150 PSY 250; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. The focus of this course is on how we learn certain behaviors why we behave as we do and how human behavior can be modified. Topics include basic concepts research methods used to study adaptive and maladaptive behaviors assessment procedures intervention strategies and outcomes self-management and ethical considerations in practice. This course fulfills the 300-level Clinical/Personality Psychology Cluster requirement for Psychology Majors.  \t*This course serves in a series of courses that prepares students to apply for the Board Certified Assistant Behavior Analyst (BCaBA) Exam.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "361",
        "title": "Adolescence",
        "description": "Prerequisites: PSY 150; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. Analysis of the physical cognitive social and emotional changes from puberty to adulthood. Examines contemporary youth culture from a historical and cross-cultural perspective. Discusses evaluation of age norms and deviant development. Project involving some aspect of adolescent development is required. This course fulfills the 300-level Developmental Psychology Cluster requirement for Psychology Majors. (Cross listed with CADV 361.)\n",
        "units": "4",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "367",
        "title": "Cognitive Psychology",
        "description": "Prerequisites: PSY 150; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. Analysis of the mechanisms by which people gather and process information from the environment. Basic phenomena of perception and cognition are discussed with an emphasis on experimental studies on such topics as pattern recognition attention memory language reasoning and problem solving. This course fulfills the 300-level Cognitive Psychology Cluster requirement for Psychology Majors.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "382",
        "title": "Principles of Human Factors",
        "description": "Prerequisites: PSY 150; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. Overview of the interdisciplinary field of human factors a professional specialization that considers how best to accommodate human needs in real world systems. Focuses on cognitive perceptual behavioral and physiological principles as they relate to the design of devices products and systems in order to enhance human performance and satisfaction. Representative topics include principles of information processing human characteristics and limitations environmental stressors user safety and applied research techniques. This course fulfills the 300-level Cognitive Psychology Cluster requirement for Psychology Majors.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "426",
        "title": "Contemporary Trends in Psychology",
        "description": "Prerequisites: PSY 150; Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory: PSY 301. Trends and issues in current psychological theories and systems.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "460",
        "title": "Counseling and Interviewing",
        "description": "Prerequisites: PSY 310; Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory: PSY 301. Intensive study of current approaches to individual counseling and psychotherapy particularly for students seeking preparation for graduate programs. Format allows students to present research findings discuss current theories and experience therapy situations through role play and supervised counseling.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "497C",
        "title": "Proseminar in Psychological Research",
        "description": "Prerequisites: PSY 150; Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory: PSY 301. Introduction to psychological research and writing through supervised individual projects and field work. 6 units maximum may be taken for credit.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "499C",
        "title": "Independent Study",
        "description": "Prerequisites: PSY 150; Completion of the Upper Division Writing Proficiency Exam with a score of 8 or higher. Recommended Preparatory: PSY 301. 6 units maximum may be taken for credit.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "524",
        "title": "Multivariate Analysis Computer and Lab",
        "description": "Prerequisite: PSY 420/L. Corequisite: PSY 524L. Analysis of multivariate research data in psychology using packaged computer programs. Covers standard techniques with applications in psychology. Choice of analytic technique is discussed as are methods of screening data to assure appropriateness of techniques. Lab: Provides direct experience with computing facilities for conducting multivariate analysis and computational methods extending statistical analysis provided by computer output. 3 hours lecture-discussion 2 hours lab per week.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "581",
        "title": "Teaching of Psychology",
        "description": "Prerequisite: Instructor consent. This course focuses on the theories skills preparation and practices required for serving as an instructional aide in Psychology courses. Topics include course preparation skills for fostering student learning theories of assessment effective strategies for improving student writing using technology in the classroom diversity sensitivity and treatment of special populations as well as ethical and legal issues faced in the classroom. An emphasis will be made on both traditional and recent educational research findings and their implementation for effective teaching. Students attend scheduled seminars on course topics and serve outside the course as a teaching aide to a professor in the Department of Psychology. Available for graduate credit with consent of students graduate advisor. May be taken for a maximum of 6 units. 1 hour seminar 2 hours by arrangement each week. (Credit/No Credit only)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "655CC",
        "title": "Fieldwork in Psychological Services",
        "description": "Prerequisite: Instructor consent. Taught as an academic University-based experience designed to accompany students supervised practica field work and/or internship. Course content varies as a function of the practicum setting (e.g. hospital community agency) and client age level (e.g. children adolescents adults). May be repeated (up to 4 semesters) and taken for varying number of units (1-5).\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "692A",
        "title": "Seminar in Research Methodology",
        "description": "Prerequisites: Graduate standing in Psychology; Instructor consent. This course focuses on advanced research methods in psychology including review of the scientific approach research designs and measurement and threats to validity. Emphasis is on critical analysis of research in terms of the research objective the adequacy of research design and the justifications for the conclusions.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "697C",
        "title": "Directed Comprehensive Studies",
        "description": "No course description.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "PSY",
        "catalog_number": "699A",
        "title": "Independent Study",
        "description": "Prerequisites: Written proposals for independent study in areas of special interest to the advanced student must be submitted for Departmental approval prior to registration.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PSY",
        "catalog_number": "699C",
        "title": "Independent Study",
        "description": "Prerequisites: Written proposals for independent study in areas of special interest to the advanced student must be submitted for Departmental approval prior to registration.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PT",
        "catalog_number": "703L",
        "title": "Applied Biomechanics for the Physical Therapist II and Lab",
        "description": "Prerequisite:  PT 702/L.  Corequisite:  PT 703.  Designed to explore the biomechanical and kinesiological principles underlying movement of the spine and lower extremities during functional activities and exercise.  Lectures will focus on applied biomechanics of the lower extremities and spine with an emphasis on functional activities such as gait. Labs will focus on the application and integration of these principles and assessment of  LE and spine function including manual muscle testing goniometry and dynamometry. Case studies will be integrated into both lecture and lab.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PT",
        "catalog_number": "706L",
        "title": "Applied Neuroscience and Lab",
        "description": "Prerequisite: Admission to the DPT Program. Corequisite: PT 706. Study of the normal structure and function of the peripheral and central nervous system as a basis for understanding clinical manifestations seen in individuals with neurologic disorders.  Includes an in-depth introduction to neuroanatomy neuropharmacology and neurophysiology.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PT",
        "catalog_number": "711L",
        "title": "Physical Therapy Management and Lab",
        "description": "Prerequisite: PT 710. Corequisite: PT 711. Covers basic patient  handling techniques and therapeutic physical modalities. Emphasis on body mechanics draping positioning bed mobility transfer  ambulation ambulatory aids wheelchair mobility and fitting. Physiological and physical bases for selection and application of therapeutic physical modalities including thermal mechanical electromagnetic and hydrodynamic agents in treatment of musculoskeletal neuromuscular and integumentary disorders.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PT",
        "catalog_number": "720L",
        "title": "Musculoskeletal Practice Management I and Lab",
        "description": "Prerequisite: PT 700/L. Corequisite: PT 720. The first of a 3-semester course sequence focusing on the examination and treatment of patients with musculoskeletal dysfunction. Emphasis is on the evaluation of and evidence-based treatment interventions for orthopaedic peripheral dysfunction and impairments.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PT",
        "catalog_number": "740L",
        "title": "Musculoskeletal Practice Management III and Lab",
        "description": "Prerequisites: PT 720/L PT 730/L. Corequisite:  740. The third of a 3-semester course sequence focusing on the development of differential diagnosis advanced examination and evaluation skills and therapeutic intervention strategies in the management of musculoskeletal system dysfunction.  Emphasis is on critical thinking collaborative learning in clinical decision making evidence-based practice and service learning. Students will apply theory to practice through service learning administering physical therapy services at CSUNs Student Health Center to meets the needs of a diverse student community.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PT",
        "catalog_number": "742L",
        "title": "Pediatric Practice Management and Lab",
        "description": "Prerequisite: Successful completion of all second-year course work in the DPT Program. Corequisite: PT 742.  Examination evaluation and management of pediatric populations with genetic and acquired disorders resulting in impairments in neurologic and musculoskeletal systems cognitive dysfunction and learning disabilities. Emphasis is on developing observation skills to identify developmental delays in infants and toddlers.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PT",
        "catalog_number": "752A",
        "title": "Evidence-Based Physical Therapy Practice II",
        "description": "Prerequisite: PT750. Corequisite: PT752C.  This course is designed to provide the students with guidance in the appraisal of physical therapy and medical research literature in order to develop a written doctoral project to a) evaluate the effectiveness of physical therapy interventions associated with specific physical therapy and medical diagnoses by completing a systematic literature review or b) provide physical therapy related research evidence by conducting a supervised research study.  Students will develop the doctoral proposal in PT 752A (Credit/No Credit Only).\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PT",
        "catalog_number": "773",
        "title": "Medical Imaging",
        "description": "Prerequisite:  Successful completion of all second-year course work in the DPT Program. Introduction to principles of imaging including radiography CT scans MRI special studies and arthrography used in diagnosing a variety of medical conditions and diseases.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PT",
        "catalog_number": "778",
        "title": "Topics in Wellness and Prevention and Lab",
        "description": "Wellness and Health and LabPrerequisite: Successful completion of all second-year course work in the DPT Program. Corequisite: PT 778L.  Advanced concepts and application of therapeutic exercise to address functional limitations and to promote health fitness and wellness.  Emphasis is on therapeutic exercise as an optimal intervention to address impairments and to promote health and quality of life.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PT",
        "catalog_number": "780",
        "title": "Professional Practice II",
        "description": "Prerequisite: Successful completion of all second-year course work in the DPT Program. This course examines the role of the professional physical therapist as an administrator and manager of patient care personnel and resources with consideration for ethical medical and legal implications. Various business models reimbursement practices and organizational structures will be examined.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "PT",
        "catalog_number": "792",
        "title": "Clinical Practice II",
        "description": "Prerequisite:  PT 794/I.  Preparation for the students\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "QS",
        "catalog_number": "115",
        "title": "Approaches to University Writing",
        "description": "Prerequisite: EPT score of 149 or higher. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction syntax and grammar as well as the elements of prose style. Students receive credit for only 1 course chosen from AAS CAS CHS ENGL PAS or QS 115. Individual tutoring is available through the Learning Resource Center. (Available for General Education Analytical Reading/Expository Writing.) (IC)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "RS",
        "catalog_number": "100",
        "title": "Introduction to Religious Studies",
        "description": "Study of the elements of religion and selected contemporary religious issues. Examines such subjects as myth and ritual the sacred and profane dreams and theophanies priests and prophets science and religion history and religion and the expansion of religion today. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "150",
        "title": "World Religions",
        "description": "Study of selected major world religions with emphasis on tribal religions and the historic international faiths of Asia and the Near East. Investigates rituals ethics institutional structures and the cultural ethos of religions as well as their myths doctrines and sacred texts. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "240",
        "title": "Approaches to the History of Religions",
        "description": "An investigation of major and selected religions around the world using social-scientific methods from history sociology political science and anthropology. Students learn why various religions change over time and how they interact with their particular social and cultural environments. Examples are taken from ancient and modern religions and from major and tribal religions including new religious cults. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "306",
        "title": "American Religious Diversity",
        "description": "Survey of the religion of groups in America who are marginal to or outside of the historically dominant mainstream Protestant and civil religion ethos. An Information Competence course. Available for General Education Comparative Cultural Studies.) (IC)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "311",
        "title": "Religion and Film",
        "description": "Examines how film artists address the major religious issues of our time including the nature of reality sources of transcendence the nature of good and evil in the self and society and the possibilities of renewal and hope.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "345",
        "title": "Christianity",
        "description": "Eastern Orthodox Roman Catholic Protestant and non-traditional forms of Christianity compared and contrasted with one another in their historical and social contexts.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "361",
        "title": "Contemporary Ethical Issues",
        "description": "Emphasizes the development of skills in critical thinking through analysis of such contemporary ethical issues as abortion euthanasia genetic engineering sexual behavior racism gender bias punishment animal rights the environment and the relationships between religion and morality. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RS",
        "catalog_number": "390",
        "title": "Buddhism",
        "description": "Study of the fundamental concepts in Theravada and Mahayana Buddhism (e.g. nirvana enlightenment karma dharma). Examines the historic development of these concepts in their various Asian cultural and geographic settings. An Information Competence course. Available for General Education Comparative Cultural Studies.) (IC)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "151A",
        "title": "Backpacking",
        "description": "Introduction to backpacking as an outdoor pursuit. Emphasis on proper use of equipment and safety of participants in the natural environment. This course is designed to give students a general overview of and experience in backpacking and spending time in the back country. Arranged field trips are required.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "151C",
        "title": "Winter Mountaineering",
        "description": "Advanced instruction in mountaineering and travel in the back country with particular emphasis on snow and ice climbing avalanche prediction physical effects of high altitudes and winter camping skills. Emphasis is on technique proper use of equipment environmental practices and safety. Arranged field trips are required.\n",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "151F",
        "title": "Survival",
        "description": "Studies in the skills essential for wilderness survival in a variety of physical environments. Includes topics of shelters water navigation and edible plants and animals. Emphasis on techniques with primitive technologies environmental conservation and safety. Arranged field trips are required.\n",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "151H",
        "title": "Caving",
        "description": "Introduction to the safe exploration of caves and the underground environment including cave formations and features techniques and special hazards. Emphasis on safety techniques for horizontal and vertical caves environmental awareness and skill development. Arranged field trips are required.\n",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "202L",
        "title": "Planning Programs and Events for Recreation Experiences and Lab",
        "description": "Prerequisite: Lower Division writing requirement; Corequisite: RTM 202. Overview of the program- and event-planning processes as they relate to the provision of human and leisure services through play recreation and leisure experiences for a variety of service recipients and settings. Lab experiences applying skills and principles addressed.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "RTM",
        "catalog_number": "251",
        "title": "Recreation and the Natural Environment",
        "description": "Study of recreational use of outdoor/natural areas and the trends creating changing patterns of use. Overview of human animal and vehicular impacts on the outdoor recreation resources. (Available for General Education Applied Arts and Sciences.) (IC)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "267",
        "title": "Sailing and Lab",
        "description": "Prerequisite: Elementary swimming skills. Corequisite: RTM 267L. Development of the skills and art of sailing including the development of basic seamanship small boat handling competency safety procedures and regulations and introductions to competitive sailing and ocean cruising. 1 hour lecture 2 hours lab per week.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "RTM",
        "catalog_number": "278",
        "title": "Exploring the World of Tourism, Hospitality, Recreation, and Parks",
        "description": "Investigation of the contributions of play leisure and recreation to the social psychological and economic well-being of individuals and groups incorporating local regional national and international perspectives. Regular written assignments are required. Recreation and Tourism Major requirement. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "300",
        "title": "Recreation and Community Development",
        "description": "Prerequisite: Lower Division writing requirement. Examination of the multicultural dynamics of urban life and recreations role in building community and in developing youth capacity and  indigenous leadership.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "RTM",
        "catalog_number": "303",
        "title": "Promotion of the Recreation Experience",
        "description": "Interpretation and promotion of recreation programs and services through the use of media processes and resources marketing principles and computer applications.\n",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "305",
        "title": "Dynamics of Early Childhood Play",
        "description": "Study of play in relation to the childs early growth and development. Implications for functional environmental and leadership dimensions of organized play experiences in early years. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the Schedule of Classes for the CS Designation.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "310L",
        "title": "Adventure Recreation and Human Relations and Lab",
        "description": "Prerequisite: Lower Division writing requirement. Corequisite: RTM 310. Introduction to personal growth and adventure. Explores issues of identity racial and ethnic diversity gender and self-esteem through readings written assignments and recitation. Regular written assignments required. Lab: Introduction to adventure recreation and diversity issues through group initiatives and participation in a shared adventure of ropes course activities. (Available for General Education Lifelong Learning.) (IC)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "RTM",
        "catalog_number": "330",
        "title": "Women, Leisure and Ethnicity in the United States",
        "description": "Leisure and Ethnicity in the United StatesPrerequisite: Lower Division writing requirement. Examines the relationship among women ethnicity and leisure. Provides opportunities to investigate a variety of factors affecting women in the U.S. Regular written assignments required. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the Schedule of Classes for the CS Designation. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "RTM",
        "catalog_number": "403",
        "title": "Evaluation Research in Recreation and Human Services",
        "description": "Investigation into the fields and methods of recreation and leisure systems including special techniques and concepts of research as applicable to these systems.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "406L",
        "title": "Enhancing Childhood Creativity and Lab",
        "description": "Corequisite: RTM 406. Integrative seminar and lab experience focusing on the theoretical approaches for enhancing childhood creativity. The uses of play and fantasy are explored as the means for developing programs that are child-oriented. Regular written assignments are required. (Cross listed with CADV 406/L.)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "RTM",
        "catalog_number": "434",
        "title": "Accommodations Management",
        "description": "Preparatory: RTM 314. Students develop a sound understanding of the accommodations industry. Students will examine techniques issues and problems of rooms division management systems food and beverage and other functional areas according to hotel category. Review current information technology used in hotel operations.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "494C",
        "title": "Supervised Internship",
        "description": "Prerequisite: Senior standing. Supervised internship in professional recreation settings. (Credit/No Credit only)\n\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "RTM",
        "catalog_number": "560",
        "title": "Facility Design in Recreational Sport",
        "description": "Investigation of principles of design planning management and operation of recreational sport facilities. Students will be introduced to facility and event management facility components specifications recreation spaces specialty areas and facility trends.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "RTM",
        "catalog_number": "693B",
        "title": "Supervised Internship II",
        "description": "Prerequisite: Instructor consent. Second of 2 supervised internships requiring completion of 200 hours in an approved setting in recreational sport management or hospitality travel and tourism. The supervised internship is designed to provide a hands-on learning experience in management of recreational sport or tourism. The second internship should expand and provide further growth based on the first internship experience whether that be in the same organization or a different one. The internship will be used as a basis for the culminating Graduate Project or Thesis to be completed during the last semester of enrollment in the Graduate Program.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "RTM",
        "catalog_number": "698",
        "title": "Graduate Project or Thesis",
        "description": "Prerequisite: Instructor consent. Culminating experience for the Graduate Degree. Planning preparation and completion of a Graduate Project or Thesis on an advanced topic in the field of recreational sport management or hospitality travel and tourism.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "RUSS",
        "catalog_number": "102",
        "title": "Elementary Russian II",
        "description": "Prerequisite: Completion of RUSS 101 or equivalent. Not open to students who have attended schools where Russian was the language of instruction. Continuation of the study of the fundamentals of Russian grammatical structures reading practice in the spoken language. May not be challenged. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SCM",
        "catalog_number": "492",
        "title": "Supply Chain Management Strategy",
        "description": "Prerequisites: SCM 416 442 447 or equivalent; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L are prerequisites for Business majors. This is a capstone course that integrates various aspects of supply chain management. Students will use their previous work in transportation purchasing and quality processes to study current practices which should lead to higher levels of customer satisfaction and lower delivery costs. Designed to give students more practice in standard business skills especially communication skills analytic problem solving and cross-disciplinary integration. \n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SED",
        "catalog_number": "514",
        "title": "Computers in Instruction",
        "description": "Introduction to the instructional uses of the Internet local networks telecommunications text processing graphics desktop publishing educational software electronic reference tools teacher support tools databases spreadsheets and other software applications and related media. Use of such applications to access and evaluate information analyze and solve problems and communicate with other professionals. Strategies and skills to enable teachers to prepare their students to be lifelong learners in an information-based society. Meets technology education requirement for the Preliminary Credential.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "525EN",
        "title": "Methods of Teaching English",
        "description": "Required of all students enrolled in the English Credential Program. Restricted to candidates officially admitted to the Credential Program or already possessing a teaching credential. Methods course addressing strategies for teaching literature composition and language. The integrated approach for literature composition and language instruction is based on the California Model Curriculum Standards and the English/Language Arts Framework. See SED 525 Series.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "525MAL",
        "title": "Methods of Teaching Mathematics in the Secondary School and Lab",
        "description": "Restricted to candidates officially admitted to the Credential Program or already possessing a teaching credential. Corequisites: SED 525MA and 525MAL. Preparatory: MATH 150B or instructor consent. Topics include subject matter selection and classroom instruction in arithmetic algebra geometry trigonometry discrete mathematics and calculus. See SED 525 Series.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SED",
        "catalog_number": "525SL",
        "title": "Methods of Teaching Science in the Secondary School and Lab",
        "description": "Restricted to candidates officially admitted to the Credential Program or already possessing a teaching credential. Corequisites: SED 525S and 525SL. Objectives instructional methods curriculum and assessment in teaching science in the secondary school. Developing adapting evaluating and using strategies and materials for teaching science appropriate both to the special needs of the learners and the special characteristics of the science discipline. Objectives instructional methods and curriculum in teaching lab-based science in the secondary school. Developing adapting evaluating and using strategies and materials for teaching science labs appropriate both to the special needs of the learners and the special characteristics of the science discipline. See SED Series.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SED",
        "catalog_number": "529",
        "title": "Teaching English Learners in Multiethnic Secondary Schools",
        "description": "Required for candidates in all Single Subject Teacher Basic Credential Programs. Restricted to candidates officially admitted to the Credential Program or already possessing a teaching credential. Prerequisite: SED 511. Co-requisite: SED 521. Preparatory: SED 525xx. Addresses state and federal legal requirements related to English learners the California English Language Development (ELD) Standards school programs serving English learners language acquisition and teaching materials and strategies for English as a Second Language (ESL) and Specially Designed Academic Instruction in English (SDAIE). Also focuses on diagnostic and other assessments for English learners. Completion of field-based activities is required.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SED",
        "catalog_number": "555",
        "title": "Supervised Practicum for the Single Subject Credential",
        "description": "Required for candidates in the Four-Year Integrated (FYI-English FYI-Math) Junior-Year Integrated (JYI-English JYI Math) Accelerated Collaborative Teacher (ACT) and Traditional Single Subject Credential Programs. Prerequisites: SED 554 554S; Clearance from the Credential Office. Corequisite: SED 555S. Corequisite or Preparatory for Traditional FYI and JYI Programs: AAS/ARMN/CHS/ELPS/PAS 417; SED 521; SPED420. Corequisites for ACT Program only: ELPS 542A; HSCI 496AD; SED 521; SPED 542B. The Supervised Practicum is designed to provide teacher candidates with a Capstone field work experience in middle school or high school classrooms. Each candidate is supervised by an on-site collaborating teacher and a University supervisor. The candidate is responsible for teaching 3 classes daily and is at the school for a 4th class period daily for observation and conferencing for a schools entire semester or track. During the supervised field experience sequence of SED 554 and 555 each teacher candidate has experiences teaching English language learners and participates in 2 or more subject-specific teaching assignments. See the Credential Office for additional details. (Credit/No Credit only)\n",
        "units": "6",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SED",
        "catalog_number": "599A",
        "title": "Independent Study",
        "description": "No course description.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "599C",
        "title": "Independent Study",
        "description": "No course description.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "699A",
        "title": "Independent Study",
        "description": "No course description.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SED",
        "catalog_number": "699C",
        "title": "Independent Study",
        "description": "No course description.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "200",
        "title": "Social Crises of Today",
        "description": "Helps the student understand the bases of some of the major social crises of the present day. Topics include alcoholism delinquency and street crime ethnic tensions gambling international tensions organized crime political corruption and terrorism. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "303",
        "title": "The Family",
        "description": "Prerequisite: SOC 150. Family as a social institution on the basis of the data of ethnology history and contemporary studies. Special attention to contemporary culture patterns.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SOC",
        "catalog_number": "305",
        "title": "Culture and Personality",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Preparatory: ANTH PSY or SOC 150. Cross-cultural study of the development of individual personality in the socio-cultural milieu. Special attention is given to child -earing practices social personality social character mental health and illness and deviant behavior in several Western and non-Western societies. Not to be taken for credit in addition to ANTH 305. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SOC",
        "catalog_number": "324",
        "title": "Sociology of Sex and Gender",
        "description": "Prerequisite: Completion of Lower Division writing requirement. Preparatory: SOC 150. Analysis of contemporary and historical sex roles in major societal institutions including economic political educational legal and medical systems and institutions of marriage and family. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SOC",
        "catalog_number": "340",
        "title": "Sociology of Work",
        "description": "Prerequisite: SOC 150. Analysis of the structural context of work in contemporary society including preparation for access to different positions within the occupational structure. Study of work settings including formal and informal characteristics changes in the structure of work and case histories involving work experiences and occupational subcultures.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SOC",
        "catalog_number": "348",
        "title": "Juvenile Delinquency",
        "description": "Preparatory: SOC 250. Extent and distribution of delinquency with emphasis on the local area. Meaning implications and treatment of delinquency. Individual-level and social environmental theoretical explanations\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "355",
        "title": "Criminology",
        "description": "Preparatory: SOC 250. Nature of crime causal factors of criminal behavior and group control of the crime problem.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "357",
        "title": "Anti-Oppressive Social Work Practice",
        "description": "Prerequsite: SOC 150. Introduction to social work and social justice practice from an anti-oppressive perspective. Application of critical social work theories and anti-oppressive approaches in social work/social justice from micro through macro practice with emphasis placed on intersecting issues of privilege and oppression. Requires 40 volunteer practicum hours in approved community organization.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "401",
        "title": "Class, Status and Power",
        "description": "Status and PowerAnalysis of the distribution of wealth prestige and power. Study of the causes of poverty life chances of the poor lifestyles of the wealthy upward and downward mobility and class and group conflict in society.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "411",
        "title": "Sociology of Education",
        "description": "Sociological analysis of education as an institution of socialization including relevant theories its structure the challenges of diversity the complexities of the urban/suburban school setting and current professional issues. Focuses on how issues of diversity impact the institution at the macro level as well as the experiences of administrators teachers students families and communities.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "434",
        "title": "The Sociology of Law",
        "description": "Preparatory: SOC 250. Introduction to the sociological study of law and the legal system with emphasis on social analysis of criminal law and the courts. Specifically the course addresses social perspectives on the origins of law and law-making the application and enforcement of law and the administration of justice through the legal process. Critical thinking and writing skills are emphasized in the course through the use of legal case study essay examinations and a final research paper dedicated to the application of legal sociology to current crime issues.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "450",
        "title": "Medical Sociology",
        "description": "Survey of sociological theory and research techniques related to mortality illness and medical treatment. Emphasis on the epidemiological aspects of these phenomena in various groups hospitals community health settings and more.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "459",
        "title": "Child Welfare",
        "description": "Trends in the movement toward establishing the rights of the child to protection and care. Emphasis on the child and the law compulsory education school social work child labor legislation institutional and foster care for the healthy and the sick child and adoption legislation.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "467",
        "title": "Sociology of Religion",
        "description": "Sociological theories of religious behavior from Max Weber to the present. Comparative study of the relationships between the role ritual and belief systems of religious institutions and their social contexts.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "492",
        "title": "Human Behavior in the Social Environment",
        "description": "Prerequisites: SOC 345 356 357. This course presents students with a range of theories that seek to understand human behavior across the lifespan. It integrates biological psychological structural environmental political global and socio-cultural perspectives. This course also explores the relationship between the person and the environment including families groups organizations communities and institutions.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SOC",
        "catalog_number": "497L",
        "title": "Qualitative and Quantitative Research Methods and Lab",
        "description": "Prerequisite: SOC 364. Corequisite: SOC 497. Preparatory: SOC 202. Application of the scientific method to social phenomena and analysis of the techniques. Methods of collecting classifying interpreting and presenting social data. Lab: Problems and exercises with research design and data analysis.\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SOC",
        "catalog_number": "545",
        "title": "Seminar in Social Psychology",
        "description": "Advanced investigation of the dynamics of social interaction. Interdisciplinary research.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "690",
        "title": "Quantitative Research Methods",
        "description": "Advanced study of social research techniques with supervised application of research methods in a lab or field study situation.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOC",
        "catalog_number": "699C",
        "title": "Independent Study",
        "description": "No course description.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SOM",
        "catalog_number": "306",
        "title": "Operations Management",
        "description": "Prerequisite: SOM 120 or MATH 140. Recommended Corequisite or Preparatory: BUS 302/L. Discusses operational issues facing organizations and introduces operations management concepts and techniques. Students develop skills necessary to improve productivity and quality of operations in both manufacturing and service organizations. Topics include international competitiveness quality assurance forecasting design and control of operations systems creating value for the customer project management and supply chain and inventory management. \n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SOM",
        "catalog_number": "416",
        "title": "Supply Chain Management",
        "description": "Prerequisites: SOM 306; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L are prerequisites for Business majors. This course covers the fundamental concepts principles and tools associated with supply chain management. Topics include supply chain integration logistics network configuration inventory management strategic alliances procurement and outsourcing warehousing quality management global logistics and the impacts of information technology on supply chain management. Global implications will be discussed throughout the course. This course involves case studies a simulation game and a culminating term project. (Crosslisted with SCM 416.) \n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SOM",
        "catalog_number": "467",
        "title": "Quality Management and Control",
        "description": "Prerequisites: SOM 306 or MSE 304; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L are prerequisites for Business majors. Application of total quality control for improvement of products and services including both statistical techniques and managerial approaches. Control charts quality costs responsibility for quality quality at the source ethical issues and ISO 9000. International differences in philosophy of quality. \n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SOM",
        "catalog_number": "591",
        "title": "Business Analytics Foundation",
        "description": "Prerequisite: Permission of the Director of Graduate Programs. Statistical methods and stochastic models to support decision making by managers. Topics include: exploratory data analysis probability distributions and assessment expected value variation estimation of means and proportions hypothesis testing for one and several populations F test chi square test simple and multiple regression and correlation time series and forecasting decision trees waiting lines and simulation. Applications in service organizations and small businesses are provided along with applications for production organizations and large businesses. A key element is a group project involving the application of one or more course topics to a current business problem.  \n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SPAN",
        "catalog_number": "101",
        "title": "Elementary Spanish I",
        "description": "Prerequisite: Not open to students with oral proficiency or who have attended schools where Spanish was the language of instruction. Study of the fundamentals of Spanish including grammatical structures reading and practice in the spoken language. Credit will not be given for both SPAN 101 and 103. May not be challenged. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "4",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SPAN",
        "catalog_number": "103",
        "title": "Elementary Written Spanish I",
        "description": "Prerequisite: Open only to those with oral fluency in Spanish. Preparatory: Instructor consent subject to verification of oral skills at the beginning of the semester. Emphasizes the development of reading and writing skills and includes the study of specific areas of grammar. Reading selections emphasize Hispanic culture. Taught in Spanish. May not be challenged. Credit will not be given for both SPAN 101 and 103. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SPAN",
        "catalog_number": "304",
        "title": "Advanced Grammar and Composition",
        "description": "Prerequisite: Upper Division standing in Spanish. One-semester course consisting of the study of difficult problems of syntax unique to the Spanish language with composition exercises that develop students command of the written language.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SPAN",
        "catalog_number": "307",
        "title": "Introduction to the Analysis of Hispanic Literature",
        "description": "Prerequisites: SPAN 220B or equivalent. Reading discussion and practical analysis of selected works of Hispanic literature to acquire the basic knowledge of the genres archetypes and movements that are unique to it. Introduction to the analytical tools (terminology critical approaches research methodology and term-paper format) necessary to the study of the above. Conducted in Spanish.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SPAN",
        "catalog_number": "497",
        "title": "Comparative Structure of Spanish and English",
        "description": "Prerequisite: SPAN 395. Recommended for native speakers. Comparative study of the Spanish and English linguistic structures at the phonemic morphemic syntactic and semantic levels as they interact in the bilingual learning process.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SPAN",
        "catalog_number": "606",
        "title": "Seminar in a Genre",
        "description": "Topics vary from semester to semester. Conducted in Spanish.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "402",
        "title": "Promoting and Supporting a Positive and Inclusive School Climate",
        "description": "This course is designed to provide education specialist candidates with the skills and knowledge needed to promote and reinforce prosocial skills using positive behavior support strategies. The 3-tiered model (primary secondary and tertiary supports) to positive behavior support will serve as the organizing framework for this course. The first part of the course will focus on ways to promote positive and cooperative behaviors by using a variety of schoolwide and classroom management strategies including teaching and reinforcing expected behaviors active supervision clear communication and collaboration with team members and planned responses to challenging behavior (primary level of supports). The remainder of the course will focus on providing more intensive supports for students with more pervasive/complex behavioral and social needs (secondary and tertiary level of supports).  Relevant federal and state legislation and ethical considerations will be discussed.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "406",
        "title": "K-12 Literacy Instruction for Diverse Learners with Disabilities",
        "description": "Prerequisites: Restricted to Candidates admitted to the Education Specialist Credential Program and ITEP. This course is designed to prepare special education students to teach diverse learners with disabilities reading and language arts at the elementary and secondary levels. The course focuses on the design and delivery of comprehensive literacy programs consistent with state standards and the competencies and strengths of students with disabilities. Content specifically addresses word analysis fluency vocabulary academic language and comprehension and prepares students to pass the RICA exam. An emphasis is placed on the development and organization of differentiated instructional practices for students with disabilities based on findings from individualized assessment procedures.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SPED",
        "catalog_number": "416",
        "title": "Educating Diverse Learners with Disabilities and Working with Their Families",
        "description": "Prequisites for MM Program: SPED 400 403 MM 406. Prequisite or Corequisite for MM Program: SPED 501MM. Prerequisites for MS Program: SPED 400 406. Prerequisite or Corequisite for MS Program: SPED 504MS. Prerequsites for DHH Program: SPED 400 406. This course is designed to provide information regarding the education of diverse learners with disabilities. The course provides an overview of the needs of English language learners (ELLs) with disabilities with an emphasis on understanding and accepting differences in culture ethnicity language and abilities and disabilities of individuals. Candidates are introduced to state and federal laws related to students with disabilities and diverse needs. Knowledge and practices for becoming culturally competent educators are discussed taking into account the principles of language acquisition language proficiency differences in family backgrounds and systems and how these effect learning. Finally the course addresses ways of communicating effectively and respectfully with families.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SPED",
        "catalog_number": "506ECC",
        "title": "Early Childhood Special Education Internship Field Experience",
        "description": "Prerequisite: Must be enrolled in the Early Childhood Special Education Specialist Intern Program. SPED 506ECA: Prerequisites or Corequisities with first semester SPED 431 and 402. SPED 506ECB : Prerequisites or Corequisities with second semester SPED 532 537). SPED 506ECC: Prerequisities prior to third semester SPED 500 535 536; Corequisites with third semester SPED 520EC 538. Designed to provide ongoing support to candidates in the Early Childhood Special Education Intern Credential Program. Reflective supervision is provided through on-site visits by the instructor analysis of videos online discussions and monthly meetings. Class sessions involve discussion of teaching experiences video analysis problem-solving resource sharing and collegial support.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SPED",
        "catalog_number": "532",
        "title": "ECSE Curriculum and Instruction",
        "description": "May be taken prior to admission. Study of curriculum and methods for infants toddlers and preschoolers with disabilities focusing on the developmental areas of cognition play and social interaction and the CA Preschool Learning Foundations. The course includes an overview on designing environments to facilitate independent problem-solving and social interaction. (Offered once each year.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "538",
        "title": "Early Intervention Practices",
        "description": "Prerequisites or Corequisites: SPED 402 404 431 500 520EC 532 535 536 537. Corequisite: 578EC. Taken with or the semester before 578EC--Field Work in ECSE: Infant/Toddler. The course content is designed for graduate level students from relevant disciplines (e.g. early childhood special education communicative disorders child development nursing physical therapy). Students will identify their roles as members of an early intervention team serving families and their infants and toddlers with IFSPs. Course content focuses on the CA Infant/Toddler Learning and Development Foundations philosophies and recommended and evidence-based practices in the field of early intervention team models service delivery approaches and strategies to promote collaboration with families and other members of the educational team. (Offered once each year.)\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SPED",
        "catalog_number": "580ACT",
        "title": "Advanced Fieldwork/Student Teaching and Seminar in Mild/Moderate and Extensive Support Needs",
        "description": "Prerequisite: Restricted to candidates admitted to the Accelerated Collaborative Teacher (ACT) Preparation Program. Prerequisites for MM Program:  EED 565M or SED 525; ELPS 541A; SPED 400 404 406 501MM 541B. Corequisites for MM Program: ELPS 542A SPED 402 502MM 503MM 542B. Other specializations should contact their advisor. Offered Spring semester. This course is the final field work experience and seminar for the ACT Program. Teacher candidates complete this experience with a teacher trained as a coach who serves students with disabilities from culturally and linguistically diverse backgrounds. Field work consists of 66 field work hours and a full-day 12-week student teaching assignment in which the teacher candidate gradually assumes full responsibility for the complete instructional program. The candidate is provided supervision and guidance by the district coach and University supervisor. The seminar is designed to link credential course work with classroom practices and to provide collegial support to participants.\n",
        "units": "6",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SPED",
        "catalog_number": "580S",
        "title": "Advanced Specialist Fieldwork Analysis in Education of Learners with IEPS",
        "description": "Pre-requisites: Course work required for approval of SPED 580ECSE/MM/MS. Corequisite: SPED 580. This seminar meets at regularly scheduled times during the semester as a concurrent seminar with student teaching to provide professional development opportunities for analysis of the field work experience related to teaching effectiveness assessment individualized educational planning program evaluations case analysis and problem solving. Relationships with parents relationships with other professionals and issues related to assuming a professional role as a special educator are included. The seminar instructor facilitates reflective practice.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SPED",
        "catalog_number": "642",
        "title": "Students with Multiple and Sensory Impairments",
        "description": "Preparatory: SPED 400 431 508 or equivalent. Educational issues for students with intellectual disabilities who also have sensory impairments (visual and/or auditory). Information on specific visual and hearing disorders psychosocial implications of these disabilities on the developing child teaching strategies to address students with these disabilities and adaptations and accommodations. (Offered Spring semester only.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SPED",
        "catalog_number": "676",
        "title": "Clinical Case Management",
        "description": "Prerequisites: SPED 673 671 672; Admission to the Special Education Masters Program or Post-M.A. Degree Certificate Program in Educational Therapy. The focus of this course is on case management.  Students will analyze contextual influences such as the school family community and culture that impact a students performance and demonstrate the ability to serve in the role of case manager (e.g. prioritizing goals responding to parent concerns understanding school demands). This course is designed to build on the knowledge and skills from foundational educational therapy course work as related to establishing and maintaining effective efficient and ethical practices.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SPED",
        "catalog_number": "695A",
        "title": "Advanced Behavioral Support",
        "description": "(Offered Fall semester only.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SUST",
        "catalog_number": "310",
        "title": "Best Practices in Sustainability",
        "description": "In this course students will learn current and best practices for planetary sustainability on an individual institutional regional and global level.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "502",
        "title": "Human Behavior and Social Environment II",
        "description": "Prerequisites: SWRK 501; Graduate admission; Acceptance to the MSW Program. This is the second of 2 human behavior and social environment courses that provide understanding of human behavior and social environmental relationships from an ecological perspective. It will focus on the developmental dynamics of larger social systems specifically groups organizations and communities and their influence on individuals and families. The systems interdependence with political social cultural economic and natural environments is explored. Content emphasizes multiculturalism diversity and social justice in relation to social systems. This course will examine adult development in the context of social relationships and societal systems (both as shaped by and as shapers of) across early middle and late adulthood. The class will focus on individuals and families living in an urban setting from a strengths-based perspective.  Special attention will be given to diverse and vulnerable individuals and families living in urban settings--LGBTQIA emancipating foster youths community-released prisoners immigrant families and returning veterans.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "520",
        "title": "Social Work Practice in Multicultural Contexts",
        "description": "Prerequisites: Graduate standing; Acceptance to the MSW Program. This course is designed to assist graduate social work students in understanding and interacting in a culturally competent manner with the multitude of groups that are identified by race culture ethnicity class religion gender age sexual orientation mental or physical disability and regional and national origins that compose the diverse cultural mosaic of the U.S. The course also will cover issues relating to international social work practice and the increasingly interconnected global economy.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "523P",
        "title": "Generalist Field Education II and Placement",
        "description": "Prerequisite: SWRK 522. Field education in the professional foundation year is designed to permit the student to apply the knowledge skills and values learned in courses in the liberal arts social work practice social welfare policy and services human behavior in the social environment and social research in an educationally supervised experience. Students are required to complete approximately 250-300 hours of supervised practice during the course in an assigned social service agency. Agency assignments are made by the field coordinator after consultation with the student. (Letter grade only)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "535",
        "title": "Social Work Research Methods I",
        "description": "Prerequisites: Graduate standing; Acceptance to the MSW Program. This foundation course is designed to provide an introduction to research methods and to produce an appreciation of the research process. The course provides an overview of social science research methods useful for social work practice. The class provides the foundation of knowledge and skills that enable students to be intelligent consumers of science-based information to conduct social research and to critically evaluate social work practice.  Students will be prepared to participate in a range of social work research activities including: (a) conceptualization of research problems; (b) review of the literature; (c) research designs; (e) measurement; (f) data collection; and (g) evaluation of data. The student will gain an understanding of how research can facilitate and inform practice decisions and on-going evaluation of ones practice.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "602",
        "title": "Advanced Social Work Practice with Urban Families II",
        "description": "Prerequisites: SWRK 601; Second year standing. This course advances students knowledge and practice skills in working with individuals and couples. Utilizing a strengths-based person-in-environment perspective students are taught engagement assessment intervention evaluation and termination skills. Evidence-based practice models will be introduced teaching students to evaluate and critique their effectiveness with diverse clients. The major focus is on developing skill and competence with individuals within the context of their urban family and system.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "SWRK",
        "catalog_number": "623P",
        "title": "Specialist Field Education with Urban Communities II and Placement",
        "description": "Prerequisite: Second Year standing SWRK 622/P.  Corequisite: SWRK 623. Advanced Practice with Urban Families Field Practicum II is the second semester of the advanced concentration field practicum courses.  The course provides field education about the advanced concentration curriculum which focuses on social work with urban families.  This second practicum is designed to provide experience in larger system work with and on behalf of families coordinating with the content classroom learning.  During the second semester of field practicum students continue at their first semester assigned placement site while continuing to enhance their social work practice skills. Students are required to complete approximately 300-360 hours of supervised practice in their assigned social service agency. (Offered Spring semester) (Letter grade only)\n",
        "units": "1",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "TH",
        "catalog_number": "108A",
        "title": "Acting I: Fundamentals",
        "description": "This course develops foundational skills for the actor with an emphasis on ensemble building collaboration and creative problem solving. Acting exercises techniques and methods from a variety of performance styles will provide a comprehensive introduction to the roles and responsibilities of actors and directors. Fundamentals of the actors craft such as developing an effective work ethic appropriate rehearsal behavior and learning to integrate external evaluation will provide students with a strong foundation in theater performance. Class meets 4 hours per week.\n",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "111",
        "title": "Actors and Acting",
        "description": "Prerequisite: Not open to Theatre Majors. Introduction to theatre through an emphasis upon its central performer--the actor. Illustrative acting exercises. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "TH",
        "catalog_number": "190",
        "title": "Theatre Production Participation",
        "description": "Participation in various aspects of Theatre CSUNs production program including acting directing technical or managerial assignments. May be repeated once.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "222",
        "title": "Mapping World Theatre and Drama",
        "description": "Prerequisite: TH 102. Introductory survey of theatre history and dramatic literature of the world from antiquity to the present. Critical writing assignments required.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "TH",
        "catalog_number": "308A",
        "title": "Acting III: Scene Study",
        "description": "Prerequisite: TH 208A. Corequisites: TH 342M TH343V. Studio course emphasizing text analysis character development and scene study; application of these skills to modern and contemporary dramatic texts. 6 hours per week.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "TH",
        "catalog_number": "321A",
        "title": "World Theatre and Drama I",
        "description": "Prerequisite: TH 222. This course is the first part of an integrated study of world theatre and drama. It encompasses theatre history and dramatic literature of Asia Africa and Europe. Critical writing assignments required.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "TH",
        "catalog_number": "342M",
        "title": "Theatre Movement II",
        "description": "Prerequisite: Theatre 108M. Intermediate training of the body for stage movement including exercise for strength flexibility relaxation control physicalization and movement as a part of character development. 6 hours lab.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "TH",
        "catalog_number": "350",
        "title": "Cultural and Historical Perspectives for Theatre",
        "description": "Prerequisite: Completion of Lower Division requirements in Theatre Major. Preparatory: TH 321A/B. Historical elements as they relate to the staging of period plays including history of architecture furniture costume social modes and manners. Development of dramaturgical research skills. Extensive writing and analysis required.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "TH",
        "catalog_number": "362B",
        "title": "Intermediate Costume Crafts",
        "description": "Prerequisites: TH 262 262A. Intermediate principles of theory and application of costume crafts for the stage including use of equipment fabrics and materials appropriate to costume accessory and craft making and preparation of appropriate accessories. Required participation in a University-sponsored production.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "TH",
        "catalog_number": "363A",
        "title": "Intermediate Lighting Techniques",
        "description": "Prerequisites: TH 263 263A. Non-Theatre Majors consult Department advisor for equivalency. Intermediate course exploring stage lighting projection equipment lighting control systems optical systems color theory and current lighting graphic standards as they apply to stage film and video. Required participation in a University-sponsored production.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "TH",
        "catalog_number": "371",
        "title": "Creative Drama and Lab",
        "description": "Corequisite: TH 371L. Theory and techniques for developing the creative capacities of children and young people through dramatization; participation and leadership in creative drama. 4 hours per week.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "TH",
        "catalog_number": "381",
        "title": "Management Techniques for the Theatre",
        "description": "Prerequisite: Completion of Lower Division requirements in Theatre Major. Basic principles in management with emphasis on theatrical applications; personnel time budgeting procedures organization safety; setting and achieving objectives. 6 hours per week.\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "TH",
        "catalog_number": "382C",
        "title": "Theatre Management Practicum",
        "description": "Prerequisites: TH 381; Completion of Lower Division requirements in Theatre Major. Practical application of theatre management techniques. Required participation in a University-sponsored production. Maximum of 3 units may be earned.\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "TH",
        "catalog_number": "473",
        "title": "Dramatic Performance in the Secondary Language Arts Curriculum",
        "description": "Prerequisite: Junior or senior standing. Corequisite: TH 473L. Study and practical application of dramatic performance in secondary-education language arts curriculum. Introduction to and application of artistic and aesthetic tools and sensitivities required for creative expression. (Fulfills General Education Section C.2 requirements for English Subject Matter Program Majors only.)\n",
        "units": "2",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "TH",
        "catalog_number": "698C",
        "title": "Thesis or Graduate Project",
        "description": "Prerequisites: Classified graduate status; Approval of appropriate area faculty to form a Thesis or Graduate Project Committee; Formation of an approved Thesis or Graduate Project Committee; Completion of all additional requirements for the Degree. (Credit/No Credit only)\n",
        "units": "3",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "UNIV",
        "catalog_number": "62C",
        "title": "Supplemental Instruction in Writing: CAS 113B",
        "description": "UNIV 61/62 is a mandatory corequisite for 113A/B--Approaches to University Writing. Students enrolled in AAS CAS CH S ENGL PAS or QS 113 must enroll concurrently in Supplemental Instruction for which they will receive a maximum of 1 additional unit of non-Baccalaureate credit per semester. UNIV61/62 sessions are led by experienced peers who have been successful in writing courses.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "UNIV",
        "catalog_number": "62Q",
        "title": "Supplemental Instruction in Writing: QS 113B",
        "description": "UNIV 61/62 is a mandatory corequisite for 113A/B--Approaches to University Writing. Students enrolled in AAS CAS CH S ENGL PAS or QS 113 must enroll concurrently in Supplemental Instruction for which they will receive a maximum of 1 additional unit of non-Baccalaureate credit per semester. UNIV61/62 sessions are led by experienced peers who have been successful in writing courses.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "URBS",
        "catalog_number": "206",
        "title": "Introduction to Graphic Communication Tools Used by Urban Studies and Planning Professionals",
        "description": "This course will focus on graphic communication tools commonly used by planning professionals.  The development of maps charts drawings and 3D visualizations enhance the ability of professionals to interact with clients and the public.  The use of Geographic Information Systems (GIS) to perform spatial analysis and present spatial data will be emphasized.  The course will also provide a fundamental knowledge of computer aided design (CAD) for creating maps and drawings and of 3D visualization tools to enhance public understanding of proposals.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "URBS",
        "catalog_number": "310",
        "title": "Growth and Sustainable Development of Cities",
        "description": "Examination of the forces contributing to the form structure and sustainable development of cities. Emphasis on urban areas of the U.S. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "URBS",
        "catalog_number": "380",
        "title": "Los Angeles: Past, Present, Future",
        "description": "Multidisciplinary investigation of the Los Angeles urban area its patterns of population and resources distribution; its historical economic social and cultural developments; and policies models designed to cope with its problems and to develop its potential as an ethnically diverse metropolis on the Pacific Rim. Application of social science methodology. Series of faculty and guest speakers weekly discussion sessions and field trips. (Cross listed with HIST and POLS 380.) (Available for General Education Social Sciences.)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "URBS",
        "catalog_number": "415",
        "title": "The California Environmental Quality Act for Urban Planners",
        "description": "This course deals with Californias statutory requirements for environmental planning and policy. The focus of the course will be on the California Environmental Quality Act (CEQA) process that addresses issuance of Negative Declarations preparation of draft and final environmental impact reports (EIRs) litigation decision making and the requirements of professional consulting. A special emphasis will be placed on understanding the environmental implications of typical projects that occur in an urban setting.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "URBS",
        "catalog_number": "450",
        "title": "Senior Seminar in Urban Studies and Planning",
        "description": "Prerequisites: Senior standing; Completion of the Lower Division writing requirement. Advanced seminar on problems and issues in urban and environmental studies. Interdisciplinary symposia and opportunities for critical appraisal and exchange of ideas on special studies developed in or stemming from field work. Emphasis on case studies and other problem approaches.\n",
        "units": "4",
        "prerequisites": "{Err}",
        "corequisites": "{Err}"
    },
    {
        "subject": "URBS",
        "catalog_number": "640",
        "title": "Seminar in Planning for Communities and Local Economic Development",
        "description": "This course focuses on the study of human behavior as it is affected by basic human needs and urban conditions. Special attention will be given to: 1) the manner in which local neighborhoods and communities are integrated into the planning process and how needs are articulated; and 2) the manner in which local economic development can be affected by the planning process and by the integration of community participation. Supporting field trips and discussions with planners and project managers are planned.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]