[
    {
        "subject": "AAS",
        "catalog_number": "100",
        "title": "Introduction to Asian American Studies",
        "description": "Survey of research on Asian Pacific American experiences including: history community life language experience arts education politics and economics. Emphasizes research on Americans of Chinese Filipino Japanese Korean Southeast Asian South Asian and Pacific Island ancestry. Available for Section B of the Multicultural Requirement for Credential Candidates. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "100EOP",
        "title": "INTRO ASIAN AM STD",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "113A",
        "title": "Approaches to University Writing A",
        "description": "Prerequisite: EPT score of 139 and below.Expository prose writing with a focus on both content and form. Specific emphases shall include the exercise of logical thought and clear expression the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction syntax and grammar as well as the elements of prose style. Students receive credit for only 1 course chosen from AAS CAS CHS ENGL PAS or QS 113A. Students are required to also enroll in UNIV 060 (1 credit) or equivalent. Individual tutoring is available through the Asian American Studies Activities Center or the Learning Resource Center.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "113AOP",
        "title": "APPR UNIV WRTNG A",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "114A",
        "title": "Approaches to University Writing A",
        "description": "Prerequisite: EPT score of 140-148.Expository prose writing with a focus on both content and form. Specific emphases shall include the exercise of logical thought and clear expression the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction syntax and grammar as well as the elements of prose style. Students receive credit for only 1 course chosen from AAS CAS CHS ENGL PAS or QS 113A. Individual tutoring is available through the Asian American Studies Activities Center or the Learning Resource Center.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "115",
        "title": "APPR UNIV WRITING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "151",
        "title": "Fundamentals of Public Speaking",
        "description": "Prerequisites: EPT score of 151 or better or EPT; Successful completion of 113A or 114A or equivalent.This course is an introduction to public speaking and oral communications processes with particular emphasis on issues related to Asian American Studies and Asian Pacific American communities. In addition to basic skills students will be introduced to Asian Pacific American figures who have used oral communication as a way to address issues related to race ethnicity gender sexuality identity and community. Students will be required to deliver a variety of speeches. The course will include intensive practice in public speaking logical reasoning and critical reasoning. Students are required to attend 15 hours of public speaking events outside of the classroom. Crosslisted with CHS 151 PAS 151 and COMS 151/L. (Available for General Education Oral Communication.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "151EOP",
        "title": "FUND PUBLIC SPEAK",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "201",
        "title": "Race",
        "description": "Racism and Critical ThinkingPreparatory: Completion of the GE sections Analytical Reading/Expository Writing and Mathematics. Introduction to the process of critical thinking through the lens of race-based theories and selected historical and contemporary discourse of African Americans Asian Americans European Americans and Latinos on race relations and multiculturalism in American society. Examines contemporary social issues through the use of scholarly studies and a range of cultural texts in order to explore the effects of race and racism on the relationship between language and logic processes and form of reasoning and practices of critical reflection. Also examines intersection of race gender and class. (Available for General Education Critical Thinking.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "201EOP",
        "title": "RACE CRIT THINK",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "210",
        "title": "History of Asians in America",
        "description": "Introduction to the history of Asian Americans in the United States from the 1800s to the present. Students review the historical forces affecting immigration of the following communities: Chinese Japanese Filipino Korean South Asian Southeast Asian and Pacific Islander. Analysis of problems resulting from limited access to the social political and economic institutions of American society. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "220",
        "title": "Survey of Asian American Literature",
        "description": "Prerequisite: Completion of the Lower Division writing requirement.Survey of Asian American literature from the late 19th century to the present. Introductory study of prose fiction and non-fiction poetry and drama written by Americans of Chinese Japanese Korean Filipino Southeast Asian South Asian and Pacific Islander ancestry. Regular writing assignments required. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "230",
        "title": "Asian Americans and the Media",
        "description": "Study of the effects of mass media on the history and development of Asians in America. Particular attention to Asian American images in film television the internet and advertisements. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "321",
        "title": "Asian American Fiction",
        "description": "Prerequisite: Completion of the Lower Division writing requirement.Study of Asian American fiction written by Americans of Chinese Japanese Korean Filipino South Asian and Southeast Asian ancestry. Regular writing assignments required. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "340",
        "title": "Asian American Women",
        "description": "Prerequisite: Completion of the Lower Division writing requirement.Multidisciplinary analysis of women in the diverse Asian Pacific American communities. Study of the historical social political and economic factors that have impacted the role and status of Asian Pacific American women in U.S. society. Regular writing assignments required. Available for Gender and Womens Studies Minor Ethnic Studies and Diversity. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "345",
        "title": "Contemporary Issues in Asian American Studies",
        "description": "Prerequisite: Completion of the Lower Division writing requirement.Critical analysis of contemporary issues confronting Asian Americans in the U.S. Emphasis placed on social and economic issues such as immigration education employment health and inter-ethnic and intra-Asian conflict. Regular writing assignments required. Available for Section B Multicultural Requirement for Credential Candidates. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "347",
        "title": "Asian American Politics and the Law",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Recommended: Prior completion of an AAS course. Advanced course on the legal and political history and contemporary struggles of Asian Americans. Overview of American political system through the examination of basic texts including the U.S. Constitution. Examines the history and formation of Asian communities in the U.S. the evolution of their participation in the political process through the lens of immigration citizenship policies and laws civil rights reform laws state laws and municipal ordinances and contemporary legal and political issues. (Meets GE Title 5 requirements in areas (2) and (3) covering the Constitution and California state and local governments.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "347EOP",
        "title": "AA POLITICS & LAW",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "350",
        "title": "Asian American Personality and Mental Health",
        "description": "Prerequisite: Completion of the Lower Division writing requirement.Analysis of psychological issues from an Asian American perspective. Specific topics include the impact of minority status on personality development cross-cultural comparisons of Asian Americans and introduction to problems in the assessment diagnosis and treatment of mental health problems in Asian Americans. Available for Section B of the Multicultural Requirement for Credential Candidates. (Available for General Education Social Sciences.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "360",
        "title": "Asian American Immigration-Global Perspective",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Examines Asian immigration to the U.S. from a world systems perspective. Examines immigration process and the implication of this process for contemporary interest in the Pacific Rim. Topics include origins of Asian immigration major U.S. immigration legislation demographic structure of contemporary Asian immigration and cross-cultural comparisons of other world groups. Regular writing assignments required. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "361A",
        "title": "Filipino American Experience",
        "description": "Prerequisite: Completion of Lower Division writing requirement. Intensive study of the immigration/incorporation history and experience of a specific Asian Pacific American sub-group. Each course examines the nexus between historical events and contemporary issues facing a particular Asian Pacific American community and their experiences in various sectors of U.S. society: labor family politics education and cultural preservation and community formation. (A) Filipino American Experience; (B) Vietnamese American Experience; (C) Chinese American Experience; (D) Korean American Experience; (E) Japanese American Experience; (F) South Asian American Experience. For courses on other groups please consult with department office.  \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "417",
        "title": "Equity and Diversity in School",
        "description": "Prepares teacher candidates to examine principles of educational equity diversity and the implementation of curriculum content and school practices for elementary/secondary students. Focuses on the history and culture of a specific ethnic experience and a comparative analysis is made with other ethnic groups in California. Engages students to examine critique and reflect on their personal biases regarding children of color. (Cross listed with ELPS PAS CHS and ARMN 417.) \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "450",
        "title": "Asian American Child and the Schools",
        "description": "Prerequisite: Completion of the Lower Division writing requirement.Study of the development of the Asian American child with particular emphasis on bicultural and bilingual issues that may influence educational progress. Culturally relevant socialization patterns of children from Chinese Japanese Korean Filipino and Southeast Asian backgrounds examined. Intended for students interested in teaching and human services. Regular writing assignments required. Available for Section A of the Multicultural Requirement for Credential Candidates. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "113B",
        "title": "Approaches to University Writing B",
        "description": "Prerequisite: Successful completion of AAS 113A. Expository prose writing with a focus on both content and form. Specific emphases shall include the exercise of logical thought and clear expression the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction syntax and grammar as well as the elements of prose style. Students receive credit for only 1 course chosen from AAS CAS CHS ENGL PAS or QS 113A. Students are required to also enroll in UNIV 060 (1 credit) or equivalent. Individual tutoring is available through the Asian American Studies Activities Center or the Learning Resource Center. (Available for General Education Analytical Reading / Expository Writing.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "113BOP",
        "title": "APPR UNIV WRTNG B",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "230EOP",
        "title": "ASIAN AMER MEDIA",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "340HON",
        "title": "ASIAN AM WOMEN",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "355",
        "title": "Biracial and Multiracial Identity",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Interdisciplinarily studies the socio-historical realities identities and political maintenance of people with multiple racial and ethnic heritages; examines the binary racial structure of the U.S. social and legal customs of racial designation and membership; focuses on multiracial populations such as Creoles mulattos mestizos Black-Indians Eurasians Afroasians Amerasians etc. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "390",
        "title": "AASFIELDPRACT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "390F",
        "title": "Asian American Communities: Field Practicum",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Recommended Corequisite or Preparatory: Concurrent enrollment in AAS 345 or other related course. A seminar on field study observation and participation in selected community institutions and agencies. This course will also offer a community service opportunity with activities relating to concepts and theories presented. 15 hours of supervised field experience. May be repeated once for credit. (Available for General Education Lifelong Learning.)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "AAS",
        "catalog_number": "453",
        "title": "Asian American Families",
        "description": "Prerequisite: Completion of the Lower Division writing requirement.Overview of the demographic social cultural structural and historical aspects of Asian American families in the United States. Examines comparative family features among Asian American ethnic groups and other cultural and ethnic groups in the U.S. Parenting styles communication styles values traditions and beliefs examined across ethnic backgrounds class and immigration histories. Available for Section B of the Multicultural Requirement for Credential Candidates. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "AAS",
        "catalog_number": "455",
        "title": "Asian American Sexuality",
        "description": "Preparatory: Completion of the Lower Division writing requirement.Explores the personal social and political identities of Asian Americans as expressed from the lens of sexuality; interdisciplinarily examines current topics in Asian American sexuality such as gender roles cultural beliefs and sexual mythology sexual practices media images literary representations sexual violence and abuse sex-related health sex work and commodification and sexual orientation. \n",
        "units": "3",
        "class_type": "LEC"
    }
]