[
    {
        "subject": "ACCT",
        "catalog_number": "220",
        "title": "Introduction to Financial Accounting",
        "description": "<p>Prerequisites: A grade ofC or higher in MATH 103 or higher-level mathematics course; sophomore class standing. Introduces the role of accounting in business and society a summary of the accounting process accounting measurement issues analyzing and recording financial transactions accounting valuation and allocation issues conceptual foundation for understanding financial reporting the usefulness of financial statements for decision making and financial statement analysis and interpretation. \n\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "230",
        "title": "Introduction to Managerial Accounting",
        "description": "Prerequisite: ACCT 220. Introduces the analysis and techniques for aiding management in planning and controlling decisions and the use of accounting data for budgeting cost control pricing evaluation of performance and general decision making. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "350",
        "title": "Intermediate Financial Accounting I",
        "description": "Prerequisites: Grades ofB or higher in ACCT 220 and ENGL 205 as well as aC or higher in all the other courses in the Pre-Accountancy major. Corequisite: BUS 302/L must be completed with aC or higher prior to enrolling in ACCT 351 and ACCT 351COM. The first course in the financial accounting sequence. Covers the theory of financial accounting as well as the accounting process with an emphasis on the accounting system and related technical skills.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "351",
        "title": "Intermediate Financial Accounting II",
        "description": "Prerequisites: Grades ofC or higher in both ACCT 350 and BUS 302/L. Corequisite: Concurrent enrollment in ACCT 351COM. The second course in the financial accounting sequence. Covers the theory of financial accounting as well as the accounting process with an emphasis on revenue recognition asset valuation cash implications of complex transactions and accounting for liabilities and investments.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "352",
        "title": "Intermediate Financial Accounting III",
        "description": "Prerequisites: Grades ofC or higher in ACCT 351 and 351COM. Third course in the financial accounting sequence. Covers the theory of financial accounting as well as the accounting process with an emphasis on stockholders equity pensions leases changes in accounting principles and in-depth examination of financial statements.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "380",
        "title": "Cost Measurement and Analysis",
        "description": "Prerequisites: Grades ofC or higher in both ACCT 350 and BUS 302/L. May be taken concurrently with ACCT 351 and 351COM. Focuses on how to measure and analyze costs for management decision making. Covers how the environment and strategy of a company influences the design of its cost-measurement system and how the resulting cost information may or may not be useful for managerial decisions and for cost management.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "412L",
        "title": "EXCEL SPEC CERT",
        "description": null,
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "ACCT",
        "catalog_number": "440",
        "title": "Income Tax I",
        "description": "Prerequisites: Grades of “C” or higher in ACCT 351 and ACCT 351COM; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. This course examines fundamentals of individual federal income taxation including the following topics: tax determination; inclusions and exclusions from gross income; deductions and losses; property transactions (gain or loss basis considerations nontaxable exchanges capital gains and losses Section 1231 and recapture provisions); depreciation; employee expenses; deductions of the self-employed; itemized deductions; and passive activity losses. The course emphasizes the development of written and oral communication skills tax research as well as individual tax compliance.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "441",
        "title": "Income Tax II",
        "description": "Prerequisites: Grades of “C” or higher in ACCT 352 and ACCT 440; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. This course examines the federal taxation of business entities including the following topics: tax credits; Alternative Minimum Tax (individual and corporate); accounting methods and periods; C corporations (organization operations distributions redemptions liquidations and reorganizations); partnerships (formation operation basis distributions transfer of interest and terminations); S corporations; and taxation of international transactions. The course emphasizes the development of tax research and tax planning skills as well as tax compliance for business entities.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "450",
        "title": "Advanced Financial Accounting",
        "description": "Prerequisites: Grades ofC or higher in ACCT 352; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. Accounting applications for specialized areas: partnerships business combinations consolidated financial statements foreign currency transactions and translation governmental and not-for-profit organizations.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "460",
        "title": "Auditing Principles",
        "description": "Prerequisites: Grades ofC or higher in ACCT 351 351COM and 352; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. (ACCT 352 may be taken concurrently). Emphasizes the auditors decision making process. Focuses on audits of domestic and multinational corporations for financial reporting purposes. Topics include attestation theory theory of evidence auditing standards auditing reports ethics control structure and environment risk assessment sampling analytical procedures audit planning and documentation.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "465",
        "title": "ADV AUDITING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "475",
        "title": "GOV & NONPROF ACCT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "498A",
        "title": "Accounting-Field Assignments and Reports",
        "description": "Individual study pertaining to present or future career. Student must obtain approved employment. Consultation with employer and instructor determines program. A maximum of 12 units may be earned by combining Field Assignments and Reports (ACCT 498) and Independent Study (ACCT 499). Academic Internship course. (Credit/No Credit only) \n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "ACCT",
        "catalog_number": "499C",
        "title": "Independent Study Accounting",
        "description": "Prerequisites: Consent of Department Chair and consent of an instructor to act as sponsor. In order to do an Independent Study assignment in the College of Business and Economics a student must have at least a 3.0 overall GPA and a 2.0 or higher GPA in all major courses. A student who does not meet these requirements will not receive credit for any ACCT 499. Admission is based on evidence of ability to pursue Independent Study in-depth and on approval of a project submitted at the time of registration. Regular progress meetings and reports are required throughout the semester. Completion of the project is required before credit may be received. Enrollment in Independent Study is not allowed for the purpose of substitution for an existing course. A maximum of 6 units of Independent Study (499) may be earned in the College of Business and Economics. A maximum of 12 units may be earned by combining Field Assignments and Reports (498) and Independent Study (499). \n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "ACCT",
        "catalog_number": "501",
        "title": "MBA Financial Accounting",
        "description": "Prerequisite: Admission to a College of Business and Economics graduate program or consent of instructor. Study of financial reporting principles structure of the balance sheet income statement and statement of cash flows. Measurement principles for assets; liabilities and stockholders equity; revenue and expenses. Covers managements responsibility for full and fair disclosure of financial information.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "511",
        "title": "ACCT ETHICS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "542",
        "title": "Introduction to Federal Tax Procedure",
        "description": "Prerequisite: ACCT 440. This course provides students with an introduction to the procedural aspects of dealing with the Internal Revenue Service. The course will introduce the students to among other things the organization of the IRS investigative authority of the IRS tax audits administrative penalties administrative appeals tax collection federal tax crimes refund claims examination of returns ethics in the practice of tax tax practitioner privileges and statute of limitation and assessments. This course provides the students with the opportunity to apply the materials learned in the course through clinical exercises in the community.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "600",
        "title": "INDIVIDUAL TAX",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "620A",
        "title": "FIN REPORT I",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "620B",
        "title": "FIN REPORT II",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "625",
        "title": "TAXATION OF ENTITIES",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "697",
        "title": "ACCT COMP EXAM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "292BCS",
        "title": "VITA-PREPARER",
        "description": null,
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "ACCT",
        "catalog_number": "392BCS",
        "title": "VITA-SUPERVISOR",
        "description": null,
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "ACCT",
        "catalog_number": "499A",
        "title": "Independent Study Accounting",
        "description": "Prerequisites: Consent of Department Chair and consent of an instructor to act as sponsor. In order to do an Independent Study assignment in the College of Business and Economics a student must have at least a 3.0 overall GPA and a 2.0 or higher GPA in all major courses. A student who does not meet these requirements will not receive credit for any ACCT 499. Admission is based on evidence of ability to pursue Independent Study in-depth and on approval of a project submitted at the time of registration. Regular progress meetings and reports are required throughout the semester. Completion of the project is required before credit may be received. Enrollment in Independent Study is not allowed for the purpose of substitution for an existing course. A maximum of 6 units of Independent Study (499) may be earned in the College of Business and Economics. A maximum of 12 units may be earned by combining Field Assignments and Reports (498) and Independent Study (499). \n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "ACCT",
        "catalog_number": "605",
        "title": "INTRO TO AUDIT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "620C",
        "title": "FIN REPORT III",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "ACCT",
        "catalog_number": "624",
        "title": "Advanced Auditing and Assurance Services",
        "description": "Prerequisites: Prerequisites: ACCT 352 and 460 or equivalents. Auditing theory and practices; auditing standards; SEC (Securities and Exchange Commission) and stock exchange regulations; auditors legal liability; statement trends and techniques. Concepts and principles governing independent professional services that provide assurance on the reliability and relevance of information including financial statement information.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "ACCT",
        "catalog_number": "699",
        "title": "Independent Study-Accounting",
        "description": "Prerequisites: Permission of Graduate Advisor and Department Chair. No more than 6 units of Independent Study may be taken in any one department and no more than 6 units may be taken in the College of Business and Economics without prior approval of the Dean. Only those graduate students who have a current 3.0 or higher GPA may register in a 600-level Independent Study course.\n",
        "units": "3",
        "class_type": "SUP"
    }
]