[
    {
        "subject": "BLAW",
        "catalog_number": "280",
        "title": "Business Law I",
        "description": "Prerequisites: Completion of Lower Division writing requirement; Sophomore standing. Study of the role of law in business including the study of legal institutions and their role in facilitating and regulating business. Includes a study of the legal system civil litigation torts and the formation and performance of contracts. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "BLAW",
        "catalog_number": "308",
        "title": "Business Law II",
        "description": "Prerequisite: BLAW 280. Corequisite/Prerequisites for Business majors: BUS 302/L. Study of the role of law in business including the study of legal institutions and their role in facilitating and regulating business. Topics include agency and employment law the various forms of business organizations and securities law. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "BLAW",
        "catalog_number": "368",
        "title": "Law",
        "description": "Business and EthicsPrerequisite: BLAW 280. Corequisite/Prerequisites for Business majors: BUS 302/L. Study of law ethics and values in the business environment. The course will examine the ethical issues managers face in organizations within the context of values and law. Students are taught to recognize ethical issues identify bias examine values explore the role of ethics in the workplace understand the legal environment in which ethical issues arise and consider the role of professional standards in the context of business ethics. Students will learn ethical frameworks with which to analyze ethical problems and decisions. The course uses the case method to provide a process- and problem-solving orientation to apply ethical theory to business situations to analyze problems in the context of legal and regulatory frameworks and to provide a basis to internalize knowledge growth and experience. Students learn skills of critical thinking. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "BLAW",
        "catalog_number": "372",
        "title": "ETHC & LEGAL TECH",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "BLAW",
        "catalog_number": "391",
        "title": "Women and the Law",
        "description": "Prerequisites: Completion of Lower Division writing requirement; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. Recommended Corequisites or Preparatory for Business majors: BUS 302/L. Study of several areas of law affecting the past and current legal status of women. Includes constitutional law employment law and health law. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "BLAW",
        "catalog_number": "409",
        "title": "Wills",
        "description": "Estates and TrustsPrerequisites: BLAW 280; BUS 302/L for Business majors; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. Introduction to the law of wills estates trusts and other areas connected with estate planning. Considers the nature of property joint ownership of property the validity and probate of wills inheritance under the laws of interstate succession and the laws governing the establishment and administration of trusts. Also considers the law of estate taxation.  \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "BLAW",
        "catalog_number": "450",
        "title": "Intellectual Property Law",
        "description": "Prerequisites: BLAW 280; BUS 302/L for Business majors; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. Exploring the law of patents copyrights trademarks trade secrets and related forms of intellectual property protection. Considered will be the nature of intellectual property rights and the scope of protection for various subject matter including international and trade aspects relating to technology protection and transfer; the enforcement of intellectual property rights and remedies for infringement or misappropriation of such rights; and practical strategies for intellectual property development management and licensing in the modern business environment both domestically and internationally. \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "BLAW",
        "catalog_number": "453",
        "title": "NEGOTIATION",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "BLAW",
        "catalog_number": "480",
        "title": "Commercial Transactions Law",
        "description": "Prerequisites: BLAW 280 308; BUS 302/L for Business majors; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. Study of those areas of law related to commercial business transactions including commercial paper negotiable instruments secured transactions bankruptcy and the law of sales. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "BLAW",
        "catalog_number": "481",
        "title": "Real Estate Law",
        "description": "Prerequisites: BLAW 280 308; BUS 302/L for Business majors; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. Legal and business aspects of real property acquisition and ownership involving the nature of property ownership including the acquisition of titles easements leases and contracts community property joint tenancy tenancy in common brokerage and land-use regulation.  \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "BLAW",
        "catalog_number": "485",
        "title": "Labor and Employment Law",
        "description": "Prerequisites: BLAW 280 308; BUS 302/L for Business majors; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. Examines the development of labor law in the U.S. from the early common law to the current legislation. Existing federal statutes regulating labor unions and labor relations will be studied in detail. These statutes are studied as they are applied and interpreted by the federal courts and by the National Labor Relations Board. In addition this course examines topics in U.S. employment laws such as family leave equal pay wrongful discharge employee defamation employer-related immigration laws privacy in the workplace discrimination based on race sex national origin and religion and other new developments.  \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "BLAW",
        "catalog_number": "508",
        "title": "MBA Law in the Business Environment",
        "description": "Prerequisite: Graduate standing. Study of the role of law in business including the study of legal institutions and their role in facilitating and regulating business. Includes a study of the legal system civil litigation torts and the formation and performance of contract agency and employment law the various forms of business organizations and securities law.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "BLAW",
        "catalog_number": "370",
        "title": "CORP SOC RESPBLTY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "BLAW",
        "catalog_number": "374",
        "title": "ETHICAL DM & BUS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "BLAW",
        "catalog_number": "428",
        "title": "International Business Law",
        "description": "Prerequisites: BLAW 280; BUS 302/L for Business majors; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. Study of the legal environment for international commercial transactions including an analysis of major Western and non-Western legal traditions and the supranational law of the European Community; a detailed analysis of the negotiation formation enforcement and financing of international sales contracts; an analysis of international trade regulation analysis of methods of regulating global competition and of the protection of business property rights in international transactions.  \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "BLAW",
        "catalog_number": "430",
        "title": "Marketing Law",
        "description": "Prerequisites: BLAW 280; BUS 302/L for Business majors; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. This course explores the legal aspects of marketing strategy. The course considers the legal aspects of product ownership distribution and competition including liability aspects of particular business practices. Students study federal and state law related to consumer protection products liability warranties trade secrets and unfair competition selected topics in antitrust law (including pricing strategy price fixing predatory pricing discriminatory pricing) and marketing channel strategy (including resale price maintenance territorial and customer restrictions exclusive dealing and refusal to deal) franchise law and limits on market dominance. Throughout the course the contrast between U.S. and international entities is explored with particular examination of foreign licensing distribution liability and enforcement issues. \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "BLAW",
        "catalog_number": "451",
        "title": "Entertainment Business Law",
        "description": "Prerequisites: BLAW 280 308; BUS 302/L for Business majors; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. This course covers the recurring legal problems that arise in the business context of the entertainment industry and the legal relationships between the parties involved in the film television theater music and online entertainment fields. In particular the course will address tort law issues including defamation invasion of privacy and the right of publicity; intellectual property protection including copyright and trademark law and the protection of ideas; contract law issues including contract formation contractual obligations and remedies; and government regulation of entertainment content and industry practices. International aspects of each of these areas will be emphasized \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "BLAW",
        "catalog_number": "495",
        "title": "Advanced Topics in Business Law",
        "description": "Prerequisites: BLAW 280 308; BUS 302/L for Business majors; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. Selected advanced topics in business law are analyzed by means of readings analysis of cases and problems case studies and class discussion. \n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "BLAW",
        "catalog_number": "499C",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    }
]