[
    {
        "subject": "CADV",
        "catalog_number": "150",
        "title": "Foundations of Child and Adolescent Development",
        "description": "This course surveys typical and atypical child and adolescent development. Readings and course work provide basic grounding in the major theories/theorists of human development an overview of major topics in cognitive social and physical development as they relate to the culture in childrens development and develop basic competencies for child observation as a study methodology. (Available for General Education Social Sciences.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "180",
        "title": "STATISTICS DEV SCI",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "250",
        "title": "The Child and Adolescent Development Profession",
        "description": "Provides an overview of the history contemporary status and projected future of child and adolescent development as a discipline. Contemporary professional issues advocacy and professionalism in careers that use child and adolescent development as a foundation are investigated.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "310",
        "title": "Developmental Impacts of Abuse and Neglect",
        "description": "Prerequisite: Completion of lower division writing requirement. Preparatory: CADV 150. Survey of the cognitive physical social/emotional effects of abuse and neglect spanning conception through emerging adulthood. Historical perspectives related to abuse and neglect of children adolescents and young adults including current trends/topics are explored. Ethical and practical issues regarding maltreatment relevant to current and prospective parents as well as professionals in the field of child and adolescent development are addressed. (Available for General Education Lifelong Learning) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "327",
        "title": "Infancy and Early Childhood",
        "description": "Prerequisite: PSY 150 250. Preparatory: PSY 301. Relevant aspects of physical social cognitive and emotional change are highlighted as part of human development from conception to early childhood (conception to 8 years). Emphasis on the study of the underlying processes and influences on human development. Cultural contexts of development key changes continuity and individual differences are examined Includes evaluation of selected theories contemporary issuesand practical applications. (Crosslisted with PSY 327.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "335",
        "title": "Middle Childhood",
        "description": "Prerequisites: PSY 150; completion of the Lower Division writing requirement. Preparatory: PSY 301.  This course examines developmental changes in the middle childhood years (7-12 years). Emphasis is on current research and major theories associated with middle childhood development. Cultural contexts of development key changes continuity and individual differences are examined. (Crosslisted with PSY 335.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "350",
        "title": "Applied Cognitive Development",
        "description": "Prerequisite: Completion of Lower Division writing requirement; Preparatory: CADV 150. Students survey major topics of cognitive development from infancy to adolescence review research literature about environmental factors that influence childrens cognitive development and assess the implications for observing and working with children and their families. Students have an opportunity to learn how childrens developing ability to think and articulate can be used as a basis for communicating effectively with them.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "352",
        "title": "Applied Social Development",
        "description": "Prerequisite: Completion of Lower Division writing requirement.Preparatory: CADV 150. This course surveys human social development from infancy through adolescence. Several theoretical frameworks that inform the study of social development are presented as well as empirical evidence extending knowledge of the processes and content of social development. Emphasis is placed on connecting theories and constructs of social development to effective practice as child and adolescent professionals the development of observation skills and use of developmentally appropriate practices with children and adolescents in naturalistic settings.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "361",
        "title": "Adolescence",
        "description": "Prerequisites: PSY 150; Completion of the Lower Division writing requirement. Preparatory: PSY 301. Analysis of the physical cognitive social and emotional changes from puberty to adulthood. Examines contemporary youth culture from a historical and cross-cultural perspective. Discusses evaluation of age norms and deviant development. Project involving some aspect of adolescent development is required. (Crosslisted with PSY 361.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "373",
        "title": "Emerging Adulthood",
        "description": "Prerequisites: PSY 150; Completion of the Lower Division writing requirement. Recommended Preparatory: PSY 301. This course fulfills the 300-level Developmental Psychology Cluster requirement for Psychology Majors. This course surveys the developmental changes that take place during emerging adulthood. Cultural contexts key changes continuity and individual differences across both typical and atypical development are examined. The course explores changes in: physiology  thinking and social interactions as well as the context and psychosocial areas within which these changes occur. Common psychosocial problems in emerging adulthood are discussed.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "380",
        "title": "Methods of Child and Adolescent Study I",
        "description": "Prerequisites: MATH 140; Completion of Lower Division writing requirement. Preparatory: CADV 150. Corequisite: CADV 380L. Designed to introduce students to the scientific process of studying children and adolescents. Through hands-on experiences students gain insight into some of the key issues facing researchers including problems of measurement observation and interpretation generation and testable questions development of coding systems and establishment of reliability. Students work in small groups to plan and carry out their own research projects at University-affiliated sites.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "380L",
        "title": "Methods of Child and Adolescent Study I Lab",
        "description": "Prerequisites: MATH 140; Completion of Lower Division writing requirement. Preparatory: CADV 150. Corequisite: CADV 380. Designed to introduce students to the scientific process of studying children and adolescents. Through hands-on experiences students gain insight into some of the key issues facing researchers including problems of measurement observation and interpretation generation and testable questions development of coding systems and establishment of reliability. Students work in small groups to plan and carry out their own research projects at University-affiliated sites.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CADV",
        "catalog_number": "381",
        "title": "Methods of Child and Adolescent Study II",
        "description": "Prerequisite: CADV 380/L. Corequisite: CADV 381L. This course is designed to build on students knowledge of the scientific process of studying children and adolescents. Major topics include a consideration of the philosophical and conceptual underpinnings of research the structures and conduct of research inquiry and the generation of research questions and hypotheses. General methodology will be covered through readings and activities from the textbooks and will be tailored to questions that focus on child and adolescent development. Students will be challenged to think critically about methodological issues in research that they read and will have an opportunity to design a research study of their own. Lab: provides the opportunity to apply course concepts in a series of in-class and on-line activities\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "381L",
        "title": "Methods of Child and Adolescent Study II Lab",
        "description": "Prerequisite: CADV 380/L. Corequisite: CADV 381. This course is designed to build on students knowledge of the scientific process of studying children and adolescents. Major topics include a consideration of the philosophical and conceptual underpinnings of research the structures and conduct of research inquiry and the generation of research questions and hypotheses. General methodology will be covered through readings and activities from the textbooks and will be tailored to questions that focus on child and adolescent development. Students will be challenged to think critically about methodological issues in research that they read and will have an opportunity to design a research study of their own. Lab: provides the opportunity to apply course concepts in a series of in-class and on-line activities\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CADV",
        "catalog_number": "394",
        "title": "Child and Adolescent Development Internship I",
        "description": "Prerequisites: CADV 150 250; PSY 150. Pre or Co-requisite: CADV 350 or 352. Students must complete an application (available in Department Office SQ 285) in the Spring semester prior to enrolling the following Fall. First of a two-semester internship sequence enabling students to apply theory to practice in a community setting. Internship includes 75 hours of service in a community organization/ setting in addition to regular class meetings. (Credit/No Credit only)\n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "CADV",
        "catalog_number": "406",
        "title": "Enhancing Childhood Creativity",
        "description": "Prerequisite: Corequisite: CADV 406L. An Integrative seminar and lab experience focusing on the theoretical approaches for enhancing childhood creativity. The uses of play and fantasy are explored as means for developing programs that are child-oriented. Regular written assignments are required. (Crosslisted with RTM 406/L.)\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "CADV",
        "catalog_number": "406L",
        "title": "Enhancing Childhood Creativity Lab",
        "description": "Prerequisite: Corequisite: CADV 406. An Integrative seminar and lab experience focusing on the theoretical approaches for enhancing childhood creativity. The uses of play and fantasy are explored as means for developing programs that are child-oriented. Regular written assignments are required. (Crosslisted with RTM 406/L.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "CADV",
        "catalog_number": "450",
        "title": "Helping Children Cope with Medical Environments",
        "description": "Prerequisites: CADV 150; Completion of the Lower Division writing requirement. The developmental impact of illness disability and hospitalization on children and youth are studied. Methods used by child development specialists to help children cope with the emotional stress of ill health and disability will be presented.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "451",
        "title": "Alternative Approaches to Discipline",
        "description": "Investigation of literature on discipline in child development settings. Practical and theoretical approaches are related and integrated.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "452",
        "title": "Child Advocacy",
        "description": "Designed to increase student knowledge of local state and national advocacy organizations and their influence on public policy. Focus is on the individual child development professionals role as a child advocate.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "453",
        "title": "AUTISM & NEURODEV",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "455",
        "title": "MENTOR IN  CADV",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CADV",
        "catalog_number": "456",
        "title": "CHILD GRIEF LOSS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "460",
        "title": "Race",
        "description": "Ethnicity Gender and Culture in DevelopmentPrerequisite: Completion of Lower Division writing requirement. Preparatory: CADV 150. Explores the development of ethnic minority children and adolescents in multicultural settings. Particular focus is placed on students exploration of their own understandings and awareness of culture ethnicity and gender based on the premise that effective professionals must clearly understand their own personal biases and level of privilege before looking at traits and characteristics of other groups. Specific attention is given to exploring the practical application of these concepts and theories in community settings.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "470",
        "title": "Advanced Theories in Child and Adolescent Development",
        "description": "Prerequisites: CADV 350 or 352 380/L. Passing score on the Upper Division Writing Proficiency Exam. This capstone course is a culminating experience for majors. It facilitates professional development through high level discussions and thinking on concepts and theories of development for transition into graduate-level programs in human development or related fields and/or into a career. Designed to synthesize the broad concepts of child and adolescent development and to address contemporary issues in the field.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "CADV",
        "catalog_number": "495A",
        "title": "Child and Adolescent Development Graduate School Skills and Applied Research Training I",
        "description": "Prerequisite: Students must complete Department application. Recommended Preparatory: CADV 150; CADV 380/L or PSY 320/L or FCS 431; Completion of Lower Division writing requirement. This course will address issues associated with becoming a professional in the field of child and adolescent development through developing applied research skills that will facilitate entry into graduate and professional programs in related fields. Students will: (1) develop competencies in qualitative and quantitative research methods in studying children and adolescents in both laboratory and field-based settings; and (2) gain practical experience applying knowledge of these research methods on actual active Child and Adolescent Development faculty research projects.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CADV",
        "catalog_number": "495B",
        "title": "Child and Adolescent Development Graduate School Skills and Applied Research Training II",
        "description": "Prerequisite: CADV 495A or consent of instructor. This course builds on the foundation of applied research methods in CADV 495A by providing opportunities for students to integrate the theories and constructs of applied research in the field of child and adolescent development toward further development of graduate school skills and training. Through participation in weekly seminars in addition to hands-on experience on research projects at varying stages of the research process this course will provide students in-depth knowledge about particular phases of research (e.g. hypotheses generation project design data collection data analyses and dissemination). In addition students will develop a personal statement of their (1) research interests and (2) theoretical grounding in child and adolescent development.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CADV",
        "catalog_number": "497AB",
        "title": "Special Topics in Child and Adolescent Development: Issues in Adulthood",
        "description": "Recommended Preparatory: CADV 350 352 380/L. Innovative courses of study. Topics to be specified in the Schedule of Classes. Different topics may be taken for credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CADV",
        "catalog_number": "497AE",
        "title": "POVERTY & DEVELOP",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CADV",
        "catalog_number": "497AF",
        "title": "THRP CLNCL OPPS CADV",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CADV",
        "catalog_number": "499A",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "CADV",
        "catalog_number": "494",
        "title": "Child and Adolescent Development Internship II",
        "description": "Prerequisite: CADV 394B. The second semester internship builds on the in-depth understanding of the program and experiences gained from the first semester internship. Individual goals enhance the professional development of students. Includes 75 hours of service in a community setting/organization in addition to regular class meetings. (Credit /No Credit only)\n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "CADV",
        "catalog_number": "497AA",
        "title": "Special Topics in Child and Adolescent Development: Affordable Child",
        "description": "Recommended Preparatory: CADV 350 352 380/L. Innovative courses of study. Topics to be specified in the Schedule of Classes. Different topics may be taken for credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CADV",
        "catalog_number": "497AC",
        "title": "Special Topics in Child and Adolescent Development: Mentoring Emerging Adults",
        "description": "Recommended Preparatory: CADV 350 352 380/L. Innovative courses of study. Topics to be specified in the Schedule of Classes. Different topics may be taken for credit.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "CADV",
        "catalog_number": "497AD",
        "title": "Special Topics in Child and Adolescent Development: Autism and Developmental Disorders",
        "description": "Recommended Preparatory: CADV 350 352 380/L. Innovative courses of study. Topics to be specified in the Schedule of Classes. Different topics may be taken for credit.\n",
        "units": "3",
        "class_type": "SEM"
    }
]