[
    {
        "subject": "GBUS",
        "catalog_number": "598C",
        "title": "MBA Internship",
        "description": "Prerequisite: Graduate student in good standing. Individual study pertaining to future career and application of knowledge skills and abilities gained in MBA coursework. Student must obtain an approved internship requiring MBA-level responsibilities. Faculty mentor and employer will determine scope of work. This academic internship course is available on a Credit/No Credit basis only. May not be used to fulfill formal program requirements in the MBA program. \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "GBUS",
        "catalog_number": "599C",
        "title": "Independent Study",
        "description": "Independent Study \n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "GBUS",
        "catalog_number": "600",
        "title": "Analysis of Contemporary Organizations",
        "description": "Interdisciplinary course introducing new graduate students to the field of business. Focuses on the nature of organizations and the inter-relatedness of the functional areas. Explores intellectual and historic roots of management theories through readings of primary source materials. Students develop communication and research skills through individual and group projects that focus on organizations and their environment. \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "GBUS",
        "catalog_number": "607",
        "title": "DATA ANALYTICS",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "GBUS",
        "catalog_number": "698A",
        "title": "Graduate Thesis",
        "description": "Prerequisites: Permission of Department Thesis Committee and Director of Graduate Programs. Number of units allowed depends upon the study undertaken. \n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "GBUS",
        "catalog_number": "690A",
        "title": "BIAS & BUSINESS IMPACT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GBUS",
        "catalog_number": "696F",
        "title": "Directed Graduate Research",
        "description": "Prerequisites: Permission of Department Chair and Director of Graduate Programs. \n",
        "units": "1",
        "class_type": "SUP"
    }
]