[
    {
        "subject": "GEOG",
        "catalog_number": "101",
        "title": "The Physical Environment",
        "description": "Study of the natural environment -- nature distribution and relationships of climate landforms vegetation hydrology and soils. (Available for General Education Natural Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "101A",
        "title": "PHYSICAL ENVIRON",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "101AL",
        "title": "PHYSICAL ENVIRON LAB",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "GEOG",
        "catalog_number": "101HON",
        "title": "THE PHYSCL ENVIRN",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "102",
        "title": "Physical Geography Lab",
        "description": "Corequisite: GEOG 101 or equivalent. Observations experiments and demonstrations designed to familiarize students with techniques utilized by physical geographers. 3 hours lab. (May be used to satisfy the lab requirement in the Natural Science Section of General Education.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOG",
        "catalog_number": "103",
        "title": "Weather",
        "description": "Study of atmospheric processes. (Available for General Education Natural Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "103A",
        "title": "WEATHER",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "103AL",
        "title": "WEATHER LAB",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "GEOG",
        "catalog_number": "105",
        "title": "Weather Lab",
        "description": "Corequisite: GEOG 103. Observations experiments and demonstrations designed to familiarize students with the nature of Californias weather and climate. 3 hours lab per week. (May be used to satisfy the lab requirement in the Natural Science Section of General Education.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOG",
        "catalog_number": "107",
        "title": "Introduction to Human Geography",
        "description": "Examines the patterns and processes of human occupance of the Earth with a focus on the U.S. Topics such as population agriculture language religion ethnicity politics and economics are covered using the tools methods and perspective of the geographer. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "111",
        "title": "CLIMATE CHANGE",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "111HL",
        "title": "CLIMATE CHANGE LB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOG",
        "catalog_number": "111HON",
        "title": "CLIMATE CHANGE",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "111L",
        "title": "CLIMATE CHANGE LB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOG",
        "catalog_number": "150",
        "title": "World Geography",
        "description": "Geographical survey of the worlds major regions with emphasis on those features important to an understanding of current global concerns and problems. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "170",
        "title": "WATER RESOURCE CA",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "206",
        "title": "Introduction to Geographical Information Science",
        "description": "Corequisite: GEOG 206L. Introduction to fundamental concepts of geographical information science. Course will cover technical and context knowledge for basic spatial analysis including data gathering analysis and display through digital methods. Geographic Information Systems (GIS) will be used to explore spatial questions about environmental and social issues. Lab demonstrates these principles through hands-on experience with the dominant GIS software ArcGIS. Students also will be exposed to other online GIS software applications. 2 hours lecture 3 hours lab (Available for General Education Lifelong Learning.) (IC).\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "206L",
        "title": "Introduction to Geographical Information Science Lab",
        "description": "Corequisite: GEOG 206. Introduction to fundamental concepts of geographical information science. Course will cover technical and context knowledge for basic spatial analysis including data gathering analysis and display through digital methods. Geographic Information Systems (GIS) will be used to explore spatial questions about environmental and social issues. Lab demonstrates these principles through hands-on experience with the dominant GIS software ArcGIS. Students also will be exposed to other online GIS software applications. 2 hours lecture 3 hours lab (Available for General Education Lifelong Learning.) (IC).\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOG",
        "catalog_number": "300",
        "title": "The Geographer&#8217;s Craft",
        "description": "Introduction to geography as a discipline emphasizing its approach to analysis and problem solving resources for conducting geographic research methods for answering geographic questions and techniques for communicating insights.\n",
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "GEOG",
        "catalog_number": "301",
        "title": "Cultural Geography",
        "description": "Prerequisites: Lower Division course in the social sciences; Completion of the Lower Division writing requirement. Study of the literature traditions and theories dealing with the human-environment relationship and an analysis of the approaches used by cultural geographers to elucidate the nature of this relationship. Major themes are the cultural landscape cultural ecology and environmental perception. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "305",
        "title": "Maps and Graphics",
        "description": "Corequisite: GEOG 305L. Preparatory: Lower Division course in Geography or other relevant field. Design use and preparation of maps and graphs. 2 hours lecture 2 hours lab.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "305L",
        "title": "Maps and Graphics Lab",
        "description": "Corequisite: GEOG 305. Preparatory: Lower Division course in Geography or other relevant field. Design use and preparation of maps and graphs. 2 hours lecture 2 hours lab.\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "GEOG",
        "catalog_number": "306",
        "title": "Intermediate Geographical Information Science",
        "description": "Prerequisite: Geog 206/L or instructor consent. Corequisite: GEOG 306L.  Intermediate course on theories and application of geographical information science. Course will cover fundamental concepts of database management spatial analysis and data creation. Geographic Information Systems (GIS) will be used to discover spatial relationships among environmental and social phenomena. Labs will provide an introduction to spatial data structures and raster-based applications of GIS. Labs offer hands-on experience with the dominant GIS software ArcGIS. 2 hour lecture 2 hours lab.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "306L",
        "title": "Intermediate Geographical Information Science Lab",
        "description": "Prerequisite: Geog 206/L or instructor consent. Corequisite: GEOG 306.  Intermediate course on theories and application of geographical information science. Course will cover fundamental concepts of database management spatial analysis and data creation. Geographic Information Systems (GIS) will be used to discover spatial relationships among environmental and social phenomena. Labs will provide an introduction to spatial data structures and raster-based applications of GIS. Labs offer hands-on experience with the dominant GIS software ArcGIS. 2 hour lecture 2 hours lab.\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "GEOG",
        "catalog_number": "316",
        "title": "Environmental Geography",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Recommended Preparatory or Corequisite: GEOG 316L. Introduction to the principles of environmental geography with special emphasis on the connections between human activities and the physical (natural) environment. Emphasis will be placed on identifying the historical and contemporary impact of humans on the natural environment. Students using this course to satisfy a General Education requirement in the Natural Sciences may satisfy the corresponding lab requirement by completing GEOG 316L. 3 hours lecture.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "318",
        "title": "Europe",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Examination of the physical historical cultural economic and political factors that have shaped the contemporary European landscapes. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "321",
        "title": "United States",
        "description": "Prerequisites: Lower Division course in the social sciences; Completion of the Lower Division writing requirement. Regional and cultural geography of the U.S. emphasizing human-environment interaction and the evolution of contemporary geographical patterns of population distribution resource exploitation transportation and agricultural and industrial production. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "322",
        "title": "Latin America",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Spatial and ecological survey of the environment cultures economies and societies of the Latin American nations. Emphasizes the changing settlement geography and pays special attention to Brazil and the Andean countries. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "324",
        "title": "China",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Geographical analysis of the peoples and culture of China emphasizing features important to an understanding of Chinas cultural and regional diversity and contemporary problems. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "326",
        "title": "Africa",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Geographical analysis of the peoples and cultures of Africa emphasizing features important to an understanding of Africas cultural and regional diversity and contemporary problems. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "330",
        "title": "California",
        "description": "Prerequisites: Lower Division course in the social sciences; Completion of the Lower Division writing requirement. An exploration of the diverse physical and human landscapes of California. The course examines the states environmental context (climate landforms water vegetation wildlife minerals); human imprints on the natural landscape (population agriculture industry urbanization); and the physical and human challenges facing California today. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "334",
        "title": "Geography of Oceania",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Cultural and regional geography of Oceania including Australia New Zealand and the Pacific nations territories and protectorates. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "340",
        "title": "Economic Geography",
        "description": "Prerequisite: Lower Division course in Geography or ECON 160 or 300. Principles governing spatial organization of society. Theoretical and empirical approaches to location of urban and rural settlement and economic activities. Spatial structures their interrelationships and changes in organization.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "351",
        "title": "Urban Geography",
        "description": "Prerequisites: Lower Division course in the social sciences; Completion of the Lower Division writing requirement. Geographical analysis of past and current patterns of world urbanization. Emphasis on city origins growth development and current problems. (Available for General Education Social Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "365",
        "title": "Geomorphology",
        "description": "Prerequisites: GEOG 101 or GEOL 101; Completion of the Lower Division writing requirement. Corequisite: GEOG 365L. Analytical and descriptive study of physical processes responsible for development and evolution of Earths surface features. Aspects of local geomorphology will be observed on field trips. 3 hours lecture 2 hours field activity. (Available for General Education Natural Sciences.) (IC)\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "365L",
        "title": "Geomorphology Lab",
        "description": "Prerequisites: GEOG 101 or GEOL 101; Completion of the Lower Division writing requirement. Corequisite: GEOG 365. Analytical and descriptive study of physical processes responsible for development and evolution of Earths surface features. Aspects of local geomorphology will be observed on field trips. 3 hours lecture 2 hours field activity. (Available for General Education Natural Sciences.) (IC)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "GEOG",
        "catalog_number": "366",
        "title": "ENVIRON HAZARDS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "366L",
        "title": "ENVIN HAZARDS LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOG",
        "catalog_number": "370",
        "title": "WATER SOC ENV",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "404TC",
        "title": "FLD STD URBAN",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "GEOG",
        "catalog_number": "406",
        "title": "Advanced Geographical Information Science",
        "description": "Prerequisite: GEOG 306 or permission of instructor. Corequisite: GEOG 406L. Course will cover advanced topics in geographical information science. Students will investigate geographic data structures advanced concepts in database design algorithms for spatial data analysis web-based mapping applications customized applications and implementation and management issues associated with Geographic Information Systems (GIS). Lab will demonstrate these issues through the use of ArcGIS software. 2 hours lecture 2 hours lab.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "406L",
        "title": "Advanced Geographical Information Science Lab",
        "description": "Prerequisite: GEOG 306 or permission of instructor. Corequisite: GEOG 406. Course will cover advanced topics in geographical information science. Students will investigate geographic data structures advanced concepts in database design algorithms for spatial data analysis web-based mapping applications customized applications and implementation and management issues associated with Geographic Information Systems (GIS). Lab will demonstrate these issues through the use of ArcGIS software. 2 hours lecture 2 hours lab.\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "GEOG",
        "catalog_number": "407",
        "title": "REMOTE SENSING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "407L",
        "title": "REMOTE SENSNG LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOG",
        "catalog_number": "408B",
        "title": "ENV APPL IN GIS",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "408D",
        "title": "Spatial Database Management",
        "description": "Prerequisite: Geography 206/L or permission of instructor. Advanced concepts in spatial database management.  This course explores the management and design of spatial datasets and their association with Geographical Information Systems. Students will be introduced to concepts such as the principles of spatial database planning design implementation and administration. Final projects will result in the development of a customized geospatial database. Available for graduate credit. Two hours lecture two hours laboratory.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "408DL",
        "title": "Spatial Database Management Lab",
        "description": "Prerequisite: Geography 206/L or permission of instructor. Advanced concepts in spatial database management.  This course explores the management and design of spatial datasets and their association with Geographical Information Systems. Students will be introduced to concepts such as the principles of spatial database planning design implementation and administration. Final projects will result in the development of a customized geospatial database. Available for graduate credit. Two hours lecture two hours laboratory.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOG",
        "catalog_number": "408F",
        "title": "WebGIS",
        "description": "Prerequisite: Geography 206/L or permission of instructor. Introduction to the design development and implementation of interactive and accessible customized web-based GIS applications. The course provides an overview of conceptual and theoretical backgrounds of WebGIS system architecture and offers programming concepts and skill sets underlying development and implementation of distributed geographical information on the Internet. Available for graduate credit. Two hours lecture two hours laboratory.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "408FL",
        "title": "WebGIS Lab",
        "description": "Prerequisite: Geography 206/L or permission of instructor. Introduction to the design development and implementation of interactive and accessible customized web-based GIS applications. The course provides an overview of conceptual and theoretical backgrounds of WebGIS system architecture and offers programming concepts and skill sets underlying development and implementation of distributed geographical information on the Internet. Available for graduate credit. Two hours lecture two hours laboratory.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOG",
        "catalog_number": "449",
        "title": "MIXED METHODS GEOG",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "460",
        "title": "Spatial Analysis and Comparison",
        "description": "Prerequisite: GEOG 360 or equivalent. Corequisite: GEOG 460L. Statistical analysis of quantitative data by areas. Measurement of aggregation and concentration description of a real distribution and gradients and significance of similarities and differences. 2 hours lecture 2 hours lab.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "460L",
        "title": "Spatial Analysis and Comparison Lab",
        "description": "Prerequisite: GEOG 360 or equivalent. Corequisite: GEOG 460. Statistical analysis of quantitative data by areas. Measurement of aggregation and concentration description of a real distribution and gradients and significance of similarities and differences. 2 hours lecture 2 hours lab.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "GEOG",
        "catalog_number": "490",
        "title": "Senior Project",
        "description": "Prerequisite: GEOG 300 or consent of instructor. Preparation of a research proposal and writing of a senior paper under close faculty supervision. Available for graduate credit.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "GEOG",
        "catalog_number": "494",
        "title": "Internship",
        "description": "Prerequisite: GEOG major with senior standing. Upon prior approval of the Internship Coordinator a student may earn 3 units of credit in the major for professional service as a geographer in a public agency or private organization. No more than 3 units may be applied to the major. Academic Internship course.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "GEOG",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Independent Study\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "GEOG",
        "catalog_number": "600",
        "title": "Geographic Thought",
        "description": "Analysis and ResearchIntroductory seminar designed for first-year graduate students. Analysis of the trends in the theories methods and problems pertinent to contemporary geography including a review of the skills required for geographical research analysis and writing.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "GEOG",
        "catalog_number": "630C",
        "title": "Environmental Studies: Special Topics in Environmental Geography",
        "description": "(A) Environmental Geography (B) Biogeography (C) Special Topics in Environmental Geography (D) Ecosystem Studies (E) Human Impact on the Environment (F) Natural Resources.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "GEOG",
        "catalog_number": "650A",
        "title": "Urban Geography: Special Topics in Urban Geography",
        "description": "(A) Special Topics in Urban Geography (B) Housing and Community Development (C) Urban Social Geography (D) Metropolitan Los Angeles\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "GEOG",
        "catalog_number": "650C",
        "title": "Urban Geography: Urban Social Geography",
        "description": "(A) Special Topics in Urban Geography (B) Housing and Community Development (C) Urban Social Geography (D) Metropolitan Los Angeles\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "GEOG",
        "catalog_number": "690A",
        "title": "Geographic Information Science: Special Topics in GIS",
        "description": "(A) Special Topics in GIS : selected topics in digital mapping with course content to be determined.  Can be taken twice for six units. (B) Spatial Statistics. (C) Digital Cartography: Selected topics in digital cartography with course content to be determined. Can be taken twice for six units. (D) Remote Sensing. (E) Image Interpretation. (F) Methods in GIS. (G) Applications in GIS: selected topics in GIS applications with course content to be determined. Can be taken twice for six units. (H) Environmental Applications of GIS.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "GEOG",
        "catalog_number": "690J",
        "title": "FOUND GIS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "696",
        "title": "Directed Graduate Research",
        "description": "To be taken near the end of the students Graduate Program and prior to GEOG 698. Supervised research leading to the development of a thesis topic preparation of a preliminary bibliography and a formal thesis proposal and selection of a Faculty Thesis Committee.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "GEOG",
        "catalog_number": "698",
        "title": "Thesis",
        "description": "Prerequisite: GEOG 696. Researching and writing the Masters thesis under the supervision of the students Faculty Thesis Committee. Only one enrollment permitted.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "GEOG",
        "catalog_number": "699A",
        "title": "Independent Study",
        "description": "Prerequisite: Consent of instructor Graduate Coordinator and Department Chair. Maximum of 3 units may be applied to the students Program and only to the elective requirement in the Option 1 Program.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "GEOG",
        "catalog_number": "304",
        "title": "MAP AND IMAGE INT",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "304L",
        "title": "MAP RD & INT LAB",
        "description": null,
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "GEOG",
        "catalog_number": "311",
        "title": "The Atmosphere",
        "description": "Prerequisites: GEOG 101 or 103 or ASTR 152 or GEOL 100 or 110 or 122; Completion of the Lower Division writing requirement. Explanations of rain wind smog etc. Basic principles of energy transfer. 3 hours lecture 3 hours lab. (Available for General Education Natural Sciences.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "311L",
        "title": "The Atmosphere Lab",
        "description": "Prerequisites: GEOG 101 or 103 or ASTR 152 or GEOL 100 or 110 or 122; Completion of the Lower Division writing requirement. Explanations of rain wind smog etc. Basic principles of energy transfer. 3 hours lecture 3 hours lab. (Available for General Education Natural Sciences.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOG",
        "catalog_number": "364",
        "title": "GEOG ECOSYSTEMS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "404AC",
        "title": "FLD STD LA",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "GEOG",
        "catalog_number": "404BC",
        "title": "FLD STD FOREIGN",
        "description": null,
        "units": "3",
        "class_type": "ACT"
    },
    {
        "subject": "GEOG",
        "catalog_number": "408E",
        "title": "GIS Automation and Customization",
        "description": "Prerequisite: Geography 306/L or permission of instructor. This course exposes students to GIS automation using industry standard programming systems. Basic programming concepts and methodologies for customizing and/or extending the available functions in ArcGIS are introduced. Available for graduate credit. One hour lecture four hours laboratory.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "408EL",
        "title": "GIS Automation and Customization Lab",
        "description": "Prerequisite: Geography 306/L or permission of instructor. This course exposes students to GIS automation using industry standard programming systems. Basic programming concepts and methodologies for customizing and/or extending the available functions in ArcGIS are introduced. Available for graduate credit. One hour lecture four hours laboratory.\n",
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "GEOG",
        "catalog_number": "409",
        "title": "Digital Cartography",
        "description": "Prerequisite: GEOG 305/L. Corequisite: GEOG 409L. Advanced design use and presentation of maps and information graphics. Course will explore computer-assisted cartography in theory and practice. Topics will include cartographic communications data acquisition and design for computer generated mapping. 2 hours lecture 2 hours lab. Available for graduate credit.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "409L",
        "title": "Digital Cartography Lab",
        "description": "Prerequisite: GEOG 305/L. Corequisite: GEOG 409. Advanced design use and presentation of maps and information graphics. Course will explore computer-assisted cartography in theory and practice. Topics will include cartographic communications data acquisition and design for computer generated mapping. 2 hours lecture 2 hours lab. Available for graduate credit.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOG",
        "catalog_number": "550F",
        "title": "FORENSIC GEOGRAPHY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOG",
        "catalog_number": "630A",
        "title": "Environmental Studies: Environmental Geography",
        "description": "(A) Environmental Geography (B) Biogeography (C) Special Topics in Environmental Geography (D) Ecosystem Studies (E) Human Impact on the Environment (F) Natural Resources.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "GEOG",
        "catalog_number": "630E",
        "title": "Environmental Studies: Human Impact on the Environment",
        "description": "(A) Environmental Geography (B) Biogeography (C) Special Topics in Environmental Geography (D) Ecosystem Studies (E) Human Impact on the Environment (F) Natural Resources.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "GEOG",
        "catalog_number": "690B",
        "title": "Geographic Information Science: Spatial Statistics",
        "description": "(A) Special Topics in GIS : selected topics in digital mapping with course content to be determined.  Can be taken twice for six units. (B) Spatial Statistics. (C) Digital Cartography: Selected topics in digital cartography with course content to be determined. Can be taken twice for six units. (D) Remote Sensing. (E) Image Interpretation. (F) Methods in GIS. (G) Applications in GIS: selected topics in GIS applications with course content to be determined. Can be taken twice for six units. (H) Environmental Applications of GIS.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "GEOG",
        "catalog_number": "690E",
        "title": "Geographic Information Science: Image Interpretation",
        "description": "(A) Special Topics in GIS : selected topics in digital mapping with course content to be determined.  Can be taken twice for six units. (B) Spatial Statistics. (C) Digital Cartography: Selected topics in digital cartography with course content to be determined. Can be taken twice for six units. (D) Remote Sensing. (E) Image Interpretation. (F) Methods in GIS. (G) Applications in GIS: selected topics in GIS applications with course content to be determined. Can be taken twice for six units. (H) Environmental Applications of GIS.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "GEOG",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisite: GEOG 696. Focused readings followed by Comprehensive Exams under the direction of the students Committee. Only one enrollment permitted.\n",
        "units": "3",
        "class_type": "SUP"
    }
]