[
    {
        "subject": "GEOL",
        "catalog_number": "101",
        "title": "Geology of Planet Earth",
        "description": "Studies of the geologic materials and processes that shape our Earth and environment are explored as they relate to our everyday lives. Topics include global tectonics; earthquakes and other geologic hazards; glacial river and coastal processes that form our landscapes; water mineral and energy resources; and waste disposal and pollution. Students using this course to satisfy the Natural Sciences section of General Education may satisfy the corresponding lab requirement by completing GEOL 102. Students may not receive credit for both GEOL 100 and 101. 3 hours lecture field trip.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "102",
        "title": "Geology of Planet Earth Lab",
        "description": "Recommended Corequisite or Preparatory: GEOL 100 or 101. Identification of rocks and minerals. Introduction to topographic maps and how they are used to interpret geologic processes and geologic history. Interpretation of geologic maps and data relating to earthquakes and plate tectonics. Satisfies the lab requirement in Natural Sciences of General Education provided either GEOL 100 or 101 is completed. 3 horus lab field trips.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOL",
        "catalog_number": "106LRS",
        "title": "Earth and Space Science for Liberal Studies Majors",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Analysis of Earth systems (atmosphere hydrosphere lithosphere and biosphere) the solar system and the universe. Selected topics include structure and composition of the Earth; minerals and rocks; plate tectonics; landforms and surface processes; natural hazards such as floods earthquakes and volcanic eruptions; physical oceanography the water cycle weather and climate; formation of the universe and solar system; and evolution of stars and galaxies. 3 hours lecture per week. Available for Earth Science credit for Liberal Studies. (Cross listed with GEOG 106LRS.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "107",
        "title": "Geology Goes Hollywood",
        "description": "Corequisite: GEOL 107L. This online lecture and laboratory combination explores how Earth science issues that impact society are depicted in film and television and how these depictions influence the viewers perceptions of Earth science. Students will learn fundamental concepts of Earth science and how to evaluate the appropriateness and accuracy of Earth science portrayed in fictional and documentary film and television. (Available for General Education Natural Sciences fulfills lecture and lab credit.)\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "107L",
        "title": "Geology Goes Hollywood Lab",
        "description": "Corequisite: GEOL 107. This online lecture and laboratory combination explores how Earth science issues that impact society are depicted in film and television and how these depictions influence the viewers perceptions of Earth science. Students will learn fundamental concepts of Earth science and how to evaluate the appropriateness and accuracy of Earth science portrayed in fictional and documentary film and television. (Available for General Education Natural Sciences fulfills lecture and lab credit.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOL",
        "catalog_number": "110",
        "title": "Earth and Life through Time",
        "description": "Introduction to the dynamic study of the Earths evolution including changes in its crust oceans atmosphere and climate and how these changes woven into the fabric of geologic time affected major groups of plants and animals including dinosaurs and humans. Students using this course to satisfy a General Education requirement Natural Sciences may satisfy the corresponding lab requirement by completing GEOL 112.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "112",
        "title": "Earth and Life through Time Lab",
        "description": "Recommended Corequisite or Preparatory: GEOL 110. Course content includes introduction to fossil relative-age relationships and construction and interpretation of maps and cross-sections that emphasize paleogeography and sedimentary rocks. May be used satisfy the lab requirement in Natural Sciences of General Education provided GEOL 110 is completed. 3 hours lab 1-day field trip.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOL",
        "catalog_number": "117",
        "title": "GEOL DISASTERS",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "117L",
        "title": "GEOL DISASTERS LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOL",
        "catalog_number": "122",
        "title": "The World Ocean",
        "description": "Introduction to the oceans. Evolution of the ocean basins their environment and resources. Aspects of biological chemical geological and physical oceanography. Students using this course to satisfy a General Education requirement may satisfy the corresponding lab requirement by completing GEOL 123. 3 hours lecture field trips.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "123",
        "title": "World Ocean Lab",
        "description": "Recommended Corequisite or Preparatory: GEOL 122. Introduction to oceanographic data its collection and interpretation. May be used to satisfy the lab requirement in the Natural Sciences of General Education provided GEOL 122 also is completed. 3 hours lab field trips.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOL",
        "catalog_number": "300",
        "title": "Environmental Geology",
        "description": "Preparatory: Completion of the Lower Division writing requirement. Study of the relationship between humans and the Earth and the application of geology to environmental problems. Topics include geological hazards pollution mineral and energy resources land use planning and environmental impact. Students using this course to satisfy a General Education requirement in the Natural Sciences may satisfy the corresponding lab requirement by completing GEOL 301. 3 hours lecture field trips.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "301",
        "title": "Environmental Geology Lab",
        "description": "Recommended Corequisite or Preparatory: GEOL 300. Introduction to geologic materials and processes as they are applicable to the human environment. Included are practical exercises on rocks minerals geologic maps and water mineral and energy resources. Earthquake volcanic landslide and flood hazard evaluations are also performed. 3 hours lab field trips. May be used to satisfy the lab requirement in the Natural Sciences of General Education provided GEOL 300 also is completed.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOL",
        "catalog_number": "307",
        "title": "Petrology",
        "description": "Prerequisite: GEOL 207/L. Corequisite: 307L. Introduction to the classification and origin of igneous and metamorphic rocks including the optical properties of minerals. Lab study of these rocks utilizing hand-specimen characteristics and the petrographic microscope. 3 hours lecture 3 hours lab field trips.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "307L",
        "title": "Petrology Lab",
        "description": "Prerequisite: GEOL 207/L. Corequisite: 307. Introduction to the classification and origin of igneous and metamorphic rocks including the optical properties of minerals. Lab study of these rocks utilizing hand-specimen characteristics and the petrographic microscope. 3 hours lecture 3 hours lab field trips.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOL",
        "catalog_number": "309",
        "title": "TECTONICS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "309L",
        "title": "TECTONICS LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOL",
        "catalog_number": "314",
        "title": "EARTH SYSTEMS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "314L",
        "title": "EARTH SYSTEMS LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOL",
        "catalog_number": "324",
        "title": "DINOSAURS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "341",
        "title": "SED/STRAT LECT",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "341L",
        "title": "SED/STRAT LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOL",
        "catalog_number": "406LRS",
        "title": "Liberal Studies Science Experience Capstone",
        "description": "Prerequisites: BIOL 100 101 or 102; PHSC 170; GEOL 106LRS or GEOG 106LRS. This laboratory course serves as a culminating science experience for Liberal Studies majors in the pre-credential and ITEP Options. An interdisciplinary blend of biology physics chemistry and Earth and space sciences from Lower Division courses will be integrated into the course as various topics are explored through the broad lens of Earth science. Hands-on investigations will include topics linked to California K-6 State Science Standards such as the nature of science astronomy and the solar system solar energy and meteorology the water cycle fossils and the evolution of life rocks and minerals natural resources plate tectonics and Earths structure earthquakes and volcanic eruptions and geomorphology. 3 hours lab.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOL",
        "catalog_number": "497",
        "title": "Research Methods and Design",
        "description": "Preparatory: Junior or senior standing; Instructor consent. Students are advised and guided in research methods and design. Students use critical reasoning and the scientific method to develop and write their own research proposal to execute the project for their senior thesis. The written proposal is patterned after those required by the National Science Foundation.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "498",
        "title": "Senior Thesis",
        "description": "Prerequisites: GEOL 497; Instructor consent. Following approval by the Thesis Advisor of a written proposal the student completes an original research project in consultation with the faculty advisor. Upon completion of the research the student will submit the written thesis to the Advisor and give an oral presentation to the Department of Geological Sciences.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "GEOL",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "See Independent Study under Courses of Study. Cannot be used for General Education credit.Graduate CoursesGEOL 500. Environmental Geology Seminar (3)\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "GEOL",
        "catalog_number": "533",
        "title": "Geology of Earthquakes",
        "description": "Preparatory: GEOL 310. Lecture topics will include a review of plate tectonics rock mechanics seismology tectonic geodesy paleoseismology tectonic geomorphology and seismic hazard assessment. Detailed discussions will include study of recent major earthquakes that have occurred in strike-slip thrust-reverse megathrust (subduction zone) and normal-fault tectonic settings. Labs will include study of air photos geologic maps trench logs and core descriptions from studies of recent earthquakes and the collection and analysis of field data used in earthquake studies. 2 hours lecture 3 hours lab field trips.\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "GEOL",
        "catalog_number": "533L",
        "title": "Geology of Earthquakes Lab",
        "description": "Preparatory: GEOL 310. Lecture topics will include a review of plate tectonics rock mechanics seismology tectonic geodesy paleoseismology tectonic geomorphology and seismic hazard assessment. Detailed discussions will include study of recent major earthquakes that have occurred in strike-slip thrust-reverse megathrust (subduction zone) and normal-fault tectonic settings. Labs will include study of air photos geologic maps trench logs and core descriptions from studies of recent earthquakes and the collection and analysis of field data used in earthquake studies. 2 hours lecture 3 hours lab field trips.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOL",
        "catalog_number": "536",
        "title": "IGNEOUS PETROLOGY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "590",
        "title": "LIT SEMINAR",
        "description": null,
        "units": "1",
        "class_type": "SEM"
    },
    {
        "subject": "GEOL",
        "catalog_number": "595U",
        "title": "HYDROGEOCHEMISTRY",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "GEOL",
        "catalog_number": "694",
        "title": "GRAD RES DESIGN",
        "description": null,
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "696C",
        "title": "Directed Graduate Research",
        "description": "No course description\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "GEOL",
        "catalog_number": "698C",
        "title": "Thesis or Graduate Project",
        "description": "No course description\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "GEOL",
        "catalog_number": "699A",
        "title": "Independent Study",
        "description": "See Independent Study under Courses of Study. Cannot be used for General Education credit.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "GEOL",
        "catalog_number": "104",
        "title": "Living With Earthquakes in California",
        "description": "Not for credit in Geology major. Examines the revolution in earthquake hazard awareness that has occurred in California since the mid-1980s when the scale of the earthquake hazard began to emerge from scientific discovery. Students will investigate the reciprocal ways in which science has informed the public political and economic debate over the implications of earthquake hazard as well as exploring the manner by which public and political priorities have shaped the direction of scientific and engineering response to the hazard. Lecture 3 hours. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "303",
        "title": "COMMUNICATING GEO",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "306",
        "title": "EARTH MAT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "306L",
        "title": "EARTH MAT LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOL",
        "catalog_number": "310",
        "title": "Structural Geology",
        "description": "Corequisite GEOL 310L. Recommended Corequisite or Preparatory: GEOL 307. Study of rock deformational processes and resulting structures in the Earths crust. Lab work emphasizes the use of graphic methods to assist in the geometric and kinematic interpretation of rock structures. 3 hours lecture 3 hours lab.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "310L",
        "title": "Structural Geology Lab",
        "description": "Corequisite GEOL 310. Recommended Corequisite or Preparatory: GEOL 307. Study of rock deformational processes and resulting structures in the Earths crust. Lab work emphasizes the use of graphic methods to assist in the geometric and kinematic interpretation of rock structures. 3 hours lecture 3 hours lab.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOL",
        "catalog_number": "313",
        "title": "FIELD METHODS",
        "description": null,
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "GEOL",
        "catalog_number": "344",
        "title": "CALIFORNIA GEOL",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "490",
        "title": "SENIOR CAPSTONE",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "GEOL",
        "catalog_number": "548",
        "title": "SEISMOLOGY",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "548L",
        "title": "SEISMOLOGY LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "GEOL",
        "catalog_number": "552",
        "title": "Geochemistry",
        "description": "Preparatory: GEOL 307 or instructor consent. Application of the principles of chemistry to geological problems. Topics include nucleosynthesis origin of the solar system elemental distribution and stable and unstable isotopes. 3 hours lecture.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "575",
        "title": "HYDROGEOLOGY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "GEOL",
        "catalog_number": "575L",
        "title": "HYDROGEOLOGY LAB",
        "description": null,
        "units": "1",
        "class_type": "LAB"
    }
]