[
    {
        "subject": "HUM",
        "catalog_number": "101",
        "title": "Forms and Ideas in Humanities",
        "description": "Prerequisite: EPT score of 151 or higher or completion of the Lower Division writing requirement. Introductory course provides instruction in the interdisciplinary analysis and interpretation of meaning in art music and literature and in the understanding of philosophical ideas in their own right and as they influence styles and themes in works of art. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HUM",
        "catalog_number": "105",
        "title": "Cultural Eras in Humanities I",
        "description": "Prerequisite: EPT score of 151 or higher or completion of the Lower Division writing requirement. Interdisciplinary study of major eras of humanistic development from the ancient world to the 15th century through representative works of visual art architecture music philosophy religion and oral and written literature. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HUM",
        "catalog_number": "106",
        "title": "Cultural Eras in Humanities II",
        "description": "Prerequisite: EPT score of 151 or higher or completion of the Lower Division writing requirement. Interdisciplinary study of major eras of humanistic development from the 16th to 20th century through representative works of visual art architecture film music philosophy religion and oral and written literature. (Available for General Education Arts and Humanities.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "HUM",
        "catalog_number": "391",
        "title": "Cultural Theories and Methodologies",
        "description": "Preparatory: HUM 105 or 106. Intensive interdisciplinary study of an age movement problem or theme with emphasis on the practices and methodologies of interdisciplinary study. The topic of the seminar varies. (Cross listed with FLIT 391.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HUM",
        "catalog_number": "491",
        "title": "Capstone Seminar",
        "description": "Preparatory: HUM 391 or FLIT 391; At least one course in intellectual history cultural theory or critical methodologies. Intensive interdisciplinary study of an age movement problem or theme with emphasis on the application of cultural theory in interdisciplinary study. The topic of the seminar varies. (Cross listed with FLIT 491 and LRS 491.)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "HUM",
        "catalog_number": "392IP",
        "title": "INTRO GERM CULT&SOC",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    }
]