[
    {
        "subject": "PHYS",
        "catalog_number": "100A",
        "title": "General Physics I",
        "description": "Prerequisite: MATH 103 or 104 or 105 or a score on the Mathematics Placement Test (MPT) sufficient for entry into MATH 255A. Introductory course in physics. Topics covered include mechanics heat and sound. (Students using this course to satisfy the Natural Sciences requirement in General Education may satisfy the corresponding lab requirement by completing course PHYS 100AL.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "100AL",
        "title": "General Physics I Lab",
        "description": "Recommended Corequisite or Preparatory: PHYS 100A. 3 hours per week. (May be used to satisfy the lab requirement in Natural Sciences General Education provided PHYS 100A also is completed.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "PHYS",
        "catalog_number": "100B",
        "title": "General Physics II",
        "description": "Prerequisite: PHYS 100A. Continuation of PHYS 100A. Topics covered include electricity and magnetism light and modern physics. (Students using this course to satisfy the Natural Sciences requirement in General Education may satisfy the corresponding lab requirement by completing course PHYS 100BL.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "100BL",
        "title": "General Physics II Lab",
        "description": "Recommended Corequisite or Preparatory: PHYS 100B. 3 hours per week. (May be used to satisfy the lab requirement in Natural Sciences General Education provided PHYS 100B also is completed.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "PHYS",
        "catalog_number": "220A",
        "title": "Mechanics",
        "description": "Prerequisite: Chemistry and Biochemistry Majors: MATH 150A or 255A. Recommended Corequisite or Preparatory: Chemistry and Biochemistry Majors: MATH 150B or 255B. Dynamics and statics of particles and rigid bodies harmonic vibrations and fluid mechanics. (Students using this course to satisfy the Natural Sciences requirement in General Education may satisfy the corresponding lab requirement by completing course PHYS 220AL.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "220AL",
        "title": "Mechanics Lab",
        "description": "Recommended Corequisite or Preparatory: PHYS 220A or 225. 3 hours per week. (May be used to satisfy the lab requirement in Natural Sciences General Education provided PHYS 220A also is completed.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "PHYS",
        "catalog_number": "220B",
        "title": "Electricity and Magnetism",
        "description": "Prerequisites: PHYS 220A. For Chemistry and Biochemistry Majors: MATH 150B or 255. Recommended Corequisite or Preparatory: MATH 250. Electric and magnetic fields circuit theory and electromagnetic induction. (Students using this course to satisfy the Natural Sciences requirement in General Education may satisfy the corresponding lab requirement by completing course PHYS 220BL.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "220BL",
        "title": "Electricity and Magnetism LAB",
        "description": "Recommended Corequisite or Preparatory: PHYS 220B or 226. 3 hours per week. (May be used to satisfy the lab requirement in Natural Sciences General Education provided PHYS 220B also is completed.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "PHYS",
        "catalog_number": "226",
        "title": "Physics II",
        "description": "Prerequisites: MATH 150B; PHYS 225. Recommended Corequisite or Preparatory: MATH 250. Second course of a sequence of courses intended primarily for physical science majors. Calculus-based course on electricity magnetism and optics.\n",
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "292IP",
        "title": "PHYSICS 1",
        "description": null,
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "301",
        "title": "Analytical Mechanics I",
        "description": "Preparatory: MATH 250 280; PHYS 227. Newtonian mechanics of a single particle oscillations systems of particles central force motion calculus of variations and Lagrangian and Hamiltonian mechanics.\n",
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "305",
        "title": "Physics Of Music",
        "description": "Corequisite: PHYS 305L. Preparatory: Completion of the Lower Division writing requirement. This course is currently taught entirely and only online. History and development of the science of sound and music physical concepts necessary for the study of wave motion mechanics of the construction of sound and musical tones and basic physical principles involved in the production of sound in instruments and the human voice including studies of the production of language. A good understanding of the composition of sounds and musical tones is obtained without detailed mathematics through experiments carried out in the home or other locations using the students computer with installed software. A final project is required. (Available for General Education Natural Sciences.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "305L",
        "title": "Physics Of Music Lab",
        "description": "Corequisite: PHYS 305. Preparatory: Completion of the Lower Division writing requirement. This course is currently taught entirely and only online. History and development of the science of sound and music physical concepts necessary for the study of wave motion mechanics of the construction of sound and musical tones and basic physical principles involved in the production of sound in instruments and the human voice including studies of the production of language. A good understanding of the composition of sounds and musical tones is obtained without detailed mathematics through experiments carried out in the home or other locations using the students computer with installed software. A final project is required. (Available for General Education Natural Sciences.) (IC)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "PHYS",
        "catalog_number": "311",
        "title": "Electromagnetism I",
        "description": "Preparatory: MATH 250 280; PHYS 227. Vector calculus electrostatics magnetostatics Faradays Law and introduction to Maxwells equations.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "331",
        "title": "PHYSICS OF SPORTS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "365",
        "title": "Experimental Physics I",
        "description": "Preparatory: MATH 250 262 280; PHYS 227/L. Advanced experimental techniques in physics with topics including optics nuclear physics thin-film characteristics microwaves data acquisition via computer interface computer simulations solar observations and other topics chosen by the instructor. This course includes a module on computer analysis in physics using Matlab. Students are trained in advanced experimental techniques and complete 2 experimental modules for 2 units of credit. 6 hours per week.\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "PHYS",
        "catalog_number": "376",
        "title": "Radiologic Physics",
        "description": "Preparatory: PHYS 100A/L 100B/L or instructor consent. Specialized course devoted to the nature and production of X-radiation. Topics include the interaction of radiation with matter attenuation of X-rays and the principles behind radiographic equipment and components.\n",
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "389",
        "title": "Mathematical Methods in Physics I",
        "description": "Preparatory: PHYS 227; MATH 280 or 351. An introduction to the mathematical methods used in junior and senior level physics courses. Topics covered include vector analysis linear algebra and partial differentiation.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "431",
        "title": "Thermodynamics and Statistical Mechanics",
        "description": "Preparatory: PHYS 301 375. Laws of thermodynamics thermodynamic potentials kinetic theory phase transitions equilibrium ensembles and related formalism with applications to classical and quantum systems. Available for graduate credit.\n",
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "451",
        "title": "Quantum Physics II",
        "description": "Preparatory: PHYS 311 375. Hydrogen atom angular momentum spin matrix representation quantum statistics perturbation theory and scattering. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "465",
        "title": "Experimental Physics III",
        "description": "Preparatory: PHYS 365. Advanced experimental techniques in physics with topics including optics nuclear physics thin-film characteristics microwaves data acquisition via computer interface computer simulations solar observations and other topics chosen by the instructor. Students are trained in advanced experimental techniques and will complete 2 experimental modules for 2 units of credit. 6 hours per week.\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "PHYS",
        "catalog_number": "480",
        "title": "Introduction to Solid State Physics",
        "description": "Preparatory: PHYS 311 375. Structure of crystals; electron theory of metals; theory of semiconductors; and mechanical electrical and magnetic behavior of substances in the solid state. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "490",
        "title": "Computer Applications in Physics",
        "description": "Preparatory: PHYS 301 and 365 or instructor consent. Applications of numerical analysis and computer programming to the solution of problems in classical and modern physics. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "493",
        "title": "Physics and Astronomy Colloquium",
        "description": "Preparatory: Junior senior or graduate standing in Physics. Series of lectures presented weekly by faculty members and invited speakers on topics of current interest in physics astronomy and related fields. May be repeated twice for credit.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "495C",
        "title": "DIR UNDERGRAD RES",
        "description": null,
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "PHYS",
        "catalog_number": "498",
        "title": "Undergraduate Thesis",
        "description": "Preparatory: Admission to Honors Program in Physics.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "PHYS",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "See Independent Study under Courses of Study.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "PHYS",
        "catalog_number": "585",
        "title": "COMP MAT THEORY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "588",
        "title": "MULTIFERROICS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "600",
        "title": "Classical Mechanics",
        "description": "Preparatory: PHYS 402 410 451. Advanced course in classical mechanics with topics selected from Lagrangian and Hamiltonian dynamics continuum mechanics nonlinear systems and chaos.\n",
        "units": "4",
        "class_type": "SEM"
    },
    {
        "subject": "PHYS",
        "catalog_number": "601",
        "title": "Selected Topics in Astrophysics",
        "description": "Preparatory: PHYS 375 402 410. Advanced treatment of the observational and theoretical foundations of astrophysics. Topics may include stellar structure radio sources relativistic cosmology the origin of the elements and galaxy formation.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PHYS",
        "catalog_number": "650",
        "title": "Quantum Mechanics I",
        "description": "Preparatory: PHYS 451. Recommended Corequisite or Preparatory: PHYS 600. Mathematical foundation of quantum theory. Scattering theory. Angular momentum and spin. Identical particles. Heisenberg and Schrodinger representations. Perturbation theory.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PHYS",
        "catalog_number": "696A",
        "title": "Directed Graduate Research",
        "description": "No course description.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "PHYS",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Preparatory: Completion of all courses required in the Program. May not be used for credit in the Program itself.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "PHYS",
        "catalog_number": "698C",
        "title": "Thesis",
        "description": "Preparatory: Classified graduate status; Permission of the Department; Instructors consent to serve as Thesis Advisor. Dissertation of a specialized advanced topic in physics such as a critical evaluation and extension of an existing theoretical treatment the construction and use of advanced research apparatus or an original theoretical analysis.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "PHYS",
        "catalog_number": "699A",
        "title": "Independent Study",
        "description": "Preparatory: At least 1 graduate course in Physics; Instructor consent. Investigation of a special topic in physics with emphasis on advanced theoretical or experimental skills. See Independent Study under Courses of Study.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "PHYS",
        "catalog_number": "225",
        "title": "Physics I",
        "description": "Prerequisite: MATH 150A. Recommended Corequisite or Preparatory: MATH 150B. First course of a sequence intended primarily for physical science majors. Calculus-based course on mechanics fluids waves and acoustics.\n",
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "227",
        "title": "Physics III",
        "description": "Prerequisites: MATH 150; PHYS 226 or 220B. Recommended Corequisite or Preparatory: MATH 280. Third course of a sequence of courses intended primarily for physical science majors. Calculus-based course on thermodynamics waves and modern physics.\n",
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "227L",
        "title": "Physics III LAB",
        "description": "Recommended Corequisite or Preparatory: PHYS 227. 3 hours per week.\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "PHYS",
        "catalog_number": "366",
        "title": "Experimental Physics II",
        "description": "Preparatory: MATH 250 262 280; PHYS 227/L. Advanced experimental techniques in physics with topics including optics nuclear physics thin-film characteristics microwaves data acquisition via computer interface computer simulations solar observations and other topics chosen by the instructor. Students are trained in advanced experimental techniques and complete 2 experimental modules for 2 units of credit. 6 hours per week.\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "PHYS",
        "catalog_number": "375",
        "title": "Quantum Physics I",
        "description": "Preparatory: MATH 262; PHYS 301. Classical background the wave function  Schroedinger equation time development and stationary states 1-dimensional problems harmonic oscillator and formalism of quantum mechanics.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "402",
        "title": "Analytical Mechanics II",
        "description": "Preparatory: MATH 262; PHYS 301. Noninertial reference frames rigid body motion coupled oscillations nonlinear mechanics scattering vibrating string and Fourier analysis. Available for graduate credit\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "410",
        "title": "Electromagnetism II",
        "description": "Preparatory: MATH 262; PHYS 301 311. Maxwells equations and applications electromagnetic waves radiation and special relativity. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "420",
        "title": "Modern Optics",
        "description": "Preparatory: PHYS 311 375. Propagation of electromagnetic waves. Geometrical optics. Physical optics including refraction reflection interference diffraction and polarization. Atomic spectroscopy. Lasers. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "466",
        "title": "Experimental Physics IV",
        "description": "Preparatory: PHYS 365. Advanced experimental techniques in physics with topics including optics nuclear physics thin-film characteristics microwaves data acquisition via computer interface computer simulations solar observations and topics chosen by the instructor. Students are trained in advanced experimental techniques and will complete 2experimental modules for 2 units of credit. 6 hours per week.\n",
        "units": "2",
        "class_type": "LAB"
    },
    {
        "subject": "PHYS",
        "catalog_number": "489",
        "title": "Mathematical Methods in Physics II",
        "description": "Prerequisite: PHYS 389 or graduate standing; Preparatory: MATH 380 PHYS 375 (may be taken concurrently). Topics include complex variables ordinary and partial differential equations special functions and boundary value problems with physical applications. Available for graduate credit.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "495B",
        "title": "DIR UNDERGRAD RES",
        "description": null,
        "units": "2",
        "class_type": "SUP"
    },
    {
        "subject": "PHYS",
        "catalog_number": "497",
        "title": "SENIOR PROJECT",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PHYS",
        "catalog_number": "610",
        "title": "Electromagnetic Theory",
        "description": "Preparatory: PHYS 410 489. Advanced theoretical treatment of the electrostatic field with introduction of mathematical techniques. Introduction to electromagnetic waves and radiation from sources.\n",
        "units": "4",
        "class_type": "LEC"
    },
    {
        "subject": "PHYS",
        "catalog_number": "630",
        "title": "Statistical Physics",
        "description": "Preparatory: PHYS 431 451 600. Theoretical foundations of thermodynamics and statistical mechanics for equilibrium and non-equilibrium systems. Applications to Bose and Fermi assemblies real gases liquids solids solutions phase transitions and chemical reactions.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "PHYS",
        "catalog_number": "651",
        "title": "Quantum Mechanics II",
        "description": "Preparatory: PHYS 650. Relativistic wave equations. Advanced scattering theory. Selected topics from quantum theory of atoms and molecules.\n",
        "units": "3",
        "class_type": "SEM"
    }
]