[
    {
        "subject": "QS",
        "catalog_number": "101",
        "title": "INTRO QUEER STUDIES",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "113A",
        "title": "Approaches to University Writing A",
        "description": "Prerequisite: EPT score of 139 and below. Corequisite: UNIV 061. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction syntax and grammar as well as the elements of prose style. Students receive credit for only 1 course chosen from AAS CAS CHS ENGL PAS or QS 113A. Students are required to also enroll in UNIV 061 (1 credit) or equivalent. Individual tutoring is available through the Learning Resource Center.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "113AOP",
        "title": "APPR UNIV WRITING A",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "114A",
        "title": "Approaches to University Writing A",
        "description": "Prerequisite: EPT score of 140-148. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction syntax and grammar as well as the elements of prose style. Students receive credit for only 1 course chosen from AAS CAS CHS ENGL PAS or QS 114A. Individual tutoring is available through the Learning Resource Center.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "115",
        "title": "Approaches to University Writing",
        "description": "Prerequisite: EPT score of 149 or higher. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction syntax and grammar as well as the elements of prose style. Students receive credit for only 1 course chosen from AAS CAS CHS ENGL PAS or QS 115. Individual tutoring is available through the Learning Resource Center. (Available for General Education Analytical Reading/Expository Writing.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "151",
        "title": "QS PUBLIC SPEAKING",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "201",
        "title": "RCETHNC IN QUEERSTUD",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "204",
        "title": "QUEER POP MUSIC",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "208",
        "title": "QUEER HEALTH",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "301",
        "title": "Perspectives in Queer Studies",
        "description": "This course introduces students to the current theories and histories in queer studies including such closely related fields as transgender studies. The course also introduces students to the scope of queer studies to scholarly community-based and activist resources and to the varied interdisciplinary methodological and theoretical paradigms in the field. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "302",
        "title": "LA IN TRANSIT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "303",
        "title": "TRANSGENDER STUDIES",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "304",
        "title": "QUEER SCREEN/SPEC",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "369",
        "title": "NATURE OF QUEER",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "401H",
        "title": "QUEER HISTORY",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "401L",
        "title": "Advanced Topics in Queer Studies: Queer Leadership",
        "description": "Intensive study of selected topics in queer studies such as queer theory transgender theory queer issues in education queer popular culture the queer diaspora and the globalization and medicalization of sex and gender. Topics change from semester to semester. May be repeated for credit with instructors consent.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "401PI",
        "title": "QUEER POP ICONS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "401QFV",
        "title": "QUEER FILM&VIDEO",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "490",
        "title": "Queer Studies Senior Capstone",
        "description": "Students develop and complete theoretically informed individualized research projects in queer studies in a structured setting. The project will include peer and instructor feedback and guidance on selecting an appropriate topic; conducting research drafting and revising the project; and presenting the completed project. Course may be offered online or in a classroom setting.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "QS",
        "catalog_number": "499",
        "title": "Queer Studies Independent Study",
        "description": "Queer Studies independent study is for advanced students who are interested in working on an independent project with a faculty  sponsor. The student needs to complete an Independent Study Form with the approval signature from the faculty sponsor and the Queer Studies Coordinator.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "QS",
        "catalog_number": "113B",
        "title": "Approaches to University Writing B",
        "description": "Prerequisite: QS 113A. Corequisite: UNIV 062. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction syntax and grammar as well as the elements of prose style. Students receive credit for only 1 course chosen from AAS CAS CHS ENGL PAS or QS 113B. Individual tutoring is available through the Learning Resource Center. (Available for General Education Analytical Reading/Expository Writing.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "113BOP",
        "title": "APPR UNIV WRTNG B",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "114B",
        "title": "Approaches to University Writing B",
        "description": "Prerequisites: QS 114A. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction syntax and grammar as well as the elements of prose style. Students receive credit for only 1 course chosen from AAS CAS CHS ENGL PAS or QS 114B. Individual tutoring is available through the Learning Resource Center. (Available for General Education Analytical Reading/Expository Writing.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "QS",
        "catalog_number": "401T",
        "title": "QUEER THEATER",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    }
]