[
    {
        "subject": "RTM",
        "catalog_number": "150",
        "title": "Introduction to Outdoor Education in the Back Country",
        "description": "Prerequisite: Restricted to Kinesiology Majors. Introduction to safe back country camping and travel including elements of trip preparation; cross-country navigation; effects of environmental conditions of cold heat and altitude on the human body; and nutrition and environmental hazards. Emphasis on safety environmental awareness and minimizing environmental impact. Arranged field trips are required.\n",
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "RTM",
        "catalog_number": "151A",
        "title": "Backpacking",
        "description": "Introduction to backpacking as an outdoor pursuit. Emphasis on proper use of equipment and safety of participants in the natural environment. This course is designed to give students a general overview of and experience in backpacking and spending time in the back country. Arranged field trips are required.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "151B",
        "title": "Rock Climbing and Mountaineering",
        "description": "Basic elements of rock climbing mountaineering and alpine travel will be examined including climbing ethics fitness and the physiological effects of environmental stress and work at high altitudes. Emphasis will be on safety proper use of equipment climbing technique and minimizing impacts on the natural environment. Arranged field trips are required.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "151D",
        "title": "Flat-Water Boating",
        "description": "Introduction to safe travel by kayak or canoe on lakes rivers and oceans. Includes equipment navigation and techniques for flat-water boating and emergency self-rescue. Emphasis will be on safety  environmental awareness and skill development. Arranged field trips are required.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "151F",
        "title": "Survival",
        "description": "Studies in the skills essential for wilderness survival in a variety of physical environments. Includes topics of shelters water navigation and edible plants and animals. Emphasis on techniques with primitive technologies environmental conservation and safety. Arranged field trips are required.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "151G",
        "title": "Challenge/Ropes Courses",
        "description": "Introduction to the safe operation of challenge/ropes course activities for outdoor experience. Emphasis on proper use of equipment and safety of both high- and low-component challenge courses. This course is designed to give students a general overview of and experience in the practice of group challenges utilizing initiatives and high ropes elements. Arranged field trips are required.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "151H",
        "title": "Caving",
        "description": "Introduction to the safe exploration of caves and the underground environment including cave formations and features techniques and special hazards. Emphasis on safety techniques for horizontal and vertical caves environmental awareness and skill development. Arranged field trips are required.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "202",
        "title": "Planning Programs and Events for Recreation Experiences",
        "description": "Prerequisite: Lower Division writing requirement; Corequisite: RTM 202L. Overview of the program- and event-planning processes as they relate to the provision of human and leisure services through play recreation and leisure experiences for a variety of service recipients and settings. Lab experiences applying skills and principles addressed.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "202L",
        "title": "Planning Programs and Events for Recreation Experiences Lab",
        "description": "Prerequisite: Lower Division writing requirement; Corequisite: RTM 202. Overview of the program- and event-planning processes as they relate to the provision of human and leisure services through play recreation and leisure experiences for a variety of service recipients and settings. Lab experiences applying skills and principles addressed.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "RTM",
        "catalog_number": "204",
        "title": "Introduction to Recreation Therapy",
        "description": "Study of the nature and function of recreation in a variety of agencies and settings. Overview of the physical cognitive affective and social characteristics of a variety of individuals with special needs with emphasis on planning and adapting recreation programs both in clinical and community/inclusive settings. Participation in field work is required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "251",
        "title": "Recreation and the Natural Environment",
        "description": "Study of recreational use of outdoor/natural areas and the trends creating changing patterns of use. Overview of human animal and vehicular impacts on the outdoor recreation resources. (Available for General Education Applied Arts and Sciences.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "265",
        "title": "Water Skiing and Wakeboarding",
        "description": "Prerequisite: Basic swimming skills. Develops proficiency in water skiing skills including wakeboarding with an emphasis on safety and the proper use of equipment.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "RTM",
        "catalog_number": "267",
        "title": "Sailing",
        "description": "Prerequisite: Elementary swimming skills. Corequisite: RTM 267L. Development of the skills and art of sailing including the development of basic seamanship small boat handling competency safety procedures and regulations and introductions to competitive sailing and ocean cruising. 1 hour lecture 2 hours lab per week.\n",
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "267L",
        "title": "Sailing Lab",
        "description": "Prerequisite: Elementary swimming skills. Corequisite: RTM 267. Development of the skills and art of sailing including the development of basic seamanship small boat handling competency safety procedures and regulations and introductions to competitive sailing and ocean cruising. 1 hour lecture 2 hours lab per week.\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "RTM",
        "catalog_number": "278",
        "title": "Recreation and Leisure in Contemporary Society",
        "description": "Investigation of the contributions of play leisure and recreation to the social psychological and economic well-being of individuals and groups incorporating local regional national and international perspectives. Regular written assignments are required. Recreation and Tourism Major requirement. (Available for General Education Lifelong Learning.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "280",
        "title": "Organizing Campus Recreation and Sport",
        "description": "Overview of the concepts and applications for effective campus recreation and sport programming and administration. Of value to current and future leaders in the field of campus recreation and sport. Includes specific field observation experiences.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "296RS",
        "title": "INTRO REC SPORT",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "300",
        "title": "Recreation and Community Development",
        "description": "Prerequisite: Lower Division writing requirement. Examination of the multicultural dynamics of urban life and recreations role in building community and in developing youth capacity and  indigenous leadership.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "302",
        "title": "Dynamics of Leadership in Recreation and Human Services",
        "description": "Prerequisites: Lower Division writing requirement. Includes an analysis of personal leadership theory and small-group dynamics and a review of classic leadership studies with emphasis on leadership values and methods including group dynamics communication decision making and motivation. Emphasis on competencies and skills needed for successful leadership of small groups. Experiential components are an integral part of class design. Field trip experiences required.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "303",
        "title": "Promotion of the Recreation Experience",
        "description": "Interpretation and promotion of recreation programs and services through the use of media processes and resources marketing principles and computer applications.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "304",
        "title": "Entrepreneurial Ventures in Recreation and Human Services",
        "description": "Analysis of approaches and techniques necessary to initiate an entrepreneurial start-up in the recreation and human service arenas. Topics include the nature of entrepreneurialism development of a business plan organization of the enterprise financial and operations management and computer applications.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "305",
        "title": "Dynamics of Early Childhood Play",
        "description": "Study of play in relation to the childs early growth and development. Implications for functional environmental and leadership dimensions of organized play experiences in early years. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the Schedule of Classes for the CS Designation.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "306",
        "title": "Leadership Coaching",
        "description": "Preparatory: RTM 302. A basic foundation for understanding and practicing coaching methodology for leadership development. Content includes core coaching competencies and principles the coaching conversation model ethics and standards application of skills necessary for one-to-one coaching to produce positive change in leaders.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "310",
        "title": "Adventure Recreation and Human Relations",
        "description": "Prerequisite: Lower Division writing requirement. Corequisite: RTM 310L. Introduction to personal growth and adventure. Explores issues of identity racial and ethnic diversity gender and self-esteem through readings written assignments and recitation. Regular written assignments required. Lab: Introduction to adventure recreation and diversity issues through group initiatives and participation in a shared adventure of ropes course activities. (Available for General Education Lifelong Learning.) (IC)\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "310L",
        "title": "Adventure Recreation and Human Relations Lab",
        "description": "Prerequisite: Lower Division writing requirement. Corequisite: RTM 310. Introduction to personal growth and adventure. Explores issues of identity racial and ethnic diversity gender and self-esteem through readings written assignments and recitation. Regular written assignments required. Lab: Introduction to adventure recreation and diversity issues through group initiatives and participation in a shared adventure of ropes course activities. (Available for General Education Lifelong Learning.) (IC)\n",
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "RTM",
        "catalog_number": "314",
        "title": "Leisure Aspects of the Hospitality Industry",
        "description": "Study of the leisure experience in the context of the hospitality industry. A systems approach is used to study the design and organization of components of the hospitality industry intended to achieve leisure and recreation outcomes for guests and visitors.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "330",
        "title": "Women",
        "description": "Leisure and Ethnicity in the United StatesPrerequisite: Lower Division writing requirement. Examines the relationship among women ethnicity and leisure. Provides opportunities to investigate a variety of factors affecting women in the U.S. Regular written assignments required. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the Schedule of Classes for the CS Designation. (Available for General Education Comparative Cultural Studies.)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "351",
        "title": "Outdoor and Environmental Education",
        "description": "Study of outdoor educational philosophy and methods as they apply to the outdoor educator. Includes the history development and basic principles of outdoor/ environmental education but emphasizes strategies for teaching interpreting and program planning in outdoor environments.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "352",
        "title": "Play and Human Potential",
        "description": "Prerequisite: Lower Division writing requirement. Examination of the play phenomenon across the lifespan. Exploration analysis and evaluation of the play phenomenon in development of human potential. Regular written assignments are required. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the Schedule of Classes for the CS Designation. (Available for General Education Lifelong Learning.) (IC)\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "353",
        "title": "LIT WILDERNES EXP",
        "description": null,
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "353L",
        "title": "LIT WLDR EXPR LAB",
        "description": null,
        "units": "1",
        "class_type": "ACT"
    },
    {
        "subject": "RTM",
        "catalog_number": "402",
        "title": "Models of Play",
        "description": "Leisure and RecreationExamines the historical theoretical and philosophical foundations of play leisure and recreation and their relevance to the professional today. Explores how play theory and philosophy impact the provision of service to individuals across the lifespan and with diverse needs.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "403",
        "title": "Evaluation Research in Recreation and Human Services",
        "description": "Investigation into the fields and methods of recreation and leisure systems including special techniques and concepts of research as applicable to these systems.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "406",
        "title": "Enhancing Childhood Creativity",
        "description": "Corequisite: RTM 406L. Integrative seminar and lab experience focusing on the theoretical approaches for enhancing childhood creativity. The uses of play and fantasy are explored as the means for developing programs that are child-oriented. Regular written assignments are required. (Cross listed with CADV 406/L.)\n",
        "units": "2",
        "class_type": "SEM"
    },
    {
        "subject": "RTM",
        "catalog_number": "406L",
        "title": "Enhancing Childhood Creativity Lab",
        "description": "Corequisite: RTM 406. Integrative seminar and lab experience focusing on the theoretical approaches for enhancing childhood creativity. The uses of play and fantasy are explored as the means for developing programs that are child-oriented. Regular written assignments are required. (Cross listed with CADV 406/L.)\n",
        "units": "1",
        "class_type": "LAB"
    },
    {
        "subject": "RTM",
        "catalog_number": "414",
        "title": "Food and Beverage Management",
        "description": "Understand food and beverage operations in the hospitality industry.  Study operations food service marketing menu cost and pricing strategies hospitality accounting customer service experiences facility design and sanitation and safety issues. Opportunity to qualify for the American Hotel and Lodging Association (AHLA) Food and Beverage Management Certification.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "415",
        "title": "Leisure and Aging",
        "description": "Study of the psycho-social aspects of aging as related to leisure and recreation. Implications for functional environmental and leadership dimensions of leisure and recreation experiences in the later years. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the Schedule of Classes for the CS Designation.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "424",
        "title": "Meetings and Conventions Management",
        "description": "Preparatory: RTM 314. The meetings and conventions sector represents a significant component of hospitality and tourism.  Components of planning coordinating and managing meetings and conventions will be examined. Factors such as impacts policies feasibility and risk management of meetings and conventions will be examined in detail. Case studies will be evaluated and critiqued.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "480",
        "title": "Recreational Tourism: Issues and Trends",
        "description": "Prerequisite: Completion of Lower Division writing requirement. Study of the phenomena of domestic and international recreational tourism. Emphasis on investigating and understanding the variables that impact recreational tourism and travel destination areas. Regular written assignments are required.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "481",
        "title": "Principles of Sustainable Tourism",
        "description": "Preparatory: RTM 480. An indepth analysis of the principles and theories of sustainability as they pertain to tourism.  Various types of tourism will be examined and evaluated from economic social and natural environment perspectives. Striking a balance among competing impacts of tourism development  will be emphasised.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "490",
        "title": "Challenges in Leisure Services Seminar",
        "description": "Analytical approach to theories and principles of recreation leisure and play as they relate to field observations and practical applications.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "RTM",
        "catalog_number": "494C",
        "title": "Supervised Internship",
        "description": "Prerequisite: Senior standing. Supervised internship in professional recreation settings. (Credit/No Credit only)\n\n",
        "units": "3",
        "class_type": "LAB"
    },
    {
        "subject": "RTM",
        "catalog_number": "498A",
        "title": "Field Assignment and Reports",
        "description": "Analysis and reports of the students study project in a field site location.\n",
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "RTM",
        "catalog_number": "499A",
        "title": "INDEPENDENT STUDY",
        "description": null,
        "units": "1",
        "class_type": "SUP"
    },
    {
        "subject": "RTM",
        "catalog_number": "500",
        "title": "FOUNDATIONS THRM",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "510",
        "title": "Trends and Issues in Hospitality and Tourism",
        "description": "Preparatory: RTM 314 or 480. Addresses current trends and future projections in the industry from multiple perspectives--economic psychological cultural and social.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "RTM",
        "catalog_number": "520",
        "title": "Trends and Issues in Recreational Sport",
        "description": "Identification and analysis of current trends challenges and issues that affect management of recreational sport facilities and programs. An examination of history of the profession current professional and research issues along with anticipation and preparation for the future.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "RTM",
        "catalog_number": "530",
        "title": "Cultural Aspects and Global Perspectives in Tourism",
        "description": "Preparatory: RTM 314 or 480. Addresses issues culture as it is affected by tourism. We will examine issues of authenticity co modification of culture and the interaction of hosts and guests in different contexts ranging from the industrialized world to  developing countries.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "RTM",
        "catalog_number": "540",
        "title": "Human Resources in Recreational Sport and Tourism",
        "description": "Provides an understanding and application of key concepts/practices in human resource management as related to the recreational sport and tourism industries.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "RTM",
        "catalog_number": "580",
        "title": "Seminar in Tourism Planning: A Cultural and International Perspective",
        "description": "Analysis and evaluation of the impact of historical tourism planning trends and their influence on human services and quality-of-life issues. Advanced study of the application of contemporary tourism  planning models.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "RTM",
        "catalog_number": "610",
        "title": "Sustainability in Hospitality &#038; Tourism",
        "description": "Addresses issues of sustainability as they pertain to hospitality and tourism. Traditionally these sectors have operated with a short-term perspective and have been largely consumptive in nature. Students will evaluate principles of sustainability how they relate to hospitality and tourism and their effectiveness in different regions of the world.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "RTM",
        "catalog_number": "620",
        "title": "Effective Teams and Leaders in Tourism",
        "description": "Hospitality and Recreation OrganizationsApplication of research on effective teams and executive leadership for organizations in the tourism hospitality and recreational sport industries.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "RTM",
        "catalog_number": "684",
        "title": "Research Methods and Design",
        "description": "Discussion and application of scientific research in the field of tourism hospitality and recreation. Procedure in research design data collection data analysis data presentation and data interpretation/utilization.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "RTM",
        "catalog_number": "693B",
        "title": "Supervised Internship II",
        "description": "Prerequisite: Instructor consent. Second of 2 supervised internships requiring completion of 200 hours in an approved setting in recreational sport management or hospitality travel and tourism. The supervised internship is designed to provide a hands-on learning experience in management of recreational sport or tourism. The second internship should expand and provide further growth based on the first internship experience whether that be in the same organization or a different one. The internship will be used as a basis for the culminating Graduate Project or Thesis to be completed during the last semester of enrollment in the Graduate Program.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "RTM",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "This course is for students to enroll in during the preparation and examination phase of their M.S. Degree. This course will allow students to review and synthesize the information learned during the program reflect and assess the level of mastery attained prepare preparatory case studies and complete their Culminating Examination. Students will be expected to develop links between the various courses and during the course of the exam apply this integrated information to develop answers to current problems in the field. (Credit /No Credit only)\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "RTM",
        "catalog_number": "698",
        "title": "Graduate Project or Thesis",
        "description": "Prerequisite: Instructor consent. Culminating experience for the Graduate Degree. Planning preparation and completion of a Graduate Project or Thesis on an advanced topic in the field of recreational sport management or hospitality travel and tourism.\n",
        "units": "3",
        "class_type": "SUP"
    },
    {
        "subject": "RTM",
        "catalog_number": "698D",
        "title": "GRAD CULM PROJ",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "RTM",
        "catalog_number": "151C",
        "title": "Winter Mountaineering",
        "description": "Advanced instruction in mountaineering and travel in the back country with particular emphasis on snow and ice climbing avalanche prediction physical effects of high altitudes and winter camping skills. Emphasis is on technique proper use of equipment environmental practices and safety. Arranged field trips are required.\n",
        "units": "2",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "294CS",
        "title": "REC SVC LRN TH/PR",
        "description": null,
        "units": "1",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "294CSL",
        "title": "REC SVC LRN TH/PR LB",
        "description": null,
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "RTM",
        "catalog_number": "434",
        "title": "Accommodations Management",
        "description": "Preparatory: RTM 314. Students develop a sound understanding of the accommodations industry. Students will examine techniques issues and problems of rooms division management systems food and beverage and other functional areas according to hotel category. Review current information technology used in hotel operations.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "444",
        "title": "Non-Profit Organizations and Fund-Development in Leisure and Human Services",
        "description": "Historical survey of the development of the volunteer movement and its leisure function in American society; theory of voluntary participation and philanthropy; structure and function of volunteer boards; and analysis of fund-raising organization and techniques.\n",
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "452",
        "title": "OUTDOOR REC LDRSP",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "452L",
        "title": "OUTDOR LDRSHP LAB",
        "description": null,
        "units": "2",
        "class_type": "ACT"
    },
    {
        "subject": "RTM",
        "catalog_number": "496ME",
        "title": "LARGE SCALE EVNTS",
        "description": null,
        "units": "3",
        "class_type": "LEC"
    },
    {
        "subject": "RTM",
        "catalog_number": "550",
        "title": "Marketing and Promotions in Recreational Sport and Tourism",
        "description": "An in-depth study of the theory and application of marketing and promotions as they related to the recreational sport and tourism industries.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "RTM",
        "catalog_number": "560",
        "title": "Facility Design in Recreational Sport",
        "description": "Investigation of principles of design planning management and operation of recreational sport facilities. Students will be introduced to facility and event management facility components specifications recreation spaces specialty areas and facility trends.\n",
        "units": "3",
        "class_type": "SEM"
    },
    {
        "subject": "RTM",
        "catalog_number": "660",
        "title": "CRISIS MGMT THRM",
        "description": null,
        "units": "3",
        "class_type": "SEM"
    }
]