{
    "course-sets": {
        "required": [
            "&",
            "AFRS 100",
            "AFRS 168",
            "AFRS 201",
            [
                "|1",
                "AFRS 220",
                "AFRS 221"
            ],
            [
                "|1",
                "AFRS 245",
                "AFRS 252"
            ],
            "AFRS 271",
            "AFRS 272",
            "AFRS 350",
            [
                "|1",
                "AFRS 391",
                "AFRS 392"
            ],
            "AFRS 397",
            "AFRS 417",
            [
                "|1",
                "AFRS 420",
                "AFRS 421"
            ],
            "AFRS 498",
            [
                "|2",
                "AFRS 300",
                "AFRS 324",
                "AFRS 325",
                "AFRS 395",
                "AFRS 488"
            ]
        ]
    },
    "link-to-major": "https://catalog.csun.edu/academics/afrs/programs/ba-africana-studies-iii/african-american-urban-education/",
    "name": "B.A., Africana Studies: African-American Urban Education",
    "prog-reqq-blob": [
        "Program Requirements",
        "The Africana Studies major consists of two components: the completion of the core requirements (21 units) and the completion of one of three specific options (24 units). For each of the options, there are specific lower and upper division core courses and electives that are relevant to that concentration. All students who major in Africana Studies must select one of the three options, each of which is designed to prepare students for graduate study or for a career of their choice.",
        "1. Core Requirements for All Options (21 units)",
        "AFRS 100 Introduction to Black Studies and Culture (3)",
        "AFRS 168 Introduction to the African Diaspora (3)",
        "AFRS 201 Economics of the African-American Community I (3)",
        "AFRS 220 Psychological Environment of the African-American (3)",
        "or AFRS 221 Social Environment of the African-American (3)",
        "AFRS 245 African-American Literature Since 1930 (3)",
        "or AFRS 252 Popular Culture and the Black World (3)",
        "AFRS 271 African-American History to 1865 (3)",
        "AFRS 272 African-American History Since 1865 (3)",
        "2. Required Courses for African-American Urban Education (18 units)",
        "AFRS 350 Advanced Writing (3)",
        "AFRS 391 Psychological Foundations of Education (Elementary) (3)",
        "or AFRS 392 Sociological Foundations of Education (Elementary) (3)",
        "AFRS 397 Urban Education and Policy in Africa and the African Diaspora (3)",
        "AFRS 417 Equity and Diversity in Schools (3)",
        "AFRS 420 The Black Child (3)",
        "or AFRS 421 Strategies for Black Child Development (3)",
        "AFRS 498 Proseminar in Pan African Studies (3)",
        "3. Electives (6 units)",
        "Select two courses from the following:",
        "AFRS 300 Contemporary Issues in the African-American Community (3)",
        "AFRS 324 The Black Woman in Contemporary Times (3)",
        "AFRS 325 The Black Man in Contemporary Times (3)",
        "AFRS 395 Bilingualism in the African-American Community (3)",
        "AFRS 488 Sustainability and Environmental Justice in the African and African Diaspora Communities (3)",
        "4. Languages (Optional)",
        "All students majoring in Africana Studies are encouraged to take foreign languages (French, Portuguese, Spanish or Swahili recommended).",
        "5. General Education (48 units)",
        "Undergraduate students must complete 48 units of General Education as described in this Catalog, including 3 units of coursework meeting the Ethnic Studies (ES) graduation requirement.",
        "12 units are satisfied by the following courses in the major: AFRS 271 satisfies C3 American History, Institutions and Ideals; AFRS 201 and AFRS 220 or AFRS 221 satisfy D1 Social Sciences; and AFRS 100 satisfies 3 units of F Comparative Cultural Studies.",
        "If taken, AFRS 245 satisfies C2 Humanities; and AFRS 300, AFRS 324 or AFRS 325 satisfies 3 units of upper division F Comparative Cultural Studies.",
        "Total Units in the Major/Option: 45",
        "General Education Units: 36",
        "Additional Units: 39",
        "Total Units Required for the B.A. Degree: 120"
    ]
}