[
    {
        "subject": "ART",
        "catalog_number": "100",
        "title": "Introduction to Art Processes",
        "description": "Corequisite: ART 100L. Not available for Art major credit. Experiences for the non-art major in drawing, painting, sculpture and other art processes. Provides an understanding of the place of art in life through actual participation. 1 hour discussion, 4 hours studio. (Available for General Education, C1 Arts.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{ART 100L}"
    },
    {
        "subject": "ART",
        "catalog_number": "100L",
        "title": "Introduction to Art Processes Lab",
        "description": "Corequisite: ART 100L. Not available for Art major credit. Experiences for the non-art major in drawing, painting, sculpture and other art processes. Provides an understanding of the place of art in life through actual participation. 1 hour discussion, 4 hours studio. (Available for General Education, C1 Arts.)",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{ART 100}"
    },
    {
        "subject": "ART",
        "catalog_number": "110",
        "title": "World Arts: The Western Tradition",
        "description": "Survey of the visual arts of the Western cultural tradition from ancient to modern times emphasizing historical, religious and sociocultural contexts. Discussion, research and writing on the visual arts, including painting, sculpture, architecture, book arts, ceramics, textiles and body arts. (Available for General Education, C1 Arts.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "112",
        "title": "World Arts: Africa, Oceania and the Americas",
        "description": "Survey of the visual arts of Africa, Oceania and the Americas emphasizing historical, religious and sociocultural contexts. Discussion, research and writing on the visual arts, including painting, sculpture, architecture, book arts, ceramics, textiles and body arts. (Available for General Education, F Comparative Cultural Studies.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "114",
        "title": "World Arts: Asia",
        "description": "Survey of the visual arts of India, China, Japan, Korea and Southeast Asia, emphasizing historical, religious and sociocultural contexts. Discussion, research and writing on the visual arts, including painting, sculpture, architecture, book arts, ceramics, textiles and body arts. (Available for General Education, C1 Arts.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "120",
        "title": "Arts Immersion: Visual Art",
        "description": "Prerequisite: Restricted to students in the ITEP Freshman option program. Corequisite: ART 120L. Introduction to the study of visual arts foundation skills, concepts and ideas, based on the Visual and Performing Arts Framework and the Visual and Performing Arts Content Standards for California Public Schools. Foundation study in the visual arts includes application of the creative processes and skills, responding to and deriving meaning from works of art and developing an understanding of art in historical and cultural context. 1 hour of lecture per week; 2 hours of lab per week.",
        "units": "1",
        "prerequisites": "{Restricted to students in the ITEP Freshman option program}",
        "corequisites": "{ART 120L}"
    },
    {
        "subject": "ART",
        "catalog_number": "120L",
        "title": "Arts Immersion: Visual Art Lab",
        "description": "Prerequisite: Restricted to students in the ITEP Freshman option program. Corequisite: ART 120L. Introduction to the study of visual arts foundation skills, concepts and ideas, based on the Visual and Performing Arts Framework and the Visual and Performing Arts Content Standards for California Public Schools. Foundation study in the visual arts includes application of the creative processes and skills, responding to and deriving meaning from works of art and developing an understanding of art in historical and cultural context. 1 hour of lecture per week; 2 hours of lab per week.",
        "units": "1",
        "prerequisites": "{Restricted to students in the ITEP Freshman option program}",
        "corequisites": "ART 120"
    },
    {
        "subject": "ART",
        "catalog_number": "124A",
        "title": "Drawing I",
        "description": "Introduction to basic drawing experiences. Graphic representation of objects stressed through a variety of techniques and media. Emphasis on form, structure, values, line and systems of perspective and space. For non-art majors; 6 hours lab. (Available for General Education, C1 Arts.)",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "140",
        "title": "Beginning Two-Dimensional Design",
        "description": "Introduction to the elements and principles of 2-dimensional design that are common to the visual arts. Foundation course stressing visual perception and an effective knowledge of the graphic means of expression and communication. 6 hours per week. (Available for General Education, C1 Arts.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "141",
        "title": "Beginning Three-Dimensional Design",
        "description": "Study of the elements and principles of 3-dimensional design and their applications, with emphasis on form in space, design systems and contemporary art concepts. Experimentation in both natural and synthetic material. For non-art majors; 6 hours per week. (Available for General Education, C1 Arts.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "148",
        "title": "Color Theory",
        "description": "Prerequisite: ART 140. Introduction to basic theories of color. Investigations of color harmony and its development as applied to 2-and 3-dimensional visual form. Introductory studies of physiological and psychological aspects of color are investigated. 6 hours per week.",
        "units": "3",
        "prerequisites": "{ART 140}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "151",
        "title": "Photography as Art",
        "description": "Not available for Art major credit. Students must provide their own digital camera (SLR or compact digital). Introduction for non-art majors to the subject matter and aesthetics of photography. Review of artists’ works that have been a major influence in the field and that reflect broader issues in visual culture. Assignments include learning basic camera anatomy, functions and digital applications. Students need basic working knowledge of computer operation. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "200",
        "title": "Art, Media and Visualization",
        "description": "Practical study of the way art, technology and theories in visual representation shape contemporary visual practice. 6 hours lab.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "201",
        "title": "Introduction to Web Art",
        "description": "This course is an introduction to web art and design. In addition to an exposure to the history of the web/Internet, the course will cover basic web development tools, terminology and aesthetics. Students will create webpages using current computer web applications. For non-Art majors. 6 hours lab. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "210",
        "title": "Animation and Immersive Technology",
        "description": "Introduction to time-based digital software and volumetric tools used to create visual art and immersive media. Students will explore animation concepts and approaches to 2D and 3D image making in entertainment, game and VR/AR production. 6 hours per week.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "219",
        "title": "Art In Los Angeles",
        "description": "Introduction to the principles and skills relating to Art History based on study and analysis of museums galleries and other art exhibitions in the Los Angeles area.  Class visits to off-campus sites alternate with in-class seminars for review and discussion of content studied on field trips.  Art History majors are required to take this course for a grade to receive credit toward the major.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "222",
        "title": "Illustration Materials and Techniques",
        "description": "Prerequisite: ART 124B. Introduction to the use of materials and techniques used in a variety of art areas and specifically in the field of illustration. Emphasis on understanding media potential and the development of refined technical skills required for the successful execution of illustrations. Covers wide range of wet- and dry-media tools and techniques. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 124B}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "224A",
        "title": "Drawing II: Anatomy",
        "description": "Prerequisite: ART 124B. Study of the human form and its graphic representation. Problems dealing with anatomy, form and structure introduced by studies of the posed model. 6 hours per week.",
        "units": "3",
        "prerequisites": "{ART 124B}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "227",
        "title": "Painting I",
        "description": "Recommended Corequisite or Preparatory for Art majors: ART 140. Non-Art majors: Consult department for equivalency. Emphasis on 2-dimensional pictorial structure. Application of design fundamentals to graphic space, organization and imagery. Use of various painting media. 6 hours per week.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{ART 140}"
    },
    {
        "subject": "ART",
        "catalog_number": "230",
        "title": "Perspective",
        "description": "Prerequisite for Art majors: ART 124A. Non-Art majors: Consult department for equivalency. Understanding and use of various systems of perspective. Emphasis upon linear perspective and applications to rendering which are based upon uses of perspective. 6 hours per week.",
        "units": "3",
        "prerequisites": "{ART 124A}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "235",
        "title": "Sculpture I",
        "description": "Recommended Corequisite or Prerequisite: ART 141. Introduction to the materials and basic facilities and processes of sculpture, including woodworking, metal forming, and mixed media applications. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 141}",
        "corequisites": "{ART 141}"
    },
    {
        "subject": "ART",
        "catalog_number": "237",
        "title": "Printmaking I",
        "description": "Recommended Corequisite or Prerequisite: ART 140. Introduction to the materials and basic processes of printmaking, including intaglio, relief, and planographic processes. Focus is placed on fine art printmaking with self-directed content utilizing design fundamentals. 6 hours lab.",
        "units": "2",
        "prerequisites": "{ART 140}",
        "corequisites": "{ART 140}"
    },
    {
        "subject": "ART",
        "catalog_number": "243",
        "title": "Introduction to Typography",
        "description": "Prerequisite: ART 140; Corequisite: ART 200. History, theory and practice of letter forms and typography as they apply to graphics, advertising and other areas of design and visual communication. Projects cover principles of typography, letter structure, typeface selection, fundamentals of computer typesetting and typographic layout. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 140}",
        "corequisites": "{ART 200}"
    },
    {
        "subject": "ART",
        "catalog_number": "244",
        "title": "Graphic Design I",
        "description": "Introductory survey to the professional field of advertising and graphic design as related to print, multimedia, entertainment, environmental and other areas of visual communications. Emphasis on fundamental principles and skills with a broad approach to the application of techniques and concepts of the field. 6 hours lab.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "250",
        "title": "Photography I",
        "description": "Basic instruction in the creative use of the camera and printing techniques. Instruction in basic principles and darkroom experience. Emphasis on photography as a fine art, stressing beginning visual awareness and craftsmanship. 6 hours lab.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "263",
        "title": "Animation I",
        "description": "Introduction to the fundamental principles of animation that are the basis for traditional and computer animation. Hand-drawn exercises are utilized to learn timing, motion and weights. Covers introduction to the early history of animation. 6 hours lab.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "267",
        "title": "Introduction to Ceramics",
        "description": "Basic methods of hand-building and wheel-forming. Emphasis on designing, decorating, glazing and firing procedures. 6 hours lab.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "300",
        "title": "Digital Technologies In Art",
        "description": "Prerequisite: ART 200.Exploration of the use of digital media in art and design. Provides practical experience in designing digital media products. 5 hours lab. \n",
        "units": "3",
        "prerequisites": "{ART 200}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "301",
        "title": "Web Design",
        "description": "Preparatory: ART 201 or ART 244. Introduction to principles and techniques for visual and information design for websites. Includes an introduction to website animation technologies. 6 hours lab.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "302",
        "title": "Video/Digital Art",
        "description": "Prerequisite: ART 202. Studies into artistic concepts and technologies involved in the creation of video art and digital time-based art forms. Investigations into digital imaging, nonlinear compositing and visual effects result in the creation of short artistic statements presented in video/digital format. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 202}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "304",
        "title": "Visual Art and the Child",
        "description": "Prerequisites: ART 120/L; Restricted to students in the ITEP Freshman option program. Provides students with the opportunity to revisit visual art and apply their knowledge of this area to working with children in a school setting. Students extend and integrate their knowledge of visual arts foundation skills, concepts and ideas, based upon the Visual and Performing Arts Framework and the Visual and Performing Arts Content Standards for California Public Schools. Experiences include planning, teaching and assessing art lessons in field based settings. Students also engage in critical analysis and reflection to discover ways to guide children in both the creation of art and thoughtful appreciation of art.",
        "units": "1",
        "prerequisites": "{{ART 120/L} && {Restricted to students in the ITEP Freshman option program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "305",
        "title": "Art and Mass Culture",
        "description": "Prerequisite: Completion of the lower division writing requirement. An introduction for the non-Art major to the relationships between art and mass culture. Illustrated lectures explore the development, techniques, and ideas underlying the contemporary visual environment, including the media arts of photography and advertising, as well as painting, sculpture and architecture. Art majors may not count this course in the major. (Available for General Education, C1 Arts.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "306",
        "title": "Motion Graphics",
        "description": "This course is an introduction to motion graphics, which includes the categories of commercial, broadcast, main sequence and music video. The course will include lectures, showcases and demonstrations of the history, techniques and applications of motion graphics. Projects will cover design, composition, narrative and sound development. Current industry standard computer applications will be introduced and applied. This course may be repeated once for credit. 6 hours lab.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "307",
        "title": "Core Art Studio",
        "description": "This course is an introduction to upper division art department concentrations, goals, and expectations. The focus is on studio exploration of technology in art and its relationship to contemporary art practice and theory. 6 hours lab.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "309",
        "title": "Video for Visual Artists",
        "description": "Prerequisite: Upper division standing. Explores the relationship between visual art and video/moving images. Students create short video explorations to study the camera, movement, composition, color, and editing. 6 hours lab.",
        "units": "3",
        "prerequisites": "{Upper division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "313",
        "title": "History Of Design",
        "description": "Study of important developments in the history of design: architecture and ornament interior and furniture decorative arts textile design industrial design product design and graphic design. (Offered Fall semester) \n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "315",
        "title": "World Perspectives in Art History",
        "description": "Prerequisite: Completion of the lower division writing requirement. An introduction to the analysis of art in the context of world cultures. Illustrated lectures explore the artistic responses to universal human needs and experiences: food and shelter, identity, community and death. Art majors may not count this course in the major. (Available for General Education, F Comparative Cultural Studies.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "318",
        "title": "Survey of 19th and 20th Century Arts",
        "description": "Prerequisite: ART 110 or ART 112 or ART 114. A survey of major movements in 19th- and 20th-century art and art theory with reference to social, political, economic and ideological contexts. This course may include visits to major museums, galleries and performance art venues in the Los Angeles area.",
        "units": "3",
        "prerequisites": "{{ART 110} || {ART 112} || {ART 114}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "319",
        "title": "Comparative Anatomy: Design, Principles, and Function",
        "description": "Prerequisite: ART 124B. A survey of the skeletal and anatomical structures of animals with an emphasis on understanding form, perspective, and evaluating anatomical design. 6 hours per week.",
        "units": "3",
        "prerequisites": "{ART 124B}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "322A",
        "title": "Illustration I",
        "description": "Prerequisite: ART 222. Basic principles and practices of publication and advertising illustration. Projects emphasize conceptual problem solving, composition and the development of personal style. Projects are designed for inclusion in a professional portfolio. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 222}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "322B",
        "title": "Illustration II",
        "description": "Prerequisite: ART 322A. Techniques used in illustration, with an emphasis on problem solving and the development of skills necessary in illustration for publication and advertising. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 322A}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "322C",
        "title": "Digital Illustration",
        "description": "Recommended Preparatory: ART 322A. The study and practice of digital illustration that uses both traditional fine art media and digital technology. Emphasis is on illustration problem-solving, experimental techniques and the development of portfolio quality illustrations. 6 hours lab.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "324A",
        "title": "Drawing III: Figure Drawing",
        "description": "Prerequisites: ART 124A, ART 124B. Study of the human figure using models. Emphasis on creative interpretation of structure, gesture and space as they relate to the elements of line, form, value and color. 6 hours per week.",
        "units": "1",
        "prerequisites": "{{ART 124A} && {ART 124B}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "324B",
        "title": "Drawing III: Figure Drawing and Painting",
        "description": "Prerequisite: ART 324A. Study of the human figure using models. Emphasis on creative interpretation of structure, gesture and space as they relate to the elements of line, form, value and color. Introduction to a broad range of problems in the combined area of drawing and painting that are nonlinear and apply to the study of human form. 6 hours per week.",
        "units": "1",
        "prerequisites": "{ART 324A}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "326",
        "title": "Painting II: Abstract Painting",
        "description": "Prerequisite: ART 227. Emphasis on an individuality of response to contemporary problems in painting incorporating a variety of media, techniques and concepts related to abstract painting. 6 hours per week.",
        "units": "1",
        "prerequisites": "{ART 227}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "327",
        "title": "Painting II: Representational Imagery",
        "description": "Prerequisite: ART 227. Emphasis on individuality of response to contemporary problems in painting, incorporating a variety of media, techniques and content related to representational imagery. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 227}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "328",
        "title": "Water Color",
        "description": "Corequisite: Upper division standing; portfolio review required for repeat credit. Transparent and opaque watercolor techniques. Emphasis on technical proficiency and creative expressions. 6 hours per week.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{{Upper division standing} && {portfolio review required for repeat credit}}"
    },
    {
        "subject": "ART",
        "catalog_number": "330",
        "title": "Drawing III: Composition",
        "description": "Prerequisites: ART 124A, ART 124B, ART 140. Problems, utilizing various drawing media and techniques, stressing the elements of 2-dimensional composition and pictorial organization. 6 hours per week.",
        "units": "3",
        "prerequisites": "{{ART 124A} && {ART 124B} && {ART 140}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "335",
        "title": "Sculpture II",
        "description": "Prerequisites: ART 141, ART 235. Further exploration of sculpture concepts and media, with emphasis on individual invention. 6 hours lab.",
        "units": "3",
        "prerequisites": "{{ART 141} && {ART 235}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "337A",
        "title": "Printmaking Ii: Intaglio",
        "description": "Prerequisite: ART 237. Investigation of contemporary intaglio methods on metal and related materials, including collagraph, photo processes, and cross-media approaches, with black/white and color printing. Projects emphasize problem solving through self-directed form and content in the creation of portfolio-quality work. 6 hours lab.\n",
        "units": "3",
        "prerequisites": "{ART 237}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "337B",
        "title": "Printmaking Ii: Serigraphy (silkscreen)",
        "description": "Prerequisite: ART 237.Investigation of the methods and materials used to create serigraphs in a contemporary fine art context. Covered techniques include hand-drawn and digital/photo stencils, multi-color registration, printing with water-based ink, and cross-media approaches. Projects emphasize problem solving through self-directed form and content in the creation of portfolio-quality work. 6 hours lab.\n",
        "units": "3",
        "prerequisites": "{ART 237}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "337D",
        "title": "Printmaking II: Relief",
        "description": "Prerequisite: ART 237; Preparatory: ART 200. Contemporary relief methods on linoleum, wood, and other related material, with black/white and color printing, and exploration of cross-media approaches. Projects emphasize problem solving through self-directed form and content in the creation of portfolio-quality work. 6 hours lab.",
        "units": "3",
        "prerequisites": "{{ART 237} || {Preparatory: ART 200}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "338",
        "title": "Printmaking II",
        "description": "Prerequisite: ART 237. Intermediate study of intaglio, serigraphy, lithography, relief, or experimental and combination processes, within a contemporary art context. Hand-drawn and photo-processes are investigated with black/white and color printing. Projects emphasize problem solving through individual development of form and content in the creation of portfolio-quality work. 6 hours lab. May be repeated once for credit.",
        "units": "3",
        "prerequisites": "{ART 237}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "341",
        "title": "Graphic Design Production",
        "description": "Prerequisites: ART 200, ART 244. Production mechanics of designed projects are prepared for offset printing and digital reproduction. In-depth review of color separations, ink, paper and current trends in print production as well as digital reproduction and multimedia. 6 hours lab.",
        "units": "3",
        "prerequisites": "{{ART 200} && {ART 244}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "342",
        "title": "Exhibition Design",
        "description": "Prerequisite: ART 140 or ART 141. Study of techniques of exhibition design. Problems of design and production in projects that emphasize creating gallery and related exhibitions or venues. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the schedule of classes for the CS designation. 6 hours per week.",
        "units": "3",
        "prerequisites": "{{ART 140} || {ART 141}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "343",
        "title": "Advanced Typography",
        "description": "Prerequisites: ART 243, ART 244. Theory and practice of letter forms and typography as they apply to graphics, advertising and other areas of design and visual communication. Projects cover principles of typography, letter structure, type face selection, fundamentals of computer typesetting and typographic layout. 6 hours lab.",
        "units": "3",
        "prerequisites": "{{ART 243} && {ART 244}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "344",
        "title": "Graphic Design II",
        "description": "Prerequisites: ART 243, ART 244. Corequisite: ART 200. Preparatory: ART 341 or equivalent. Introduction to intermediate skills and conceptual problems of the field. Stressed is the integration of theory with practical applications. Projects demand creative solutions to typical problems faced by the graphic designer. 6 hours lab.",
        "units": "1",
        "prerequisites": "{{ART 243} && {ART 244}}",
        "corequisites": "ART 200"
    },
    {
        "subject": "ART",
        "catalog_number": "345",
        "title": "Design for Entertainment Advertising",
        "description": "Prerequisite: ART 344. Preparatory: ART 343. This course concentrates on the theory and practice of advertising design for the entertainment industry. Students are expected to develop a combination of graphic design, illustration, concept development and branding skills for the purposes of promoting motion pictures and television through a wide variety of media (posters, print ads, billboards, web banners, and other branding elements). Utilizing industry standard software, the course also includes historical and contemporary references, as well as theoretical and conceptual approaches. Non-majors may take this course for Credit/No Credit. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 344}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "350",
        "title": "Photography II",
        "description": "Prerequisite: ART 250. Continuation of the principles learned in Photography I with more advanced process and content exploration. Students explore the medium more fully through analog and alternative processes, including exhibition quality print production, toning, and multiple imagery. Introduction of digital approaches using analog and digital sources with accompanying discussion of relevant historic and contemporary photography. 6 hours lab.",
        "units": "2",
        "prerequisites": "{ART 250}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "351",
        "title": "Digital Photo Imaging",
        "description": "Prerequisite: ART 250. Preparatory: ART 200. Exploration of digital photography, integrating established principles of the photo medium with digital technologies. Photo images are created and manipulated through digital software processes for both fine art and commercial application. Assignments result in a portfolio. May be repeated once for credit; 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 250}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "352",
        "title": "Visual Effects",
        "description": "Prerequisite: For Art majors and minors upper division standing, or instructor consent (non-majors). Studies in the conceptualization and techniques of digitally generated visual effects in time-based media. Creative self-expression is emphasized in the production of experimental short videos. 6 hours lab.",
        "units": "3",
        "prerequisites": "{{{Art majors and minors} && {upper division standing}} || {{instructor consent (non-majors)} && {upper division standing}}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "353",
        "title": "Color Photography",
        "description": "Preparatory: ART 200, ART 250 or equivalent. Investigation into the various aspects of color photography, which include: exposure and development of negative film; printing with color materials utilizing the subtractive color principles that underlie color filtration and correction; a brief survey of contemporary color photographers with an emphasis on the aesthetics of their works; and refinement of the students’ visual eye while pursuing their own stylistic expression. May be repeated once for credit. 6 hours lab.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "354",
        "title": "Computer Graphics",
        "description": "Prerequisites for Art majors: ART 200, ART 244. Non-art majors: Consult department for equivalency. Application and principles of computer graphics as a creative technological medium. Practical experience with micro-computers in studying the potentials of graphic communication and visual expression. 6 hours lab.",
        "units": "3",
        "prerequisites": "{{ART 200} && {ART 244}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "357",
        "title": "Narrative Digital Photography",
        "description": "Prerequisite: ART 250. Continuation of the principles learned in Photography I while exploring the multiple uses of still images. Students explore the medium more fully through experience with creating photo sequences and short time based projects. The history and heritage of still photography is discussed in relation to trends in contemporary photography. Students create digital slide shows and use stills to explore photography’s use in motion based artworks. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 250}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "358",
        "title": "User Experience and User Interface Design",
        "description": "Prerequisite: ART 244. This intermediate course focuses on theory and design of user experience and user interfaces for interactive products. Students will practice researching, strategizing, conceiving and prototyping solutions for interactive mediums and devices. Key principles of innovation, design thinking, user-centered design, branding design, and advances in technology will be explored. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 244}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "363A",
        "title": "Animation II",
        "description": "Prerequisite: ART 263. Further study of animation skills for both traditional and computer animation. Introduction to storyboard process, character design and story development. Intermediate-level animation principles, including character expression, lip sync and staging. Continuation of animation history 1943 to the present. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 263}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "364",
        "title": "3-D Computer Animation",
        "description": "Prerequisite: ART 263. Investigation of 3-D computer animation with emphasis on animation timing, modeling and lighting. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 263}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "365",
        "title": "3-D Computer Animation II",
        "description": "Prerequisite: ART 364. Intermediate study of 3-D computer animation with focus on 3-D character creation and animation. Includes: design, modeling, rigging, key-frame lip-sync acting, background, lighting, texturing, coloring and critical analysis of 3-D characters from the game and animation fields. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 364}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "366",
        "title": "Ceramics II",
        "description": "Prerequisite: ART 267. Investigation of the use of clay as a medium with an emphasis on sculptural applications. Discussion of ideas, technical processes and approaches as they relate to clay’s use as a non-utilitarian medium. Experimentation with mold making, casting, clay bodies, glaze formulation and surface treatments. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 267}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "367",
        "title": "Ceramics III",
        "description": "Prerequisite: ART 267. Further investigation of the use of clay as a medium with emphasis on experimental practice. Further discussion of ideas, technical processes and approaches as it relates to the work and contemporary visual art. Continued experimentation with wheel forming, hand building, clay bodies, glaze formulation and surface treatments. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 267}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "368",
        "title": "Game Animation and Design",
        "description": "Recommended Preparatory: ART 365. Investigation of the creative process of game design and game animation. Practical, theoretical and global aspects of game design will be explored by creating game assets and producing animation work. 6 hours lab.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "380",
        "title": "Children’s Art",
        "description": "Prerequisite: Junior standing. Corequisite: ART 380L. Recommended for Multiple Subjects Credential Candidates. Development of fundamentals and principles for determining art experiences for children. Understanding the significance of art in the child’s development. Emphasis on developing basic art skills in criticism, aesthetics, history and studio production. 2 hours discussion, 2 hours studio and visits to art exhibitions.",
        "units": "2",
        "prerequisites": "{Junior standing}",
        "corequisites": "{ART 380L}"
    },
    {
        "subject": "ART",
        "catalog_number": "380L",
        "title": "Children’s Art Lab",
        "description": "Prerequisite: Junior standing. Corequisite: ART 380L. Recommended for Multiple Subjects Credential Candidates. Development of fundamentals and principles for determining art experiences for children. Understanding the significance of art in the child’s development. Emphasis on developing basic art skills in criticism, aesthetics, history and studio production. 2 hours discussion, 2 hours studio and visits to art exhibitions.",
        "units": "1",
        "prerequisites": "{Junior standing}",
        "corequisites": "{ART 380}"
    },
    {
        "subject": "ART",
        "catalog_number": "383",
        "title": "Art in Early Childhood",
        "description": "Prerequisite: Junior standing. Corequisite: ART 383L. Analysis and discussion of the significance of art in the development of young children ages 3 through 8 combined with studio experiences in 2- and 3-dimensional materials. 2 hours discussion, 2 hours studio.",
        "units": "2",
        "prerequisites": "{Junior standing}",
        "corequisites": "{ART 383L}"
    },
    {
        "subject": "ART",
        "catalog_number": "383L",
        "title": "Art in Early Childhood Lab",
        "description": "Prerequisite: Junior standing. Corequisite: ART 383L. Analysis and discussion of the significance of art in the development of young children ages 3 through 8 combined with studio experiences in 2- and 3-dimensional materials. 2 hours discussion, 2 hours studio.",
        "units": "1",
        "prerequisites": "{Junior standing}",
        "corequisites": "{ART 383}"
    },
    {
        "subject": "ART",
        "catalog_number": "385",
        "title": "Children’s Crafts",
        "description": "Prerequisite: Junior standing. Corequisite: ART 385L. Basic skills and understandings that provide meaningful craft experiences for children. Emphasis on the educational value of crafts. Beginning techniques and processes involving 3-dimensional materials. 2 hours discussion, 2 hours studio.",
        "units": "3",
        "prerequisites": "{Junior standing}",
        "corequisites": "{ART 385L}"
    },
    {
        "subject": "ART",
        "catalog_number": "385L",
        "title": "Children’s Crafts Lab",
        "description": "Prerequisite: Junior standing. Corequisite: ART 385L. Basic skills and understandings that provide meaningful craft experiences for children. Emphasis on the educational value of crafts. Beginning techniques and processes involving 3-dimensional materials. 2 hours discussion, 2 hours studio.",
        "units": "1",
        "prerequisites": "{Junior standing}",
        "corequisites": "{ART 385}"
    },
    {
        "subject": "ART",
        "catalog_number": "389CS",
        "title": "Impact Design",
        "description": "Prerequisites: ART 243 and ART 244 or permission by instructor. Pre/Corequisite: ART 344 or permission by instructor. Through community-based projects and service learning opportunities in reciprocal relationship with community organizations, students explore the many roles creative professionals play when executing projects for social impact. Design teams develop skills in design methodology for visual communication: identifying problems, design research, ideation, and implementation. May be repeated once for credit. 6 hours lab. Offers a community service opportunity with activities relating to concepts and theories presented.",
        "units": "3",
        "prerequisites": "{{{ART 243} && {ART 244}} || {permission by instructor}}",
        "corequisites": "ART 344 or permission by instructor"
    },
    {
        "subject": "ART",
        "catalog_number": "400",
        "title": "Developing Visual Literacy",
        "description": "Prerequisites: ART 380; Junior standing. Corequisite: ART 400L. In-depth exploration of selected art processes culminating in a significant research paper or project. 2 hours discussion 2 hours studio. \n",
        "units": "2",
        "prerequisites": "{{ART 380} && {Junior standing}}",
        "corequisites": "{ART 400L}"
    },
    {
        "subject": "ART",
        "catalog_number": "400L",
        "title": "Developing Visual Literacy Lab",
        "description": "Prerequisites: ART 380; Junior standing. Corequisite: ART 400. In-depth exploration of selected art processes culminating in a significant research paper or project. 2 hours discussion 2 hours studio. \n",
        "units": "1",
        "prerequisites": "{{ART 380} && {Junior standing}}",
        "corequisites": "{ART 400}"
    },
    {
        "subject": "ART",
        "catalog_number": "401",
        "title": "History of Native North American Art",
        "description": "The visual arts of North American native cultures from the Eskimo to Canada, the Northwest and Southwest areas of the United States, the Plains and Eastern Indian societies. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "402",
        "title": "Advanced Video/Digital Art",
        "description": "Preparatory: ART 302. Advanced studies into video/digital art involve exploration into a broad range of artistic concepts and visual technologies utilized in video/digital media and time-based art forms. Investigation into art software applications and experimental methods lead to the production and refinement of artistic statements presented in video/digital format. Available for graduate credit. 6 hours lab.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "404",
        "title": "History of African and Oceania Art",
        "description": "Visual arts of sub-Saharan tribal Africa are considered in their cultural context, including related art forms, such as literature, music and ritual observances. Arts of the South Pacific, the tribal societies of Melanesia, Polynesia, Micronesia and Australia. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "405",
        "title": "Advanced Web Design",
        "description": "Prerequisite: ART 301; Recommended Preparatory: ART 354. Advanced techniques in web design. This course covers advanced techniques in current computer web applications, interaction/motion web design and programming tools. 6 hours lab.",
        "units": "3",
        "prerequisites": "{{ART 301} && {Recommended Preparatory: ART 354}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "412",
        "title": "History Of Korean Art",
        "description": "Prerequisite: Upper Division standing. Korean visual culture from the Neolithic period to the present time. Investigation of various art forms in different media (including ceramics calligraphy painting sculpture architecture woodblock print photograph video installation and performance) and ways in which different artistic features are connected to specific historical religious philosophical and political contexts.  \n",
        "units": "3",
        "prerequisites": "{Upper Division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "413",
        "title": "History of Chinese Art",
        "description": "Prerequisite: Upper division standing. Chinese visual culture from the Neolithic period to the present time. Investigation of various art forms in different media (including ceramics, jade and bronze objects, calligraphy, painting, sculpture, architecture, woodblock print, photographs, video, installations and performance) and ways in which different artistic features are connected to specific historical, religious, philosophical and political contexts. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Upper division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "414",
        "title": "History of Japanese Art",
        "description": "Prerequisite: Upper division standing. Japanese visual culture from the Neolithic period to the present time. Investigation of various art forms in different media (including ceramics, bronze objects, calligraphy, painting, sculpture, architecture, woodblock print, photographs, video, installations and performance) and ways in which different artistic features are connected to specific historical, religious, philosophical and political contexts. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Upper division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "415",
        "title": "History Of The Art Of India",
        "description": "Prerequisite: Upper Division standing. Indian visual culture from the Neolithic period to the present time. Investigation of various art forms in different media (including ceramics bronze objects painting sculpture architecture photographs video installations and performance) and ways in which different artistic features are connected to specific historical religious philosophical and political contexts.  \n",
        "units": "3",
        "prerequisites": "{Upper Division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "416",
        "title": "History of Ancient Near Eastern Art",
        "description": "Prerequisite: Upper division standing. Study of the architecture, sculpture and related art forms of the ancient Near East, Mesopotamia, Anatolia and Iran from prehistoric times to the beginning of the Sassanian Empire. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Upper division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "420",
        "title": "History of Greek Art and Architecture",
        "description": "Prerequisite: Upper division standing. Art and architecture of the Aegean area from the early Archaic to the end of the Hellenistic periods. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Upper division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "421",
        "title": "History of Roman Art and Architecture",
        "description": "Prerequisite: Upper division standing. Art and architecture of the Roman World from circa 700 B.C. to 400 A.D. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Upper division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "422",
        "title": "Illustration III",
        "description": "Prerequisite: ART 322B. Advanced study of specific problems in publication and advertising illustration. Projects require the creative implementation of the ideas, media and techniques used by illustrators. Available for graduate credit. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 322B}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "424",
        "title": "Drawing Iv: Life Drawing",
        "description": "Prerequisite: ART 324B.Advanced problems in draftsmanship and study of the human figure with special emphasis on freedom of expression and experimentation. (Portfolio review is required to be eligible for enrollment for 3rd and 4th semester repeat credit.) 5 hours per week. \n",
        "units": "3",
        "prerequisites": "{ART 324B}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "425",
        "title": "History Of Italian Renaissance Art",
        "description": "Prerequisite: Upper Division standing.Study of the developments in art and architecture of Italy from 1300 to 1520 with particular emphasis on the relationship between the visual tradition and cultural context. Regular written assignments are required. \n",
        "units": "3",
        "prerequisites": "{Upper Division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "427",
        "title": "Painting III",
        "description": "Prerequisites: ART 326, ART 327. Emphasis on individuality and invention through independent research and experimentation. Guidelines and objectives to be established with individuals. (Portfolio review is required to be eligible for enrollment for third and fourth semester repeat credit.) Available for graduate credit. 6 hours per week.",
        "units": "3",
        "prerequisites": "{{ART 326} && {ART 327}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "429",
        "title": "Advanced Study in Studio Art",
        "description": "Prerequisites: Upper division standing and instructor permission. Portfolio review required upon entering the course. Projects emphasize conceptual development in art through visual and material based research, advanced critique and presentation skills, and exposure to contemporary art. Students will develop professional skills and materials. Professional portfolio is emphasized. Available for graduate credit. 6 hours per week.",
        "units": "3",
        "prerequisites": "{{Upper division standing} && {instructor permission}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "430",
        "title": "Drawing IV: Composition",
        "description": "Prerequisite: ART 330. Advanced drawing problems in 2-dimensional composition and pictorial organization. 6 hours per week.",
        "units": "3",
        "prerequisites": "{ART 330}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "431",
        "title": "History of Baroque Art",
        "description": "Prerequisite: Upper division standing. Preparatory: ART 426. A study of the arts from the Counter Reformation (1563) to the death of Louis XIV (1715). Painting, sculpture and architecture in Europe with a special emphasis on the arts of Italy, the Netherlands and France. Regular written assignments required. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Upper division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "435",
        "title": "Sculpture III",
        "description": "Prerequisite: ART 335. Advanced study with special consideration of conception, media and techniques through emphasis on individual projects. (Portfolio review is required to be eligible for enrollment for third and fourth semester repeat credit.) Available for graduate credit. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 335}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "437",
        "title": "Printmaking III",
        "description": "Prerequisite: ART 338 or ART 337A or ART 337B or ART 337C or ART 337D. Advanced study of intaglio, serigraphy, lithography, relief, or experimental and combination processes, within a contemporary, fine art context. Emphasis is placed on self-directed exploration into process, form, and content, in the creation of portfolio-quality work. Guidelines and goals discussed on an individual basis. (Portfolio review required to be eligible for enrollment for third and fourth semester repeat credit.) Available for graduate credit. 6 hours lab.",
        "units": "3",
        "prerequisites": "{{ART 338} || {ART 337A} || {ART 337B} || {ART 337C} || {ART 337D}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "438",
        "title": "Senior Projects",
        "description": "Prerequisite: Senior standing. Corequisite: ART 438L. Projects that afford students the opportunity to assess their training, summarize their achievement and analyze their place in the visual arts. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the schedule of classes for the CS designation.",
        "units": "3",
        "prerequisites": "{Senior standing}",
        "corequisites": "{ART 438L}"
    },
    {
        "subject": "ART",
        "catalog_number": "438L",
        "title": "Senior Projects Lab",
        "description": "Prerequisite: Senior standing. Corequisite: ART 438L. Projects that afford students the opportunity to assess their training, summarize their achievement and analyze their place in the visual arts. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the schedule of classes for the CS designation.",
        "units": "1",
        "prerequisites": "{Senior standing}",
        "corequisites": "{ART 438}"
    },
    {
        "subject": "ART",
        "catalog_number": "439",
        "title": "Bronze Casting Sculpture",
        "description": "Prerequisite: ART 235. Lost-wax bronze-casting foundry projects. Students create sculpture to be cast in bronze. Available for graduate credit. 6 hours per week.",
        "units": "3",
        "prerequisites": "{ART 235}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "442",
        "title": "3-D Computer Animation III",
        "description": "Prerequisite: ART 364. Recommended Preparatory: ART 365. Advanced study of 3-D Computer Animation with a focus on character acting, timing and advanced action analysis. Includes: key-frame animation with full body gestures, lip sync acting, and support elements of modeling, rigging, texturing, and lighting. Culminating in the production of quality work suitable for student demo reel. May be repeated once for credit.",
        "units": "3",
        "prerequisites": "{ART 364}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "443",
        "title": "Animation Drawing",
        "description": "Prerequisite: ART 224A. Exploration of the various forms of drawing related to the field of animation. Direct drawing of the human figure from models; drawing a variety of animals from live observation; and development of layout drawing used for background painting. Emphasis on volume, mass, weight, movement/gesture, conveying attitude, dramatic expression, action poses, acting, anatomy, consistent perspective and economy of line. 6 hours per week.",
        "units": "3",
        "prerequisites": "{ART 224A}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "444",
        "title": "Graphic Design III",
        "description": "Prerequisite: ART 344. Advanced and complex problem-solving consistent with those of graphic designers in the field. Emphasis on project of substantive scope, integration of skills and presentation. Students should have developed a professional resume and portfolio by the end of this series. Available for graduate credit. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 344}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "445",
        "title": "History Of Modern Art",
        "description": "Prerequisite: Upper Division standing.Investigation of major movements in 20th century painting sculpture architecture with reference to the social economic and ideological context. \n",
        "units": "3",
        "prerequisites": "{Upper Division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "446",
        "title": "Packaging Design",
        "description": "Prerequisite: ART 344. Designing for product containers, identification graphics, product line packaging and related displays. Coordination of the fundamental elements of packaging such as typography, color, imagery and package structure. Available for graduate credit. 6 hours lab.",
        "units": "2",
        "prerequisites": "{ART 344}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "448",
        "title": "History of Contemporary Art",
        "description": "Prerequisite: ART 110 or ART 112 or ART 114. Deals with American and European art from the mid-20th century to the present. Includes a study of developments in non-traditional media, crafts and popular arts, as well as painting and sculpture. Regular written assignments required. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{ART 110} || {ART 112} || {ART 114}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "450",
        "title": "Photography III",
        "description": "Prerequisite: ART 302 or ART 309 or ART 350 or ART 351 or ART 353 or ART 357. Advanced problems in photography. Emphasis on content: The student is encouraged to apply technical and expressive skills in photography toward some original and meaningful use of the medium. Students are required to present an original project to the class for discussion and is then required to execute it. Available for graduate credit. May be repeated 3 times for credit. Portfolio review required for eligibility for enrollment for third and fourth semester repeat credit. 6 hours lab per week.",
        "units": "3",
        "prerequisites": "{{ART 302} || {ART 309} || {ART 350} || {ART 351} || {ART 353} || {ART 357}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "455A",
        "title": "Photography/Video Lighting I",
        "description": "Prerequisite: ART 302 or ART 309 or ART 350 or ART 351 or ART 353 or ART 357. Professional problems, techniques and equipment in studio lighting. Introduction to basic studio photography fundamentals, various lighting systems and advanced digital workflow. Available for graduate credit. 6 hours lab.",
        "units": "3",
        "prerequisites": "{{ART 302} || {ART 309} || {ART 350} || {ART 351} || {ART 353} || {ART 357}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "455B",
        "title": "Photography/Video Lighting II",
        "description": "Prerequisite: ART 455A. Advanced projects in advertising photography. Emphasis on problems of large product and exterior photography, portrait and figure studies and uses of complex lighting. May be repeated once for credit. Available for graduate credit. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 455A}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "455C",
        "title": "Photography/Video Lighting III",
        "description": "Prerequisite: ART 455B. Investigation of advanced advertising problems in photography exploring both the technical and conceptual challenges of visual communication. Advanced projects in portraiture, fashion, table-top, photo-illustration and editorial will be addressed. Computer imaging introduced as an important area of investigation. May be repeated once for credit. Available for graduate credit. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 455B}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "458",
        "title": "Graphics Seminar",
        "description": "Prerequisites: ART 344; Six additional units of upper division graphic design; Senior standing. Review career options related to visual communication. Students develop and apply solutions to business-related problems faced in the design profession, such as incorporating team concepts, building professional relationships and refining communication skills. Students develop professional résumés and portfolios (print and digital). The course emphasizes professional graphic design business practices and creative processes. Available for graduate credit. May be repeated once for credit. 6 hours lab.",
        "units": "3",
        "prerequisites": "{{ART 344} && {Six additional units of upper division graphic design} && {Senior standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "460",
        "title": "History of Animation",
        "description": "Prerequisite: Upper division standing. A survey and study of world animation as visual art from 16th century traditions to contemporary forms. Students examine how animation is used to communicate through semiotics and visual narrative. Discussion, research and writing about screenings of animated works and assigned readings emphasize historical and sociocultural contexts. Art majors may use this course for an upper division Art elective.",
        "units": "3",
        "prerequisites": "{Upper division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "461",
        "title": "History of Graphic Arts",
        "description": "Emphasizes the study of graphic design and its impact on society from the 19th to 21st centuries, including the development of typography and graphic art from the 15th to the 19th century. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "462",
        "title": "History of Photography",
        "description": "Emphasizes the aesthetics of photography and its emergence and acceptance as a fine art. In addition to slide lectures and discussions, students are required to attend several photography exhibitions and lectures at galleries and museums in the area. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "463",
        "title": "Animation III",
        "description": "Prerequisite: ART 363B. Advanced level development and production of an original animation project. Students may utilize 3-D computer animation or 2-D methods. May be repeated once for credit. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 363B}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "465",
        "title": "Game Animation Project",
        "description": "Prerequisite: ART 364. Preparatory: ART 368. Advanced level design and creation of a game production project. Students may use either 2-D or 3-D animation techniques to create a video game prototype. Includes concept development, creation of character assets, animation cycles, and environments. May be repeated once for credit. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 364}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "467",
        "title": "Ceramics IV",
        "description": "Prerequisite: ART 367. Advanced investigation of the use of clay as it relates to a personal direction. Advanced refinement of ideas, technical processes and approaches as they relate to a unified body of work and to contemporary visual art. Continued experimentation with technical processes, clay bodies, glaze formulation and surface treatments. Development of portfolio materials and documentation of the unified body of work. (Portfolio review is required to be eligible for enrollment for third and fourth semester repeat credit). Available for graduate credit. 6 hours lab.",
        "units": "3",
        "prerequisites": "{ART 367}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "468",
        "title": "History of Women in the Visual Arts",
        "description": "Prerequisite: Upper division standing. Preparatory: GWS 100. Covers the history of women as artists in the European and American traditions. Art by women in non-Western cultures also is studied, together with related issues such as images of women and feminist art analysis. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Upper division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "482",
        "title": "Teaching Art in PK-12",
        "description": "Prerequisite: Upper division standing or permission of instructor. This course provides students with skills and experiences in teaching art in PK-12 classrooms, focusing on the structure, organization and culture of public-school teaching in the state of California. Topics include theory, pedagogy, curriculum, instruction, assessment, classroom management, teaching diverse populations and accommodations for English language learners as well as special education students. Students will participate in Early Field Experience observations in PK-12 art classrooms, which is required for application to the Single Subject Credential Program.",
        "units": "3",
        "prerequisites": "{{Upper division standing} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "484",
        "title": "Art Education Portfolio",
        "description": "Prerequisite: Complete admission to Teacher Education Program (Credentials Office). Capstone course in which students are assessed in their subject matter competency prior to student teaching. Course must be successfully completed to be cleared for entrance into student teaching. (Credit/No Credit only)\n",
        "units": "1",
        "prerequisites": "{Complete admission to Teacher Education Program (Credentials Office)}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "488",
        "title": "Public Art",
        "description": "Development and completion of art forms in the public realm. Public art investigated in a workshop format that includes speakers, demonstrations, field trips and art products. Emphasis on studio skills, proposal development and service learning activities. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the schedule of classes for the CS designation. 5 hours per week.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "488CS",
        "title": "Public Art",
        "description": "Development and completion of art forms in the public realm. Public art investigated in a workshop format that includes speakers, demonstrations, field trips and art products. Emphasis on studio skills, proposal development and service learning activities. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented. Check the schedule of classes for the CS designation. 5 hours per week.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "491",
        "title": "Design Strategy for Effective Branding",
        "description": "Prerequisite: ART 344. This advanced course focuses on literacy, theory, strategy and practice in communicating and developing brand identity and brand strategy. Students will research and integrate graphic design methodology, tools and design-thinking principles in order to communicate a visual representation of a brand identity and build/implement a brand. Key principles of entrepreneurship, communication, design research, user-centered design, social media and digital mediums and platforms will be explored. 6 hours per week.",
        "units": "3",
        "prerequisites": "{ART 344}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "494",
        "title": "Internship in Arts",
        "description": "Prerequisites: Senior or Graduate standing; Portfolio review. Available for Art major credit. Academic Internship course. Experiential education in appropriate aspects of specific area of interest. Available for graduate credit. 6 units maximum. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{{Senior Standing} || {Graduate standing}} && {Portfolio review}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Enrollment in Independent Study is by department chair’s consent and instructor’s consent to act as sponsor. Admission based on evidence of ability to pursue in-depth independent study and approval of a project submitted at the time of registration. Regular progress meetings and reports are required throughout the semester. Completion of the project is required before credit may be received. No more than 6 units of credit in 499 may be earned toward the bachelor’s degree in Art. Enrollment in Independent Study is not allowed for the purpose of substitution for an existing course.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "510",
        "title": "Methods and Practice of Art History",
        "description": "Prerequisites: Graduate standing in Art History or senior status and instructor permission. Seminar designed to develop student skills in art historical research, and a critical introduction to the practice and methodology of art history as a discipline. Graduate students will practice the application of theoretical and philosophical frameworks in all assignments. Satisfies upper division core requirement for Art History option only. May be taken for elective credit but does not satisfy upper division core requirement for Art majors other than Art History.",
        "units": "3",
        "prerequisites": "{{{Graduate standing in Art History} || {senior status}} && {instructor permission}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "519A-Z",
        "title": "Selected Topics in Art History",
        "description": "Prerequisite: Instructor consent or classified graduate standing. Research in depth on specific topics within art history. Topics vary per semester. May be taken three times for credit.",
        "units": "3",
        "prerequisites": "{{Instructor consent} || {classified graduate standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "520",
        "title": "Studio Problems Video/Digital Art",
        "description": "Investigation into artistic studio problems in video/digital art. Explorations lead to resolution of personal artistic statements. Increasing complexity in concept, media and presentation is required in the sequence of coursework. Available for repeat credit. 6 hours per week in supervised studio work.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "521",
        "title": "Studio Problems: Painting",
        "description": "Prerequisites: Graduate standing; Instructor consent. Investigation of artistic problems in painting, exploration leading to resolution in artistic statements. Problems of increasing complexity and evidence of greater depth of artistic concept required in the sequence of coursework. 1 hour per week in seminar; 5 hours per week in supervised studio work.",
        "units": "3",
        "prerequisites": "{{Graduate standing} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "522",
        "title": "Studio Problems: Illustration",
        "description": "Prerequisites: Graduate standing; Instructor consent. Investigation of artistic problems in illustration with exploration leading to concrete resolutions. Problems of increased complexity and greater depth of practical problem solving required in the sequence of coursework. 6 hours lab.",
        "units": "3",
        "prerequisites": "{{Graduate standing} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "524",
        "title": "Studio Problems: Drawing",
        "description": "Prerequisite: ART 424. Investigation of advanced problems in drawing or in drawing and related art disciplines. Projects of increasing complexity that require evidence of greater depth and skill in the resolution of visual statements. 1 hour per week in seminar; 5 hours per week in supervised studio work.",
        "units": "3",
        "prerequisites": "{ART 424}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "525",
        "title": "Studio Problems: Printmaking",
        "description": "Prerequisites: Graduate standing; Instructor consent. Investigation of artistic problems in printmaking, exploration leading to resolution in artistic statements. Problems of increasing complexity and evidence of greater depth of artistic concept required in the sequence of coursework. 1 hour per week in seminar; 5 hours per week in supervised studio work.",
        "units": "3",
        "prerequisites": "{{Graduate standing} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "535",
        "title": "Studio Problems: Sculpture",
        "description": "Prerequisites: Graduate standing; Instructor consent. Investigation of advanced problems in sculpture.",
        "units": "3",
        "prerequisites": "{{Graduate standing} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "542CS",
        "title": "Advanced Exhibition Design",
        "description": "Prerequisite: Graduate standing. Advanced study of the primary components of exhibition design, including curating, budgeting, installation and promotion. Focuses on public relations, education, community service, tours, publicity and publication as they pertain to the CSUN and/or community galleries and their functions. Several class meetings held in each of the art galleries, as well as other venues. Offers a community service opportunity with activities relating to concepts and theories presented. 6 hours per week.",
        "units": "3",
        "prerequisites": "{Graduate standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "544",
        "title": "Studio Problems: Graphic Design",
        "description": "Prerequisites: ART 444 or equivalent; Graduate standing; Instructor consent. Investigation of advanced problems in graphic design exploring both the technical and conceptual challenges of visual communication. Projects of increasing complexity and evidence of greater depth of artistic concept required in the sequence of coursework. 6 hours lab.",
        "units": "3",
        "prerequisites": "{{ART 444} && {Graduate standing} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "550",
        "title": "Studio Problems: Photography",
        "description": "Prerequisites: Portfolio review; Graduate standing; Instructor consent. Investigation of advanced problems in photography exploring both the technical and conceptual challenges of visual communication. Projects of increasing complexity and evidence of greater depth of artistic concept required in the sequence of coursework. 6 hours lab.",
        "units": "3",
        "prerequisites": "{{Portfolio review} || {Graduate standing} || {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "560",
        "title": "Studio Problems in Ceramics Design",
        "description": "Prerequisites: Graduate standing; Instructor consent. Investigation of artistic problems in ceramics and/or glass design, exploration and experimentation leading to resolution in artistic statements. Problems in increasing complexity and evidence of greater depth of artistic concept required in the sequence of coursework. 1 hour per week in seminar; 5 hours per week in supervised studio work.",
        "units": "3",
        "prerequisites": "{{Graduate standing} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "579",
        "title": "Art Education Across Cultures",
        "description": "Prerequisite: Junior standing. Corequisite: ART 579L. Provides knowledge and practice in planning art experiences, and increases teacher effectiveness in multi- and cross-cultural teaching of the arts. Incorporates focused activities for graduate students. Meets requirement for multicultural education for Multiple and Single Subject Credentials. Course contains both lecture and lab activities.",
        "units": "2",
        "prerequisites": "{Junior standing}",
        "corequisites": "{ART 579L}"
    },
    {
        "subject": "ART",
        "catalog_number": "579L",
        "title": "Art Education Across Cultures Lab",
        "description": "Prerequisite: Junior standing. Corequisite: ART 579L. Provides knowledge and practice in planning art experiences, and increases teacher effectiveness in multi- and cross-cultural teaching of the arts. Incorporates focused activities for graduate students. Meets requirement for multicultural education for Multiple and Single Subject Credentials. Course contains both lecture and lab activities.",
        "units": "1",
        "prerequisites": "{Junior standing}",
        "corequisites": "{ART 579L}"
    },
    {
        "subject": "ART",
        "catalog_number": "582",
        "title": "Teaching Art in PK-12",
        "description": "Prerequisite: Graduate level standing. This course provides students with skills and experiences in teaching art in PK-12 classrooms, focusing on the structure, organization and culture of public-school teaching in the state of California. Topics include theory, pedagogy, curriculum, instruction, assessment, classroom management, teaching diverse populations and accommodations for English language learners as well as special education students. Students will participate in Early Field Experience observations in PK-12 art classrooms, which is required for application to the Single Subject Credential Program. Students will engage in instructional presentations/teaching demonstrations and the development of their professional portfolio.",
        "units": "1",
        "prerequisites": "{Graduate level standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "585L",
        "title": "Teaching Art in PK-12 Lab",
        "description": "Prerequisite: Graduate level standing. This course provides students with skills and experiences in teaching art in PK-12 classrooms, focusing on the structure, organization and culture of public-school teaching in the state of California. Topics include theory, pedagogy, curriculum, instruction, assessment, classroom management, teaching diverse populations and accommodations for English language learners as well as special education students. Students will participate in Early Field Experience observations in PK-12 art classrooms, which is required for application to the Single Subject Credential Program. Students will engage in instructional presentations/teaching demonstrations and the development of their professional portfolio.",
        "units": "2",
        "prerequisites": "{Graduate level standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "586",
        "title": "Studio Problems Teaching 3-D Art",
        "description": "Prerequisite: Junior standing or permission of instructor. Required for a Single Subject Credential in Art. Develop instructional strategies, organize standards-based curricula, and refine art skills for teaching art in a variety of educational settings. Topics will include the study of art and art education, curriculum development, traditional and emerging art media and materials, and technology in art education. Emphasis will be on the study of three-dimensional art. Final art education portfolio review for art teaching credential students. 1 hour discussion; 4 hours studio.",
        "units": "1",
        "prerequisites": "{{Junior standing} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "586L",
        "title": "Studio Problems Teaching 3-D Art Lab",
        "description": "Prerequisite: Junior standing or permission of instructor. Required for a Single Subject Credential in Art. Develop instructional strategies, organize standards-based curricula, and refine art skills for teaching art in a variety of educational settings. Topics will include the study of art and art education, curriculum development, traditional and emerging art media and materials, and technology in art education. Emphasis will be on the study of three-dimensional art. Final art education portfolio review for art teaching credential students. 1 hour discussion; 4 hours studio.",
        "units": "2",
        "prerequisites": "{{Junior standing} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "588",
        "title": "Studio Problems in Public Art",
        "description": "Prerequisites: ART 488; 400-level Art course; Instructor consent. Development and completion of art forms planned for placement in the public realm. Increasing complexity and evidence of greater depth required in the sequence of coursework. Public art investigated in a workshop format that includes speakers, demonstrations and field trips. Emphasis on studio activities, proposal development and service learning. Some sections of this course may offer a community service opportunity with activities relating to concepts and theories presented in the course. Check the schedule of classes for the CS designation. 6 hours per week.",
        "units": "3",
        "prerequisites": "{{ART 488} && {400-level Art course} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "590",
        "title": "History and Philosophy of Art Education",
        "description": "Prerequisite: Junior standing. Required for Single Subject Credential in Art. May be used as upper division Art elective for B.A. degree. Intensive study of the historical and chronological development of Art Education in America and abroad. Emphasis on significant trends and movements that have affected its growth and present structure.",
        "units": "3",
        "prerequisites": "{Junior standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "611",
        "title": "History and Philosophy of Art",
        "description": "Prerequisites: Minimum 1 year Art History (2 years recommended); Graduate standing. Seminar examining the development of movements and ideas in 20th century art. Research in modern art and artists. (Offered Fall semester.)",
        "units": "3",
        "prerequisites": "{{Minimum 1 year Art History (2 years recommended)} && {Graduate standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "615",
        "title": "Art Analysis and Criticism",
        "description": "Prerequisites: Minimum 1 year of Art History; Graduate standing. Seminar exploring the critical approach to the work of art in terms of form, content and expression. Aesthetic and methodological problems will be treated in particular relationship to contemporary art and its criticism. (Offered Spring semester.)",
        "units": "3",
        "prerequisites": "{{Minimum 1 year of Art History} && {Graduate standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "620",
        "title": "Advanced Studio Problems: Video/Digital Art",
        "description": "Prerequisite: ART 502 or equivalent. Investigation into advanced concepts involved in the production of video/digital art forms. Explores resolution of problems dealing with media, technique and presentation. Increasing complexity and evidence of conceptual depth is required in the sequence of coursework. 6 hours per week in supervised studio work.",
        "units": "3",
        "prerequisites": "{ART 502}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "621",
        "title": "Advanced Studio Problems: Painting",
        "description": "Prerequisites: Classified graduate standing; Instructor consent. Investigation of artistic problems in painting, exploration leading to resolution in artistic statements. Problems of increasing complexity and evidence of greater depth of artistic concept required in the sequence of coursework. May be repeated 3 times for credit. 1 hour per week in seminar, 5 hours per week in supervised studio work.",
        "units": "3",
        "prerequisites": "{{Classified graduate standing} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "622",
        "title": "Advanced Studio Problems: Illustration",
        "description": "Prerequisites: Classified graduate standing; Instructor consent. Investigation of advanced problems in illustration, exploration leading to resolution in artistic statements. Problems of increasing complexity and evidence of greater depth of artistic concept required in the sequence of coursework. 1 hour per week in seminar; 5 hours per week in supervised studio work.",
        "units": "3",
        "prerequisites": "{{Classified graduate standing} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "624",
        "title": "Advanced Studio Problems: Drawing",
        "description": "Prerequisites: Classified graduate standing; Instructor consent. Investigation of advanced problems in drawing and related art disciplines. Projects of increasing complexity that require evidence of greater depth and skill in the resolution of visual statements. 1 hour per week in seminar; 5 hours per week in supervised studio work.",
        "units": "3",
        "prerequisites": "{{Classified graduate standing} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "625",
        "title": "Advanced Studio Problems: Printmaking",
        "description": "Prerequisites: Classified graduate standing; Instructor consent. Investigation of artistic problems in printmaking, exploration leading to resolution in artistic statements. Problems of increasing complexity and evidence of greater depth of artistic concept required in the sequence of coursework. 1 hour per week in seminar; 5 hours per week in supervised studio work.",
        "units": "3",
        "prerequisites": "{{Classified graduate standing} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "635",
        "title": "Advanced Studio Problems: Sculpture",
        "description": "Prerequisites: Classified graduate standing; Instructor consent. Investigation of advanced problems in sculpture.",
        "units": "3",
        "prerequisites": "{{Classified graduate standing} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "644",
        "title": "Advanced Studio Problems: Graphic Design",
        "description": "Prerequisites: Classified graduate standing; Instructor consent. Investigation of advanced problems in graphic design, exploration leading to resolution in artistic statements. Problems of increasing complexity and evidence of greater depth of artistic concept required in the sequence of coursework. 1 hour per week in seminar; 5 hours per week in supervised studio work.",
        "units": "3",
        "prerequisites": "{{Classified graduate standing} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "650",
        "title": "Advanced Studio Problems: Photography",
        "description": "Prerequisites: 6 units of ART 550; Classified graduate standing; Portfolio review. Investigation of advanced problems in photography exploring both the technical and conceptual challenges of visual communication. Projects of increasing complexity with evidence of greater depth of artistic concept and proficiency required in the sequence of coursework. 6 hours lab.",
        "units": "3",
        "prerequisites": "{{6 units of ART 550} && {Classified graduate standing} && {Portfolio review}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "660",
        "title": "Advanced Studio Problems in Ceramics Design",
        "description": "Prerequisites: Classified graduate standing; Instructor consent. Investigation of artistic problems in ceramics, exploration and experimentation leading to resolution in artistic statements. Problems in increasing complexity and evidence of greater depth of artistic concept required in the sequence of coursework. 1 hour per week in seminar; 5 hours per week in supervised studio work.",
        "units": "3",
        "prerequisites": "{{Classified graduate standing} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "667",
        "title": "Teaching Art in Higher Education",
        "description": "Prerequisites: Permission of instructor. Classified graduate standing in Visual Arts. Content includes the study and practice of teaching art to undergraduate students in institutions of higher education; developing strategies for course organization, lectures/discussions, learning techniques, and other responsibilities of faculty within higher education institutions. This elective course counts toward the graduate degree and may be repeated once for credit.",
        "units": "3",
        "prerequisites": "{Permission of instructor}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "681A",
        "title": "Seminar in Art Education",
        "description": "Prerequisite: Classified graduate standing. Graduate students from outside the Department of Art permitted with consent of instructor. Study of the nature of creativity in art, place of art in the curriculum, improving teaching methods and inquiry into other disciplines for related implications. Identification of areas of greatest need for research.",
        "units": "3",
        "prerequisites": "{Classified graduate standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "686",
        "title": "Research In Art Education",
        "description": "Prerequisites: Graduate standing; Restricted to M.A. Art candidates. Recommended Corequisite: ART 681B. Current experiments and studies in art education; problems of conducting research unique to the area of investigation. Development of research studies with emphasis on design criteria measurement and standards of proof. \n",
        "units": "3",
        "prerequisites": "{{Graduate standing} && {Restricted to M.A. Art candidates}}",
        "corequisites": "{ART 681B}"
    },
    {
        "subject": "ART",
        "catalog_number": "690A",
        "title": "M.F.A. Studio",
        "description": "Prerequisites: M.F.A.; Classified status; Instructor’s and graduate advisor’s consent. Investigation of advanced artistic problems leading to a highly specialized and personal aesthetic. 5 hours per week.",
        "units": "3",
        "prerequisites": "{{M.F.A.} && {Classified status} && {Instructor’s and graduate advisor’s consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "691A",
        "title": "M.F.A. Seminar",
        "description": "Prerequisites: M.F.A.; Classified status. Orientation to the procedures and requirements of the M.F.A. professional degree programs in Studio or Visual communication Arts. Exploration into career development, professional issues and writing about art. Philosophies pertaining to disciplines in the visual arts are examined through a series of guest lectures. 3 hours per week.",
        "units": "3",
        "prerequisites": "{{M.F.A.} && {Classified status}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "696B",
        "title": "Directed Graduate Research",
        "description": "Prerequisites: Classified status; Advisor consent.",
        "units": "2",
        "prerequisites": "{{Classified status} && {Advisor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "698C",
        "title": "Thesis or Graduate Project",
        "description": "Prerequisites: Classified graduate standing in the areas of Art Education or Art History; Completion of or current enrollment in all required Area of Concentration courses for the M.A. degree in Art; Consent of graduate advisor and thesis committee; Conformance to University standards for graduate thesis. Encompasses the preparation, completion and formal presentation of the culminating work for the degree.",
        "units": "3",
        "prerequisites": "{{Classified graduate standing in the areas of Art Education or Art History} && {Completion of or current enrollment in all required Area of Concentration courses for the M.A. degree in Art} && {Consent of graduate advisor and thesis committee} && {Conformance to University standards for graduate thesis}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "698D",
        "title": "Graduate Project",
        "description": "Prerequisites: Classified graduate standing; Completion of, or current enrollment in all remaining required courses. Advancement to Candidacy fulfilled. Consists of the spring group exhibition and/or performance of the student’s work, photographic documentation and a written statement addressing the aesthetic, philosophical and, when appropriate, technical aspects of the work, and an exhibition catalog.",
        "units": "3",
        "prerequisites": "{{Classified graduate standing} && {Completion of, or current enrollment in all remaining required courses}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ART",
        "catalog_number": "698F",
        "title": "M.A. Thesis/Artistic Performance",
        "description": "Prerequisites: Classified graduate standing; Completion of or current enrollment in all required courses.",
        "units": "6",
        "prerequisites": "{{Classified graduate standing} && {Completion of or current enrollment in all required courses}}",
        "corequisites": "{None}"
    }
]