[
    {
        "subject": "CD",
        "catalog_number": "133",
        "title": "Survey of Communication Disorders",
        "description": "Introduction to normal development and processes of human communication, as well as an introduction to various disorders of communication that occur when these processes are delayed or disrupted. Students will learn about the scopes of practice for speech-language pathologists and audiologists, as well as speech, language, and hearing scientists, all of whom investigate and provide clinical services to people across the lifespan who have disorders of speech, language, voice, swallowing, feeding, hearing, and balance. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "361",
        "title": "Language Development in Children",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of oral language development in children and the bases for speech and language problems. Provides layperson awareness of the various dimensions of speech and language development; the milestones observable within the normal developmental sequence; and the identification, consequences and management of speech and language disorders. (Not open to Communication Disorders and Sciences majors.) (Available for General Education, E Lifelong Learning.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "405",
        "title": "Phonetics",
        "description": "Study of general phonetics principles; articulatory, acoustic and linguistic aspects of the sound systems of standard and non-standard dialects of American English; introduction to the application of phonetics to disordered sound systems.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "410",
        "title": "Hearing Science",
        "description": "Study of physics of sound, anatomy and physiology of the earand measurement of perception of sound. Brief survey of causes of hearing impairment and habilitation procedures.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "415",
        "title": "Speech and Language Development",
        "description": "Study of speech and language development in relation to normal learning and growth processes; brief introduction to second language acquisition.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "442",
        "title": "Speech Science",
        "description": "Structure and function of neuro-muscular systems used in respiration, phonation, resonation and articulation; fundamentals of sound production and transmission applied to speech.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "445",
        "title": "Audiometry and Hearing Conservation",
        "description": "Prerequisite: CD 410. Study of basic battery of audiologic tests, including equipment calibration procedures, pure tone and speech audiometry, clinical masking and the study of school and industrial identification audiometry and hearing conservation. Familiarization with basic audiologic equipment, and calibration and test procedures.",
        "units": "3",
        "prerequisites": "{CD 410}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "446",
        "title": "Auditory Habilitation",
        "description": "Prerequisite: CD 410. Theory and methods of habilitation of hearing-impaired adults and children, including assessment of hearing handicap, habilitation management, speech-reading and amplification with individual and group hearing aids.",
        "units": "3",
        "prerequisites": "{CD 410}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "450",
        "title": "Fluency and Disorders of Fluency",
        "description": "Prerequisites: CD 415, CD 442. Study of the etiology, characteristics and clinic assessment of typical/atypical stuttering in adults and children. The efficacy and efficiency of therapeutic management of fluency disorders are discussed. In addition, multicultural implications for assessment and treatment will be presented. Regular written assignments are required.",
        "units": "3",
        "prerequisites": "{{CD 415} && {CD 442}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "451",
        "title": "Phonologic and Articulatory Disorders",
        "description": "Prerequisites: CD 405, CD 415, CD 442. Examination of theories of normal and disordered acquisition of phonology and articulatory production, as well as basic phonologic assessment methods and treatment planning. Both functional and structural disorders are emphasized, including cleft lip and palate and related craniofacial syndromes. Regular written assignments are required.",
        "units": "3",
        "prerequisites": "{{CD 405} && {CD 415} && {CD 442}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "462",
        "title": "Language Disorders I",
        "description": "Prerequisite: CD 415. Ways of conceptualizing language of parts of language; introduction to data collection, transcription and language analysis; introduction to the concept of differential diagnosis; introduction to diagnostic populations with associated developmental language disorders.",
        "units": "3",
        "prerequisites": "{CD 415}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "465",
        "title": "Clinical Practicum in Speech Pathology I-UG",
        "description": "Prerequisites: CD 405 (or equivalent), CD 410 (or equivalent), CD 415 (or equivalent), CD 442 (or equivalent), CD 451 (or equivalent), CD 462 (or equivalent), CD 469A (or equivalent), CD 469O (or equivalent). Corequisites: Maintenance of clinical privileges; Consent of instructor. Supervised clinical experience in assessment screening and therapy for speech-, language- and deaf and hard of hearing children and adults, academic study of specific communication problems. 6 hours of clinical skills lab per week.",
        "units": "2",
        "prerequisites": "{{CD 405 (or equivalent)} && {CD 410 (or equivalent)} && {CD 415 (or equivalent)} && {CD 442 (or equivalent)} && {CD 451 (or equivalent)} && {CD 462 (or equivalent)} && {CD 469A (or equivalent)} && {CD 469O (or equivalent)}}",
        "corequisites": "{{Maintenance of clinical privileges} && {Consent of instructor}}"
    },
    {
        "subject": "CD",
        "catalog_number": "469A",
        "title": "Diagnostic Methods in Communication Disorders",
        "description": "Prerequisites: CD 405, CD 410, CD 415 and CD 442. Basic concepts of standardized and non-standardized evaluation procedures for children and adults with mild to moderate communicative disorders. Theory and application of clinical writing, including the case history and the assessment report.",
        "units": "3",
        "prerequisites": "{{CD 405} && {CD 410} && {CD 415} && {CD 442}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "469O",
        "title": "Observation and Professional Writing in Communication Disorders",
        "description": "Prerequisites: Eligibility for Clinical Privileges (Clinical Phase) and consent of instructor. Development of entry-level case management fundamentals for prospective speech-language pathologists and audiologists. Students develop preliminary clinical skills for clinical documentation. This course completes 25 observation hours in evaluation and fundamental management of speech, language, voice and hearing disorders. Students must maintain eligibility for clinical privileges throughout the semester.",
        "units": "1",
        "prerequisites": "{{Eligibility for Clinical Privileges (Clinical Phase)} && {consent of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "475",
        "title": "Clinical Practicum in Audiology I",
        "description": "Prerequisites: CD 445, CD 446, CD 469A, CD 469O. Application of audiometric theory in the audiological lab, giving the student experience in the clinic routine of assessing auditory function and preparing and implementing a program of rehabilitation. 6 hours of lab per week.",
        "units": "2",
        "prerequisites": "{{CD 445} && {CD 446} && {CD 469A} && {CD 469O}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "480",
        "title": "Early Speech-Language Intervention",
        "description": "Prerequisites: CD 405, CD 415, CD 462. Advanced study of speech and language disorders, assessment procedures and intervention management of developmentally-delayed children from birth to age 5.",
        "units": "3",
        "prerequisites": "{{CD 405} && {CD 415} && {CD 462}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "485",
        "title": "Augmentative and Alternative Communication",
        "description": "Prerequisites: CD 405 (or equivalent), CD 410 (or equivalent), CD 415 (or equivalent), CD 442 (or equivalent). The study of unaided and aided communication systems and modalities to provide augmentative and/or alternative communication habilitation and rehabilitation to communicatively handicapped individuals. Contemporary microcomputer hardware and software, program development, devices and applications in the fields of Speech-Language Pathology and Audiology are introduced. Library research, using computers and specialized software, and diagnostic and rehabilitative procedures are discussed, along with requirements and methods of clinical documentation. Regular written assignments are required.",
        "units": "3",
        "prerequisites": "{{CD 405 (or equivalent)} && {CD 410 (or equivalent)} && {CD 415 (or equivalent)} && {CD 442 (or equivalent)}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "500",
        "title": "Background Leveling in Communication Disorders and Sciences",
        "description": "Corequisite: Admission to the Department of Communication Disorders and Sciences graduate studies program. Recommended Preparatory Courses: Course equivalents of CD 405, CD 410, CD 415, CD 442, CD 445, CD 446, CD 450, CD 451, CD 462, CD 469A. Tailored instruction for students to ensure achievement of expected competency requirements as they begin graduate study. Students are assessed across seven strands of knowledge and skills competencies; for those strands in which minimal competency skills are not met, instruction/skill remediation modules are designed in order to advance the students’ foundations of knowledge and skills.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{Admission to the Department of Communication Disorders and Sciences graduate studies program}"
    },
    {
        "subject": "CD",
        "catalog_number": "501",
        "title": "Interviewing and Counseling in Communicative Disorders",
        "description": "Prerequisite: Graduate standing or permission of instructor. Advanced study of interviewing and counseling strategies and techniques associated with diagnostic and therapeutic practice in Speech-Language Pathology and Audiology. Professional responsibilities for ethical practices. Regular written assignments are required.",
        "units": "3",
        "prerequisites": "{{Graduate standing} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "502",
        "title": "Research in Communication Disorders",
        "description": "Prerequisite: Graduate standing. Study of applied research methods and instrumentation in the field of communication disorders, including literature search techniques, research design, statistical tests, lab instrumentation and calibration, and report preparation. Regular written assignments are required.",
        "units": "3",
        "prerequisites": "{Graduate standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "552",
        "title": "Language Disorders II",
        "description": "Prerequisites: CD 462 or equivalent; Graduate standing. Survey of current definitions and causes of language disorder; disorders of parts of language and trade-off effects. Identification of relevant features of disordered language for assessment and intervention. Analysis of relevant features of disordered language through advanced data collection, transcription and language analysis of intonation, morphosyntactic form, communicative function, repair phenomena and discourse-level sequences.",
        "units": "3",
        "prerequisites": "{{CD 462} && {Graduate standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "558",
        "title": "Neuroanatomy and Neurophysiology of Speech, Language and Hearing",
        "description": "Prerequisite: Graduate standing. Concerned with the structural components and organization of the central and peripheral nervous systems and their conduction pathways and functions, with specific emphasis on those structures that subserve normal speech, language and hearing processes. Regular writing assignments are required.",
        "units": "3",
        "prerequisites": "{Graduate standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "565",
        "title": "Clinical Practicum in Speech Pathology I-GR",
        "description": "Prerequisites: CD 405 (or equivalent), CD 410 (or equivalent), CD 415 (or equivalent), CD 442 (or equivalent), CD 451 (or equivalent), CD 462 (or equivalent), CD 469A (or equivalent), CD 469O (or equivalent); Graduate status. Corequisites: Maintenance of clinical privileges and consent of instructor. Supervised clinical experience in assessment screening, diagnosis of and therapy for speech-, language- and hearing-handicapped children and adults, academic study of specific communication problems. 6 hours of clinical skills lab per week. May be repeated one time.",
        "units": "2",
        "prerequisites": "{{CD 405 (or equivalent)} && {CD 410 (or equivalent)} && {CD 415 (or equivalent)} && {CD 442 (or equivalent)} && {CD 451 (or equivalent)} && {CD 462 (or equivalent)} && {CD 469A (or equivalent)} && {CD 469O (or equivalent)} && {Graduate status}}",
        "corequisites": "{{Maintenance of clinical privileges} && {consent of instructor}}"
    },
    {
        "subject": "CD",
        "catalog_number": "566",
        "title": "Clinical Practicum in Speech Pathology II",
        "description": "Prerequisites: CD 405 (or equivalent), CD 410 (or equivalent), CD 415 (or equivalent), CD 442 (or equivalent), CD 451 (or equivalent), CD 462 (or equivalent), CD 465 or CD 565 (or equivalent), CD 469A (or equivalent), CD 469O (or equivalent); Graduate status. Corequisites: Maintenance of clinical privileges; Consent of instructor. 6 hours of clinical skills lab per week. May be repeated one time.",
        "units": "2",
        "prerequisites": "{{CD 405 (or equivalent)} && {CD 410 (or equivalent)} && {CD 415 (or equivalent)} && {CD 442 (or equivalent)} && {CD 451 (or equivalent)} && {CD 462 (or equivalent)} && {{CD 465 (or equivalent)} || {CD 565 (or equivalent)}} && {CD 469A (or equivalent)} && {CD 469O (or equivalent)} && {Graduate status}}",
        "corequisites": "{{Maintenance of clinical privileges} && {Consent of instructor}}"
    },
    {
        "subject": "CD",
        "catalog_number": "567",
        "title": "Clinical Practicum in Speech Pathology III",
        "description": "Prerequisites: CD 566 (or equivalent); Graduate status. Corequisites: Maintenance of clinical privileges; Consent of instructor. 6 hours of clinical skills lab per week. May be repeated one time.",
        "units": "2",
        "prerequisites": "{{CD 566 (or equivalent)} && {Graduate status}}",
        "corequisites": "{{Maintenance of clinical privileges} && {Consent of instructor}}"
    },
    {
        "subject": "CD",
        "catalog_number": "576",
        "title": "Clinical Practicum in Audiology II",
        "description": "Prerequisite: CD 475. 6 hours of lab per week.",
        "units": "2",
        "prerequisites": "{CD 475}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "577",
        "title": "Clinical Practicum in Audiology III",
        "description": "Prerequisite: Graduate status. 6 hours of lab per week.",
        "units": "2",
        "prerequisites": "{Graduate status}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "599A",
        "title": "Independent Study",
        "description": "Independent Study",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "651",
        "title": "Advanced Study of Articulation and Phonological Disorders in Children",
        "description": "Prerequisites: CD 451, CD 462, CD 469A, CD 558 or the equivalents; Graduate standing. Advanced study of speech acquisition, differential diagnosis of pediatric speech disorders and principles of intervention.",
        "units": "3",
        "prerequisites": "{{CD 451 (or equivalent)} && {CD 462 (or equivalent)} && {CD 469A (or equivalent)} && {CD 558 (or equivalent)} && {Graduate standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "659",
        "title": "Neurogenic Disorders of Cognition and Language",
        "description": "Prerequisites: Admission to the department’s graduate program; CD 558. Corequisite: Consent of instructor. This course includes advanced study of the neurological bases for language and cognitive deficits, as well as theoretical views of the organization of these components. Primary focus is given to the diagnosis and treatment of common communication problems in adults with aphasia, traumatic brain injury and other acquired language and cognitive disorders. In addition, these language and cognitive impairments will be contrasted with communication changes associated with normal aging.",
        "units": "3",
        "prerequisites": "{{Admission to the department’s graduate program} && {CD 558}}",
        "corequisites": "{Consent of instructor}"
    },
    {
        "subject": "CD",
        "catalog_number": "660",
        "title": "Structural and Neurogenic Speech Disorders",
        "description": "Prerequisites: CD 558; Admission to the department’s graduate program. Corequisite: Consent of instructor. This course focuses on the advanced study of structural and neurogenic speech disorders, including models of motor control of speech production, neurological representation of speech and the effects of structural or neurological damage on speech production. Students will identify specific speech deficits characterizing dysarthria, apraxia of speech, craniofacial anomalies and surgical or traumatic alterations in normal speech structure and function. Physical and clinical assessment and management of these cases will be emphasized.",
        "units": "3",
        "prerequisites": "{{Admission to the department’s graduate program} && {CD 558}}",
        "corequisites": "{Consent of instructor}"
    },
    {
        "subject": "CD",
        "catalog_number": "661",
        "title": "Voice and Disorders of Voice",
        "description": "Prerequisite: Admission to the department’s graduate program. Corequisite: Consent of instructor. Study of theoretical, diagnostic and treatment issues in functional/organic/neurogenic/and psychgenic voice disorders. In addition, diagnostic and treatment options for laryngeal, head and neck cancer are presented. Multicultural implications for assessment and treatment are discussed. Regular written assignments are required, as well as proficiency with instrumentation for options within assessment and treatment.",
        "units": "3",
        "prerequisites": "{Admission to the department’s graduate program}",
        "corequisites": "{Consent of instructor}"
    },
    {
        "subject": "CD",
        "catalog_number": "662",
        "title": "Seminar in Developmental Language Disorders",
        "description": "Prerequisites: CD 552; Graduate standing. Advanced study of current research relating to the differential diagnosis of populations with associated developmental language disorders, including specific language impairment, language/learning disabilities, central auditory processing disorders, pervasive developmental disorders, psychiatric disorders, mental retardation and other populations with associated developmental disorder.",
        "units": "3",
        "prerequisites": "{{CD 552} && {Graduate standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "663",
        "title": "Adult and Pediatric Swallowing/Feeding Disorders",
        "description": "Prerequisites: CD 558; Admission to the department’s graduate program. Corequisite: Consent of instructor. This course focuses on the theoretical and clinical aspects of the disorders of swallowing or dysphagia. The physiology of normal swallow is studied as it develops across the lifespan. The etiologies of dysphagia in both the pediatric and adult populations are examined, as well as clinical and instrumental assessment of normal swallowing and dysphagia. Finally, the diagnosis and management of disorders of swallowing in the pediatric and adult populations are investigated.",
        "units": "3",
        "prerequisites": "{{Admission to the department’s graduate program} && {CD 558}}",
        "corequisites": "{Consent of instructor}"
    },
    {
        "subject": "CD",
        "catalog_number": "668",
        "title": "Advanced Diagnostics in Speech-Language Pathology",
        "description": "Prerequisites: CD 465, CD 566, CD 567, CD 552, CD 558, CD 651, CD 659, CD 661; Maintenance of clinical privileges; Consent of instructor. Advanced diagnosis and evaluation of children and adults with complex disorders of speech and/or language and/or cognition. Clinical experience in taking a history, constructing a test battery, administering norm-referenced tests, performing informal assessment procedures, interpreting formal and informal results, making a differential diagnosis, writing reports and conducting feedback sessions with clients, parents and/or caregivers.",
        "units": "3",
        "prerequisites": "{{CD 465} && {CD 566} && {CD 567} && {CD 552} && {CD 558} && {CD 651} && {CD 659} && {CD 661} && {Maintenance of clinical privileges} && {Consent of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "672A",
        "title": "Advanced Clinical Practice in Speech Pathology and Audiology I",
        "description": "Prerequisites: CD 465, CD 566, CD 567 (or equivalents) and instructor consent. Supervised clinical experience in diagnostics, assessments, screenings and therapeutic procedures with children and adults who have disorders in speech, language, voice, resonance and swallowing. Practicum placement may include sites such as transitional centers, private practices, hospitals or community health service centers. Interdisciplinary staff conferences are expected with educational personnel, allied health personnel or medical personnel who collaborate in the treatment of speech and language pathologies. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{CD 465 (or equivalent)} && {CD 566 (or equivalent)} && {CD 567 (or equivalent)} && {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "672B",
        "title": "Advanced Clinical Practice in Speech Pathology and Audiology II",
        "description": "Prerequisites: CD 465, CD 566, CD 567, CD 672A (or equivalents) and instructor consent. Supervised clinical experience in diagnostics, assessments, screenings and therapeutic procedures with children and adults who have disorders in speech, language, voice, resonance and swallowing. Enrollment in CD 672B emphasizes finalization of all knowledge and skill competencies expected for entry level into professional practice that are associated with certification, licensure and credential. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{CD 465 (or equivalent)} && {CD 566 (or equivalent)} && {CD 567 (or equivalent)} && {CD 672A (or equivalent)} && {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "672C",
        "title": "Advanced Clinical Practice in Speech Pathology and Audiology II",
        "description": "Prerequisites: CD 465, CD 566, CD 567, CD 672A (or equivalents). Corequisites: Maintenance of clinical privileges; Consent of instructor. Supervised clinical experience in diagnostics, assessments, screenings and therapeutic procedures with children and adults who have disorders in speech, language, voice, resonance and swallowing. Enrollment in 672C emphasizes finalization of all knowledge and skill competencies expected for entry level into professional practice that are associated with certification, licensure and credential. (Credit/No Credit only)",
        "units": "6",
        "prerequisites": "{{CD 465 (or equivalent)} && {CD 566 (or equivalent)} && {CD 567 (or equivalent)} && {CD 672A (or equivalent)}}",
        "corequisites": "{{Maintenance of clinical privileges} && {Consent of instructor}}"
    },
    {
        "subject": "CD",
        "catalog_number": "674",
        "title": "Pediatric Audiology",
        "description": "Prerequisites: CD 445, CD 446. Advanced study of the causation, assessment and management of auditory disorders in infants and children.",
        "units": "3",
        "prerequisites": "{{CD 445} && {CD 446}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies",
        "description": "Prerequisite: Completion of all courses required in the program.",
        "units": "3",
        "prerequisites": "{Completion of all courses required in the program}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "708",
        "title": "Advanced Anatomy and Physiology of Auditory System",
        "description": "Prerequisite: Admission to the AuD graduate program. The anatomical and physiological mechanisms for the peripheral and central auditory systems with normal and abnormal functions are covered in this course. In addition, research on auditory physiology will be discussed.",
        "units": "3",
        "prerequisites": "{Admission to the AuD graduate program}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "720",
        "title": "Psychoacoustics and Speech Perception",
        "description": "Prerequisite: Admission to the AuD graduate program. This course will explore auditory processing of acoustic signals including non-speech and speech sounds in normal and abnormal human auditory systems. Lecture will be combined with laboratory activities as the major format of the class. The course will emphasize anatomy and physiology of the peripheral and central auditory system, behavioral measures of auditory performance including masking, sound localization, pitch and loudness perception and speech perception of normal and hearing impaired listeners.",
        "units": "3",
        "prerequisites": "{Admission to the AuD graduate program}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "724",
        "title": "Advanced Audiometry Evaluation",
        "description": "Prerequisite: Admission to the AuD graduate program. This course includes advanced instruction in the development and application of standard diagnostic audiology procedures, as well as instrumentation and calibration standards for audiology practice. Advanced instruction for the administration and interpretation of standard audiometric tests is also included.",
        "units": "3",
        "prerequisites": "{Admission to the AuD graduate program}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "730",
        "title": "Clinical Methods and Instrumentation",
        "description": "Prerequisite: Admission to the AuD graduate program. This class instructs the foundations of audiology practice and how the practice inserts into the diagnostic and therapeutic processes of clinical decision making. Students will study how data from technology, such as acoustic signals–calibration–evaluation results of hearing assessment, contribute to patient responses and clinical judgment in developing a partnership for effective primary care management.",
        "units": "3",
        "prerequisites": "{Admission to the AuD graduate program}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "742A",
        "title": "Auditory Amplification I",
        "description": "Prerequisites: CD 708 (or equivalent) and admission to the AuD graduate program. This course analyzes the theories and concepts of current technology with regard to amplification systems for hearing impaired patients. Standard audiological batteries for comprehensive aural rehabilitation and treatment processes and various types of amplification systems and accessories appropriated for each hearing impaired individual are discussed.",
        "units": "3",
        "prerequisites": "{{CD 708 (or equivalent)} && {admission to the AuD graduate program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "742B",
        "title": "Auditory Amplification II",
        "description": "Prerequisites: CD 742A (or equivalent) and admission to the AuD graduate program. In this course, advanced topics in amplification devices and systems are discussed. Audiologic rehabilitation and case management of individuals with hearing loss, as well as careproviders, are presented in formats that promote critical thinking skills and adaptive skills that are required of audiologists in the face of rapidly advancing technologies.",
        "units": "3",
        "prerequisites": "{{CD 742A (or equivalent)} && {admission to the AuD graduate program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "744",
        "title": "Interviewing and Counseling in Audiology",
        "description": "Prerequisite: Admission to the AuD graduate program. Advanced study of strategies and techniques for effective interviewing and counseling of patients and care providers involved with the diagnostic and therapeutic practices in audiology. Professional responsibilities for ethical practices specifically related to patient care during the interviewing and counseling processes are investigated.",
        "units": "3",
        "prerequisites": "{Admission to the AuD graduate program}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "745",
        "title": "Pathologies of Auditory System",
        "description": "Prerequisites: CD 708, CD 724 (or equivalents), and admission to the AuD graduate program. This course is designed to address symptoms, etiology and pathology, site of lesion, audiological evaluation and management of selected peripheral and central auditory disorders. Particular attention will be paid to anatomy and physiology of the specific disorder, patient symptoms, choosing appropriate tests, appropriate interpretation of symptoms and test results, and medical referral and follow‑up.",
        "units": "3",
        "prerequisites": "{{CD 708 (or equivalent)} && {CD 724 (or equivalent)} && {admission to the AuD graduate program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "748",
        "title": "Educational Audiology",
        "description": "Prerequisites: CD 740 (or equivalent) and admission to the AuD graduate program. The focus of this course is on clinical competencies in the aural (re)habilitation of deaf and hard-of-hearing children specifically within educational settings. The course has a strong interdisciplinary focus, considering ethnic and cultural variables in (re)habilitation processes for children with congenital and acquired hearing loss, as well as impacts of family culture in decision making and program collaboration.",
        "units": "3",
        "prerequisites": "{{CD 740 (or equivalent)} && {admission to the AuD graduate program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "752",
        "title": "Implantable Auditory Prostheses",
        "description": "Prerequisites: CD 708 and CD 720 (or equivalents), and admission to the AuD graduate program. Implantable Auditory Prostheses is one of academic/clinical courses which explores the many different areas and issues related to auditory devices that are implantable. Topics to be covered include signal processing, candidacy determination, medical considerations, steps in programming, aural (re)habilitation techniques, and speech perception and production outcomes in children and adults. Information will be presented and learned through lectures, guest speakers, hands-on activities, assignments, and interactions with adult users of implantable devices.",
        "units": "3",
        "prerequisites": "{{CD 708 (or equivalent)} && {CD 720 (or equivalent)} && {admission to the AuD graduate program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "753A",
        "title": "Electrophysiology of Auditory System I",
        "description": "Prerequisites: CD 708 (or equivalent) and admission to the AuD graduate program. This course provides a fundamental knowledge base in the underlying scientific background, relevant clinical applications, and methods in the practice of physiological clinical measures associated with audiology; measures include otoacoustic emissions and auditory evoked potentials and specifically, the auditory brainstem response (ABR) test.",
        "units": "3",
        "prerequisites": "{{CD 708 (or equivalent)} && {admission to the AuD graduate program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "753B",
        "title": "Electrophysiology of Auditory System II",
        "description": "Prerequisites: CD 708, CD 753A (or equivalents), and admission to the AuD graduate program. This course experience covers advanced topics pertaining to the theoretical and clinical aspects of auditory evoked potentials. Topics include vestibular differential diagnosis, evoked otoacoustic emissions (distortion-product, transient evoked, and stimulus frequency), electrocochleography, bone and horizontal evoked potential recordings, middle latency responses, auditory steady state responses, auditory event-related potentials such Mismatch Negativity (MMN), auditory late responses, cranial nerve VII recordings, and neuroimaging techniques.",
        "units": "3",
        "prerequisites": "{{CD 708 (or equivalent)} && {CD 753A (or equivalent)} && {admission to the AuD graduate program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "755",
        "title": "Advanced Pediatric Audiology: Development, Assessment and Intervention",
        "description": "Prerequisite: Admission to the AuD graduate program. In this course, students will study the embryologic and physiologic development of the auditory system, genetics and hearing loss, as well as non-genetic causes of hearing loss, auditory disorders in children including otitis media and auditory processing disorder, and physiological and behavioral assessments of auditory function commonly used with infants and children.",
        "units": "3",
        "prerequisites": "{Admission to the AuD graduate program}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "760",
        "title": "Research Methods in Audiology",
        "description": "Prerequisites: Admission to the AuD graduate program and instructor consent. This course involves the study of applied research methods in the field of communication disorders, and most specifically, the field of audiology. This course includes instruction in application of common statistical topics such as univariate data, probability, bivariate data, estimation and tests of significance; these statistical topics are integrated with instruction of research design and report preparation.",
        "units": "3",
        "prerequisites": "{Admission to the AuD graduate program} && {instructor consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "762",
        "title": "Business Aspects in Audiology",
        "description": "Prerequisite: Admission to the AuD graduate program. This course covers legal, ethical and multicultural issues within various practice settings associated with the field of audiology and the roles of audiologists. Topics include professional issues related to scope of practice, treatment outcome measures, licensure, certification, malpractice issues, financial considerations and practice management.",
        "units": "3",
        "prerequisites": "{Admission to the AuD graduate program}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "764",
        "title": "Industrial, Occupational and Forensic Audiology",
        "description": "Prerequisites: CD 730 (or equivalent) and admission to the AuD graduate program. This course covers the topics of identification and prevention of hearing loss in children and adults due to the effects and impacts of different settings and occupations, and assessment and management of auditory processing disorders in adult populations. Additionally, the roles of audiologists as experts who testify in matters relating to the law are investigated.",
        "units": "3",
        "prerequisites": "{{CD 730 (or equivalent)} && {admission to the AuD graduate program}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "767",
        "title": "Interdisciplinary Aspects in Audiology: Contemporary Issues",
        "description": "Prerequisite: Admission to the AuD graduate program. The need for effective interdisciplinary collaboration by audiologists is essential for effective case management. Policies and practices outside of the healthcare management that is specifically directed by hearing specialists can have strong influences that impact assessment decisions, treatment decisions and counseling directions. This course investigates issues facing contemporary practice in audiology, especially regarding interdisciplinary, collaborative efforts co-occurring in case management.",
        "units": "3",
        "prerequisites": "{Admission to the AuD graduate program}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "770",
        "title": "Clinical Practicum in Audiology I",
        "description": "Prerequisites: Admission to the AuD graduate program, maintenance of clinical privileges and instructor consent. Supervised clinical experience in assessment, screening and therapy for speech-, language- and deaf and hard of hearing children and adults, academic study of specific communication difficulties and audiological disorders. Nine hours of clinical skills lab per week. May be repeated one time.",
        "units": "3",
        "prerequisites": "{{Admission to the AuD graduate program} && {maintenance of clinical privileges} && {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "771",
        "title": "Clinical Practicum in Audiology II",
        "description": "Prerequisites: CD 770 with a grade of “A” or “B” (or equivalent), maintenance of clinical privileges and instructor consent. Supervised clinical experience in diagnostics, assessments, screenings and therapeutic procedures with infants, children and adults who have disorders associated with the auditory system and/or systems for processing of acoustic information. Nine hours of clinical skills lab per week. May be repeated one time.",
        "units": "3",
        "prerequisites": "{{CD 770 with a grade of B or higher (or equivalent)} && {maintenance of clinical privileges} && {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "773",
        "title": "Clinical Practicum in Audiology IV",
        "description": "Prerequisites: CD 772 with a grade of “A” or “B” (or equivalent), maintenance of clinical privileges and instructor consent. Supervised clinical experience in diagnostics, assessments, screenings and therapeutic procedures with infants, children and adults who have disorders associated with the auditory system, vestibular system and/or systems for processing of acoustic information. Nine hours of clinical skills lab per week. May be repeated one time.",
        "units": "3",
        "prerequisites": "{{CD 772 with a grade of B or higher (or equivalent)} && {maintenance of clinical privileges} && {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "774",
        "title": "Clinical Practicum in Audiology V",
        "description": "Prerequisites: CD 773 with a grade of “A” or “B” (or equivalent), maintenance of clinical privileges and instructor consent. Supervised clinical experience in diagnostics, assessments, screenings and therapeutic procedures with infants, children and adults who have disorders associated with the auditory system, vestibular system and/or systems for processing of acoustic information. Nine hours of clinical skills lab per week. May be repeated one time.",
        "units": "3",
        "prerequisites": "{{CD 773 with a grade of B or higher (or equivalent)} && {maintenance of clinical privileges} && {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "775B",
        "title": "Advanced Clinical Practice in Audiology II",
        "description": "Prerequisites: CD 775A with a grade of “A” or “B”, maintenance of clinical privileges and instructor consent. Supervised clinical experience in diagnostics, assessments, screenings and therapeutic procedures with infants, children and adults who have disorders associated with the auditory system, vestibular system and/or systems for processing of acoustic information. CD 775B is the second off-campus practicum within the 775 series (775A, 775B and 775C). CD 775B is an off-campus placement and emphasizes the continued development of knowledge and skill competencies leading to entry level professional practice that is consistent with certification, licensure and credential within the field of audiology. (Credit/No Credit only)",
        "units": "6",
        "prerequisites": "{{CD 775A with a grade of B or higher (or equivalent)} && {maintenance of clinical privileges} && {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "775C",
        "title": "Advanced Clinical Practice in Audiology III",
        "description": "Prerequisites: CD 775B with a grade of “A” or “B”, maintenance of clinical privileges and instructor consent. Supervised clinical experience in diagnostics, assessments, screenings and therapeutic procedures with infants, children and adults who have disorders associated with the auditory system, vestibular system and/or systems for processing of acoustic information. CD 775C is the third and last within the 775 series (775A, 775B and 775C). CD 775C is an off campus placement and emphasizes the continued development of knowledge and skill competencies leading to entry level professional practice that is consistent with certification, licensure and credential within the field of audiology. (Credit/No Credit only)",
        "units": "6",
        "prerequisites": "{{CD 775B with a grade of B or higher (or equivalent)} && {maintenance of clinical privileges} && {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "776B",
        "title": "Required Professional Experience in Audiology II",
        "description": "Prerequisites: CD 776A with a grade of “A” or “B”, maintenance of clinical privileges and instructor consent. Supervised clinical experience in diagnostics, assessments, screenings and therapeutic procedures with infants, children and adults who have disorders in hearing. CD 776B is the second within the 776 series (776A, 776B and 776C), which occurs in the final year of studies for the Doctorate in Audiology. Enrollment in 776B emphasizes the continued finalization of all knowledge and skill competencies expected for entry level into professional practice that are associated with certification, licensure and credential. (Credit/No Credit only)",
        "units": "6",
        "prerequisites": "{{CD 776A with a grade of B or higher (or equivalent)} && {maintenance of clinical privileges} && {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "796",
        "title": "Directed Graduate Research in Audiology",
        "description": "Prerequisites: Advancement to candidacy, advisor consent, instructor consent, maintenance of clinical privileges. Conducted clinical research under the guidance of a CDS faculty member. Students will conduct independent research as well as attend meetings with advisors and with peers within a regularly scheduled seminar. May be repeated once.",
        "units": "3",
        "prerequisites": "{{Advancement to candidacy} && {advisor consent} && {instructor consent} && {maintenance of clinical privileges}}",
        "corequisites": "{None}"
    },
    {
        "subject": "CD",
        "catalog_number": "797",
        "title": "Directed Comprehensive Studies in Audiology",
        "description": "Prerequisites: Completion of all required academic coursework in the Doctor of Audiology program, advisor consent, instructor consent, maintenance of clinical privileges. This course includes guided preparation and review for the culminating, comprehensive examination in the Doctor of Audiology program. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{Completion of all required academic coursework in the Doctor of Audiology program} && {advisor consent} && {instructor consent} && {maintenance of clinical privileges}}",
        "corequisites": "{None}"
    }
]