[
    {
        "subject": "EED",
        "catalog_number": "472",
        "title": "Mathematics Curriculum and Methods",
        "description": "Prerequisites: EPC 315; Special Education students only may take SPED 400 instead of EPC 315. Admission to credential program. Recommended Pre/Corequisites: MATH 310 and MATH 310L. Restricted to Integrated Teacher Education Program candidates admitted to the credential program. Addresses the skills and understandings that Multiple Subject Credential candidates and Preliminary Education Specialist candidates need in order to effectively plan, implement and evaluate instructional programs in mathematics for diverse student populations that reflect the California Mathematics Framework and Academic Content Standards. Designed to provide teacher candidates with models of pre- and post-assessment and instruction consistent with our current understanding of learning processes, opportunities to develop related process skills, and skills in implementing instructional models. The course helps teacher candidates develop strategies for teaching children of various cultural and linguistic heritages, developmental levels, learning styles and special populations to ensure all children equal access to the core curriculum.",
        "units": "2",
        "prerequisites": "{{EPC 315} || {Special Education students only may take SPED 400 instead of EPC 315}}",
        "corequisites": "{MATH 310/L}"
    },
    {
        "subject": "EED",
        "catalog_number": "477A",
        "title": "Reading Instruction for Diverse Learners",
        "description": "Prerequisite: Admission to the Integrated Teacher Education Program. This is the first of two courses designed to prepare undergraduate multiple-subject credential candidates to teach reading, speaking, listening and language across the curriculum to all students—including beginning through advanced readers, English learners and students with special needs. Teacher candidates will become familiar with historical and theoretical perspectives on reading/language arts and the current state-adopted standards in English language arts and English language development (ELD). Candidates will learn how to use an array of engaging instructional methods to address student needs and to help students become skillful, analytic, lifelong readers. Candidates learn to administer literacy assessments and use assessment data to inform instructional planning. This course requires 20 hours of directed fieldwork in a public school during reading/language arts/ELD instruction.",
        "units": "3",
        "prerequisites": "{Admission to the Integrated Teacher Education Program}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "480",
        "title": "Science/Social Science Curriculum Methods",
        "description": "Prerequisites: Successful completion of EED 477B and first student teaching assignment. Corequisites for Multiple Subject Credential Candidates: EED 578D, EED 579. Corequisites for Education Specialist Credential Candidates: SPED 579, SPED 580MM. This course addresses the skills and understandings that Multiple Subject Credential and Preliminary Education Specialist Credential candidates need in order to effectively plan, implement, and evaluate instructional programs in science and social science for diverse student populations that reflect the California Science and Social Science Frameworks, Common Core Standards (CCSS), Academic Content Standards, and the Next Generation Science Standards (NGSS). It is designed to provide teacher candidates with models of instruction such as Problem-Based Learning (PBL) consistent with our current understanding of learning processes, opportunities to develop related process skills, use of technology and STEM Education in the teaching and learning of science and social science, and skills in implementing instructional models. Furthermore, the course helps teacher candidates develop strategies for teaching children of widely differing cultural and linguistic heritages, developmental levels and learning styles, and special populations to ensure equal access to the core curriculum. This course is restricted to Integrated Teacher Education Program candidates admitted to the credential program. Available for graduate credit with approval from the graduate coordinator.",
        "units": "4",
        "prerequisites": "{{EED 477B} && {First student teaching assignment}}",
        "corequisites": "{{EED 578D} && {EED 579}}"
    },
    {
        "subject": "EED",
        "catalog_number": "500",
        "title": "Foundations of Elementary Teaching",
        "description": "Prerequisite: Admission to the Multiple Subject Credential Program or under Intent to Apply Status (ITA). Intent to Apply (ITA) students who are enrolled in this course are required to perform 20 hours of fieldwork observation (as they have not yet been formally admitted into the teacher credential program). EPC 315 may be substituted for EED/EPC 500 only if completed previously as an undergraduate student. This theory-into-practice introductory teacher education course focuses on the foundations of education and the practical applications of human learning theory and teacher effectiveness research in specific relation to elementary instruction and classroom management. Credential candidates are introduced to important theorists in educational psychology, standards-based lesson planning and instructional design, culturally relevant teaching practices, and strategies that can be employed to modify instruction to meet the diverse learning needs of the full range of learners including struggling readers, students demonstrating atypical development, English learners, and advanced learners. Each candidate develops a Classroom Management Plan describing a range of positive behavioral support strategies and methods for creating respectful, safe, organized, inclusive, and caring learning environments that promote the social-emotional well-being of all students. This course requires candidates to develop a thorough understanding of how students learn and how that learning is tied directly to the candidate’s teaching. (Cross-listed with EPC 500.)",
        "units": "3",
        "prerequisites": "{Admission to the Multiple Subject Credential Program or under Intent to Apply Status (ITA)}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "502",
        "title": "Introduction to Induction",
        "description": "Prerequisite: Admission to the Multiple or Single Subject Induction Program. This initial Induction Program course offers individuals who have earned a Multiple or Single Subject Credential a professional community that will assist the transition from teacher preparation to induction. The course provides an overview of the program and supports candidate’s development of advanced knowledge, skills and dispositions. Candidates will develop an Individual Induction Plan (IIP) in collaboration with the university instructor and the support provider. The course focuses on the candidate’s development of collaborative communication, universal access, inquiry and formative assessment activities, and pedagogy. Reflective practice tools and assessments will be presented in formats that promote self-reflection and career goal setting.",
        "units": "3",
        "prerequisites": "{Admission to the Multiple or Single Subject Induction Program}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "515",
        "title": "Learning Technologies",
        "description": "Prerequisite: Intent to Apply or Admission to the Multiple Subject Credential Program; Corequisite: EED 500/EPC 500. This course addresses technology-driven skills and understandings that Multiple Subject Credential candidates need to effectively plan, implement, and evaluate instructional tools and software programs to teach to the California Core State Standards (CA-CCSS) and Next Generation Science Standards (NGSS), including those for STEM/STEAM education and diverse student populations. It is designed to provide teacher candidates with models of instruction consistent with learning technology research and our current understanding of learning processes, opportunities to develop related STEM/STEAM practices, and skills in implementing collaborative lessons and units of study to lay a foundation for K-5 students to develop into technologically literate citizens. In addition, teacher candidates will explore and apply the various dimensions of teacher knowledge, including curriculum frameworks and instructional tools and software curriculum materials; students’ alternative conceptions; and teaching strategies. Teacher candidates will apply key practices to the specific content demands of the new curriculum based on the International Society for Technology in Education National Educational Technology Standards for Teachers. They will develop strategies for teaching children of widely differing cultural, linguistic, and ethnic backgrounds, developmental levels and learning styles, as well as students with special learning needs to provide all children equal access to the elementary curriculum.",
        "units": "2",
        "prerequisites": "{Intent to Apply or Admission to the Multiple Subject Credential Program}",
        "corequisites": "{{EED 500} || {EPC 500}}"
    },
    {
        "subject": "EED",
        "catalog_number": "520",
        "title": "Reading Instruction for Diverse Learners",
        "description": "Prerequisite: Restricted to candidates officially admitted to the post-baccalaureate multiple subject teaching credential program. Corequisite: EED 500 or EPC 500. EPC 315 (Psychological Foundations of Teaching and Learning) may be substituted for the EPC/EED 500 prerequisite only if completed as an undergraduate. This course prepares post-baccalaureate multiple subject credential candidates to teach reading, speaking, listening, and language across the curriculum to all students—including beginning through advanced readers, English learners, and students with disabilities (e.g., individuals demonstrating atypical development). Teacher candidates will become familiar with historical and theoretical perspectives on reading/language arts and the current state-adopted standards in English language arts and English language development (ELD). Candidates will learn how to use an array of engaging instructional methods to address student needs and to help students become skillful, analytic, lifelong readers. Candidates learn to administer literacy assessments and use assessment data to inform instructional planning. This course requires twenty (20) hours of directed fieldwork in a public school during reading/language arts/ELD instruction.",
        "units": "3",
        "prerequisites": "{Restricted to candidates officially admitted to the post-baccalaureate multiple subject teaching credential program}",
        "corequisites": "{{EED 500} || {EPC 500}}"
    },
    {
        "subject": "EED",
        "catalog_number": "550B",
        "title": "1. Supervised Fieldwork and Seminar",
        "description": "Prerequisites: Admission to the Multiple Subject University Internship Credential Program; Currently a teacher-of-record for a K-8 classroom. Recommended Corequisite: Enrollment or completion of EED 500 and EED 520. The combined fieldwork and seminar format of this course assists the intern in establishing connections among course content, theories of teaching and learning, and classroom pedagogy. This first supervised field experience and seminar provides interns with the formative feedback necessary to teach in the full range of domains defined by the Teaching Performance Expectations (TPEs). During the sequence of fieldwork experiences and seminars, interns will complete the Teacher Performance Assessments (TPAs) required by the CTC.",
        "units": "2",
        "prerequisites": "{{Admission to the Multiple Subject University Internship Credential Program} && {Currently a teacher-of-record for a K-8 classroom}}",
        "corequisites": "{{EED 500} && {EED 520}}"
    },
    {
        "subject": "EED",
        "catalog_number": "550D",
        "title": "Student Teaching in the Elementary School",
        "description": "Recommended Corequisite: Enrollment in required multiple subject credential coursework. Specially arranged student teaching for students not in the regular student teaching program. Open to students only upon departmental approval.",
        "units": "4",
        "prerequisites": "{None}",
        "corequisites": "{Enrollment in required multiple subject credential coursework}"
    },
    {
        "subject": "EED",
        "catalog_number": "551C",
        "title": "Supervised Practicum",
        "description": "Prerequisites: EED 500 (or EPC 500), EED 520, EED 550B(1), EED 550B(2), EED 550B(3), EED 559C, EED 565M, EED 575, EED 577; ELPS 417/CHS 417/AFRS 417/AAS 417/ARMN 417; SPED 401C; Admission to the Multiple Subject Credential Program–University Internship Pathway; Currently a teacher of record for a K-8 classroom; Verification of eligibility from Credential Office; Documentation of 40 hours of fieldwork. Corequisite: EED 559F. Prerequisites/Corequisites: Enrollment in or completion of EED 515, EED 565S; HSCI 465ELM; KIN 595PE. This course assists the intern in establishing connections among course content, theories of teaching and learning, and classroom pedagogy. This culminating intern teaching experience provides interns with the formative feedback necessary to teach in the full range of domains defined by the Teaching Performance Expectations (TPEs). (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{{{EED 500} || {EPC 500}} && {EED 520} && {EED 550B(1)} && {EED 550B(2)} && {EED 550B(3)} && {EED 559C} && {EED 565M} && {EED 575} && {EED 577}} && {{ELPS 417} || {CHS 417} || {AFRS 417} || {AAS 417} || {ARMN 417}} && {SPED 401C} && {Admission to the Multiple Subject Credential Program University Internship Pathway} && {Currently a teacher of record for a K-8 classroom} && {Verification of eligibility from Credential Office} && {Documentation of 40 hours of fieldwork}}",
        "corequisites": "{EED 559F}"
    },
    {
        "subject": "EED",
        "catalog_number": "559C",
        "title": "Supervised Fieldwork Seminar",
        "description": "Prerequisites/Corequisites: EED 500 (or EPC 500), EED 520, EED 565M. Corequisite: EED 560C or EED 567ACT. This course is a 2-unit supervised fieldwork seminar for students completing the Traditional, Accelerated Collaborative Teacher (ACT) Preparation or Internship pathway for Multiple Subject Credential candidates. The seminar provides opportunities for candidates to reflect on and analyze fieldwork experiences. Student teachers learn to: (1) assess their needs; (2) gather data; (3) analyze results; (4) problem solve; (5) modify teaching practices; and (6) determine implications of their experience for future instruction. The seminar will promote teacher candidates’ rehearsal of the Teaching Event of the adopted Teacher Performance Assessment. This course is taken concurrently with the first semester of supervised fieldwork in the Traditional (EED 560C), ACT (EED 567ACT) and Intern (EED 550B 3) pathways. (Credit/No Credit only)",
        "units": "1",
        "prerequisites": "{{{EED 500} || {EPC 500}} && {EED 520} && {EED 565M}}",
        "corequisites": "{{EED 560C} || {EED 567ACT}}"
    },
    {
        "subject": "EED",
        "catalog_number": "559F",
        "title": "Student Teaching Seminar",
        "description": "Prerequisites: EED 550B(3), EED 560C or EED 567ACT; EED 559C. Corequisites: EED 551C, EED 561F or EED 568ACT. This course is a 1-unit supervised fieldwork seminar for Multiple Subject Credential candidates completing the Traditional, Accelerated Collaborative Teacher (ACT) Preparation and Internship pathways. The seminar provides opportunities for candidates to reflect on and analyze fieldwork experiences. Student teachers and interns learn to: (1) assess their own and pupil needs; (2) gather data; (3) analyze results; (4) problem solve; (5) modify teaching practices; and (6) determine implications of their experience for future instruction. The seminar will promote teacher candidates’ successful completion of the Teaching Event of the adopted Teacher Performance Assessment. (Credit/No Credit only)",
        "units": "1",
        "prerequisites": "{{{EED 550B(3)} || {EED 560C} || {EED 567ACT}} && {EED 559C}}",
        "corequisites": "{{EED 551C} || {EED 561F} || {EED 568ACT}}"
    },
    {
        "subject": "EED",
        "catalog_number": "560C",
        "title": "Student Teaching I",
        "description": "Prerequisites: Admission to the Multiple Subject Credential Program. Verification of eligibility from Credential Office. Pre/Corequisites: EED 500 or EPC 500 (EPC 315 may be substituted for EED 500 or EPC 500 only if completed previously as an undergraduate student), EED 515, EED 520, EED 565M, and EED 577. Corequisite: EED 559C-Seminar. Teaching credential candidates in the Multiple Subject Credential Program (Traditional Pathway) are placed with an exemplary mentor teacher for 20 hours of early field experience plus 10 weeks of supervised student teaching (approximately 245 total hours of clinical practice). Student teachers plan and teach lessons in reading and language arts, English language development (ELD) and mathematics, while refining their classroom management skills. Student teachers move toward mastery of the California Teaching Performance Expectations (TPEs) and rehearse the state-mandated Teaching Performance Assessment (TPA). (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{Admission to the Multiple Subject Credential Program}",
        "corequisites": "{{EED 500 || EPC 500} && {EED 515} && {EED 520} && {EED 565M} && {EED 577}}"
    },
    {
        "subject": "EED",
        "catalog_number": "561F",
        "title": "Student Teaching II",
        "description": "Prerequisites: EED 559C, EED 560C; Admission to the Multiple Subject Credential Program; Verification of eligibility from Credential Office. Corequisite: EED 559F. Pre/Corequisites: EED 515, EED 565S, EED 575, EED 577; AAS 417/AFRS 417/ARMN 417/CHS 417/ELPS 417; HSCI 465ELM; KIN 595PE; SPED 420. EED 561F is the second of two substantive clinical practice experiences in the Multiple Subject Credential Program–Traditional Pathway. The course requires 20 hours of Early Field Experience preceding student teaching and 10 weeks of student teaching in a participating public school classroom to provide the credential candidate the opportunity to establish connections among course content, theories of teaching and learning, and classroom pedagogy. In this course, student teachers are placed with an exemplary mentor teacher, skilled in both teaching and classroom management, in order to develop skills in planning daily standards-based lessons, implementing the elementary curriculum, engaging and supporting all students in learning, using educational technology, assessing student learning, and developing as a professional educator. Candidates plan lessons that provide access to the curriculum for all students and use a range of instructional strategies to tailor and adapt instruction as necessary to meet individual student needs. Emphasis in this all-day supervised clinical practice experience (approximately 320 hours) is on implementing positive behavioral support strategies with students and developing general pedagogical skills such as planning and teaching effective, meaningful, engaging lessons in all subjects, as well as integrated and designated English language development (ELD). Student teachers are provided formative feedback from their master teacher and university supervisor to help them move toward mastery of the California Teaching Performance Expectations (TPEs). Teacher candidates must complete and pass the state-mandated Teaching Performance Assessment (TPA). (Credit/No Credit only)",
        "units": "6",
        "prerequisites": "{{{EED 559C} && {EED 560C}} && {Admission to the Multiple Subject Credential Program} && {Verification of eligibility from Credential Office}}",
        "corequisites": "{EED 559F}"
    },
    {
        "subject": "EED",
        "catalog_number": "565M",
        "title": "Mathematics Curriculum and Methods",
        "description": "Prerequisite: Admission to the Multiple Subject or Educational Specialist Credential Program. Pre/Corequisite: EED 500 or EPC 500. EPC 315 (Psychological Foundations of Teaching and Learning) may be substituted for the EPC/EED 500 prerequisite only if completed as an undergraduate. This course addresses the skills and understandings that Multiple Subject Credential candidates and Education Specialist candidates need in order to effectively plan, implement and evaluate instructional programs in mathematics for diverse student populations that reflect the California Mathematics Framework and Academic Content Standards. It is designed to provide credential candidates with models of pre- and post-assessment, instruction consistent with our current understanding of learning processes, opportunities to develop related process skills, and skills in implementing instructional models. Furthermore, the course helps teacher candidates develop strategies for teaching children of widely differing cultural and linguistic heritages, developmental levels and learning styles, and special populations to ensure all children equal access to the core curriculum.",
        "units": "2",
        "prerequisites": "{Admission to the Multiple Subject or Educational Specialist Credential Program}",
        "corequisites": "{{EED 500} || {EPC 500}}"
    },
    {
        "subject": "EED",
        "catalog_number": "565S",
        "title": "Science Curriculum and Methods",
        "description": "Prerequisites: Admission to the Multiple Subject Credential Program; EED 500/EPC 500; EPC 315 (Psychological Foundations of Teaching and Learning) may be substituted for the EPC 500/EED 500 prerequisite only if completed as an undergraduate; EED 520; EED 565M. This course addresses the skills and understandings that Multiple Subject Credential candidates need in order to effectively plan, implement, and evaluate instructional programs in science, including those for STEM education, for diverse student populations. It is designed to provide teacher candidates with models of instruction consistent with the nature of science and our current understanding of learning processes, opportunities to develop related science and engineering practices, and skills in implementing inquiry-based lessons and units of study to lay a foundation for K-5 students to develop into scientifically literate citizens. In addition, students will explore and apply the various dimensions of science teacher knowledge, including state-adopted standards, curriculum frameworks, and science/engineering curriculum materials; students’ alternative conceptions; and teaching strategies. Teacher candidates will apply key literacy practices to the specific content demands of the science curriculum. They will develop strategies for teaching children of widely differing cultural and linguistic heritages, developmental levels and learning styles, and students with special learning needs to provide all children equal access to the science curriculum.",
        "units": "3",
        "prerequisites": "{{Admission to the Multiple Subject Credential Program} && {{EED 500} || {EPC 500}} && {EPC 315} && {EED 520} && {EED 565M}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "567ACT",
        "title": "Supervised Fieldwork",
        "description": "Prerequisite: Admission to the ACT Preparation Program. Corequisites: EED 500 (or EPC 500) or (EPC 315 may be substituted for EED 500 or EPC 500 only if completed previously as an undergraduate student), EED 515, EED 520, EED 559C, EED 565M, EED 577; ELPS 541A; SPED 541B. Restricted to candidates admitted to the Accelerated Collaborative Teacher Preparation Program and offered in the Fall Semester only. EED 567ACT is the first field experience for Multiple Subject Credential candidates enrolled in the ACT pathway. The field experience takes place in participating public schools and provides the teacher candidate the opportunity to establish connections among course content, theories of teaching and learning, and classroom pedagogy. In this course, students develop skills in assessing pupils and planning and implementing the elementary curriculum, and are provided formative feedback necessary to teach in the full range of domains defined by the California Standards for the Teaching Profession and associated Teacher Performance Expectations (TPEs). This field experience provides the teacher candidate the opportunity to work toward the goal of assuming the full responsibilities of a certificated teacher. Emphasis in this field experience is on general pedagogical skills, such as classroom management and lesson planning in teaching in the areas of reading/language arts, English language development (ELD) and mathematics. This course also provides a context for rehearsal of the Teaching Event of the state-mandated Teaching Performance Assessment (TPA). (Credit/No Credit only)",
        "units": "4",
        "prerequisites": "{Admission to the ACT Preparation Program}",
        "corequisites": "{{{EED 500} || {EPC 500}} && {EED 515} && {EED 520} && {EED 559C} && {EED 565M} && {EED 577} && {ELPS 541A} && {SPED 541B}}"
    },
    {
        "subject": "EED",
        "catalog_number": "568ACT",
        "title": "Student Teaching",
        "description": "Prerequisites: EED 559C, EED 567ACT; Admission to the ACT Preparation Program; Verification of eligibility from Credential Office. Corequisites: EED 559F, EED 565S, EED 575; ELPS 542A; HSCI 465ELM; KIN 595PE; SPED 542B. EED 568ACT is the second field experience in the ACT Pathway and the culminating student teaching experience for Multiple Subject Credential candidates enrolled in ACT. The field experience provides the teacher candidate the opportunity to establish connections among course content, theories of teaching and learning, and classroom pedagogy. In this course, students develop skills in assessing pupils and planning and implementing the elementary curriculum, and are provided formative feedback from their master teacher and university supervisor to help them move toward mastery of the California Teaching Performance Expectations (TPEs). This field experience provides the teacher candidate the opportunity to work toward the goal of assuming the full responsibilities of a certificated teacher. The 10-week (approximately 320 hours) field experience takes place in participating public schools and expands on the first student teaching assignment with the inclusion of planning, implementing and evaluating social studies, science, arts, physical education and health education curriculum to the responsibilities of the student teacher. Teacher candidates must complete and pass the state-mandated Teaching Performance Assessment (TPA). (Credit/No Credit only).",
        "units": "6",
        "prerequisites": "{{EED 559C} && {EED 567ACT} && {Admission to the ACT Preparation Program} && {Verification of eligibility from Credential Office}}",
        "corequisites": "{{EED 559F} && {EED 565S} && {EED 575} && {ELPS 542A} && {HSCI 465ELM} && {KIN 595PE} && {SPED 542B}}"
    },
    {
        "subject": "EED",
        "catalog_number": "575",
        "title": "Integrated Social Studies and Arts Curriculum and Methods",
        "description": "Prerequisites: EED 500/EPC 500, EED 520 and EED 565M. Corequisite: EED 577. A methods course teaching the basic content and competencies required for effective instruction in elementary school social studies and visual-performing arts. It is offered concurrently with a student teaching assignment. Opportunity for interdisciplinary curriculum development will be provided. The course combines the social studies content and incorporates the content of the visual-performing arts as outlined in the state framework. The Visual-Performing Arts Standards are designed to produce fully literate individuals who understand aesthetic, expressive, and intellectual skills as forms of communication as related to cultural and historical frameworks.",
        "units": "3",
        "prerequisites": "{{{EED 500} || {EPC 500}} && {EED 520} && {EED 565M}}",
        "corequisites": "{EED 577}"
    },
    {
        "subject": "EED",
        "catalog_number": "577",
        "title": "Language Arts Instruction and English Language Development",
        "description": "Prerequisites: Admission to the credential program. Corequisites: EED 500 or EPC 500; EPC 315 (Psychological Foundations of Teaching and Learning) may be substituted for the EED/EPC 500 prerequisite only if completed as an undergraduate; EED 520. This course emphasizes instructional approaches for literacy development specific to English language learners, language arts, and writing methods within the context of a comprehensive, developmental literacy program, and within content area literacy. Students will analyze and develop language arts, writing, and English Language Development (ELD) instructional materials in order to make content comprehensible, and will differentiate instruction for varying English language proficiency levels in multicultural/multilingual settings.",
        "units": "3",
        "prerequisites": "{Admission to the credential program}",
        "corequisites": "{{{EED 500} || {EPC 500}} && {EPC 315} && {EED 520}}"
    },
    {
        "subject": "EED",
        "catalog_number": "578A",
        "title": "Student Teaching I",
        "description": "Prerequisites: Admission to Multiple Subject Credential Program; Admission to student teaching. Corequisites: EED 477B and EED 579A. EED 578A is a field experience in the Multiple Subject Credential Program (Integrated Teacher Education Program-ITEP). The field experience takes place in public elementary schools, and provides opportunities for the credential candidate to work under the daily direction and guidance of a qualified supervising elementary teacher who exemplifies best practices in teaching all students, including English language learners and students with disabilities. Student teachers move toward mastery of the California Teaching Performance Expectations (TPEs), and rehearse the state-mandated Teaching Performance Assessment (TPA). (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{Admission to Multiple Subject Credential Program} && {Admission to student teaching}}",
        "corequisites": "{{EED 477B} && {EED 579A}}"
    },
    {
        "subject": "EED",
        "catalog_number": "579A",
        "title": "Student Teaching Seminar",
        "description": "Prerequisites: Admission to Multiple Subject Credential program; Admission to student teaching. Corequisite: EED 578A. This course is a 2-unit student teaching seminar in the Multiple Subject Credential Program. The seminar provides opportunities for candidates to reflect on and analyze fieldwork experiences. Student teachers learn to: (1) assess their needs; (2) gather data; (3) analyze results; (4) problem solve; (5) modify teaching practices; (6) determine implications of their experience for future instruction; and (7) reflect on their teaching practice. (Credit/No Credit only)",
        "units": "2",
        "prerequisites": "{{Admission to Multiple Subject Credential program} && {Admission to student teaching}}",
        "corequisites": "{EED 578A}"
    },
    {
        "subject": "EED",
        "catalog_number": "601",
        "title": "Curriculum, Instruction and the Reflective Teacher",
        "description": "Prerequisite: Completion of Student Teaching. In addition to exploring the philosophical and research bases for instructional practices and instructional decision making, the course examines curricular theories and their influence on teaching/learning. Contemporary educational research and literature provide a framework for examining fundamental issues in education and their impact on current practices. Opportunities to engage in reflective thinking are an integral part of the course.",
        "units": "3",
        "prerequisites": "{Completion of Student Teaching}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "602",
        "title": "Applying Technology to Curricular Goals",
        "description": "Prerequisite: EED 513. Advanced-level course in the use of computers in the elementary school curriculum. Primary emphasis is on applications in the various curricular areas in the self-contained classroom with one, two or more computers. Content includes such practical and theoretical considerations as manipulating and analyzing data, communicating through a variety of electronic media, interacting and collaborating with others using the computer-based tools, and developing lessons based upon technological resources. Students will review, modify and design teacher-created instructional materials, which meet their own curricular needs. These materials include Web pages, gameboards, visual charts and multimedia instructional modules. The major software tools used are word processing, database, spreadsheets, drawing and paint programs, Web publishing software, Internet search engines and presentation tools. Course meets the Professional Credential requirement in computer-based technology.",
        "units": "3",
        "prerequisites": "{EED 513}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "610",
        "title": "Research in Elementary Education",
        "description": "Prerequisite: Completion of Multiple Subject Credential; Completion required within first 9 units in Master of Arts degree program; Must be taken prior to all graduate seminar courses. Survey and analysis of research in elementary education, chiefly in areas of contemporary interest that cut across all curricular fields. Emphasis is on learning to use a wide range of research reference sources, on understanding of research designs utilized in a variety of research studies and on use of criteria in evaluating the findings and conclusions of such studies.",
        "units": "3",
        "prerequisites": "{{Completion of Multiple Subject Credential} && {Completion required within first 9 units in Master of Arts degree program} && {Must be taken prior to all graduate seminar courses}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "625A",
        "title": "Literacy Assessment and Teaching Strategies A",
        "description": "Prerequisites: EED 520/SED 520 or equivalent; EED 633 or SED 625ENG; Teaching experience. Corequisite: EED 625AL. Principles and procedures for the evaluation of reading and writing effectiveness are presented. Each student develops competencies in assessing literacy behavior on an individual basis, as well as in a classroom setting. Students should become adept at observations and interviews while attaining skills of selecting, scoring and interpreting the results of a comprehensive variety of whole-language assessments. Similarly, principles and procedures for the design and selection of materials, methods and contexts for literacy instruction are presented. Each student develops a literacy program for an individual child based on assessment findings. Program includes meaning-centered activities appropriate for classroom settings. Students should become adept at determining the effectiveness of various instructional strategies as well as confirming/disconfirming their assessment results. Lab: This 1-unit supervised lab experience with children includes parent conferencing and concentrated assessment and instruction in the correction of reading/writing difficulties. Each student is assigned at least one child experiencing problems processing written language for whom the student designs and implements a corrective program. It is suggested that a student continue with the same child for a second semester in EED 625BL. Case studies demonstrate awareness of psychological, physiological, educational, cultural and linguistic factors in the reading/writing process. (Cross-listed with SED 625A/L.)",
        "units": "3",
        "prerequisites": "{{{EED 520} || {SED 520}} && {{EED 633} || {SED 625ENG}} && {Teaching experience}}",
        "corequisites": "{EED 625AL}"
    },
    {
        "subject": "EED",
        "catalog_number": "625AL",
        "title": "Literacy Assessment and Teaching Strategies A Lab",
        "description": "Prerequisites: EED 520/SED 520 or equivalent; EED 633 or SED 625ENG; Teaching experience. Corequisite: EED 625AL. Principles and procedures for the evaluation of reading and writing effectiveness are presented. Each student develops competencies in assessing literacy behavior on an individual basis, as well as in a classroom setting. Students should become adept at observations and interviews while attaining skills of selecting, scoring and interpreting the results of a comprehensive variety of whole-language assessments. Similarly, principles and procedures for the design and selection of materials, methods and contexts for literacy instruction are presented. Each student develops a literacy program for an individual child based on assessment findings. Program includes meaning-centered activities appropriate for classroom settings. Students should become adept at determining the effectiveness of various instructional strategies as well as confirming/disconfirming their assessment results. Lab: This 1-unit supervised lab experience with children includes parent conferencing and concentrated assessment and instruction in the correction of reading/writing difficulties. Each student is assigned at least one child experiencing problems processing written language for whom the student designs and implements a corrective program. It is suggested that a student continue with the same child for a second semester in EED 625BL. Case studies demonstrate awareness of psychological, physiological, educational, cultural and linguistic factors in the reading/writing process. (Cross-listed with SED 625A/L.)",
        "units": "1",
        "prerequisites": "{{{EED 520} || {SED 520}} && {{EED 633} || {SED 625ENG}} && {Teaching experience}}",
        "corequisites": "{EED 625A}"
    },
    {
        "subject": "EED",
        "catalog_number": "625B",
        "title": "Literacy Assessment and Teaching Strategies B",
        "description": "Prerequisite: EED 625AL/SED 625AL. Corequisite: EED 625BL. Additional principles and procedures for the evaluation of reading and writing effectiveness are presented. Each student continues to develop competencies in assessing literacy behavior on an individual basis, as well as in a classroom setting. Students should hone their skills of selecting, scoring and interpreting the results of a comprehensive variety of standardized tests. Similarly, additional principles and procedures for the design and selection of materials, methods and contexts for literacy instruction are presented. Each student will expand the literacy program developed for an individual child based on new assessment findings. Program includes meaning-centered and skill-based activities appropriate for classroom settings. Students should become adept at determining the effectiveness of various instructional strategies as well as confirming/disconfirming their assessment results. Lab: This 1-unit supervised lab experience with children includes parent conferencing and concentrated assessment and instruction in the correction of reading/writing difficulties. Each student is assigned at least one child experiencing problems processing written language for whom the student designs and implements a corrective program. It is suggested that a student continue with the same child he/she worked with in EED/SED 625AL. Case studies demonstrate awareness of psychological, physiological, educational, cultural and linguistic factors in the reading/writing process. (Cross-listed with SED 625B/L.)",
        "units": "3",
        "prerequisites": "{{EED 625AL} || {SED 625AL}}",
        "corequisites": "{EED 625BL}"
    },
    {
        "subject": "EED",
        "catalog_number": "625BL",
        "title": "Literacy Assessment and Teaching Strategies B Lab",
        "description": "Prerequisite: EED 625AL/SED 625AL. Corequisite: EED 625BL. Additional principles and procedures for the evaluation of reading and writing effectiveness are presented. Each student continues to develop competencies in assessing literacy behavior on an individual basis, as well as in a classroom setting. Students should hone their skills of selecting, scoring and interpreting the results of a comprehensive variety of standardized tests. Similarly, additional principles and procedures for the design and selection of materials, methods and contexts for literacy instruction are presented. Each student will expand the literacy program developed for an individual child based on new assessment findings. Program includes meaning-centered and skill-based activities appropriate for classroom settings. Students should become adept at determining the effectiveness of various instructional strategies as well as confirming/disconfirming their assessment results. Lab: This 1-unit supervised lab experience with children includes parent conferencing and concentrated assessment and instruction in the correction of reading/writing difficulties. Each student is assigned at least one child experiencing problems processing written language for whom the student designs and implements a corrective program. It is suggested that a student continue with the same child he/she worked with in EED/SED 625AL. Case studies demonstrate awareness of psychological, physiological, educational, cultural and linguistic factors in the reading/writing process. (Cross-listed with SED 625B/L.)",
        "units": "1",
        "prerequisites": "{{EED 625AL} || {SED 625AL}}",
        "corequisites": "{EED 625B}"
    },
    {
        "subject": "EED",
        "catalog_number": "626",
        "title": "Literacy Instruction for English Learners K-12",
        "description": "Prerequisite: EED 520 or SED 520 or equivalent. Major theories of first and second language acquisition and literacy development specific to second language learners are presented in this seminar for both monolingual and bilingual classroom teachers. Additionally, the importance of varied instructional approaches in the development of oral language, reading and writing are discussed. Research on variables affecting second language learners’ reading and writing achievement is explored. An emphasis is given to effective methodologies, teaching strategies, instructional materials and assessment strategies. (Cross-listed with SED 626.)",
        "units": "3",
        "prerequisites": "{{EED 520} || {SED 520}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "628",
        "title": "Language and Literacy Programs: Leadership, Planning and Evaluation",
        "description": "Prerequisites: EED 625A/L or SED 625A/L, and EED 625B/L or SED 625B/L or instructor consent. Principles of designing, organizing, coordinating and evaluating a variety of bilingual/multilingual programs as well as literacy programs (e.g., K-12 integrated language arts programs, corrective reading/writing programs, programs for students at risk) are presented. Students develop competencies in planning, conducting and evaluating staff development in language and literacy or bilingual/multilingual education. They familiarize themselves with the state textbook adoption process, state frameworks, district curriculum guides, and selected state, national and international language and literacy projects/programs. Strategies for writing grants are offered and participation in professional organizations is encouraged. Students demonstrate ability to provide leadership in decision making for teaching language and literacy or for teaching across the curriculum in bilingual/multilingual programs. Bilingual/multilingual refers to bilingual/bicultural and multilingual/multicultural settings. (Cross-listed with SED 628.)",
        "units": "3",
        "prerequisites": "{{{EED 625A/L} || {SED 625A/L}} && {{EED 625B/L} || {SED 625B/L}} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "633",
        "title": "Seminar in Elementary School Language Arts Education",
        "description": "Prerequisites: EED 601; Graduate standing. Advanced curriculum course in language arts for the teacher of elementary school children. Major emphasis of the course is on the theory and the research relevant to the study of the nature of the language arts, and to the current trends and developments in teaching language arts with an interdisciplinary approach.",
        "units": "3",
        "prerequisites": "{{EED 601} & {Graduate standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "638",
        "title": "Seminar in Elementary School Social Studies Education",
        "description": "Prerequisites: EED 610; Graduate standing. Advanced curriculum course in elementary school social studies. Identification of current problems in the field of the social studies, with extensive exploration of the professional interdisciplinary literature related to rationale of and potential approaches to resolving such problems. Emphasis of the course will be theory and research.",
        "units": "3",
        "prerequisites": "{{EED 610} && {Graduate standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "643",
        "title": "Seminar in Elementary School Mathematics Education",
        "description": "Prerequisites: EED 610; Graduate standing. Graduate course in education on the research in elementary school mathematics. Course emphasis on analysis of research in education and related fields, current curricular projects, trends and issues, modern learning and pedagogical theory, and student development of a researchable project.",
        "units": "3",
        "prerequisites": "{{EED 610} && {Graduate standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "648",
        "title": "Seminar in Elementary School Science Education",
        "description": "Prerequisites: EED 610; Graduate standing. Advanced curriculum course in elementary school science for teachers. Major emphasis of the course will include theory and research related to contemporary aspects of elementary school science. Current trends and issues are examined in relation to current developments stressing an interdisciplinary approach to science. A research project, using elementary school children to test new ideas in science, is an integral and ongoing theme of the course.",
        "units": "3",
        "prerequisites": "{{EED 610} && {Graduate standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "649",
        "title": "Elementary School Interdisciplinary Arts Education",
        "description": "Prerequisite: Completion of student teaching. An interdisciplinary methods course focusing on the meaning, role and teaching strategies of the arts in the elementary school curriculum. The course: (1) provides opportunities for exploration and understanding of dance, music, drama and visual arts; (2) seeks strategies for integrating two or more of the arts; and (3) applies music, dance drama and visual arts as recommended in the Visual and Performing Arts Framework to other subject areas, such as language arts, social studies, science, mathematics and physical education. Participants learn how to plan, teach and evaluate an interdisciplinary unit of study in the arts in relationship to specific subject areas. They also learn how to present their units using technology and other media to develop a multimedia production.",
        "units": "2",
        "prerequisites": "{Completion of student teaching}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "675",
        "title": "Bilingual/Multilingual Teaching Strategies",
        "description": "Prerequisite: EED 610 or equivalent or instructor consent. Students evaluate research on bilingual/multilingual teaching methods and strategies. Emphasis is placed on relating research findings to instructional decision making. Includes modeling, developing and validating effective teaching strategies that provide English learners access to the core curriculum. Bilingual/multilingual refers to bilingual/bicultural and multilingual/multicultural settings. (Cross-listed with SED 675.)",
        "units": "3",
        "prerequisites": "{{EED 610} || {instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "681",
        "title": "Classroom Communication and Management Methods",
        "description": "Prerequisite: Admission to the Multiple Subject Credential Program or classroom teacher. Focuses on the theoretical basis for and the practical implementation of several approaches to classroom management and communication. Emphasis is on the interrelationship between management and the instructional process (e.g., students’ motivation and characteristics, curriculum considerations, assessment components.) (Cross-listed with EPC 681.)",
        "units": "3",
        "prerequisites": "{Admission to the Multiple Subject Credential Program or classroom teacher}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "697",
        "title": "Directed Comprehensive Studies and Exam",
        "description": "Preparatory: Restricted to and required of M.A. degree candidates in the semester in which they take the comprehensive examination for the degree. This course is designed to provide encouragement, support, and opportunity for students to complete the comprehensive exam and the portfolio. Assignments focused on leadership and professionalism are also part of this course, the final class of the M.A. program. A comprehensive examination is an assessment of the student’s ability to integrate the knowledge of the area, show critical and independent thinking, and demonstrate mastery of the subject matter. The results of the examination evidences independent thinking, appropriate organization, critical analysis and accuracy of documentation.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "698",
        "title": "Thesis or Graduate Project",
        "description": "Prerequisites: Graduate standing and completion of EED 610 Research in Elementary Education. A thesis on an advanced topic in the field of education.",
        "units": "3",
        "prerequisites": "{{Graduate standing} && {EED 610 Research in Elementary Education}}",
        "corequisites": "{None}"
    },
    {
        "subject": "EED",
        "catalog_number": "699A",
        "title": "Independent Study",
        "description": "Independent Study",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]