[
    {
        "subject": "ENGL",
        "catalog_number": "113A",
        "title": "Approaches to University Writing A",
        "description": "Prerequisite: Placement in a supported GE subarea A2 Written Communication course. Corequisite: UNIV 061. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 113A, AFRS 113A, CAS 113A, CHS 113A, ENGL 113A, LING 113A or QS 113A. Students also are required to enroll in UNIV 061 (1 credit) or equivalent. Individual tutoring is available through the Learning Resource Center.",
        "units": "3",
        "prerequisites": "{Placement in a supported GE subarea A2 Written Communication course}",
        "corequisites": "{UNIV 061}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "113B",
        "title": "Approaches to University Writing B",
        "description": "Prerequisite: Successful completion of 113A. Corequisite: UNIV 062. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 113B, AFRS 113B, CAS 113B, CHS 113B, ENGL 113B, LING 113B or QS 113B. Students also are required to enroll in UNIV 062 (1 credit). Individual tutoring is available through the Learning Resource Center. (Available for General Education, Basic Skills A2 Written Communication.) (IC)",
        "units": "3",
        "prerequisites": "{ENGL 113A}",
        "corequisites": "{UNIV 062}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "114A",
        "title": "Approaches to University Writing A",
        "description": "Prerequisite: Placement in a supported GE subarea A2 Written Communication course. Expository prose writing with a focus on both content and form. Specific emphases shall include the exercise of logical thought and clear expression, the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 114A, AFRS 114A, CAS 114A, CHS 114A, ENGL 114A or QS 114A. Individual tutoring is available through the Learning Resource Center.",
        "units": "3",
        "prerequisites": "{Placement in a supported GE subarea A2 Written Communication course}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "114B",
        "title": "Approaches to University Writing B",
        "description": "Prerequisite: Successful completion of 114A. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 114B, AFRS 114B, CAS 114B, CHS 114B, ENGL 114B or QS 114B. Individual tutoring is available through the Learning Resource Center. (Available for General Education, Basic Skills A2 Written Communication.) (IC)",
        "units": "3",
        "prerequisites": "{ENGL 114A}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "115",
        "title": "Approaches to University Writing",
        "description": "Prerequisite: Multiple Measures Placement in GE-level writing. Expository prose writing with a focus on both content and form. Specific emphases include the exercise of logical thought and clear expression, the development of effective organizational strategies and the appropriate gathering and utilization of evidence. Includes instruction on diction, syntax and grammar, as well as the elements of prose style. Students receive credit for only one course chosen from AAS 115, AFRS 115, CAS 115, CHS 115, ENGL 115 or QS 115. Individual tutoring is available through the Learning Resource Center. (Available for General Education, Basic Skills A2 Written Communication.) (IC)",
        "units": "3",
        "prerequisites": "{Multiple Measures Placement in GE-level writing}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "205",
        "title": "Business Communication in Its Rhetorical Contexts",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: GE section A1 Oral Communication; COMP 100 or equivalent. Development of critical writing, thinking, research and technology skills in the context of business. Through substantial writing and other work, students will hone their written, oral and visual communication skills, and their ability to find, synthesize and make arguments based on primary and secondary sources. Emphasis on communication with a diverse audience and case studies about ethical issues common to the local and global business world. This course is required of students who have declared a major in Accountancy, Business Administration, or Information Systems. Also may be taken as an elective by other students who wish to enhance their professional communication skills. Not available for students who have earned credit for BUS 105 or BUS 205.",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "208",
        "title": "Creative Writing",
        "description": "Preparatory: Completion of the lower division writing requirement. Introductory workshop course in creative writing. Students have the option of concentrating on one of three modes: prose fiction, poetry or drama. Part of the Creative Writing option in English. (Available for General Education, C1 Arts.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "215",
        "title": "Critical Thinking About Research Writing",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course will focus on composing and reading practices appropriate to research writing tasks. Students will practice writing effectively and using information technologies. There will be a focus on comprehending and using quantitative and qualitative data and students will be introduced to generating qualitative or quantitative data. Other activities will include drafting and revising documents as well as analyzing information and testing its credibility, including through analyzing logical fallacies. (Available for General Education, Basic Skills A3 Critical Thinking.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "250FE",
        "title": "Perspectives on English Studies for Teachers",
        "description": "Introduces students to the issues of reading and writing in the context of examining their own first-year experiences with reading and writing, and connects these experiences to the curricular content of 9th grade English classes and pupils. Students will meet with a CSUN instructor 1.5 hours per week. A 20-hour field experience in a 9th grade English classroom is required. Required for FYI and JYI English Program.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "253",
        "title": "Bestselling Literature",
        "description": "Preparatory: Completion of the lower division writing requirement. Study of selected literary works that have enjoyed wide commercial popularity. Focus will be on recent texts, although readings may also include older bestsellers. Analysis of the financial, cultural, or critical success of those works, and the implications of that success for diverse social groups and identities. Focus on skills requisite for thinking critically about recent and current developments in popular literature and culture. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "255",
        "title": "Introduction to Literature",
        "description": "Preparatory: Completion of the lower division writing requirement. Introductory study of the genres of imaginative literature—prose fiction, poetry and drama—with special emphasis on the interrelationships between form and theme. The course will feature a specific cultural tradition (e.g., Western, Postcolonial, African American, etc.) to be chosen by the instructor. Critical writing is an integral part of the course. Meets the lower division literature requirement for Liberal Studies majors. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "258",
        "title": "Major English Writers I",
        "description": "Preparatory: Completion of the lower division writing requirement. Study of works of major English writers from the Middle Ages to Samuel Johnson, with attention to literary movements and backgrounds. Critical writing required. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "259",
        "title": "Major English Writers II",
        "description": "Preparatory: Completion of the lower division writing requirement. Study of works of major English writers, from Blake to the present, with attention to literary movements and backgrounds. Critical writing required. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "275",
        "title": "Major American Writers",
        "description": "Preparatory: Completion of the lower division writing requirement. Study of the important works of a selected number of American writers from the colonial period to modern times. Critical writing required. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "300",
        "title": "Contemporary Literature",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: Upper division standing. Study and analysis of selected major works of fiction, poetry, drama and major authors since approximately the end of World War II in England and America. Critical writing required. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "301",
        "title": "Language and Linguistics",
        "description": "Preparatory: Completion of the lower division writing requirement. Introduction to linguistic science, its background, development and relation to other fields of study, as well as recent developments in the study of language. (Linguistics and Language Study requirement of the English Subject Matter Program.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "302",
        "title": "Introduction to Modern Grammar",
        "description": "Basic course in grammar—traditional, structural and trans-formational. Some applications of linguistics to the teaching of English and the language arts are suggested.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "303",
        "title": "Introduction to Language, Grammar and Linguistics for Teachers",
        "description": "Corequisite: ENGL 303L. Introduction to the study of human language(s) and to major scientific approaches in linguistics: phonetics (properties of sound in spoken language and manual and non-manual elements in signed languages), phonology (sound systems of particular spoken languages, and manual and non-manual systems in signed languages), morphology (word and sign formation processes), syntax (word order and phrase structure patterns), semantics (study of meaning) and language variation (including dialects and historical change). Designed for students in the Liberal Studies Freshman ITEP Program, this course focuses on the linguistic study of those aspects of language included in the English-Language Arts Content Standards for Grades K-5 as mandated by the English Language Arts Common Core Standards (ELA-CCSS). It also addresses the broader aspects of language that are crucial to K-5 teachers and their students. The discussion/lecture session meets for 2 hours every week.\nThe lab, ENGL 303L, provides hands-on work with language data, guiding students into the discovery of analytical methods provided by a linguistic lens, basic linguistic principles, and the interface between linguistic knowledge and other cognitive systems, all in the service of their prospective teaching in the language arts. The lab meets for 2 hours every week.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{ENGL 303L}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "303L",
        "title": "Introduction to Language, Grammar and Linguistics for Teachers Lab",
        "description": "Corequisite: ENGL 303L. Introduction to the study of human language(s) and to major scientific approaches in linguistics: phonetics (properties of sound in spoken language and manual and non-manual elements in signed languages), phonology (sound systems of particular spoken languages, and manual and non-manual systems in signed languages), morphology (word and sign formation processes), syntax (word order and phrase structure patterns), semantics (study of meaning) and language variation (including dialects and historical change). Designed for students in the Liberal Studies Freshman ITEP Program, this course focuses on the linguistic study of those aspects of language included in the English-Language Arts Content Standards for Grades K-5 as mandated by the English Language Arts Common Core Standards (ELA-CCSS). It also addresses the broader aspects of language that are crucial to K-5 teachers and their students. The discussion/lecture session meets for 2 hours every week.\nThe lab, ENGL 303L, provides hands-on work with language data, guiding students into the discovery of analytical methods provided by a linguistic lens, basic linguistic principles, and the interface between linguistic knowledge and other cognitive systems, all in the service of their prospective teaching in the language arts. The lab meets for 2 hours every week.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{ENGL 303}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "305",
        "title": "Intermediate Expository Writing",
        "description": "Preparatory: Completion of the lower division writing requirement. Intermediate course in written expository writing includes a study of the style of competent writers and extends the writing skills acquired by students in the Freshman Composition course. Emphasis on developing writing that exhibits clarity, coherence, style and a clear purpose. Satisfies the writing requirement in the Liberal Studies major.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "306",
        "title": "Report Writing",
        "description": "Prerequisite: Completion of the lower division writing requirement. Approaches to writing scientific, technical, professional, business or general-information reports and articles for various audiences and contexts. Emphasis on awareness of discursive practices of particular fields to achieve purpose, coherence and effective style. Culminates with research project and presentation. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "308",
        "title": "Narrative Writing",
        "description": "Preparatory: ENGL 208 or demonstrated proficiency. Intensive practice in narrative writing, with emphasis on short fiction. Analysis and criticism of students’ work, as well as analysis of selected published writings. May be repeated once for credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "309",
        "title": "Verse Writing",
        "description": "Preparatory: ENGL 208 or demonstrated proficiency. Intensive practice in writing poetry. Analysis and criticism of students’ work, as well as some critical study of published verse. May be repeated once for credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "310",
        "title": "Playwriting",
        "description": "Preparatory: ENGL 208 or demonstrated proficiency. Intensive practice in writing drama for stage, radio and television. Analysis and criticism of students’ work, including lab production through college facilities. May be repeated once for credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "311",
        "title": "History of African-American Writing",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: At least one university-level course in literature. Focus on the development of the major genres in African-American writing from the beginning to the present, relating them to the larger movements in American culture. Critical writing required. (Available for General Education, F Comparative Cultural Studies.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "312",
        "title": "Literature and Film",
        "description": "Study of selected literary works that have been made into films, as well as an exploration of the adapted films themselves and of the change in emphasis and meaning when literature is translated into or adapted to film.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "313",
        "title": "Studies in Popular Culture",
        "description": "Prerequisite: Completion of the lower division writing requirement. Cultural studies course focusing on the interpretation of American popular culture. Course methodology may include Marxist, psychoanalytic, semiotic or culturally eclectic scholarly points of view. Designed for students who may want to enter the fields of entertainment or advertising, or future teachers who may want to use popular culture in their classrooms, this course will survey the products of popular culture as signifiers of larger cultural forces and realities. Available as an elective in all options of the major and minor. (Available for General Education, E Lifelong Learning.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "315",
        "title": "Digital Writing",
        "description": "Prerequisite: Completion of the lower division writing requirement. This course focuses on production of an array of digital texts, such as podcast, website, documentary, e-portfolio, blog, and collaborative online article. Other topics include social media, digital identity, and ethical questions surrounding the production and distribution of texts in digital environments. The course underscores the expanded notion of writing—the idea that writing includes print, but also multimodal compositions done by using mediums, such as sound, video, images, web, graphics, and animation. (Available for General Education, E Lifelong Learning.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "316",
        "title": "Shakespeare",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: Upper division standing. Introductory study of representative poems and plays. Attendance at performances and/or films is required. Critical writing required. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "318",
        "title": "American Indian Literature",
        "description": "Prerequisite: Completion of the lower division writing requirement. Survey of American Indian literature, which may include traditional oral forms, autobiographies, and contemporary poetry and prose. Students who have taken ENGL 314 will not receive credit for ENGL 318. (Available for General Education, C2 Humanities or F Comparative Cultural Studies.) (Cross-listed with AIS 318.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "333",
        "title": "Comics and Graphic Novels",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of comics, including comic strips, comic books and graphic novels, from literary and cultural studies perspectives. Emphasis on both history and form, including image-text relationships. Topics also may include fan culture, particular genres of comics and connections between comics and other forms of visual text. Critical writing required. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "355",
        "title": "Writing About Literature",
        "description": "Preparatory: Completion of the lower division writing requirement and two lower division English courses. Intensive study of the literary genres of poetry, prose, fiction and drama. Emphasis on written analysis of selected works in each genre. Development of criteria for responsible judgment.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "360",
        "title": "The English Bible as Literature",
        "description": "Preparatory: Upper division standing. Study of form, theme and style in the King James Version of the Bible.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "364",
        "title": "The Short Story",
        "description": "Prerequisite: Completion of the lower division writing requirement. Preparatory: Upper division standing. A study of the short story, beginning with careful examination of some classics in the genre, followed by analysis of more contemporary works. Critical writing required. (Available for General Education, C2 Humanities.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "368",
        "title": "Gay Male Writers",
        "description": "Preparatory: Completion of the lower division writing requirement. Examines works in British and American literature that: (a) were written by gay men; and (b) portray the lives of gay individuals. Focusing primarily on texts written since the late 19th century and traces the development of gay male self-representation in poetry, novels, short fiction, drama and nonfiction.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "369",
        "title": "Lesbian Writers",
        "description": "Preparatory: Completion of the lower division writing requirement. Primarily focuses on the work of lesbian writers of the 20th century. Using the approaches of current feminist literary theorists, the course explores the diversity and intersections of lesbian literary traditions, and examines the extent to which lesbian writers have followed and/or altered genre conventions in fiction and poetry.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "370",
        "title": "Science Fiction",
        "description": "Preparatory: Completion of the lower division writing requirement. Study of selected short stories, essays and novels of science fiction.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "371",
        "title": "Issues in Jewish-American Writing",
        "description": "Prerequisite: Completion of the lower division writing requirement. Study of Jewish writing in America as it affects the relationship between Jewish issues and themes and American culture, based on the works of such authors as I. B. Singer, Roth, Bellow, Malamud, Cahan, Paley, Olsen, Shapiro, Ozick and Potok. Critical writing required. (Available for General Education, F Comparative Cultural Studies.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "392",
        "title": "Junior Honors Seminar I",
        "description": "Preparatory: Admission to the Honors Program. May be taken in any sequence with ENGL 393. Introduction to literary history with emphasis on the role of tradition and influence.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "393",
        "title": "Junior Honors Seminar II",
        "description": "Preparatory: Admission to the Honors Program. May be taken in any sequence with ENGL 392. Introduction to practical criticism through a study of critical methods and their application to various literary works, with some attention to bibliography and scholarly method.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "400",
        "title": "History Of The English Language",
        "description": "Developments in the English language from Old English through Middle English Early Modern English and Modern English. American English and its heritage. Influences from other languages as well as internal linguistic processes in English itself.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "405",
        "title": "Language Differences and Language Change",
        "description": "Preparatory: Completion of the lower division writing requirement. Study of how and why language changes, with particular emphasis on the history of English; social and geographical dialects; current English usage; and lexicography. Brief review of phonology and grammar is included for those students who need it. (Available for Section C of the Multicultural Requirement for Credential Candidates.) Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "406",
        "title": "Advanced Expository Writing for Teachers",
        "description": "Preparatory: Completion of the lower division writing requirement. Required of candidates working for the Single Subject Credential in English; an option for candidates in Liberal Studies working for the Multiple Subjects Credential. Advanced course in written composition and recent composition theory extends the student’s writing skills, explores the kind of writing required of California public school students and establishes criteria for the evaluation of writing at all levels. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "407",
        "title": "Composition and the Professions",
        "description": "Preparatory: Demonstrated proficiency; Instructor consent. Advanced composition, logical thinking and coherent expression designed particularly for students who wish to use their writing and analytic skills in the professions of law or medicine, government or community services, business, industry, or nonteaching educational and research services. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "408",
        "title": "Advanced Narrative Writing",
        "description": "Preparatory: ENGL 308. Continued practice in the writing of prose fiction, with a concentration on experimentation in style and structure. Analysis and criticism of students’ work. Available for graduate credit. May be repeated once for credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "409",
        "title": "Advanced Verse Writing",
        "description": "Preparatory: ENGL 309. Continued practice in the writing of poetry, with emphasis on formal poetic patterns. Analysis and criticism of students’ work, as well as study of selected published verse. Available for graduate credit. May be repeated once for credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "410",
        "title": "Advanced Dramatic Writing",
        "description": "Preparatory: ENGL 310. Continued practice in dramatic writing leading to the completion of a full-length drama. Analysis and criticism of students’ work as well as study of selected plays. Available for graduate credit. May be repeated once for credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "412",
        "title": "Literary Magazine",
        "description": "Preparatory: Upper division standing. Theoretical overview of literary publishing; practice in close reading and in the exercise of literary and aesthetic judgment; and editing and publishing of the Northridge Review, a literary magazine. Available for graduate credit. May be repeated once with instructor’s consent. May be repeated once for credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "414",
        "title": "Chaucer",
        "description": "Preparatory: 6 units of lower division literature courses, or 3 units of lower division literature and ENGL 355. Study of The Canterbury Tales and other selected poems. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "416",
        "title": "Shakespeare: Selected Plays",
        "description": "Close study of three to five plays. ENGL 416 and ENGL 417 may be taken separately or in any sequence. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "417",
        "title": "Shakespeare: A Survey",
        "description": "Study of eight to fifteen of the major plays. ENGL 416 and ENGL 417 may be taken separately or in any sequence. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "419",
        "title": "English Drama 1660-1880",
        "description": "Study of significant plays in England, 1660-1880, with special emphasis on such major dramatists as Wycherley, Dryden, Congreve, Otway and Sheridan. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "420",
        "title": "Milton",
        "description": "Study of Paradise Lost, other poems and selected prose. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "427",
        "title": "Drama From Ibsen to the Present",
        "description": "Development of significant theater movements in Europe and America. Intensive study of selected plays. Available for graduate credit. (Cross-listed with FLIT 427.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "428",
        "title": "Children’s Literature",
        "description": "Preparatory: One lower division course in literature. Study of form, content and theme in children’s literature, classic and contemporary, from preschool through 9th-grade level. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "429",
        "title": "Literature for Adolescents",
        "description": "Critical analysis of selected literary works of interest to adolescents, including works commonly used in secondary schools (grades 7-12). Development of principles for the evaluation of literature for adolescents. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "430",
        "title": "Literature and the Visual Arts",
        "description": "Study of literature from the perspective of its relationships with the visual arts, including fields such as literary pictorialism, the sister arts tradition, inter-media stylistic and book illustration. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "431",
        "title": "Images Of Women In Literature",
        "description": "Preparatory: Completion of 3 units of Lower Division literature. Study of the images of women in literature and criticism primarily by women themselves. Emphasis on the diversity of contemporary portrayals and their traditional backgrounds.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "434",
        "title": "19th Century Women Novelists",
        "description": "Preparatory: 6 units of lower division literature courses, or 3 units of lower division literature and ENGL 355. Study of selected novels by important 19th century women novelists, both British and American, including such writers as Alcott, Austen, C. Brontë, E. Brontë, Chopin, Eliot, Gaskell, Gilman and Stowe. Examines both text and context for each novel studied to suggest why these women chose to be writers, why they chose the subjects they did and how their works have been received by readers. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "436",
        "title": "Major Critical Theories",
        "description": "Study of major texts of literary criticism from Plato to the present. Emphasis on application of critical theories. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "438",
        "title": "Critical Approaches to Literature",
        "description": "Application of basic topics of practical criticism—rhetorical, formal, contextual, psychological and archetypal—to a selected core of literary texts. Emphasis on critical writing. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "443",
        "title": "English Literature of the Middle Ages",
        "description": "Preparatory: 6 units of lower division literature courses, or 3 units of lower division literature and ENGL 355. Study of the literature of England to 1500, including Beowulf and representative Old English secular and religious poems and such Middle English authors as Chaucer, Langland, the Pearl Poet, Gower and Malory, as well as such medieval genres as the romance, the lyric, the ballad and the drama. Some works will be read in modern English versions. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "449",
        "title": "The English Renaissance",
        "description": "Preparatory: 6 units of Lower Division literature courses or 3 units of Lower Division literature and ENGL 355. Study of the non-dramatic literature and of the culture of England from 1500 to 1603.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "452",
        "title": "17th Century Literature",
        "description": "Preparatory: 6 units of Lower Division literature courses or 3 units of Lower Division literature and ENGL 355. Study of the non-dramatic literature and of the culture of England from the death of Elizabeth I to the Glorious Revolution.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "455",
        "title": "Literacy, Rhetoric and Culture",
        "description": "Study of current and past theories of literacy, including the nature of literacy itself; connections between rhetoric and literacy; the ways literacy is shared and used by individuals, families and cultures; and the political, social and personal ramifications of literacy. Core course for English Department minor in Writing and Rhetoric. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "456",
        "title": "Age of Revolutions",
        "description": "Preparatory: 6 units of lower division literature courses, or 3 units of lower division literature and ENGL 355. Study of the transatlantic literary and cultural world of from 1660-1820, with an emphasis on key revolutions (Glorious, American, French, Haitian), imperialism and the rise of the British Empire. Authors may include Behn, Swift, Equiano, Prince, and Austen. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "457HN",
        "title": "Selected Topics In Creative Writing: Hybrid And Narrative",
        "description": "Prerequisite: English 308 309 310 or permission of instructor. Intensive consideration of a focused area of study as it proceeds from a literary or critical tradition that informs creative writing. Creative and critical writing required. Topics will change from semester to semester. May be repeated one time for credit.\n",
        "units": "3",
        "prerequisites": "{{{ENGL 308} && {ENGL 309} && {ENGL 310}} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "457IL",
        "title": "Selected Topics In Creative Writing: International Literature",
        "description": "Prerequisite: English 308 309 310 or permission of instructor. Intensive consideration of a focused area of study as it proceeds from a literary or critical tradition that informs creative writing. Creative and critical writing required. Topics will change from semester to semester. May be repeated one time for credit.\n",
        "units": "3",
        "prerequisites": "{{{ENGL 308} && {ENGL 309} && {ENGL 310}} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "457WSF",
        "title": "Selected Topics In Creative Writing: Writing Special Fiction",
        "description": "Prerequisite: English 308 309 310 or permission of instructor. Intensive consideration of a focused area of study as it proceeds from a literary or critical tradition that informs creative writing. Creative and critical writing required. Topics will change from semester to semester. May be repeated one time for credit.\n",
        "units": "3",
        "prerequisites": "{{{ENGL 308} && {ENGL 309} && {ENGL 310}} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "458",
        "title": "The Romantic Age",
        "description": "Preparatory: 6 units of lower division literature courses, or 3 units of lower division literature and ENGL 355. Study of the literature and culture of England during the Romantic period, with special emphasis on the major poets, including Blake, Wordsworth, Coleridge, Shelley, Keats and Byron. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "459RS",
        "title": "Selected Topics In Writing And Rhetoric: Rhetoric Of Science",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Intensive study of a topic relevant to literacy composition or rhetoric. Analytic or critical writing required. Topics will change from semester to semester. May be repeated one time. Available for graduate credit.\n",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "459WR",
        "title": "Selected Topics In Writing And Rhetoric: Genres",
        "description": "Prerequisite: Completion of the Lower Division writing requirement. Intensive study of a topic relevant to literacy composition or rhetoric. Analytic or critical writing required. Topics will change from semester to semester. May be repeated one time. Available for graduate credit.\n",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "460",
        "title": "The Victorian Age",
        "description": "Preparatory: 6 units of lower division literature courses, or 3 units of lower division literature and ENGL 355. Study of the literature and culture of England from 1837 to 1901, with special emphasis on the major writers of the age, including Tennyson, Arnold and Browning. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "461",
        "title": "Modern British Literature",
        "description": "Preparatory: 6 units of lower division literature courses, or 3 units of lower division literature and ENGL 355. Study of British literature, from 1900 to 1939 and of the cultural forces that helped shape it. Emphasis on such major writers as Yeats, Joyce, Lawrence, Woolf and Shaw. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "462",
        "title": "Contemporary British Literature",
        "description": "Preparatory: 6 units of lower division literature courses and ENGL 355. Study of British literature in the late 20th and early 21st centuries (e.g., Stoppard, Beckett, Kureishi, Smith, Amis, Heaney, Adcock, McGuckian). The course will consider the historical and cultural forces currently shaping genres and ideas, and may also discuss influences of mid-20th century writers. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "463A",
        "title": "Modern Poetry",
        "description": "Intensive study and analysis of the poems of major English language authors between 1912 and 1955 including such writers as Yeats Eliot Pound H. D. Crane Jeffers Toomer L. Hughes Lawrence Auden Moore Stevens Williams and Cummings.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "463B",
        "title": "Contemporary Poetry",
        "description": "Preparatory: 6 units of lower division literature courses, or 3 units of lower division literature and ENGL 355. Intensive study and analysis of the poems of major English language authors since 1955, including such writers as Robert Lowell, Sylvia Plath, John Berryman, Adrienne Rich, Allen Ginsberg, James Wright, John Ashbery, Amiri Baraka, Maxine Kumin, Rita Dove and Seamus Heaney. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "464",
        "title": "Theories of Poetry",
        "description": "Intensive study of the theories and craft of poetry. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "465",
        "title": "Theories of Fiction",
        "description": "Intensive study of the theories and craft of fiction. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "466",
        "title": "Major British Novelists I: 1700-1815",
        "description": "Study of selected major novels by such authors as Defoe, Richardson, Fielding, Sterne and Austen. ENGL 466, ENGL 467 and ENGL 468 may be taken separately or in any sequence. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "467",
        "title": "Major British Novelists II: 1815-1900",
        "description": "Study of selected major novels such by authors as Scott, Dickens, C. Brontë, E. Brontë, Thackeray, George Eliot, Trollope and Hardy. ENGL 466, ENGL 467 and ENGL 468 may be taken separately or in any sequence. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "470GS",
        "title": "Major Authors: Godwin And Shelley",
        "description": "Preparatory: 6 units of Lower Division literature courses or 3 units of Lower Division literature and ENGL 355. In-depth study of a single author or a comparative study of two authors such as Swift Hawthorne Woolf Morrison/Faulkner and Williams/Lawrence. The author(s) studied will change from semester to semester.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "473",
        "title": "American Literature: 1607-1860",
        "description": "Preparatory: 6 units of lower division literature courses, or 3 units of lower division literature and ENGL 355. Study of the literature and the culture of the colonial, early republic and romantic periods. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "474",
        "title": "American Literature: 1860-1912",
        "description": "Preparatory: 6 units of lower division literature courses, or 3 units of lower division literature and ENGL 355. Study of the literature and the culture of the age of realism. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "475",
        "title": "American Literature: 1912-1945",
        "description": "Preparatory: 6 units of lower division literature courses, or 3 units of lower division literature and ENGL 355. Study of the literature and culture of early 20th century America, from the poetic renaissance through World War II. Emphasis on such major writers as Frost, Hemingway, Eliot, Wharton, Fitzgerald, Faulkner, Stevens, Cather, Moore and Porter. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "476",
        "title": "Contemporary American Literature",
        "description": "Preparatory: 6 units of lower division literature courses, or 3 units of lower division literature and ENGL 355. Study of the literature and culture of America from 1945 to the present. Emphasis on such major writers as Bellow, Albee, Lowell, Williams, Welty, Morrison, Rich, O’Connor and Pynchon. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "477",
        "title": "Major American Novelists I: The 19th Century",
        "description": "Study of selected works by such major American writers as Cooper, Hawthorne, Melville, Twain, Chopin and James. ENGL 477 and ENGL 478 may be taken separately or in any sequence. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "478",
        "title": "Major American Novelists II: The 20th Century",
        "description": "Study of selected works by such major American writers as Fitzgerald, Hemingway, Cather, Wharton, Faulkner, McCullers, Bellow, Morrison, O’Connor and Updike. ENGL 477 and ENGL 478 may be taken separately or in any sequence. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "487",
        "title": "Latino/a Literatures of the Americas",
        "description": "Preparatory: ENGL 275, ENGL 436. Study of selected works of Latina and/or Latino writers from both the U.S. and Latin America, as well as of issues raised by critics and theorists in the field. Analysis of primary texts will employ methods of contemporary literary criticism. Topic or theme selected by instructor. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "490",
        "title": "Senior Seminar in Narrative Writing",
        "description": "Preparatory: Senior standing. Preparation of a collection of short stories or of a single longer work of narrative fiction. Students complete, revise and supplement their work to produce a finished manuscript of narrative fiction. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "491",
        "title": "Senior Seminar in Verse Writing",
        "description": "Preparatory: Senior standing. Preparation of a collection of poems or of a single long poem. Students complete, revise and supplement their work to produce a finished manuscript of poetry. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "492",
        "title": "Senior Honors Seminar I",
        "description": "Preparatory: Senior honors standing. Intensive study of a literary figure, age, movement or problem. May be repeated once for credit. ENGL 492 and ENGL 493 may be taken in any sequence. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "493",
        "title": "Senior Honors Seminar II",
        "description": "Preparatory: Senior honors standing. Intensive study of a literary figure, age, movement or problem. May be repeated once for credit. ENGL 492 and ENGL 493 may be taken in any sequence. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "494",
        "title": "English Intern Program",
        "description": "Preparatory: ENGL 407. Students are placed by the faculty supervisor with sponsoring organizations, where they work for 90 hours per semester while meeting for 15 hours in the classroom. Specific duties associated with technical and professional writing are assigned by sponsors. Students compile a portfolio of writing done for the sponsor and a term report of the experience. Available for graduate credit. May be repeated once for credit.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "494IP",
        "title": "English Intern Program",
        "description": "Preparatory: ENGL 407. Students are placed by the faculty supervisor with sponsoring organizations, where they work for 90 hours per semester while meeting for 15 hours in the classroom. Specific duties associated with technical and professional writing are assigned by sponsors. Students compile a portfolio of writing done for the sponsor and a term report of the experience. Available for graduate credit. May be repeated once for credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "495AGE",
        "title": "Senior Seminar In Literature: Coming Of Age",
        "description": "Preparatory: Either two Lower Division courses in literature or 3 units of Lower Division literature and ENGL 355; Senior standing. Intensive study of a major British or American author or of a literary theme or sub-genre. Reports and seminar papers required. Topics change from semester to semester. May be repeated once for credit.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "495AUS",
        "title": "Senior Seminar In Literature: Austen",
        "description": "Preparatory: Either two Lower Division courses in literature or 3 units of Lower Division literature and ENGL 355; Senior standing. Intensive study of a major British or American author or of a literary theme or sub-genre. Reports and seminar papers required. Topics change from semester to semester. May be repeated once for credit.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "495BB",
        "title": "Senior Seminar In Literature: Black British Literature",
        "description": "Preparatory: Either two Lower Division courses in literature or 3 units of Lower Division literature and ENGL 355; Senior standing. Intensive study of a major British or American author or of a literary theme or sub-genre. Reports and seminar papers required. Topics change from semester to semester. May be repeated once for credit.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "495ESM",
        "title": "Multigenre Literacy in a Global Context",
        "description": "The capstone course for English Subject Matter students, focuses on literacy in multiple genres (poetry, myth, short fiction, and media). Its multigenre, multimedia, and transnational compass fulfills State Standards and grounds this fulfillment in cutting edge scholarship in the fields of English studies. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "495JB",
        "title": "Senior Seminar In Literature: James Baldwin",
        "description": "Preparatory: Either two Lower Division courses in literature or 3 units of Lower Division literature and ENGL 355; Senior standing. Intensive study of a major British or American author or of a literary theme or sub-genre. Reports and seminar papers required. Topics change from semester to semester. May be repeated once for credit.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "495LVE",
        "title": "Senior Seminar In Literature: Love/law",
        "description": "Preparatory: Either two Lower Division courses in literature or 3 units of Lower Division literature and ENGL 355; Senior standing. Intensive study of a major British or American author or of a literary theme or sub-genre. Reports and seminar papers required. Topics change from semester to semester. May be repeated once for credit.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "495RTW",
        "title": "Senior Seminar In Literature: Roaring Twenties",
        "description": "Preparatory: Either two Lower Division courses in literature or 3 units of Lower Division literature and ENGL 355; Senior standing. Intensive study of a major British or American author or of a literary theme or sub-genre. Reports and seminar papers required. Topics change from semester to semester. May be repeated once for credit.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "495SG",
        "title": "Senior Seminar In Literature: Social Gospel",
        "description": "Preparatory: Either two Lower Division courses in literature or 3 units of Lower Division literature and ENGL 355; Senior standing. Intensive study of a major British or American author or of a literary theme or sub-genre. Reports and seminar papers required. Topics change from semester to semester. May be repeated once for credit.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "495SH",
        "title": "Senior Seminar In Literature: Superheroes",
        "description": "Preparatory: Either two Lower Division courses in literature or 3 units of Lower Division literature and ENGL 355; Senior standing. Intensive study of a major British or American author or of a literary theme or sub-genre. Reports and seminar papers required. Topics change from semester to semester. May be repeated once for credit.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "497A",
        "title": "Honors Revision Seminar",
        "description": "Preparatory: Senior honors standing; Preparation of an article-length manuscript, to be a revised version of a seminar paper from honors seminars ENGL 392, ENGL 393, ENGL 492 or ENGL 493. Students will have the opportunity to experience a full and rewarding revision process, through which they will develop an existing paper into a more sophisticated analysis that is richly researched and rhetorically and stylistically polished. Students will have the time to practice stages in the revision process that typically get short shrift when trying to develop a paper in a single semester. The resulting 20- to 25-page research essay will be suitable as a writing sample for graduate school applications or as concrete evidence of well-honed writing and thinking skills when searching for a job.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "501CP",
        "title": "Activities In Creative Writing Studies: Comedy",
        "description": "Recommended preparatory: ENGL 208. Intensive writing in a focused area of study. This is an activity-based series of courses and may include off-campus meetings. Topics will change from semester to semester. Check with Department for specific offerings May be repeated once for credit.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "502A",
        "title": "Activities in Creative Writing Studies",
        "description": "Recommended Preparatory: ENGL 208. Intensive writing in a focused area of study. This is an activity-based series of courses and may include off-campus meetings. Topics will change from semester to semester. Check with department for specific offerings. May be repeated once for credit.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "502AF",
        "title": "Activities In Creative Writing Studies: Spec Poetry And Com",
        "description": "Recommended preparatory: ENGL 208. Intensive writing in a focused area of study. This is an activity-based series of courses and may include off-campus meetings. Topics will change from semester to semester. Check with Department for specific offerings. May be repeated once for credit.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "502P",
        "title": "Activities In Creative Writing Studies: Poets And Art",
        "description": "Recommended preparatory: ENGL 208. Intensive writing in a focused area of study. This is an activity-based series of courses and may include off-campus meetings. Topics will change from semester to semester. Check with Department for specific offerings. May be repeated once for credit.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "502PF",
        "title": "Activities In Creative Writing Studies: Poets, Art, And Society",
        "description": "Recommended preparatory: ENGL 208. Intensive writing in a focused area of study. This is an activity-based series of courses and may include off-campus meetings. Topics will change from semester to semester. Check with Department for specific offerings. May be repeated once for credit.\n",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "507",
        "title": "An Introduction to Graduate Studies in English",
        "description": "This course introduces students to graduate‑level research and writing skills across the three options in the program: Literature, Creative Writing, and Rhetoric and Composition. The course also requires experiential learning in the field. This course should be taken in the first year of coursework.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "512",
        "title": "Writing for Performance",
        "description": "Throughout the semester, students will engage in writing exercises, participate in workshopping and develop new texts for performance. Students will also read several published plays and other types of performance texts. A final portfolio—which will include an introduction, rough drafts and revised texts—will be required. This course is available both for graduate and undergraduate credit. Additionally, this course may be taken by undergraduates in the Creative Writing option as a Senior Seminar. Undergraduates must have senior standing. ENGL 512 may be repeated once for credit by both graduate and undergraduate students.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "595PB",
        "title": "Experimental Topics Courses In English: Picture Bk Theory",
        "description": "Topics will be announced each semester in the Schedule of Classes.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "600A",
        "title": "College Composition: Theory and Pedagogy",
        "description": "Prerequisite: Restricted to teaching associates or at the discretion of the director of composition. Study of theoretical and pedagogical issues that impact the teaching of writing at the college level. Review of current studies in rhetoric, composition and literacy. ENGL 600B also entails faculty observation of student teaching.",
        "units": "3",
        "prerequisites": "{Restricted to teaching associates or at the discretion of the director of composition}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "600B",
        "title": "College Composition: Theory and Pedagogy Field Experience",
        "description": "Prerequisite: ENGL 600A and ENGL 600B/F are restricted to teaching associates or at the discretion of the director of composition. Corequisite: ENGL 600B. Study of theoretical and pedagogical issues that impact the teaching of writing at the college level. Review of current studies in rhetoric, composition and literacy. ENGL 600B also entails faculty observation of student teaching.",
        "units": "2",
        "prerequisites": "{ENGL 600A and ENGL 600B/F are restricted to teaching associates or at the discretion of the director of composition}",
        "corequisites": "{ENG 600B}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "600BF",
        "title": "College Composition: Theory and Pedagogy Field Experience",
        "description": "Prerequisite: ENGL 600A and ENGL 600B/F are restricted to teaching associates or at the discretion of the director of composition. Corequisite: ENGL 600B. Study of theoretical and pedagogical issues that impact the teaching of writing at the college level. Review of current studies in rhetoric, composition and literacy. ENGL 600B also entails faculty observation of student teaching.",
        "units": "1",
        "prerequisites": "{ENGL 600A and ENGL 600B/F are restricted to teaching associates or at the discretion of the director of composition}",
        "corequisites": "{ENGL 600B}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "601",
        "title": "Seminar in Scholarly Methods and Bibliography",
        "description": "Study of traditional and electronic methods of scholarly research. Investigation and evaluation of major areas of bibliographic study, such as literature and “new historicism,” the editing of texts and literary influence studies and intertextuality.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "604",
        "title": "Seminar in Language and Linguistics",
        "description": "An introduction to linguistics for graduate students.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "608",
        "title": "Seminar in Narrative Writing",
        "description": "Prerequisite: Qualified standing in the graduate Creative Writing option or instructor consent. Intensive practice in advanced writing and analysis of the short story and the novel. Course may be repeated once for credit. One enrollment in ENGL 608 or ENGL 609 may be used in the Rhetoric and Composition option.",
        "units": "3",
        "prerequisites": "{Qualified standing in the graduate Creative Writing option or instructor consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "609",
        "title": "Seminar in Poetry Writing",
        "description": "Prerequisite: Qualified standing in the graduate Creative Writing option or instructor consent. Intensive practice in the writing of poetry, with attention to both contemporary and historical techniques. Analysis and criticism of students’ work. May be repeated once for credit. One enrollment in ENGL 608 or ENGL 609 may be used in the Rhetoric and Composition option.",
        "units": "3",
        "prerequisites": "{Qualified standing in the graduate Creative Writing option or instructor consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "617",
        "title": "Studies in Shakespeare",
        "description": "Prerequisite: ENGL 417 or equivalent. Advanced study of several of Shakespeare’s works, including formal, textual or historical aspects. Topics will change from semester to semester.",
        "units": "3",
        "prerequisites": "{ENGL 417}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "620M",
        "title": "Seminar In Individual Authors: Yeats",
        "description": "In-depth study of a major British or American author such as Swift Hawthorne or Woolf. The author studied will change from semester to semester.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "622",
        "title": "Seminar on Aspects of Poetry",
        "description": "Intensive critical study of the province of poetry, providing opportunity for the scrutiny of individual poets as well as for concentration on the wider historical perspective.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "623",
        "title": "Seminar in Studies in Prose Fiction",
        "description": "Seminar in the theory, forms, traditions and techniques of prose fiction. Topics will vary from semester to semester.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "624",
        "title": "Studies in Dramatic Literature",
        "description": "Advanced study in drama considered as literature, with special emphasis on historical developments and their relationship to literary periods and movements in other genres.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "630AA",
        "title": "Seminar In Literary Periods: African-american Literature",
        "description": "Study of a period of British or American literature with wide readings in a range of authors and their intellectual backgrounds.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "630B",
        "title": "Seminar In Literary Periods: Bodies Matter",
        "description": "Study of a period of British or American literature with wide readings in a range of authors and their intellectual backgrounds.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "630DW",
        "title": "Seminar In Literary Periods: Defiant Women",
        "description": "Study of a period of British or American literature with wide readings in a range of authors and their intellectual backgrounds.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "630FA",
        "title": "Seminar In Literary Periods: Foreign Americans",
        "description": "Study of a period of British or American literature with wide readings in a range of authors and their intellectual backgrounds.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "630LR",
        "title": "Seminar In Literary Periods: Literary Realism",
        "description": "Study of a period of British or American literature with wide readings in a range of authors and their intellectual backgrounds.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "630SN",
        "title": "Seminar In Literary Periods: Seminar On The Novel",
        "description": "Study of a period of British or American literature with wide readings in a range of authors and their intellectual backgrounds.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "638",
        "title": "Seminar in Critical Approaches to Literature",
        "description": "Study of major critical approaches to literature and their application to selected literary texts.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "651",
        "title": "Rhetoric and Composition Theory",
        "description": "Intense discussion and analysis of theories of rhetoric and composition.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "652",
        "title": "Creative Writing Studies",
        "description": "Prerequisite: Qualified standing in the graduate Creative Writing option or instructor consent. Introduction to the theoretical, professional and institutional concerns of creative writers, especially in an academic context. Intensive practice in creative writing (multi-genre). Workshop format.",
        "units": "3",
        "prerequisites": "{Qualified standing in the graduate Creative Writing option or instructor consent}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "653",
        "title": "Literary and Rhetorical Genre Theory",
        "description": "Examination of scholarship concerned with genre, both the traditional concept of genre, which focuses on formal categories of literary texts and the rhetorical notion of genre, which focuses on the rhetorical purpose and function of non-literary texts. Through extensive reading, class discussions and research projects, students will explore the function of genre, the communities that genres serve, the relationship between literary and non-literary genres, the cultural elements in genre, the relationship between genre and power and the ways in which genres are acquired.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "654",
        "title": "Advanced Topics in Rhetoric and Composition",
        "description": "Preparatory: ENGL 651. Intense advanced study of a specialized area, topic, question or problem in the field of rhetoric and composition. Topics vary from semester to semester. May be repeated once for credit, provided topic is different.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "685",
        "title": "Seminar In Contemporary World Literature",
        "description": "Major trends in the literature of the West in the late 19th and 20th centuries.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "697C",
        "title": "Directed Comprehensive Studies",
        "description": "Focused reading and research followed by comprehensive exam.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "698C",
        "title": "Graduate Project",
        "description": "This course is one of the available choices for the culminating experience in the English Department M.A. Program. In significantly revising existing written work students will practice the tools of research used in the field of English Studies. While students in the Literature and the Rhetoric and Composition Theory Options will focus on revising and developing a previously written essay students in the Creative Writing Option will write a critical introduction to a revised portfolio of their creative work. Additionally students will gain experience with professional conferences presentations and productions. Note: Students in the Creative Writing Option are required to enroll concurrently in a creative writing workshop within their primary genre at the 400- 500- or 600-level.\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "ENGL",
        "catalog_number": "90",
        "title": "Extemporaneous Expository Writing",
        "description": "Preparatory: Completion of the Lower Division writing requirement. Intensive practice in writing effective expository prose under test conditions. Primarily designed for students preparing to retake the Upper Division Writing Proficiency Exam (UDWPE). Credit for ENGL 090 does not guarantee passing the UDWPE. (Credit/No Credit only)\n",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    }
]