[
    {
        "subject": "FIN",
        "catalog_number": "102",
        "title": "Financial Literacy",
        "description": "Covers basic financial terms and institutions and the tools necessary for students to make wise financial decisions. Topics covered include budgeting, borrowing, managing credit, financial planning and related topics. (Available for General Education, E Lifelong Learning.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "302",
        "title": "Personal Finance",
        "description": "Prerequisite: Completion of the lower division writing requirement. Examination of the concepts necessary for the rational allocation of personal resources. Emphasis is on the significant financial decisions facing each household during its life cycle. The role of financial institutions and governmental economic policy is evaluated in the context of their potential impact on personal financial planning. (Available for General Education, E Lifelong Learning.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "303",
        "title": "Financial Management",
        "description": "Prerequisites: ACCT 220; ECON 160; SOM 120 (may be taken concurrently). BUS 302 and BUS 302L are co/prerequisites for Business majors. Analysis of the financial decision making process of a firm from both internal and external points of view. Topics include valuation, working capital management, capital budgeting, financial forecasting, capital structure, and sources of capital and dividend policy in both a domestic and international context.",
        "units": "3",
        "prerequisites": "{{ACCT 220} && {ECON 160} && {SOM 120}}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "336",
        "title": "Principles of Risk Management and Insurance",
        "description": "Corequisites for Business Majors: BUS 302 and BUS 302L. Risk Management and Insurance as an economic and business institution. Survey of risk management, fire, marine, casualty and life insurance for those interested as potential customers, salespersons or brokers.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{BUS 302/L}"
    },
    {
        "subject": "FIN",
        "catalog_number": "338",
        "title": "Real Estate Principles",
        "description": "Prerequisite: Upper Division standing. Introductory survey of the field of real estate. Areas covered include real estate law appraisal brokerage finance and investment.\n",
        "units": "3",
        "prerequisites": "{Upper Division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "352",
        "title": "Investment Management",
        "description": "Prerequisite: Grade of “C” or higher in FIN 303. BUS 302 and BUS 302L are prerequisites for Business majors. Survey of investments including corporate and government securities, real property and financial intermediaries. Survey of investment theory emphasizing security analysis, valuation and portfolio management.",
        "units": "3",
        "prerequisites": "{FIN 303}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "355",
        "title": "Corporate Finance",
        "description": "Prerequisite: Grade of “C” or higher in FIN 303. BUS 302 and BUS 302L are prerequisites for Business majors. Advanced readings and case studies in current problems and trends in corporate financial policy formulation. Students will be required to analyze selected problems orally and in writing.",
        "units": "3",
        "prerequisites": "{FIN 303}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "359",
        "title": "Quantitative Finance",
        "description": "Prerequisite: Grade of “C” or higher in FIN 303. BUS 302 and BUS 302L are prerequisites for Business majors. Quantitative analysis of various problems in corporate finance and investments. Emphasis is placed on developing computer skills.",
        "units": "3",
        "prerequisites": "{FIN 303}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "425",
        "title": "Entrepreneurial Finance",
        "description": "Prerequisite: Grade of “C” or higher in FIN 303. BUS 302 and BUS 302L are prerequisites for Business majors. Examines the financial issues of starting a new company, raising funds and valuing and managing ongoing ventures.",
        "units": "3",
        "prerequisites": "{FIN 303}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "430",
        "title": "International Financial Management",
        "description": "Prerequisite: Grade of “C” or higher in FIN 303. BUS 302 and BUS 302L are prerequisites for Business majors. Analysis of the international complexities of corporate financial management and investment strategies. Emphasis is placed on the nature of the close link between corporate financial management and developments in international financial institutions and international financial markets.",
        "units": "3",
        "prerequisites": "{FIN 303}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "431",
        "title": "Risk Management",
        "description": "Prerequisites: FIN 336; Grade of “C” or higher in FIN 303. BUS 302 and BUS 302L are prerequisites for Business majors. Analysis of the methods and procedures of dealing with risk in the firm, including the theoretical basis of insurance and self-insurance mechanisms. Consideration of the commercial insurance industry, its structure and regulation.",
        "units": "3",
        "prerequisites": "{{FIN 336} && {FIN 303}}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "433",
        "title": "Real Estate Finance",
        "description": "Prerequisites: FIN 338; Grade ofC or higher in FIN 303; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L are prerequisites for Business majors. Analysis of the instruments institutions agencies and operations involved in the financing of real estate.\n",
        "units": "3",
        "prerequisites": "{{FIN 338} && {FIN 303} && {Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher}}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "434",
        "title": "Life and Health Insurance",
        "description": "Prerequisites: FIN 336; Grade of “C” or higher in FIN 303. BUS 302 and BUS 302L are prerequisites for Business majors. An examination of life insurance, health insurance, employee benefits and annuities. Study of regulation of life and health insurers, Social Security, retirement issues and other applications of life and health insurance contracts.",
        "units": "3",
        "prerequisites": "{{FIN 336} && {FIN 303}}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "436",
        "title": "Futures and Options: Theory and Strategy",
        "description": "Prerequisite: Grade of “C” or higher in FIN 352 or instructor’s permission. BUS 302 and BUS 302L are prerequisites for Business majors. Study of the structure of futures and options. The analysis will emphasize the theoretical framework of options and futures pricing models, practical financial implications and the mechanics of and economic rationale for futures and options markets.",
        "units": "3",
        "prerequisites": "{{FIN 352} || {instructor permission}}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "438",
        "title": "Management of Financial Institutions",
        "description": "Prerequisite: Grade of “C” or higher in FIN 303. BUS 302 and BUS 302L are prerequisites for Business majors. Examination of the principles, practices and procedures applicable to the operation and management of financial institutions. Includes analysis of the sources and uses of funds in the system and the federal and state regulatory structure.",
        "units": "3",
        "prerequisites": "{FIN 303}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "439",
        "title": "Real Estate Valuation",
        "description": "Prerequisites: FIN 338; Grade ofC or higher in FIN 303; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L are prerequisites for Business majors. Analysis of the various determinants of real estate value and the methods used in practice to estimate such value. Economic factors affecting real estate value are emphasized and traditional valuation techniques are critically examined.\n",
        "units": "3",
        "prerequisites": "{{FIN 338} && {FIN 303} && {Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher}}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "440",
        "title": "Retirement Planning and Employee Benefits",
        "description": "Prerequisite: Grade of “C” or higher in FIN 303. BUS 302 and BUS 302L are prerequisites for Business majors. Provides knowledge of both public and private benefit and retirement plans. Public plans include Social Security, Medicare and Medicaid. Private plans include defined benefit and defined contribution plans and their regulatory provisions. Specifics of the various plans are analyzed as well as non-qualified deferred compensation plans. Issues individuals face in retirement, such as life-styles choices and medical issues also discussed. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{FIN 303}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "442",
        "title": "Theory and Practice of Financial Planning",
        "description": "Prerequisites: FIN 352; Grade of “C” or higher in FIN 303. BUS 302 and BUS 302L are prerequisites for Business majors. Financial theory and planning process includes data gathering, cash flow and debt considerations, goal setting and objectives (including retirement and education funding), integration, plan formulation, tax consideration and implementation. Planning considerations also include ethical and legal issues.",
        "units": "3",
        "prerequisites": "{{FIN 352} && {FIN 303}}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "446",
        "title": "Income Tax and Estate Planning",
        "description": "Prerequisite: Grade of “C” or higher in FIN 303. BUS 302 and BUS 302L are prerequisites for Business majors. This course surveys the financial and legal fields of estate planning and income tax planning. It equips financial planners to solve basic income and estate planning problems, and to recognize common tax planning strategies.",
        "units": "3",
        "prerequisites": "{FIN 303}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "452",
        "title": "Investment Analysis",
        "description": "Prerequisite: Grade of “C” or higher in FIN 352 or instructor’s permission. BUS 302 and BUS 302L are prerequisites for Business majors. Portfolio management and performance evaluation and topics related to pension and other institutional fund management. It includes applications to portfolio benchmarking as well as discussions of alternative investment approaches and products.",
        "units": "3",
        "prerequisites": "{{FIN 352} || {instructor permission}}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "455",
        "title": "Business Valuation",
        "description": "Prerequisite: Grade of “C” or higher in FIN 355 or instructor’s permission. BUS 302 and BUS 302L are prerequisites for Business majors. Advanced treatment of corporate finance. Topics covered include cost of capital, capital budgeting, capital structure and leverage, dividend and payout policy, corporate governance and corporate restructuring. Emphasis is on the real world applications.",
        "units": "3",
        "prerequisites": "{{FIN 355} || {instructor permission}}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "459",
        "title": "Financial Modeling",
        "description": "Prerequisites: Grade of “C” or higher in FIN 352, FIN 355 and FIN 359, or instructor’s permission. BUS 302 and BUS 302L are prerequisites for Business majors. Advanced quantitative skills used by financial professionals and researchers, including statistical estimation, simulation and Monte Carlo methods and optimization.",
        "units": "3",
        "prerequisites": "{{{FIN 352} && {FIN 355} && {FIN 359}} || {instructor permission}}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "462",
        "title": "Fixed Income Securities",
        "description": "Prerequisite: Grade of “C” or higher in FIN 352 or instructor’s permission. BUS 302 and BUS 302L are prerequisites for Business majors. Introduction to the fixed-income markets and fixed-income securities. It covers the pricing and risk management of fixed-income products, as well as introduction to fixed-income derivatives.",
        "units": "3",
        "prerequisites": "{{FIN 352} || {instructor permission}}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "491A",
        "title": "Seminar in Financial Analysis",
        "description": "Prerequisite: Grade of “C” or higher in FIN 303. BUS 302 and BUS 302L are prerequisites for Business majors. Advanced issues in a subfield in financial analysis are analyzed by means of case studies, readings and class discussion. Up to two different courses within this series may be taken for credit in the following areas: (A) Fundamental Analysis and Portfolio Management, (B) Asset Allocation and Tactical Portfolio Management, (C) Socially Responsible Investments and Sustainable Portfolios.",
        "units": "3",
        "prerequisites": "{FIN 303}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "495A",
        "title": "Seminar in Insurance",
        "description": "Prerequisite: Grade of “C” or higher in FIN 303. BUS 302 and BUS 302L are prerequisites for Business majors. Advanced issues in a subfield in insurance are analyzed by means of case studies, readings and class discussion. Up to two different courses of this series may be taken for credit in the following areas: (A) Insurance Operations, (B) Insurance Management, (C) Risk Management.",
        "units": "3",
        "prerequisites": "{FIN 303}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "498A",
        "title": "Field Assignments and Reports—Finance",
        "description": "Prerequisite: A grade of “C” or higher in FIN 303 for Finance majors and minors. BUS 302 and BUS 302L are prerequisites for Business majors. Individual study pertaining to present or future career. Student must obtain approved employment. Consultation with employer and instructor determines program. A maximum of 12 units may be earned by combining Field Assignments and Reports (FIN 498) and Independent Study (FIN 499). Academic Internship course. (Credit/No Credit only)",
        "units": "1",
        "prerequisites": "{FIN 303}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Prerequisite: Consent of department chair and consent of an instructor to act as sponsor. BUS 302 and BUS 302L are prerequisites for Business majors. In order to do an Independent Study assignment in the College of Business and Economics, students must have at least a 3.0 overall GPA, a 2.0 GPA in all major courses and a 2.0 GPA in their option courses. Students who do not meet these grade point requirements will not receive credit for any FIN 499 that they may take. Admission is based on evidence of ability to pursue Independent Study in depth and on approval of a project submitted at the time of registration. Regular progress meetings and reports are required throughout the semester. Completion of the project is required before credit may be received. Enrollment in Independent Study is not allowed for the purpose of substitution for an existing course. A maximum of 6 units of Independent Study (FIN 499) may be earned in the College of Business and Economics. Further, a maximum of 12 units may be earned by combining Field Assignments and Reports (FIN 498) and Independent Study (FIN 499).",
        "units": "1",
        "prerequisites": "{Consent of department chair and consent of an instructor to act as sponsor}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "502",
        "title": "Managerial Finance",
        "description": "Prerequisite: ACCT 501. Examination of the financial decision making process. Topics include the analysis and interpretation of financial statements, ratio analysis, financial forecasting and budgeting, financial markets, working capital management, valuation, capital budgeting, sources of capital and capital structure, dividend policy, and the management of risk and return in an international context.",
        "units": "3",
        "prerequisites": "{ACCT 501}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "635",
        "title": "Corporate Finance",
        "description": "Prerequisite: FIN 502. Examination of the theory and its applications to financial management of business entities. Analytical skills are developed through financial market analysis and the use of authentic cases.",
        "units": "3",
        "prerequisites": "{FIN 502}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "636",
        "title": "Seminar in Investment Analysis",
        "description": "Prerequisite: FIN 502. Seminar in the fundamental and technical analysis of securities and capital markets. Applied financial analysis of firms and their securities; study of institutional forces in the security markets.",
        "units": "3",
        "prerequisites": "{FIN 502}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "638",
        "title": "MBA Portfolio Management",
        "description": "Prerequisite: FIN 635 or consent of instructor. The course provides a select group of graduate students the opportunity to obtain real-world experience in the process of managing an investment portfolio. It will combine a comprehensive theoretical foundation with the challenge of managing a real stock portfolio. Students will take a team-oriented approach, with each group expected to research and formally present their investment ideas to the class. In addition, guest speakers from the industry will share their professional experiences with the class.",
        "units": "3",
        "prerequisites": "{{FIN 635} || {consent of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "639",
        "title": "Seminar in Financial Problems",
        "description": "Prerequisite: FIN 635. Selected topics in corporate finance are examined in the context of the managerial decision process. Emphasis is placed on the application of the theory of finance to problems facing entrepreneurs, investors and managers.",
        "units": "3",
        "prerequisites": "{FIN 635}",
        "corequisites": "{None}"
    },
    {
        "subject": "FIN",
        "catalog_number": "699",
        "title": "Independent Study—Finance",
        "description": "Prerequisites: Permission of graduate advisor and department chair. No more than 6 units of Independent Study may be taken in any one department, and no more than 6 units may be taken in the College of Business without prior approval of the Dean. Only those graduate students who have a current GPA of 3.0 or higher may register in a 600-level Independent Study course. Note: See Graduate Business Interdepartmental Courses for GBUS 694B, 695B and 696B.",
        "units": "3",
        "prerequisites": "{Permission of graduate advisor and department chair}",
        "corequisites": "{None}"
    }
]