[
    {
        "subject": "MGT",
        "catalog_number": "360",
        "title": "Management and Organizational Behavior",
        "description": "Prerequisite: Completion of lower division business core. BUS 302 and BUS 302L are co/prerequisites for business majors. Introduction to the basic concepts in management and organizational behavior. Applies these concepts to the management of people and resources toward the accomplishment of organizational goals. Emphasis is on the organizational applications of behavioral science concepts, interpersonal skills and team building.",
        "units": "3",
        "prerequisites": "{Completion of lower division business core}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "370",
        "title": "Management Skills Development",
        "description": "Prerequisite: Grade of “C” or higher in MGT 360. BUS 302 and BUS 302L are prerequisites for Business majors. A presentation of major concepts of the behavioral sciences that apply to the management of organizations. Focus is on understanding factors and developing skills that affect the behavior and ultimately the performance of individuals and groups within organizations.",
        "units": "3",
        "prerequisites": "{MGT 360}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "380",
        "title": "Employment Practices",
        "description": "Prerequisite: Grade of “C” or higher in MGT 360. BUS 302 and BUS 302L are prerequisites for Business majors. Analyzes how, why and the procedures involved in recruiting, retaining, evaluating and managing employees in light of current issues and trends in the legal and socio-demographic environments.",
        "units": "3",
        "prerequisites": "{MGT 360}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "450",
        "title": "Organization Change and Development",
        "description": "Prerequisite: Grade of “C” or higher in MGT 360. BUS 302 and BUS 302L are prerequisites for Business majors. Examines current practices in the application of behavioral science knowledge to organization change issues. Focus is on the dynamics of change as well as current diagnostic techniques and intervention strategies.",
        "units": "3",
        "prerequisites": "{MGT 360}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "454",
        "title": "Leadership, Power and Politics",
        "description": "Prerequisite: Grade of “C” or higher in MGT 360. BUS 302 and BUS 302L are prerequisites for Business majors. Concentrates on the ability of individuals to lead others in important undertakings, including the management of organizations, the management of large-scale change and the resolution of complex problems. Focuses on behavioral approaches to leadership, particularly attaining and exerting power and managing the political subsystem.",
        "units": "3",
        "prerequisites": "{MGT 360}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "456",
        "title": "Negotiation and Conflict Management",
        "description": "Prerequisite: Grade of “C” or higher in MGT 360. BUS 302 and BUS 302L are prerequisites for Business majors. Primary objective of this course is to introduce students to current theories and processes for negotiation and conflict management as practiced in a variety of settings. The course also builds students’ skills using negotiation and conflict management techniques.",
        "units": "3",
        "prerequisites": "{MGT 360}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "458",
        "title": "Decision Making and Creativity",
        "description": "Prerequisite: Grade of “C” or higher in MGT 360. BUS 302 and BUS 302L are prerequisites for Business majors. Analysis and skill-building in creative and ethical decision making, focused on managerial and organizational contexts. Decision making is considered as a comprehensive process, encompassing identification and framing of issues/problems, evaluation of alternatives, choice, implementation and learning from the experience. Attention is given to a variety of contemporary decision making and creativity techniques, in addition to traditional and rational decision making models.",
        "units": "3",
        "prerequisites": "{MGT 360}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "460",
        "title": "Strategic Human Resource Management",
        "description": "Prerequisite: Grade of “C” or higher in MGT 360. BUS 302 and BUS 302L are prerequisites for Business majors. Examination of the formulation and implementation of human resource policy at the strategic level. Emphasis is placed on how human resource functions can integrate with the overall strategy of the firm to make the firm more competitive.",
        "units": "3",
        "prerequisites": "{MGT 360}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "462",
        "title": "Business and Society",
        "description": "Prerequisite: Grade of “C” or higher in MGT 360. BUS 302 and BUS 302L are prerequisites for Business majors. The course looks at the relationship among business, government, not-for-profits and society. The major issues covered include: ethical dilemmas for business; models of relationships among business, government and society; and the impact of the public policy process on business and vice-versa.",
        "units": "3",
        "prerequisites": "{MGT 360}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "464",
        "title": "International Business Management",
        "description": "Prerequisite: Grade of “C” or higher in MGT 360. BUS 302 and BUS 302L are prerequisites for Business majors. Studies various issues related to managing international businesses effectively. The purpose is to develop skills in identifying critical issues facing, analyzing key factors related to and developing solutions for businesses that either compete or will compete in global business environments.",
        "units": "3",
        "prerequisites": "{MGT 360}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "468",
        "title": "Crisis Management",
        "description": "Prerequisite: Grade of “C” or higher in MGT 360. BUS 302 and BUS 302L are prerequisites for Business majors. The aim of this course is to help students understand how and why crises occur in organizations, and what can be done to manage them better. Specifically, the course aims to educate students so that they are able to prepare for and respond to crisis their organization may experience. Students will learn the concepts, models, frameworks, and tools of Crisis Management (CM), and apply them in various cases and exercises. More importantly, students will develop a comprehensive and integrated CM framework.",
        "units": "3",
        "prerequisites": "{MGT 360}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "491",
        "title": "Executive Leadership",
        "description": "Prerequisites: Consent of Instructor; Grade of “C” or higher in MGT 360; Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher. BUS 302/L is a prerequisite for Business majors. Students will research identified Chief Executive Officers Chief Financial Officers Group Vice Presidents and other executives and the companies and organizations which they lead to determine how these leaders guide their organizations how they reached their current positions and their roles in developing and enhancing the distinctive value-added of their companies. Students will receive intensive training in preparing for and conducting executive level interviews and will then be sent to meet with these identified leaders. Following each interview students will prepare confidential reports on each company and submit them to the leaders who were interviewed.\n\n",
        "units": "3",
        "prerequisites": "{{Consent of Instructor} && {MGT 360} && {Upper Division Writing Proficiency Exam (UDWPE) score of 8 or higher}}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "498A",
        "title": "AE-CE. Internship—Management",
        "description": "Prerequisites: Grade of “C” or higher in MGT 360 for all Business majors and minors except for non-business Entrepreneurship minors; BUS 302 and BUS 302L are prerequisites for Business majors; ENT 410 and instructor consent is a prerequisite for Entrepreneurship minors. Individual study regarding the application of management principles in the workplace. Student must obtain an approved internship pertaining to present or future career. A maximum of 12 units may be earned by combining Internship (MGT 498) and Independent Study (MGT 499). (Credit/No Credit only)",
        "units": "1",
        "prerequisites": "{Parse Error: Refer to class description for prerequisites}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "499A",
        "title": "Independent Study",
        "description": "Prerequisites: Consent of department chair and consent of an instructor to act as sponsor; Grade of “C” or higher in MGT 360. BUS 302 and BUS 302L are prerequisites for Business majors. In order to do an Independent Study assignment in the College of Business and Economics, students must have at least a 3.0 overall GPA, a 3.0 or higher GPA in all major courses and a 3.0 or higher GPA in their option courses. Students who do not meet these grade point requirements will not receive credit for any MGT 499 that they may take. Admission is based on evidence of ability to pursue Independent Study in-depth and on approval of a project submitted at the time of registration. Regular progress meetings and reports are required throughout the semester. Completion of the project is required before credit may be received. Enrollment in Independent Study is not allowed for the purpose of substitution for an existing course. A maximum of 6 units of Independent Study (MGT 499) may be earned in the College of Business and Economics. Further, a maximum of 12 units may be earned by combining Internship (MGT 498) and Independent Study (MGT 499).",
        "units": "1",
        "prerequisites": "{{Consent of department chair and consent of an instructor to act as sponsor} && {MGT 360}}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "620",
        "title": "Organizational Behavior",
        "description": "Prerequisite: GBUS 600 (may be taken concurrently with MGT 620). This course is designed to provide students with a sophisticated understanding of how individuals and groups behave in organizations and how human behavior within organizations can be managed. The course will help students identify and define behavioral issues within organizations, understand how these issues are interrelated and help them develop the skills required to deal with the issues. The course encourages students to examine and reflect on their own behavior and experience in organizations to gain insights into the issues studied.",
        "units": "3",
        "prerequisites": "{GBUS 600 (may be taken concurrently with MGT 620)}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "630",
        "title": "Human Resource Strategies",
        "description": "Prerequisite: GBUS 600. Examination of the interaction between organizations and their political, social, economic and technical environments. Issues of ethical and social responsibility are examined.",
        "units": "3",
        "prerequisites": "{GBUS 600}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "667",
        "title": "Leadership",
        "description": "Prerequisite: GBUS 600. This course concentrates on contemporary leadership theory and practice with an emphasis on self-assessment and development of participants leadership skills. The course focuses on behavioral approaches to leadership including gaining power and managing the political subsystem.\n",
        "units": "3",
        "prerequisites": "{GBUS 600}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "693",
        "title": "Strategic Management",
        "description": "Prerequisite: Taken during last year of coursework for MBA students. Must have completed or be completing all core classes. An integrative seminar dealing with broad business policy problems via the case method. There will be definition and analysis of internal and external factors affecting the development of the objectives and policies of the firm. The course stresses the interrelationships of major functional areas and the pervasive adjustments that may result from changes in a specific policy. Students are expected to use their personal experience and apply the analytical tools obtained from specialized courses in the solution of organization-wide problems. Emphasis is placed on case study methodology.",
        "units": "3",
        "prerequisites": "{Must be taken during last year of coursework for MBA students}",
        "corequisites": "{None}"
    },
    {
        "subject": "MGT",
        "catalog_number": "699",
        "title": "Independent Study—Management",
        "description": "Prerequisites: Permission of graduate advisor and department chair. No more than 6 units of Independent Study may be taken in any one department, and no more than 6 units may be taken in the College of Business and Economics without prior approval of the dean. Only those graduate students who have at least a current 3.0 GPA may register in a 600-level Independent Study course. Note: See Graduate Business Interdepartmental Courses for GBUS 694C, GBUS 695C, GBUS 696C, GBUS 697C and GBUS 698C.",
        "units": "3",
        "prerequisites": "{Permission of graduate advisor and department chair}",
        "corequisites": "{None}"
    }
]