[
    {
        "subject": "SCI",
        "catalog_number": "100",
        "title": "Science for Life",
        "description": "This course gives college students the skills and knowledge to promote success and instill lifelong learning with emphasis in science, mathematics and technology. The course will provide students with tools to examine their personal, academic and career choices through introspection, consultation, discussion, experimentation and traditional classroom exercises using examples from the natural world. The course is suggested for freshmen in science-based majors or those exploring these majors. Enrollment limited to First-time Freshman only. (Available for General Education, E Lifelong Learning.) (IC)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SCI",
        "catalog_number": "111",
        "title": "Understanding Climate Change",
        "description": "Severe global climate change will have disastrous consequences for Earth’s population. This course will develop the basic science behind the predictions for Earth’s climate, and explain why human activities, primarily the emission of greenhouse gases, are the main driver of global warming. Course topics include the causes of climate change, its impacts, projections for the future, possible mitigation, and economic barriers imposed by the global capitalist system. 3 hours lecture per week. Students receive credit for only one course chosen from either SCI 111, GEOG 111, or SUST 111. (Available for General Education, B1 Physical Science. Students may satisfy the B3 Science Laboratory Activity requirement by completing SCI 111L.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "SCI",
        "catalog_number": "111L",
        "title": "Understanding Climate Change Lab Lab",
        "description": "Corequisite: SCI 111. Laboratory exercises include climate prediction modeling, the use of proxy data, and examination of the impacts of climate change. 3 hours lab per week. Students receive credit for only one course chosen from either SCI 111L, GEOG 111L, or SUST 111L. (Available for General Education, B3 Science Laboratory Activity requirement provided SCI 111 is also completed.)",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{SCI 111}"
    },
    {
        "subject": "SCI",
        "catalog_number": "456",
        "title": "Science Capstone",
        "description": "Prerequisites: Completion of course 1 and course 2 of science specialization. Recommended Preparatory Courses: PHYS 170, GEOL 106LRS/GEOG 106LRS. The capstone course will emphasize concepts from the physical science, earth science and life science content areas with an emphasis on scientific investigation and problem solving. Students will integrate crosscutting themes across the sciences such as patterns, cause and effect, scale, energy and matter flow, structure and function, and stability and change. Students will design and carry out scientific investigation projects that allow them to apply their knowledge of scientific practice and scientific concepts. LRS students will connect their own understanding of the sciences with the conceptual understanding of K-6 children. Students will read, discuss, and write about selected research articles assessing problem solving and connections to learning science in elementary classrooms. This course is intended for Multiple Subject Credential students only.",
        "units": "3",
        "prerequisites": "{Completion of course 1 and course 2 of science specialization}",
        "corequisites": "{None}"
    }
]