[
    {
        "subject": "TH",
        "catalog_number": "108A",
        "title": "Acting I: Fundamentals",
        "description": "Prerequisite: Theatre major or Theatre minor or permission of instructor. This course develops foundational skills for the actor, with an emphasis on ensemble building, collaboration and creative problem solving. Acting exercises, techniques and methods from a variety of performance styles will provide a comprehensive introduction to the roles and responsibilities of actors and directors. Fundamentals of the actor’s craft, such as developing an effective work ethic, appropriate rehearsal behavior and learning to integrate external evaluation, will provide students with a strong foundation in theater performance. Course meets 4 hours per week.",
        "units": "2",
        "prerequisites": "{{Theatre major} || {Theatre minor} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "110",
        "title": "Introduction to Theatre: Text/Drama/Performance",
        "description": "Introduction to theatre through reading and discussing play scripts, analyzing dramatic forms and writing about live performances. Regular critical writing assignments and attendance at live performances are required. (Available for General Education, C1 Arts.)",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "111",
        "title": "Actors and Acting",
        "description": "Prerequisite: Not open to Theatre majors. Introduction to theatre through an emphasis upon its central performer–the actor. Illustrative acting exercises. (Available for General Education, C1 Arts.)",
        "units": "3",
        "prerequisites": "{Not open to Theatre majors}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "120",
        "title": "Arts Immersion: Theatre",
        "description": "Prerequisite: Limited to students in the ITEP-Freshman Option. Corequisite: TH 120L. Introductory course in which students engage in the study and practice of theatre and process drama. Exploration of the role of playwright, director, designer, actor, technician and dramaturg/critic as they relate to the art of theatre and the design of drama experiences for children. Focuses on identifying and experiencing the relationship of theatre and drama experiences for children to learning and achievement. Students are expected to apply and integrate the knowledge of the art form under study to all of the arts and to address the five standards of the Visual and Performing Arts Framework in a holistic manner. 1 hour lecture, 2 hours lab per week.",
        "units": "1",
        "prerequisites": "{Limited to students in the ITEP-Freshman Option}",
        "corequisites": "{TH 120L}"
    },
    {
        "subject": "TH",
        "catalog_number": "120L",
        "title": "Arts Immersion: Theatre Lab",
        "description": "Prerequisite: Limited to students in the ITEP-Freshman Option. Corequisite: TH 120L. Introductory course in which students engage in the study and practice of theatre and process drama. Exploration of the role of playwright, director, designer, actor, technician and dramaturg/critic as they relate to the art of theatre and the design of drama experiences for children. Focuses on identifying and experiencing the relationship of theatre and drama experiences for children to learning and achievement. Students are expected to apply and integrate the knowledge of the art form under study to all of the arts and to address the five standards of the Visual and Performing Arts Framework in a holistic manner. 1 hour lecture, 2 hours lab per week.",
        "units": "1",
        "prerequisites": "{Limited to students in the ITEP-Freshman Option}",
        "corequisites": "{TH 120}"
    },
    {
        "subject": "TH",
        "catalog_number": "142M",
        "title": "Theatre Movement I",
        "description": "Introduction to movement for performance. This course focuses on the development of individual creativity through physical expression. Movement fundamentals taught include basic anatomy, stretching and strengthening exercises, somatic practices that develop the breath/movement connection, Laban effort vocabulary and compositional projects that foster an expressive use of theatrical space. Course meets 4 hours per week.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "143V",
        "title": "Theatre Voice and Speech I",
        "description": "Introduction to fundamentals of voice for the stage, including studio experiences exploring foundation skills in vocal production. Understanding the role of voice training in the development of the actor’s craft and introduction to the methods, systems and techniques of voice training.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "155",
        "title": "Introduction to Design and Creativity",
        "description": "This course acquaints students with the basic principles of design that govern all forms of visual expression, emphasizing those used in the theatre. It provides students with the ability to communicate in visual terms and introduces students to the creative process.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "190",
        "title": "Theatre Production Participation",
        "description": "Participation in various aspects of Theatre CSUN’s production program, including acting, directing, technical, or managerial assignments. May be repeated once.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "208A",
        "title": "Acting II: Character and Text",
        "description": "Prerequisite: TH 108A. Dramatic structure; methods of text analysis for the actor; and application through lab experience to specific texts and scenes. 6 hours per week.",
        "units": "2",
        "prerequisites": "{TH 108A}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "222",
        "title": "Mapping World Theatre and Drama",
        "description": "Prerequisite: TH 110. Introductory survey of theatre history and dramatic literature of the world from antiquity to the present. Critical writing assignments required.",
        "units": "3",
        "prerequisites": "{TH 110}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "261",
        "title": "Fundamentals of Scenery and Properties Technology",
        "description": "Corequisite: TH 261P. Preparatory: TH 155. Practical introduction to the theories and application of construction techniques for the scenic environment; visual language, principles, techniques and tools used in creating scenery and properties; and safety in the theatre.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{TH 261P}"
    },
    {
        "subject": "TH",
        "catalog_number": "261P",
        "title": "Scenery and Properties Technology Production Participation",
        "description": "Corequisite: TH 261. Preparatory: TH 155. Participation in the scenery and/or properties department of a CSUN theatre production.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{TH 261}"
    },
    {
        "subject": "TH",
        "catalog_number": "262",
        "title": "Fundamentals of Costume Technology",
        "description": "Corequisite: TH 262P. Preparatory: TH 155. A practical introduction to the theory and application of costume and accessory construction for the stage, including use of equipment, fabrics and materials appropriate to costume technology.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{TH 262P}"
    },
    {
        "subject": "TH",
        "catalog_number": "262P",
        "title": "Costume Technology Production Participation",
        "description": "Corequisite: TH 262. Preparatory: TH 155. Participation in the costume department of a CSUN theatre production.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{TH 262}"
    },
    {
        "subject": "TH",
        "catalog_number": "263",
        "title": "Fundamentals of Lighting and Sound Technology",
        "description": "Corequisite: TH 263P. Preparatory: TH 155. Introduction to technical principles and applications of stage lighting and sound, including basic lighting and sound equipment, nomenclature, and skills and practices used in creating lighting and sound for stage productions.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{TH 263P}"
    },
    {
        "subject": "TH",
        "catalog_number": "263P",
        "title": "Lighting and Sound Technology Production Participation",
        "description": "Corequisite: TH 263. Preparatory: TH 155. Participation in the scenery and/or properties department of a CSUN theatre production.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{TH 263}"
    },
    {
        "subject": "TH",
        "catalog_number": "290",
        "title": "Theatre Production Participation",
        "description": "Participation in various aspects of Theatre CSUN’s production program, including acting, directing, technical or managerial assignments. May be repeated once.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "304",
        "title": "Process Drama and the Child",
        "description": "Prerequisites: TH 120; Restricted to students in the ITEP-Freshman Option. Provides students the opportunity to revisit Theatre and apply their knowledge of this area to working with children and develop skills as a leader of drama experiences for children through the practice of planning, implementing and evaluating drama experiences with peers and in the context of field based-settings. Two hours of lab per week.",
        "units": "1",
        "prerequisites": "{{TH 120} && {Restricted to students in the ITEP-Freshman Option}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "308A",
        "title": "Acting III: Scene Study",
        "description": "Prerequisite: TH 208A. Corequisites: TH 342M, TH 343V. Studio course emphasizing text analysis, character development and scene study; application of these skills to modern and contemporary dramatic texts. 6 hours per week.",
        "units": "3",
        "prerequisites": "{TH 208A}",
        "corequisites": "{{TH 342M} && {TH 343V}}"
    },
    {
        "subject": "TH",
        "catalog_number": "310",
        "title": "Theatre in Performance",
        "description": "Prerequisite: Completion of the lower division writing requirement. Not open to Theatre majors. Introduction to the theatre through the experience of attending performances, preparatory lectures and post-performance discussions and critiques. Critical writing assignments required. (Available for General Education, C1 Arts.)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "321A",
        "title": "World Theatre and Drama I",
        "description": "Prerequisite: TH 222. This course is the first part of an integrated study of world theatre and drama. It encompasses theatre history and dramatic literature of Asia, Africa and Europe. Critical writing assignments required.",
        "units": "3",
        "prerequisites": "{TH 222}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "321B",
        "title": "World Theatre and Drama II",
        "description": "Prerequisite: TH 222. This course is the second part of the integrated study of the world theatre and drama. It encompasses theatre history and dramatic literature of the Middle East, Latin America and the West. Critical writing assignments required.",
        "units": "3",
        "prerequisites": "{TH 222}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "325",
        "title": "World Drama and Performance",
        "description": "Prerequisite: Completion of the lower division writing requirement and upper division standing. Not open to Theatre majors. Survey of world dramatic literature and performance styles from the Ancient world to the present, with particular focus on the cultural, political, social and aesthetic factors that shaped these works. We will examine masterpieces from Western and non-Western theatre traditions to understand how these plays negotiate between performers and audiences, individual and national identities and across cultures. (Available for General Education, F Comparative Cultural Studies.) (IC)",
        "units": "3",
        "prerequisites": "{{Completion of the lower division writing requirement} && {upper division standing}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "333",
        "title": "The American Musical",
        "description": "Prerequisite: Completion of the lower division writing requirement. This class is a survey of Western musical theatre history, drama and practices from late 19th century through modern day. Students will analyze the role of musical theatre in the culture of the United States by examining the context of changes and trends in American musical theatre from the 1890s to the present. Students will evaluate American history as it is reflected in musical theatre and the effects of multicultural historical events on the theater. Students will study musical theatre’s elements and structure through the lens of major librettists, composers, lyricists, designers, directors, choreographers, and performers. (Available for General Education, C2 Humanities.) (IC)",
        "units": "3",
        "prerequisites": "{Completion of the lower division writing requirement}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "342M",
        "title": "Theatre Movement II",
        "description": "Prerequisite: TH 142M. Intermediate training of the body for stage movement, including exercise for strength, flexibility, relaxation, control, physicalization and movement as a part of character development. 6 hours lab.",
        "units": "2",
        "prerequisites": "{TH 142M}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "343V",
        "title": "Theatre Voice and Speech II",
        "description": "Prerequisite: TH 143V. Intermediate theory and practice of voice and speech in the theatre. Exercises in stage diction, vocal techniques and phonetics. 6 hours lab.",
        "units": "3",
        "prerequisites": "{TH 143V}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "345",
        "title": "Acting On Camera",
        "description": "Prerequisite: TH 208A or permission of instructor. Non-Theatre majors, consult department for equivalency. Prepares the student for the particular demands of acting in front of the camera. Techniques of blocking, text analysis, cold-reading, character presentation, scene preparation, vocabulary and camera shots. 6 hours per week.",
        "units": "3",
        "prerequisites": "{{TH 208A} || {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "346",
        "title": "Musical Theatre Workshop I",
        "description": "Prerequisites: MUS 238A; TH 208A. Study of the special acting, vocal and movement skills required for performance in musical theatre. 6 hours per week.",
        "units": "3",
        "prerequisites": "{{MUS 238A} && {TH 208A}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "350",
        "title": "Cultural and Historical Perspectives for Theatre",
        "description": "Prerequisite: Completion of lower division requirements in Theatre major. Preparatory: TH 321A/TH 321B. Historical elements as they relate to the staging of period plays, including history of architecture, furniture, costume, social modes and manners. Development of dramaturgical research skills. Extensive writing and analysis required.",
        "units": "3",
        "prerequisites": "{Completion of lower division requirements in Theatre major}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "355",
        "title": "Principles of Stage Design",
        "description": "Prerequisites: Completion of lower division requirements in Theatre major. Non-Theatre majors, consult Theatre department advisor. Introduction to the discursive and non-discursive aspects of stage design, including process, techniques and language of collaborative production artists and conceptualization of dramatic action, mood and style through a range of media. Extensive critique of work in progress. 4 hours per week.",
        "units": "2",
        "prerequisites": "{Completion of lower division requirements in Theatre major}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "361A",
        "title": "Intermediate Scenic Design and Construction Techniques",
        "description": "Prerequisites: TH 261, TH 261P. Intermediate principles of realizing technical designs for the stage, including construction technology, finishing, rigging and materials. Course meets 4 hours per week.",
        "units": "2",
        "prerequisites": "{TH 261} && {TH 261P}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "361B",
        "title": "Digital Scenic Techniques",
        "description": "Prerequisites: TH 261, TH 261P. An exploration of the technology, tools and techniques used in the art of scenic design. Course meets 4 hours per week.",
        "units": "2",
        "prerequisites": "{TH 261} && {TH 261P}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "361P",
        "title": "Scenic/Properties Practicum",
        "description": "Prerequisites: TH 261, TH 261P and permission of instructor. Participation in a CSUN Theatre Department production, in a leadership or craftsperson role in the scenic or properties areas. Students in this area will be supervised by the department faculty member leading that area while interacting with production faculty, staff, guest artists and students. This course may be repeated twice for credit. This course is a practicum and meeting expectations will be set upon project assignment in accordance with campus standards.",
        "units": "1",
        "prerequisites": "{{TH 261} && {TH 261P} && {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "362A",
        "title": "Intermediate Costume Techniques",
        "description": "Prerequisites: TH 262, TH 262P. Intermediate principles of theory and application of costume construction techniques for stage, TV and film, including pattern making, draping, advanced stitching techniques, equipment, fabrics and materials appropriate to costume technology. Non-Theatre majors, consult Theatre Department costume faculty for equivalency. Course meets four hours per week.",
        "units": "2",
        "prerequisites": "{{TH 262} && {TH 262P}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "362B",
        "title": "Intermediate Costume Crafts",
        "description": "Prerequisites: TH 262, TH 262P. Intermediate principles of theory and application of costume crafts for the stage, including use of equipment, fabrics and materials appropriate to costume accessory and craft making, and preparation of appropriate accessories. Required participation in a University-sponsored production.",
        "units": "2",
        "prerequisites": "{{TH 262} && {TH 262P}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "362P",
        "title": "Intermediate Costume Practicum",
        "description": "Prerequisites: TH 262, TH 262P and permission of instructor. Recommended Preparatory: TH 362A or TH 362B or TH 367. Participation in a CSUN Theatre Department production, in the area of costumes or make-up/hair (i.e., cutter/draper, craftsperson, milliner, make-up crew chief, etc.). Students in this area will be supervised by the department faculty member leading that area while interacting with production faculty, staff, guest artists and students. This course may be repeated twice for credit. This course is a practicum and meeting expectations will be set upon project assignment in accordance with campus standards.",
        "units": "1",
        "prerequisites": "{{TH 262} && {TH 262P} && {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "363A",
        "title": "Intermediate Lighting Techniques",
        "description": "Prerequisites: TH 263, TH 263P. Non-Theatre majors, consult Theatre Department lighting faculty for equivalency. Intermediate course exploring stage lighting, projection equipment, lighting control systems, optical systems, color theory and current lighting graphic standards as they apply to stage, film and video. Course meets four hours per week.",
        "units": "2",
        "prerequisites": "{{TH 263} && {TH 263P}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "363P",
        "title": "Lighting/Sound/Video Practicum",
        "description": "Prerequisites: TH 263, TH 263P and permission of instructor. Participation in a CSUN Theatre Department production, in a leadership or craftsperson role in the lighting, sound or video areas. Students in this area will be supervised by the department faculty member leading that area while interacting with production faculty, staff, guest artists and students. This course may be repeated twice for credit. This course is a practicum and meeting expectations will be set upon project assignment in accordance with campus standards.",
        "units": "1",
        "prerequisites": "{{TH 263} && {TH 263P} && {permission of instructor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "367",
        "title": "Intermediate Makeup Techniques",
        "description": "Prerequisites: TH 155 and two of the following Technology/Production Participation pairs: TH 261/TH 261P or TH 262/TH 262P or TH 263/TH 263P. Practical experience in the application and design of make-up for the stage, film and TV. Instruction includes theory and practice of make-up, facial analysis, color theory, basic three-dimensional design techniques, research, and health and safety protocols. This course is a practicum and meeting expectations will be set upon project assignment in accordance with campus standards.",
        "units": "2",
        "prerequisites": "{Parse error: refer to class description}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "371",
        "title": "Creative Drama",
        "description": "Corequisite: TH 371L. Theory and techniques for developing the creative capacities of children and young people through dramatization; participation and leadership in creative drama. 4 hours per week.",
        "units": "2",
        "prerequisites": "{None}",
        "corequisites": "{TH 371L}"
    },
    {
        "subject": "TH",
        "catalog_number": "371L",
        "title": "Creative Drama Lab",
        "description": "Corequisite: TH 371L. Theory and techniques for developing the creative capacities of children and young people through dramatization; participation and leadership in creative drama. 4 hours per week.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{TH 371}"
    },
    {
        "subject": "TH",
        "catalog_number": "376",
        "title": "Production Preparation and Performance: Theatre for Young Audiences",
        "description": "Prerequisite: Audition/Interview. Preparation and performance of a University-sponsored production for young audiences. May be taken up to three times for credit.",
        "units": "3",
        "prerequisites": "{Audition/Interview}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "381",
        "title": "Management Techniques for the Theatre",
        "description": "Prerequisite: Completion of lower division requirements in Theatre major. Basic principles in management, with emphasis on theatrical applications; personnel, time, budgeting, procedures, organization, safety; setting and achieving objectives. 6 hours per week.",
        "units": "2",
        "prerequisites": "{Completion of lower division requirements in Theatre major}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "382A",
        "title": "Theatre Management Practicum",
        "description": "Prerequisites: TH 381; Completion of lower division requirements in Theatre major. Practical application of theatre management techniques. Required participation in a University-sponsored production. Maximum of 3 units may be earned.",
        "units": "1",
        "prerequisites": "{{TH 381} && {Completion of lower division requirements in Theatre major}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "384",
        "title": "Touring Theatre",
        "description": "Prerequisite: Audition/Interview. Theory and practice in the artistic and management aspects of producing theatrical performances for touring, including practical experience in producing and presenting touring productions. Required participation in a University-sponsored production. May be taken up to three times for credit.",
        "units": "3",
        "prerequisites": "{Audition/Interview}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "385",
        "title": "Stage Management",
        "description": "Prerequisite: Upper division standing. An exploration of the profession of stage management. Provides the student with an understanding of the duties and responsibilities of a stage manager, and through the review of the production process, provides training in the techniques used by professional stage managers.",
        "units": "3",
        "prerequisites": "{Upper division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "390A",
        "title": "Theatre Production Participation",
        "description": "Participation in various aspects of Theatre CSUN’s production program, including acting, directing, technical or managerial assignments. Maximum of 4 units may be earned.",
        "units": "1",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "396VT",
        "title": "Experimental Topics Courses In Theatre: Veterans Project",
        "description": "Prerequisite: Consult Theatre Department Office. Experimental courses in theatre with course content to be determined. Maximum of 6 units may be earned.\n",
        "units": "3",
        "prerequisites": "{Consult Theatre Department Office}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "397",
        "title": "Theatre Honors Tutorial",
        "description": "Prerequisite: Admission to Theatre Honors Program. Intensive investigation in a small group of a topic related to some aspect of theatre practice or theory. Maximum of 3 units may be earned.",
        "units": "1",
        "prerequisites": "{Admission to Theatre Honors Program}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "408A",
        "title": "Acting IV: Advanced Acting",
        "description": "Prerequisites: TH 308A and completion of lower division requirements in Theatre major. Not available for graduate credit. Performance course emphasizing advanced text analysis, character development and scene study as applied to a wide variety of periods and genres. Available for graduate credit. 6 hours per week.",
        "units": "3",
        "prerequisites": "{{TH 308A} && {completion of lower division requirements in Theatre major}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "422",
        "title": "Theatre and Drama of Greece and Rome",
        "description": "Prerequisites: TH 321A, TH 321B; Theatre major or minor. Non-Theatre majors, consult department advisor for equivalency. Study of the history and literature of the theatre of Greece and Rome. Critical writing assignments required. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{TH 321A} && {TH 321B} && {Theatre major or minor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "426",
        "title": "Contemporary Theatre and Drama of Europe and America",
        "description": "Prerequisites: TH 321A, TH 321B; Theatre major or minor. Non-Theatre majors, consult department advisor for equivalency. Study of contemporary theatre movements in Europe and America. Critical writing assignments required. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{TH 321A} && {TH 321B} && {Theatre major or minor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "432",
        "title": "Theatre and Drama of the United States",
        "description": "Prerequisites: TH 321A and TH 321B; Theatre major or minor. Non-Theatre majors, consult department advisor for equivalency. Study of the history and literature of the American theatre from colonial times to the mid-20th century. Critical writing assignments required. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{{TH 321A} && {TH 321B} && {Theatre major or minor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "433",
        "title": "The Musical Theatre in the United States",
        "description": "Prerequisite: Theatre major or minor with upper division standing. Study of the history and literature of the musical theatre in the U.S. from its beginnings to the present. Critical writing assignments required. Available for graduate credit.",
        "units": "3",
        "prerequisites": "{Theatre major or minor with upper division standing}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "442M",
        "title": "Theatre Movement III",
        "description": "Prerequisite: TH 342M. Not available for graduate credit. Performance course in advanced stage movement techniques; modes and manners of theatrical periods from ancient to modern; dance forms of the same periods, and application of these studies to the creation of character in period drama. 6 hours per week.",
        "units": "2",
        "prerequisites": "{TH 342M}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "443V",
        "title": "Theatre Voice and Speech III",
        "description": "Prerequisites: TH 343V; Completion of lower division requirements in Theatre major. Not available for graduate credit. Development of advanced voice, speech, analytical and interpretative skills for the actor, including application to the speaking and acting of Shakespearean texts. Course meets 6 hours per week.",
        "units": "3",
        "prerequisites": "{{TH 343V} && {Completion of lower division requirements in Theatre major}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "444",
        "title": "Principles of Directing",
        "description": "Prerequisites for Theatre major: Completion of lower division requirements in Theatre major. Prerequisites for Theatre minor: Completion of lower division requirements in Theatre minor. Not available for graduate credit. Theories and techniques of directing plays. 6 hours per week.",
        "units": "3",
        "prerequisites": "{Completion of lower division requirements in Theatre major}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "448",
        "title": "Advanced Acting for the Camera",
        "description": "Prerequisite: TH 345. Students practice the tools and techniques of film and television acting in specific and varied contexts. Specific focus will be given to artistic genres, distinctions between commercial and theatrical work, single and multiple camera formats, and other shooting styles.",
        "units": "3",
        "prerequisites": "{TH 345}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "449",
        "title": "Tutorial in Performance Skills",
        "description": "Prerequisite: Audition. Not available for graduate credit. Diagnosis of individual strengths and weaknesses in performance skills through individual tutorials directed at improvement of skills and correction of problems. Complements work in CSUN’s Theatre production program. May be repeated 3 times. (Credit/No Credit only)",
        "units": "1",
        "prerequisites": "{Audition}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "454",
        "title": "Advanced Directing/Acting: Collaborative Studies",
        "description": "Prerequisites: Upper division standing, audition required. Recommended Preparatory: TH 308A, TH 342M, TH 343V or TH 444. Advanced study of directing and acting via collaborative practice. With attention to the director-actor relationship, scenes from diverse periods and genres are rehearsed and presented, applying a range of practical approaches, from the traditional to the latest theatrical trends. Emphasis on collaborative interpretation and execution of text, character, and staging in support of theatrical concepts. Course may be repeated once for credit. 6 hours per week.",
        "units": "3",
        "prerequisites": "{{Upper division standing} && {audition required}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "457",
        "title": "Theatre Design Tutorial",
        "description": "Prerequisites: TH 350, TH 355, TH 357. Individual work in theatre design, with emphasis on scenery, costumes, or lighting. Focuses on developing and presenting design concepts for selected theatre productions. May be repeated twice. Portfolio review required for repeat credit. Maximum of 3 units may be earned for graduate credit.",
        "units": "3",
        "prerequisites": "{{TH 350} && {TH 355} && {TH 357}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "473",
        "title": "Dramatic Performance in the Secondary Language Arts Curriculum",
        "description": "Prerequisite: Junior or senior standing. Corequisite: TH 473L. Study and practical application of dramatic performance in secondary-education language arts curriculum. Introduction to and application of artistic and aesthetic tools and sensitivities required for creative expression. Available for graduate credit. (Fulfills General Education, C1 Arts for English Subject Matter Program majors only.)",
        "units": "2",
        "prerequisites": "{Junior or senior standing}",
        "corequisites": "{TH 473L}"
    },
    {
        "subject": "TH",
        "catalog_number": "473L",
        "title": "Dramatic Performance in the Secondary Language Arts Curriculum Lab",
        "description": "Prerequisite: Junior or senior standing. Corequisite: TH 473L. Study and practical application of dramatic performance in secondary-education language arts curriculum. Introduction to and application of artistic and aesthetic tools and sensitivities required for creative expression. Available for graduate credit. (Fulfills General Education, C1 Arts for English Subject Matter Program majors only.)",
        "units": "1",
        "prerequisites": "{Junior or senior standing}",
        "corequisites": "{TH 473}"
    },
    {
        "subject": "TH",
        "catalog_number": "490A",
        "title": "Theatre Production Participation",
        "description": "Prerequisite: Not available for graduate credit. Participation in various aspects of CSUN’s Theatre production program, including acting, directing, technical or managerial assignments. Maximum of 4 units may be earned. Available for graduate credit.",
        "units": "1",
        "prerequisites": "{Not available for graduate credit}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "498F",
        "title": "Senior Honors Project or Thesis",
        "description": "Prerequisites: Theatre Honors Program; Approved project or thesis proposal. Not available for graduate credit. Completion of an artistic project or writing of a thesis resulting from the investigation of a significant topic or problem in theatre. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{Theatre Honors Program} && {Approved project or thesis proposal}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "530",
        "title": "Theatre and Drama of Latin America",
        "description": "Prerequisites: TH 321A and TH 321B; Theatre major or minor. Non-Theatre majors, consult department advisor for equivalency. Study of the history and literature of the Latin American theatre from pre-Columbian times to the present. Critical writing assignments required.",
        "units": "3",
        "prerequisites": "{{TH 321A} && {TH 321B} && {Theatre major or minor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "531",
        "title": "Theatre and Drama of Asia",
        "description": "Prerequisites: TH 321A/TH 321B; Theatre major or minor. Non-Theatre majors, consult department advisor for equivalency. Study of the history and literature of the Asian theatre from the beginnings to the present. Critical writing assignments required.",
        "units": "3",
        "prerequisites": "{{TH 321A/TH 321B} && {Theatre major or minor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "535",
        "title": "Theatrical Theory and Criticism",
        "description": "Prerequisites: TH 321A/TH 321B; Theatre major or minor. Non-Theatre majors, consult department advisor for equivalency. Study of the history of theatrical theory and criticism from antiquity to the present. Major theories pertaining to all aspects of theatrical production, including staging, acting, scenography and the script is examined. Critical writing assignments required.",
        "units": "3",
        "prerequisites": "{{TH 321A/TH 321B} && {Theatre major or minor}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "544",
        "title": "Principles of Directing",
        "description": "Theories and techniques of directing plays. 6 hours per week.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "545",
        "title": "Advanced Directing",
        "description": "Prerequisite: TH 444. Advanced study of theories and styles of directing plays. Practical experience through production of scenes from different historical periods. 6 hours per week.",
        "units": "2",
        "prerequisites": "{TH 444}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "594",
        "title": "Internship in the Arts",
        "description": "Prerequisites: Senior or graduate standing; Portfolio review or audition; Instructor consent. Academic Internship course. May be repeated once. Maximum of 3 units may be earned for graduate credit. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{Senior or graduate standing} && {Portfolio review or audition} && {Instructor consent}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "599A",
        "title": "Independent Study",
        "description": "Prerequisites: Completion of all core requirements in Theatre major; Instructor consent to serve as sponsor; Permission of the department chair. Enrollment restricted to Theatre majors who have completed the full sequence of courses in the area of study to be pursued by independent study. Not open to classified graduate students. Maximum of 6 units may be earned.",
        "units": "1",
        "prerequisites": "{{Completion of all core requirements in Theatre major} && {Instructor consent to serve as sponsor} && {Permission of the department chair}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "600",
        "title": "Seminar in Research Methods and Bibliography in Theatre",
        "description": "Introduction to theatre research, involving bibliographical methods, the tools of research and the organization and writing of the research study.",
        "units": "3",
        "prerequisites": "{None}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "620",
        "title": "Seminar in Theatre History",
        "description": "Prerequisites: TH 600; Advanced course in theatre history/literature (TH 422 through TH 535, or equivalent). Investigation of selected problems in theatre history from antiquity through the present. Consideration of theatre architecture, audiences, staging and production, acting and performance organization.",
        "units": "3",
        "prerequisites": "{{TH 600} && {Advanced course in theatre history/literature (TH 422 through TH 535, or equivalent)}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "621",
        "title": "Seminar in Theatrical Literature",
        "description": "Prerequisites: TH 600; Advanced course in theatre history/literature (TH 422 through TH 535, or equivalent). Investigation of selected problems in theatrical literature from antiquity to the present. Consideration of the text, playwright, theatrical genres and periods and movements.",
        "units": "3",
        "prerequisites": "{{TH 600} && {Advanced course in theatre history/literature (TH 422 through TH 535, or equivalent)}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "625",
        "title": "Seminar in Popular Theatre and Entertainment",
        "description": "Prerequisite: TH 600. Investigation of selected popular theatrical and para-theatrical forms of theatre and entertainment from antiquity through the present. Consideration of relationships between popular theatre and formal literary theatre.",
        "units": "3",
        "prerequisites": "{TH 600}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "630",
        "title": "Seminar in Theatre Aesthetics",
        "description": "Prerequisites: TH 600; Advanced course in directing or design (TH 457, TH 545 or equivalent). Analysis of the aesthetic principles and techniques of the theatre, including selected problems in the philosophy of dramatic art.",
        "units": "3",
        "prerequisites": "{{TH 600} && {Advanced course in theatre history/literature (TH 457 through TH 545, or equivalent)}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "640",
        "title": "Seminar in Acting and Directing",
        "description": "Prerequisites: TH 600; Advanced course in acting or directing (TH 408A, TH 545 or equivalents). Selected theoretical problems and their application to acting and directing.",
        "units": "3",
        "prerequisites": "{{TH 600} && {Advanced course in theatre history/literature (TH 408A through TH 545, or equivalent)}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "670",
        "title": "Seminar in Child Drama",
        "description": "Prerequisites: TH 600; TH 371, TH 475 or equivalent experience. Examination of child drama theories and practices, including creative drama and theatre for children.",
        "units": "3",
        "prerequisites": "{{TH 600} && {TH 371} && {TH 475}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "698C",
        "title": "Thesis or Graduate Project",
        "description": "Prerequisites: Classified graduate status; Approval of appropriate area faculty to form a thesis or graduate project committee; Formation of an approved thesis or graduate project committee; Completion of all additional requirements for the degree. (Credit/No Credit only)",
        "units": "3",
        "prerequisites": "{{Classified graduate status} && {Approval of appropriate area faculty to form a thesis or graduate project committee} && {Formation of an approved thesis or graduate project committee} && {Completion of all additional requirements for the degree}}",
        "corequisites": "{None}"
    },
    {
        "subject": "TH",
        "catalog_number": "699A",
        "title": "Independent Study",
        "description": "Prerequisites: Classified graduate status; Consent of an instructor to serve as sponsor; Review by the department director of graduate studies. Maximum of 6 units may be earned.",
        "units": "1",
        "prerequisites": "{{Classified graduate status} && {Consent of an instructor to serve as sponsor} && {Review by the department director of graduate studies}}",
        "corequisites": "{None}"
    }
]